{
    "about": "The Aberth method, or Aberth–Ehrlich method, named after Oliver Aberth[1] and Louis W. Ehrlich,[2] is a root-finding algorithm developed in 1967 for simultaneous approximation of all the roots of a univariate polynomial.", 
    "name": "Aberth Method", 
    "classification": "Root-Finding Algorithms", 
    "full_text": "The Aberth method, or Aberth–Ehrlich method, named after Oliver Aberth[1] and Louis W. Ehrlich,[2] is a root-finding algorithm developed in 1967 for simultaneous approximation of all the roots of a univariate polynomial.\nThe fundamental theorem of algebra states that for each polynomial with complex coefficients there are as many roots as the degree of the polynomial. This method converges cubically, an improvement over the Weierstrass–(Durand–Kerner) method, another numerical algorithm that approximates all roots at once, which converges quadratically.[1][2] (However, both algorithms converge linearly at multiple zeros.[3])\n\n\nLet \n\n\n\np\n(\nx\n)\n=\n\np\n\nn\n\n\n\nx\n\nn\n\n\n+\n\np\n\nn\n−\n1\n\n\n\nx\n\nn\n−\n1\n\n\n+\n⋯\n+\n\np\n\n1\n\n\nx\n+\n\np\n\n0\n\n\n\n\n{\\displaystyle p(x)=p_{n}x^{n}+p_{n-1}x^{n-1}+\\cdots +p_{1}x+p_{0}}\n\n be a univariate polynomial of degree n with real or complex coefficients. Then there exist complex numbers \n\n\n\n\nz\n\n1\n\n\n∗\n\n\n,\n\n\nz\n\n2\n\n\n∗\n\n\n,\n…\n,\n\nz\n\nn\n\n\n∗\n\n\n\n\n{\\displaystyle z_{1}^{*},\\,z_{2}^{*},\\dots ,z_{n}^{*}}\n\n, the roots of p(x), that give the factorisation:\nAlthough those numbers are unknown, upper and lower bounds for their absolute values are computable from the coefficients of the polynomial. Now one can pick n distinct numbers in the complex plane—randomly or evenly distributed—such that their absolute values are within the same bounds. (Also, if the zeros are symmetrical, the starting points must not be exactly symmetrical along the same axis, as this can prevent convergence.)[1] A set of such numbers is called an initial approximation of the set of roots of p(x). This approximation can be iteratively improved using the following procedure.\nLet \n\n\n\n\nz\n\n1\n\n\n,\n…\n,\n\nz\n\nn\n\n\n∈\n\nC\n\n\n\n{\\displaystyle z_{1},\\dots ,z_{n}\\in \\mathbb {C} }\n\n be the current approximations of the zeros of p(x). Then offset numbers \n\n\n\n\nw\n\n1\n\n\n,\n…\n,\n\nw\n\nn\n\n\n∈\n\nC\n\n\n\n{\\displaystyle w_{1},\\dots ,w_{n}\\in \\mathbb {C} }\n\n are computed as\nwhere p'(z) is the polynomial derivative of p evaluated in the point z.\nThe next set of approximations of roots of p(x) is then \n\n\n\n\nz\n\n1\n\n\n+\n\nw\n\n1\n\n\n,\n…\n,\n\nz\n\nn\n\n\n+\n\nw\n\nn\n\n\n\n\n{\\displaystyle z_{1}+w_{1},\\dots ,z_{n}+w_{n}}\n\n. One can measure the quality of the current approximation by the values of the polynomial or by the size of the offsets.\nConceptually, this method uses an electrostatic analogy, modeling the approximated zeros as movable negative point charges, which converge toward the true zeros, represented by fixed positive point charges.[1] A direct application of Newton's method to each approximated zero will often cause multiple starting points to incorrectly converge to the same root. The Aberth method avoids this by also modeling the repulsive effect the movable charges have on each other. In this way, when a movable charge has converged on a zero, their charges will cancel out, so that other movable charges are no longer attracted to that location, encouraging them to converge to other \"unoccupied\" zeros. (Stieltjes also modeled the positions of zeros of polynomials as solutions to electrostatic problems.)\nInside the formula of the Aberth method one can find elements of Newton's method and the Weierstrass–(Durand–Kerner) method. Details for an efficient implementation, esp. on the choice of good initial approximations, can be found in Bini (1996).[3]\nThe updates of the roots may be executed as a simultaneous Jacobi-like iteration where first all new approximations are computed from the old approximations or as a sequential Gauss–Seidel-like iteration that uses each new approximation from the time it is computed.\nA very similar method is the Newton-Maehly method. It computes the zeros one after another, but instead of an explicit deflation it divides by the already acquired linear factors on the fly. The Aberth method is like the Newton-Maehly method for computing the last root while pretending you have already found the other ones.[4]\nThe iteration formula is the univariate Newton iteration for the function\nIf the values \n\n\n\n\nz\n\n1\n\n\n,\n…\n,\n\nz\n\nn\n\n\n\n\n{\\displaystyle z_{1},\\dots ,z_{n}}\n\n are already close to the roots of p(x), then the rational function F(x) is almost linear with a dominant root close to \n\n\n\n\nz\n\nk\n\n\n\n\n{\\displaystyle z_{k}}\n\n and poles at \n\n\n\n\nz\n\n1\n\n\n,\n…\n,\n\nz\n\nk\n−\n1\n\n\n,\n\nz\n\nk\n+\n1\n\n\n,\n…\n,\n\nz\n\nn\n\n\n\n\n{\\displaystyle z_{1},\\dots ,z_{k-1},z_{k+1},\\dots ,z_{n}}\n\n that direct the Newton iteration away from the roots of p(x) that are close to them. That is, the corresponding basins of attraction get rather small, while the root close to \n\n\n\n\nz\n\nk\n\n\n\n\n{\\displaystyle z_{k}}\n\n has a wide region of attraction.\nThe Newton step \n\n\n\n\n\n\n\nF\n(\nx\n)\n\n\n\nF\n′\n\n(\nx\n)\n\n\n\n\n\n\n{\\displaystyle {\\tfrac {F(x)}{F'(x)}}}\n\n in the univariate case is the reciprocal value to the logarithmic derivative\nThus, the new approximation is computed as\nwhich is the update formula of the Aberth–Ehrlich method.", 
    "dbpedia_url": "http://dbpedia.org/resource/Aberth_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Aberth_method\n"
}