{
    "about": "An adaptive beamformer is a system that performs adaptive spatial signal processing with an array of transmitters or receivers. The signals are combined in a manner which increases the signal strength to/from a chosen direction. Signals to/from other directions are combined in a benign or destructive manner, resulting in degradation of the signal to/from the undesired direction. This technique is used in both radio frequency and acoustic arrays, and provides for directional sensitivity without physically moving an array of receivers or transmitters.", 
    "name": "Adaptive Beamformer", 
    "classification": "Signal Processing", 
    "full_text": "An adaptive beamformer is a system that performs adaptive spatial signal processing with an array of transmitters or receivers. The signals are combined in a manner which increases the signal strength to/from a chosen direction. Signals to/from other directions are combined in a benign or destructive manner, resulting in degradation of the signal to/from the undesired direction. This technique is used in both radio frequency and acoustic arrays, and provides for directional sensitivity without physically moving an array of receivers or transmitters.\n\n\nAdaptive beamforming was initially developed in the 1960s for the military applications of sonar and radar.[1] There exist several modern applications for beamforming, one of the most visible applications being commercial wireless networks such as LTE. Initial applications of adaptive beamforming were largely focused in radar and electronic countermeasures to mitigate the effect of signal jamming in the military domain.[2]\nAn adaptive beamforming system relies on principals of wave propagation and phase relationships. See Constructive interference, and Beamforming. Using the principles of superimposing waves, a higher or lower amplitude wave is created (e.g. by delaying and weighting the signal received). The adaptive beamforming system dynamically adapts in order to maximize or minimize a desired parameter, such as Signal-to-interference-plus-noise ratio.\nThere are several ways to approach the beamforming design, the first approach was implemented by maximizing the signal to noise ratio (SNR) by Applebaum 1965.[4] This technique adapts the system parameters in order to maximize the receive signal power, while minimizing noise (such as interference or jamming). Another approach is the Least Mean Squares (LMS) error method implemented by Widrow, and Maximum Likelihood Method (MLM), developed in 1969 by Capon.[5] Both the Applebaum and the Widrow algorithms are very similar, and converge toward an optimal solution.[6] However, these techniques have implementation drawbacks. In 1974, Reed demonstrated a technique known as Sample-Matrix Inversion (SMI). SMI determines the adaptive antenna array weights directly, Unlike the algorithms of Applebaum and Widrow.[7]\nA detailed explanation of the adaptive techniques introduced above can be found here:", 
    "dbpedia_url": "http://dbpedia.org/resource/Adaptive_beamformer", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Adaptive_beamformer\n"
}