{
    "about": "The adjoint state method is a numerical method for efficiently computing the gradient of a function or operator in a numerical optimization problem. It has applications in geophysics and seismic imaging.", 
    "name": "Adjoint State Method", 
    "classification": "Numerical Analysis", 
    "full_text": "The adjoint state method is a numerical method for efficiently computing the gradient of a function or operator in a numerical optimization problem. It has applications in geophysics and seismic imaging.\nThe adjoint state space is chosen to simplify the physical interpretation of equation constraints.[1] It may take the form of a Hilbert space.\nAdjoint state techniques allow the use of integration by parts, resulting in a form which explicitly contains the physically interesting quantity. An adjoint state equation is introduced, including a new unknown variable.\nThe adjoint method formulates the gradient of a function towards its parameters in a constraint optimization form. By using the dual form of this constraint optimization problem, it can be used to calculate the gradient very fast. A nice property is that the number of computations is independent of the number of parameters for which you want the gradient. The adjoint method is derived from the dual problem [1] and is used i.e. in the Landweber iteration method [2].\nThe name adjoint state method refers to the dual form of the problem, where the adjoint matrix \n\n\n\n\nA\n\n∗\n\n\n=\n\n\n\nA\n¯\n\n\n\nT\n\n\n\n\n{\\displaystyle A^{*}={\\overline {A}}^{T}}\n\n is used.\nWhen the initial problem consists of calculating the product \n\n\n\n\ns\n\nT\n\n\nx\n\n\n{\\displaystyle s^{T}x}\n\n and x must satisfy \n\n\n\nA\nx\n=\nb\n\n\n{\\displaystyle Ax=b}\n\n, the dual problem can be realized as calculating the product \n\n\n\n\nr\n\nT\n\n\nb\n\n\n{\\displaystyle r^{T}b}\n\n (\n\n\n\n=\n\ns\n\nT\n\n\nx\n\n\n{\\displaystyle =s^{T}x}\n\n), where \n\n\n\nr\n\n\n{\\displaystyle r}\n\n must satisfy \n\n\n\n\nA\n\n∗\n\n\nr\n=\ns\n\n\n{\\displaystyle A^{*}r=s}\n\n. \n\n\n\nr\n\n\n{\\displaystyle r}\n\n is called the adjoint state vector.\nA well written explanation by Errico: What is an adjoint Model?\nMore technical explanation: A review of the adjoint-state method for computing the gradient of a functional with geophysical applications\nMIT course [3]\nDeriving the adjoint state method from different fields: [4]\nMIT notes [5]\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Adjoint_state_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Adjoint_state_method\n"
}