{
    "about": "Acoustic analogies are applied mostly in numerical aeroacoustics to reduce aeroacoustic sound sources to simple emitter types. They are therefore often also referred to as aeroacoustic analogies.[1][2][3][4]", 
    "name": "Aeroacoustic Analogy", 
    "classification": "Numerical Analysis", 
    "full_text": "Acoustic analogies are applied mostly in numerical aeroacoustics to reduce aeroacoustic sound sources to simple emitter types. They are therefore often also referred to as aeroacoustic analogies.[1][2][3][4]\nIn general, aeroacoustic analogies are derived from the compressible Navier–Stokes equations (NSE). The compressible NSE are rearranged into various forms of the inhomogeneous acoustic wave equation. Within these equations, source terms describe the acoustic sources. They consist of pressure and speed fluctuation as well as stress tensor and force terms.\nApproximations are introduced to make the source terms independent of the acoustic variables. In this way, linearized equations are derived which describe the propagation of the acoustic waves in a homogeneous, resting medium. The latter is excited by the acoustic source terms, which are determined from the turbulent fluctuations. Since the aeroacoustics are described by the equations of classical acoustics, the methods are called aeroacoustic analogies.\nThe Lighthill analogy considers a free flow, as for example with an engine jet. The nonstationary fluctuations of the stream are represented by a distribution of quadrupole sources in the same volume.\nThe Curle analogy is a formal solution of the Lighthill analogy, which takes hard surfaces into consideration.\nThe Ffowcs Williams–Hawkings analogy is valid for aeroacoustic sources in relative motion with respect to a hard surface, as is the case in many technical applications for example in the automotive industry or in air travel. The calculation involves quadrupole, dipole and monopole terms.", 
    "dbpedia_url": "http://dbpedia.org/resource/Aeroacoustic_analogy", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Aeroacoustic_analogy\n"
}