{
    "about": "An all-pass filter is a signal processing filter that passes all frequencies equally in gain, but changes the phase relationship among various frequencies. It does this by varying its phase shift as a function of frequency. Generally, the filter is described by the frequency at which the phase shift crosses 90° (i.e., when the input and output signals go into quadrature – when there is a quarter wavelength of delay between them).", 
    "classification": "Digital Signal Processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/All-pass_filter\n", 
    "full_text": "An all-pass filter is a signal processing filter that passes all frequencies equally in gain, but changes the phase relationship among various frequencies. It does this by varying its phase shift as a function of frequency. Generally, the filter is described by the frequency at which the phase shift crosses 90° (i.e., when the input and output signals go into quadrature – when there is a quarter wavelength of delay between them).\nThey are generally used to compensate for other undesired phase shifts that arise in the system, or for mixing with an unshifted version of the original to implement a notch comb filter.\nThey may also be used to convert a mixed phase filter into a minimum phase filter with an equivalent magnitude response or an unstable filter into a stable filter with an equivalent magnitude response.\n\n\nThe operational amplifier circuit shown in Figure 1 implements an active all-pass filter with the transfer function\nwhich has one pole at -1/RC and one zero at 1/RC (i.e., they are reflections of each other across the imaginary axis of the complex plane). The magnitude and phase of H(iω) for some angular frequency ω are\nAs expected, the filter has unity-gain magnitude for all ω. The filter introduces a different delay at each frequency and reaches input-to-output quadrature at ω=1/RC (i.e., phase shift is 90 degrees).\nThis implementation uses a high-pass filter at the non-inverting input to generate the phase shift and negative feedback to compensate for the filter's attenuation.\nIn fact, the phase shift of the all-pass filter is double the phase shift of the high-pass filter at its non-inverting input.\nThe Laplace transform of a pure delay is given by\nwhere \n\n\n\nT\n\n\n{\\displaystyle T}\n\n is the delay (in seconds) and \n\n\n\ns\n∈\n\nC\n\n\n\n{\\displaystyle s\\in \\mathbb {C} }\n\n is complex frequency. This can be approximated using a Padé approximant, as follows:\nwhere the last step was achieved via a first-order Taylor series expansion of the numerator and denominator. By setting \n\n\n\nR\nC\n=\nT\n\n/\n\n2\n\n\n{\\displaystyle RC=T/2}\n\n we recover \n\n\n\nH\n(\ns\n)\n\n\n{\\displaystyle H(s)}\n\n from above.\nA similar all-pass filter can be implemented by interchanging the position of the resistor and capacitor, which turns the high-pass filter into a low-pass filter. The result is a phase shifter with the same quadrature frequency but a −180 degree shift at high frequencies and no shift at low frequencies. In other words, the transfer function is negated, and so it has the same pole at −1/RC and reflected zero at 1/RC. Again, the phase shift of the all-pass filter is double the phase shift of the first-order filter at its non-inverting input.\nThe resistor can be replaced with a FET in its ohmic mode to implement a voltage-controlled phase shifter; the voltage on the gate adjusts the phase shift. In electronic music, a phaser typically consists of two, four or six of these phase-shifting sections connected in tandem and summed with the original. A low-frequency oscillator (LFO) ramps the control voltage to produce the characteristic swooshing sound.\nThese circuits are used as phase shifters and in systems of phase shaping and time delay. Filters such as the above can be cascaded with unstable or mixed-phase filters to create a stable or minimum-phase filter without changing the magnitude response of the system. For example, by proper choice of pole (and therefore zero), a pole of an unstable system that is in the right-hand plane can be canceled and reflected on the left-hand plane.\nThe benefit to implementing all-pass filters with active components like operational amplifiers is that they do not require inductors, which are bulky and costly in integrated circuit designs. In other applications where inductors are readily available, all-pass filters can be implemented entirely without active components. There are a number of circuit topologies that can be used for this. The following are the most commonly used circuits.\nThe lattice phase equaliser, or filter, is a filter composed of lattice, or X-sections. With single element branches it can produce a phase shift up to 180°, and with resonant branches it can produce phase shifts up to 360°. The filter is an example of a constant-resistance network (i.e., its image impedance is constant over all frequencies).\nThe phase equaliser based on T topology is the unbalanced equivalent of the lattice filter and has the same phase response. While the circuit diagram may look like a low pass filter it is different in that the two inductor branches are mutually coupled. This results in transformer action between the two inductors and an all-pass response even at high frequency.\nThe bridged T topology is used for delay equalisation, particularly the differential delay between two landlines being used for stereophonic sound broadcasts. This application requires that the filter has a linear phase response with frequency (i.e., constant group delay) over a wide bandwidth and is the reason for choosing this topology.\nA Z-transform implementation of an all-pass filter with a complex pole at \n\n\n\n\nz\n\n0\n\n\n\n\n{\\displaystyle z_{0}}\n\n is\nwhich has a zero at \n\n\n\n1\n\n/\n\n\n\n\nz\n\n0\n\n\n¯\n\n\n\n\n{\\displaystyle 1/{\\overline {z_{0}}}}\n\n, where \n\n\n\n\n\nz\n¯\n\n\n\n\n{\\displaystyle {\\overline {z}}}\n\n denotes the complex conjugate. The pole and zero sit at the same angle but have reciprocal magnitudes (i.e., they are reflections of each other across the boundary of the complex unit circle). The placement of this pole-zero pair for a given \n\n\n\n\nz\n\n0\n\n\n\n\n{\\displaystyle z_{0}}\n\n can be rotated in the complex plane by any angle and retain its all-pass magnitude characteristic. Complex pole-zero pairs in all-pass filters help control the frequency where phase shifts occur.\nTo create an all-pass implementation with real coefficients, the complex all-pass filter can be cascaded with an all-pass that substitutes \n\n\n\n\n\n\nz\n\n0\n\n\n¯\n\n\n\n\n{\\displaystyle {\\overline {z_{0}}}}\n\n for \n\n\n\n\nz\n\n0\n\n\n\n\n{\\displaystyle z_{0}}\n\n, leading to the Z-transform implementation\nwhich is equivalent to the difference equation\nwhere \n\n\n\ny\n[\nk\n]\n\n\n{\\displaystyle y[k]}\n\n is the output and \n\n\n\nx\n[\nk\n]\n\n\n{\\displaystyle x[k]}\n\n is the input at discrete time step \n\n\n\nk\n\n\n{\\displaystyle k}\n\n.\nFilters such as the above can be cascaded with unstable or mixed-phase filters to create a stable or minimum-phase filter without changing the magnitude response of the system. For example, by proper choice of \n\n\n\n\nz\n\n0\n\n\n\n\n{\\displaystyle z_{0}}\n\n, a pole of an unstable system that is outside of the unit circle can be canceled and reflected inside the unit circle.", 
    "name": "All Pass Filter"
}