{
    "about": "In mathematics, an almost periodic function is, loosely speaking, a function of a real number that is periodic to within any desired level of accuracy, given suitably long, well-distributed \"almost-periods\". The concept was first studied by Harald Bohr and later generalized by Vyacheslav Stepanov, Hermann Weyl and Abram Samoilovitch Besicovitch, amongst others. There is also a notion of almost periodic functions on locally compact abelian groups, first studied by John von Neumann.", 
    "name": "Almost Periodic Function", 
    "classification": "Digital Signal Processing", 
    "full_text": "In mathematics, an almost periodic function is, loosely speaking, a function of a real number that is periodic to within any desired level of accuracy, given suitably long, well-distributed \"almost-periods\". The concept was first studied by Harald Bohr and later generalized by Vyacheslav Stepanov, Hermann Weyl and Abram Samoilovitch Besicovitch, amongst others. There is also a notion of almost periodic functions on locally compact abelian groups, first studied by John von Neumann.\nAlmost periodicity is a property of dynamical systems that appear to retrace their paths through phase space, but not exactly. An example would be a planetary system, with planets in orbits moving with periods that are not commensurable (i.e., with a period vector that is not proportional to a vector of integers). A theorem of Kronecker from diophantine approximation can be used to show that any particular configuration that occurs once, will recur to within any specified accuracy: if we wait long enough we can observe the planets all return to within a second of arc to the positions they once were in.\n\n\nThere are several inequivalent definitions of almost periodic functions. The first was given by Harald Bohr. His interest was initially in finite Dirichlet series. In fact by truncating the series for the Riemann zeta function ζ(s) to make it finite, one gets finite sums of terms of the type\nwith s written as (σ + it) – the sum of its real part σ and imaginary part it. Fixing σ, so restricting attention to a single vertical line in the complex plane, we can see this also as\nTaking a finite sum of such terms avoids difficulties of analytic continuation to the region σ < 1. Here the 'frequencies' log n will not all be commensurable (they are as linearly independent over the rational numbers as the integers n are multiplicatively independent – which comes down to their prime factorizations).\nWith this initial motivation to consider types of trigonometric polynomial with independent frequencies, mathematical analysis was applied to discuss the closure of this set of basic functions, in various norms.\nThe theory was developed using other norms by Besicovitch, Stepanov, Weyl, von Neumann, Turing, Bochner and others in the 1920s and 1930s.\nBohr (1925) defined the uniformly almost-periodic functions as the closure of the trigonometric polynomials with respect to the uniform norm\n(on bounded functions f on R). In other words, a function f is uniformly almost periodic if for every ε > 0 there is a finite linear combination of sine and cosine waves that is of distance less than ε from f with respect to the uniform norm. Bohr proved that this definition was equivalent to the existence of a relatively dense set of ε almost-periods, for all ε > 0: that is, translations T(ε) = T of the variable t making\nAn alternative definition due to Bochner (1926) is equivalent to that of Bohr and is relatively simple to state:\nA function f is almost periodic if every sequence {ƒ(t + Tn)} of translations of f has a subsequence that converges uniformly for t in (−∞, +∞).\nThe Bohr almost periodic functions are essentially the same as continuous functions on the Bohr compactification of the reals.\nThe space Sp of Stepanov almost periodic functions (for p ≥ 1) was introduced by V.V. Stepanov (1925). It contains the space of Bohr almost periodic functions. It is the closure of the trigonometric polynomials under the norm\nfor any fixed positive value of r; for different values of r these norms give the same topology and so the same space of almost periodic functions (though the norm on this space depends on the choice of r).\nThe space Wp of Weyl almost periodic functions (for p ≥ 1) was introduced by Weyl (1927). It contains the space Sp of Stepanov almost periodic functions. It is the closure of the trigonometric polynomials under the seminorm\nWarning: there are nonzero functions ƒ with ||ƒ||W,p = 0, such as any bounded function of compact support, so to get a Banach space one has to quotient out by these functions.\nThe space Bp of Besicovitch almost periodic functions was introduced by Besicovitch (1926). It is the closure of the trigonometric polynomials under the seminorm\nWarning: there are nonzero functions ƒ with ||ƒ||B,p = 0, such as any bounded function of compact support, so to get a Banach space one has to quotient out by these functions.\nThe Besicovitch almost periodic functions in B2 have an expansion (not necessarily convergent) as\nwith Σ an2 finite and λn real. Conversely every such series is the expansion of some Besicovitch periodic function (which is not unique).\nThe space Bp of Besicovitch almost periodic functions (for p ≥ 1) contains the space Wp of Weyl almost periodic functions. If one quotients out a subspace of \"null\" functions, it can be identified with the space of Lp functions on the Bohr compactification of the reals.\nWith these theoretical developments and the advent of abstract methods (the Peter–Weyl theorem, Pontryagin duality and Banach algebras) a general theory became possible. The general idea of almost-periodicity in relation to a locally compact abelian group G becomes that of a function F in L∞(G), such that its translates by G form a relatively compact set. Equivalently, the space of almost periodic functions is the norm closure of the finite linear combinations of characters of G. If G is compact the almost periodic functions are the same as the continuous functions.\nThe Bohr compactification of G is the compact abelian group of all possibly discontinuous characters of the dual group of G, and is a compact group containing G as a dense subgroup. The space of uniform almost periodic functions on G can be identified with the space of all continuous functions on the Bohr compactification of G. More generally the Bohr compactification can be defined for any topological group G, and the spaces of continuous or Lp functions on the Bohr compactification can be considered as almost periodic functions on G. For locally compact connected groups G the map from G to its Bohr compactification is injective if and only if G is a central extension of a compact group, or equivalently the product of a compact group and a finite-dimensional vector space.\nIn speech processing, audio signal processing, and music synthesis, a quasiperiodic signal, sometimes called a quasiharmonic signal, is a waveform that is virtually periodic microscopically, but not necessarily periodic macroscopically. This does not give a quasiperiodic function in the sense of the Wikipedia article of that name, but something more akin to an almost periodic function, being a nearly periodic function where any one period is virtually identical to its adjacent periods but not necessarily similar to periods much farther away in time. This is the case for musical tones (after the initial attack transient) where all partials or overtones are harmonic (that is all overtones are at frequencies that are an integer multiple of a fundamental frequency of the tone).\nWhen a signal \n\n\n\nx\n(\nt\n)\n \n\n\n{\\displaystyle x(t)\\ }\n\n is fully periodic with period \n\n\n\nT\n \n\n\n{\\displaystyle T\\ }\n\n, then the signal exactly satisfies\nor\nThe Fourier series representation would be\nor\nwhere \n\n\n\n\nf\n\n0\n\n\n=\n\n\n1\nT\n\n\n\n\n{\\displaystyle f_{0}={\\frac {1}{T}}}\n\n is the fundamental frequency and the Fourier coefficients are\nThe fundamental frequency \n\n\n\n\nf\n\n0\n\n\n \n\n\n{\\displaystyle f_{0}\\ }\n\n, and Fourier coefficients \n\n\n\n\na\n\nn\n\n\n \n\n\n{\\displaystyle a_{n}\\ }\n\n, \n\n\n\n\nb\n\nn\n\n\n \n\n\n{\\displaystyle b_{n}\\ }\n\n, \n\n\n\n\nr\n\nn\n\n\n \n\n\n{\\displaystyle r_{n}\\ }\n\n, or \n\n\n\n\nφ\n\nn\n\n\n \n\n\n{\\displaystyle \\varphi _{n}\\ }\n\n, are constants, i.e. they are not functions of time. The harmonic frequencies are exact integer multiples of the fundamental frequency.\nWhen \n\n\n\nx\n(\nt\n)\n \n\n\n{\\displaystyle x(t)\\ }\n\n is quasiperiodic then\nor\nwhere\nNow the Fourier series representation would be\nor\nor\nwhere \n\n\n\n\nf\n\n0\n\n\n(\nt\n)\n=\n\n\n1\n\nT\n(\nt\n)\n\n\n\n\n\n{\\displaystyle f_{0}(t)={\\frac {1}{T(t)}}}\n\n is the possibly time-varying fundamental frequency and the Fourier coefficients are\nand the instantaneous frequency for each partial is\nWhereas in this quasiperiodic case, the fundamental frequency \n\n\n\n\nf\n\n0\n\n\n(\nt\n)\n \n\n\n{\\displaystyle f_{0}(t)\\ }\n\n, the harmonic frequencies \n\n\n\n\nf\n\nn\n\n\n(\nt\n)\n \n\n\n{\\displaystyle f_{n}(t)\\ }\n\n, and the Fourier coefficients \n\n\n\n\na\n\nn\n\n\n(\nt\n)\n \n\n\n{\\displaystyle a_{n}(t)\\ }\n\n, \n\n\n\n\nb\n\nn\n\n\n(\nt\n)\n \n\n\n{\\displaystyle b_{n}(t)\\ }\n\n, \n\n\n\n\nr\n\nn\n\n\n(\nt\n)\n \n\n\n{\\displaystyle r_{n}(t)\\ }\n\n, or \n\n\n\n\nφ\n\nn\n\n\n(\nt\n)\n \n\n\n{\\displaystyle \\varphi _{n}(t)\\ }\n\n are not necessarily constant, and are functions of time albeit slowly varying functions of time. Stated differently these functions of time are bandlimited to much less than the fundamental frequency for \n\n\n\nx\n(\nt\n)\n \n\n\n{\\displaystyle x(t)\\ }\n\n to be considered to be quasiperiodic.\nThe partial frequencies \n\n\n\n\nf\n\nn\n\n\n(\nt\n)\n \n\n\n{\\displaystyle f_{n}(t)\\ }\n\n are very nearly harmonic but not necessarily exactly so. The time-derivative of \n\n\n\n\nφ\n\nn\n\n\n(\nt\n)\n \n\n\n{\\displaystyle \\varphi _{n}(t)\\ }\n\n, that is \n\n\n\n\nφ\n\nn\n\n\n′\n\n\n(\nt\n)\n \n\n\n{\\displaystyle \\varphi _{n}^{\\prime }(t)\\ }\n\n, has the effect of detuning the partials from their exact integer harmonic value \n\n\n\nn\n\nf\n\n0\n\n\n(\nt\n)\n \n\n\n{\\displaystyle nf_{0}(t)\\ }\n\n. A rapidly changing \n\n\n\n\nφ\n\nn\n\n\n(\nt\n)\n \n\n\n{\\displaystyle \\varphi _{n}(t)\\ }\n\n means that the instantaneous frequency for that partial is severely detuned from the integer harmonic value which would mean that \n\n\n\nx\n(\nt\n)\n \n\n\n{\\displaystyle x(t)\\ }\n\n is not quasiperiodic.\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Almost_periodic_function", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Almost_periodic_function\n"
}