{
    "about": "The α-algorithm is an algorithm used in process mining, aimed at reconstructing causality from a set of sequences of events. It was first put forward by van der Aalst, Weijters and Măruşter.[1] Several extensions or modifications of it have since been presented, which will be listed below.", 
    "name": "Alpha Algorithm", 
    "classification": "Data Mining Algorithms", 
    "full_text": "The α-algorithm is an algorithm used in process mining, aimed at reconstructing causality from a set of sequences of events. It was first put forward by van der Aalst, Weijters and Măruşter.[1] Several extensions or modifications of it have since been presented, which will be listed below.\nIt constructs P/T nets with special properties (workflow nets) from event logs (as might be collected by an ERP system). Each transition in the net corresponds to an observed task.\n\n\nThe algorithm takes a workflow log \n\n\n\nW\n⊆\n\nT\n\n∗\n\n\n\n\n{\\displaystyle W\\subseteq T^{*}}\n\n as input and results in a workflow net being constructed.\nIt does so by examining causal relationships observed between tasks. For example, one specific task might always precede another specific task in every execution trace, which would be useful information.\nDeclaratively, the algorithm can be presented as follows. Three sets of tasks are determined:\nBasic ordering relations are determined (\n\n\n\n\n≻\n\nW\n\n\n\n\n{\\displaystyle \\succ _{W}}\n\n first, the latter three can be constructed therefrom)\nPlaces are discovered. Each place is identified with a pair of sets of tasks, in order to keep the number of places low.\nThe flow relation \n\n\n\n\nF\n\nW\n\n\n\n\n{\\displaystyle F_{W}}\n\n is the union of the following:\nThe result is\nIt can be shown [2] that in the case of a complete workflow log generated by a sound SWF net, the net generating it can be reconstructed. Complete means that its \n\n\n\n\n≻\n\nW\n\n\n\n\n{\\displaystyle \\succ _{W}}\n\n relation is maximal. It is not required that all possible traces be present (which would be countably infinite for a net with a loop).\nGeneral workflow nets may contain several types of constructs [3] which the α-algorithm cannot rediscover.\nConstructing \n\n\n\n\nY\n\nW\n\n\n\n\n{\\displaystyle Y_{W}}\n\n takes exponential time in the number of tasks, since \n\n\n\n\n≻\n\nW\n\n\n\n\n{\\displaystyle \\succ _{W}}\n\n is not constrained and arbitrary subsets of \n\n\n\n\nT\n\nW\n\n\n\n\n{\\displaystyle T_{W}}\n\n must be considered.\nfor example [4] [5]", 
    "dbpedia_url": "http://dbpedia.org/resource/Alpha_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Alpha_algorithm\n"
}