{
    "about": "In pulsed radar and sonar signal processing, an ambiguity function is a two-dimensional function of time delay and Doppler frequency \n\n\n\nχ\n(\nτ\n,\nf\n)\n\n\n{\\displaystyle \\chi (\\tau ,f)}\n\n showing the distortion of a returned pulse due to the receiver matched filter[1] (commonly, but not exclusively, used in pulse compression radar) due to the Doppler shift of the return from a moving target. The ambiguity function is determined by the properties of the pulse and the matched filter, and not any particular target scenario. Many definitions of the ambiguity function exist; Some are restricted to narrowband signals and others are suitable to describe the propagation delay and Doppler relationship of wideband signals. Often the definition of the ambiguity function is given as the magnitude squared of other definitions (Weiss[2]). For a given complex baseband pulse \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n, the narrowband ambiguity function is given by", 
    "name": "Ambiguity Function", 
    "classification": "Signal Processing", 
    "full_text": "In pulsed radar and sonar signal processing, an ambiguity function is a two-dimensional function of time delay and Doppler frequency \n\n\n\nχ\n(\nτ\n,\nf\n)\n\n\n{\\displaystyle \\chi (\\tau ,f)}\n\n showing the distortion of a returned pulse due to the receiver matched filter[1] (commonly, but not exclusively, used in pulse compression radar) due to the Doppler shift of the return from a moving target. The ambiguity function is determined by the properties of the pulse and the matched filter, and not any particular target scenario. Many definitions of the ambiguity function exist; Some are restricted to narrowband signals and others are suitable to describe the propagation delay and Doppler relationship of wideband signals. Often the definition of the ambiguity function is given as the magnitude squared of other definitions (Weiss[2]). For a given complex baseband pulse \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n, the narrowband ambiguity function is given by\nwhere \n\n\n\n\n\n\n∗\n\n\n\n\n{\\displaystyle ^{*}}\n\n denotes the complex conjugate and \n\n\n\ni\n\n\n{\\displaystyle i}\n\n is the imaginary unit. Note that for zero Doppler shift (\n\n\n\nf\n=\n0\n\n\n{\\displaystyle f=0}\n\n) this reduces to the autocorrelation of \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n. A more concise way of representing the ambiguity function consists of examining the one-dimensional zero-delay and zero-Doppler \"cuts\"; that is, \n\n\n\nχ\n(\n0\n,\nf\n)\n\n\n{\\displaystyle \\chi (0,f)}\n\n and \n\n\n\nχ\n(\nτ\n,\n0\n)\n\n\n{\\displaystyle \\chi (\\tau ,0)}\n\n, respectively. The matched filter output as a function of a time (the signal one would observe in a radar system) is a Doppler cut, with constant frequency given by the target's Doppler shift: \n\n\n\nχ\n(\nτ\n,\n\nf\n\nD\n\n\n)\n\n\n{\\displaystyle \\chi (\\tau ,f_{D})}\n\n.\n\n\nPulse-Doppler radar equipment sends out a series of radio frequency pulses. Each pulse has a certain shape (waveform)—how long the pulse is, what its frequency is, whether the frequency changes during the pulse, and so on. If the waves reflect off a single object, the detector will see a signal which, in the simplest case, is a copy of the original pulse but delayed by a certain time \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n—related to the object's distance—and shifted by a certain frequency \n\n\n\nf\n\n\n{\\displaystyle f}\n\n—related to the object's velocity (Doppler shift). If the original emitted pulse waveform is \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n, then the detected signal (neglecting noise, attenuation, and distortion, and wideband corrections) will be:\nThe detected signal will never be exactly equal to any \n\n\n\n\ns\n\nτ\n,\nf\n\n\n\n\n{\\displaystyle s_{\\tau ,f}}\n\n because of noise. Nevertheless, if the detected signal has a high correlation with \n\n\n\n\ns\n\nτ\n,\nf\n\n\n\n\n{\\displaystyle s_{\\tau ,f}}\n\n, for a certain delay and Doppler shift \n\n\n\n(\nτ\n,\nf\n)\n\n\n{\\displaystyle (\\tau ,f)}\n\n, then that suggests that there is an object with \n\n\n\n(\nτ\n,\nf\n)\n\n\n{\\displaystyle (\\tau ,f)}\n\n. Unfortunately, this procedure may yield false positives, i.e. wrong values \n\n\n\n(\n\nτ\n′\n\n,\n\nf\n′\n\n)\n\n\n{\\displaystyle (\\tau ',f')}\n\n which are nevertheless highly correlated with the detected signal. In this sense, the detected signal may be ambiguous.\nThe ambiguity occurs specifically when there is a high correlation between \n\n\n\n\ns\n\nτ\n,\nf\n\n\n\n\n{\\displaystyle s_{\\tau ,f}}\n\n and \n\n\n\n\ns\n\n\nτ\n′\n\n,\n\nf\n′\n\n\n\n\n\n{\\displaystyle s_{\\tau ',f'}}\n\n for \n\n\n\n(\nτ\n,\nf\n)\n≠\n(\n\nτ\n′\n\n,\n\nf\n′\n\n)\n\n\n{\\displaystyle (\\tau ,f)\\neq (\\tau ',f')}\n\n. This motivates the ambiguity function \n\n\n\nχ\n\n\n{\\displaystyle \\chi }\n\n. The defining property of \n\n\n\nχ\n\n\n{\\displaystyle \\chi }\n\n is that the correlation between \n\n\n\n\ns\n\nτ\n,\nf\n\n\n\n\n{\\displaystyle s_{\\tau ,f}}\n\n and \n\n\n\n\ns\n\n\nτ\n′\n\n,\n\nf\n′\n\n\n\n\n\n{\\displaystyle s_{\\tau ',f'}}\n\n is equal to \n\n\n\nχ\n(\nτ\n−\n\nτ\n′\n\n,\nf\n−\n\nf\n′\n\n)\n\n\n{\\displaystyle \\chi (\\tau -\\tau ',f-f')}\n\n.\nDifferent pulse shapes (waveforms) \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n have different ambiguity functions, and the ambiguity function is relevant when choosing what pulse to use.\nThe function \n\n\n\nχ\n\n\n{\\displaystyle \\chi }\n\n is complex-valued; the degree of \"ambiguity\" is related to its magnitude \n\n\n\n\n|\n\nχ\n(\nτ\n,\nf\n)\n\n\n|\n\n\n2\n\n\n\n\n{\\displaystyle |\\chi (\\tau ,f)|^{2}}\n\n.\nThe ambiguity function plays a key role in the field of time–frequency signal processing,[3] as it is related to the Wigner–Ville distribution by a 2-dimensional Fourier transform. This relationship is fundamental to the formulation of other time–frequency distributions: the bilinear time–frequency distributions are obtained by a 2-dimensional filtering in the ambiguity domain (that is, the ambiguity function of the signal). This class of distribution may be better adapted to the signals considered.[4]\nMoreover, the ambiguity distribution can be seen as the short-time Fourier transform of a signal using the signal itself as the window function. This remark has been used to define an ambiguity distribution over the time-scale domain instead of the time-frequency domain.[5]\nThe wideband ambiguity function of \n\n\n\ns\n∈\n\nL\n\n2\n\n\n(\nR\n)\n\n\n{\\displaystyle s\\in L^{2}(R)}\n\n is:[2][6]\nwhere \n\n\n\n\nα\n\n\n\n{\\displaystyle {\\alpha }}\n\n is a time scale factor of the received signal relative to the transmitted signal given by:\nfor a target moving with constant radial velocity v. The reflection of the signal is represented with compression (or expansion) in time by the factor \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n, which is equivalent to a compression by the factor \n\n\n\n\nα\n\n−\n1\n\n\n\n\n{\\displaystyle \\alpha ^{-1}}\n\n in the frequency domain (with an amplitude scaling). When the wave speed in the medium is sufficiently faster than the target speed, as is common with radar, this compression in frequency is closely approximated by a shift in frequency Δf = fc*v/c (known as the doppler shift). For a narrow band signal, this approximation results in the narrowband ambiguity function given above, which can be computed efficiently by making use of the FFT algorithm.\nAn ambiguity function of interest is a 2-dimensional Dirac delta function or \"thumbtack\" function; that is, a function which is infinite at (0,0) and zero elsewhere.\nAn ambiguity function of this kind would be somewhat of a misnomer; it would have no ambiguities at all, and both the zero-delay and zero-Doppler cuts would be an impulse. This is not usually desirable (if a target has any Doppler shift from an unknown velocity it will disappear from the radar picture), but if Doppler processing is independently performed, knowledge of the precise Doppler frequency allows ranging without interference from any other targets which are not also moving at exactly the same velocity.\nThis type of ambiguity function is produced by ideal white noise (infinite in duration and infinite in bandwidth).[7] However, this would require infinite power and is not physically realizable. There is no pulse \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n that will produce \n\n\n\nδ\n(\nτ\n)\nδ\n(\nf\n)\n\n\n{\\displaystyle \\delta (\\tau )\\delta (f)}\n\n from the definition of the ambiguity function. Approximations exist, however, and noise-like signals such as binary phase-shift keyed waveforms using maximal-length sequences are the best known performers in this regard.[8]\n(1) Maximum value\n(2) Symmetry about the origin\n(3) Volume invariance\n(4) Modulation by a linear FM signal\n(5) Frequency energy spectrum\nConsider a simple square pulse of duration \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n and amplitude \n\n\n\nA\n\n\n{\\displaystyle A}\n\n:\nwhere \n\n\n\nu\n(\nt\n)\n\n\n{\\displaystyle u(t)}\n\n is the Heaviside step function. The matched filter output is given by the autocorrelation of the pulse, which is a triangular pulse of height \n\n\n\n\nτ\n\n2\n\n\n\nA\n\n2\n\n\n\n\n{\\displaystyle \\tau ^{2}A^{2}}\n\n and duration \n\n\n\n2\nτ\n\n\n{\\displaystyle 2\\tau }\n\n (the zero-Doppler cut). However, if the measured pulse has a frequency offset due to Doppler shift, the matched filter output is distorted into a sinc function. The greater the Doppler shift, the smaller the peak of the resulting sinc, and the more difficult it is to detect the target.\nIn general, the square pulse is not a desirable waveform from a pulse compression standpoint, because the autocorrelation function is too short in amplitude, making it difficult to detect targets in noise, and too wide in time, making it difficult to discern multiple overlapping targets.\nA commonly used radar or sonar pulse is the linear frequency modulated (LFM) pulse (or \"chirp\"). It has the advantage of greater bandwidth while keeping the pulse duration short and envelope constant. A constant envelope LFM pulse has an ambiguity function similar to that of the square pulse, except that it is skewed in the delay-Doppler plane. Slight Doppler mismatches for the LFM pulse do not change the general shape of the pulse and reduce the amplitude very little, but they do appear to shift the pulse in time. Thus, an uncompensated Doppler shift changes the target's apparent range; this phenomenon is called range-Doppler coupling.\nThe ambiguity function can be extended to multistatic radars, which comprise multiple non-colocated transmitters and/or receivers (and can include bistatic radar as a special case).\nFor these types of radar, the simple linear relationship between time and range that exists in the monostatic case no longer applies, and is instead dependent on the specific geometry – i.e. the relative location of transmitter(s), receiver(s) and target. Therefore, the multistatic ambiguity function is mostly usefully defined as a function of two- or three-dimensional position and velocity vectors for a given multistatic geometry and transmitted waveform.\nJust as the monostatic ambiguity function is naturally derived from the matched filter, the multistatic ambiguity function is derived from the corresponding optimal multistatic detector – i.e. that which maximizes the probability of detection given a fixed probability of false alarm through joint processing of the signals at all receivers. The nature of this detection algorithm depends on whether or not the target fluctuations observed by each bistatic pair within the multistatic system are mutually correlated. If so, the optimal detector performs phase coherent summation of received signals which can result in very high target location accuracy.[9] If not, the optimal detector performs incoherent summation of received signals which gives diversity gain. Such systems are sometimes described as MIMO radars due to the information theoretic similarities to MIMO communication systems.[10]", 
    "dbpedia_url": "http://dbpedia.org/resource/Ambiguity_function", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Ambiguity_function\n"
}