{
    "about": "In mathematics and signal processing, an analytic signal is a complex-valued function that has no negative frequency components.[1]  The real and imaginary parts of an analytic signal are real-valued functions related to each other by the Hilbert transform.", 
    "name": "Analytic Signal", 
    "classification": "Signal Processing", 
    "full_text": "In mathematics and signal processing, an analytic signal is a complex-valued function that has no negative frequency components.[1]  The real and imaginary parts of an analytic signal are real-valued functions related to each other by the Hilbert transform.\nThe analytic representation of a real-valued function is an analytic signal, comprising the original function and its Hilbert transform. This representation facilitates many mathematical manipulations. The basic idea is that the negative frequency components of the Fourier transform (or spectrum) of a real-valued function are superfluous, due to the Hermitian symmetry of such a spectrum. These negative frequency components can be discarded with no loss of information, provided one is willing to deal with a complex-valued function instead. That makes certain attributes of the function more accessible and facilitates the derivation of modulation and demodulation techniques, such as single-sideband. As long as the manipulated function has no negative frequency components (that is, it is still analytic), the conversion from complex back to real is just a matter of discarding the imaginary part. The analytic representation is a generalization of the phasor concept:[2] while the phasor is restricted to time-invariant amplitude, phase, and frequency, the analytic signal allows for time-variable parameters.\n\n\nIf \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n is a real-valued function with Fourier transform \n\n\n\nS\n(\nf\n)\n\n\n{\\displaystyle S(f)}\n\n, then the transform has Hermitian symmetry about the \n\n\n\nf\n=\n0\n\n\n{\\displaystyle f=0}\n\n axis:\nThe function:\nwhere:\ncontains only the non-negative frequency components of \n\n\n\nS\n(\nf\n)\n\n\n{\\displaystyle S(f)}\n\n.  And the operation is reversible, due to the Hermitian symmetry of \n\n\n\nS\n(\nf\n)\n\n\n{\\displaystyle S(f)}\n\n:\n\nThe analytic signal of \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n is the inverse Fourier transform of \n\n\n\n\nS\n\n\na\n\n\n\n(\nf\n)\n\n\n{\\displaystyle S_{\\mathrm {a} }(f)}\n\n:\nwhere\nThen:\n\nA corollary of Euler's formula is  \n\n\n\ncos\n⁡\n(\nω\nt\n)\n=\n\n\n\n1\n2\n\n\n\n(\n\ne\n\nj\nω\nt\n\n\n+\n\ne\n\nj\n(\n−\nω\n)\nt\n\n\n)\n.\n\n\n{\\displaystyle \\cos(\\omega t)={\\tfrac {1}{2}}(e^{j\\omega t}+e^{j(-\\omega )t}).}\n\n  In general, the analytic representation of a simple sinusoid is obtained by expressing it in terms of complex-exponentials, discarding the negative frequency component, and doubling the positive frequency component. And the analytic representation of a sum of sinusoids is the sum of the analytic representations of the individual sinusoids.\nHere we use Euler's formula to identify and discard the negative frequency.\nThen:\nThis is another example of using the Hilbert transform method to remove negative frequency components. We note that nothing prevents us from computing \n\n\n\n\ns\n\n\na\n\n\n\n(\nt\n)\n\n\n{\\displaystyle s_{\\mathrm {a} }(t)}\n\n for a complex-valued \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n. But it might not be a reversible representation, because the original spectrum is not symmetrical in general. So except for this example, the general discussion assumes real-valued \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n.\nThen:\nSince \n\n\n\ns\n(\nt\n)\n=\nRe\n⁡\n[\n\ns\n\n\na\n\n\n\n(\nt\n)\n]\n\n\n{\\displaystyle s(t)=\\operatorname {Re} [s_{\\mathrm {a} }(t)]}\n\n, restoring the negative frequency components is a simple matter of discarding \n\n\n\nIm\n⁡\n[\n\ns\n\n\na\n\n\n\n(\nt\n)\n]\n\n\n{\\displaystyle \\operatorname {Im} [s_{\\mathrm {a} }(t)]}\n\n which may seem counter-intuitive. We can also note that the complex conjugate \n\n\n\n\ns\n\n\na\n\n\n\n∗\n\n\n(\nt\n)\n\n\n{\\displaystyle s_{\\mathrm {a} }^{*}(t)}\n\n comprises only the negative frequency components. And therefore \n\n\n\nRe\n⁡\n[\n\ns\n\n\na\n\n\n\n∗\n\n\n(\nt\n)\n]\n\n\n{\\displaystyle \\operatorname {Re} [s_{\\mathrm {a} }^{*}(t)]}\n\n restores the suppressed positive frequency components.\nAn analytic signal can also be expressed in terms of its time-variant magnitude and phase (polar coordinates):\nwhere:\nIn the accompanying diagram, the blue curve depicts \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n and the red curve depicts the corresponding \n\n\n\n\ns\n\n\nm\n\n\n\n(\nt\n)\n\n\n{\\displaystyle s_{\\mathrm {m} }(t)}\n\n.\nThe time derivative of the unwrapped instantaneous phase has units of radians/second, and is called the instantaneous angular frequency:\nThe instantaneous frequency (in hertz) is therefore:\nThe instantaneous amplitude, and the instantaneous phase and frequency are in some applications used to measure and detect local features of the signal. Another application of the analytic representation of a signal relates to demodulation of modulated signals. The polar coordinates conveniently separate the effects of amplitude modulation and phase (or frequency) modulation, and effectively demodulates certain kinds of signals.\nAnalytic signals are often shifted in frequency (down-converted) toward 0 Hz, possibly creating [non-symmetrical] negative frequency components:\nwhere \n\n\n\n\nω\n\n0\n\n\n\n\n{\\displaystyle \\omega _{0}}\n\n is an arbitrary reference angular frequency.[2]\nThis function goes by various names, such as complex envelope and complex baseband. The complex envelope is not unique; it is determined by the choice of \n\n\n\n\nω\n\n0\n\n\n\n\n{\\displaystyle \\omega _{0}}\n\n. This concept is often used when dealing with passband signals. If \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n is a modulated signal, \n\n\n\n\nω\n\n0\n\n\n\n\n{\\displaystyle \\omega _{0}}\n\n might be equated to its carrier frequency.\nIn other cases, \n\n\n\n\nω\n\n0\n\n\n\n\n{\\displaystyle \\omega _{0}}\n\n is selected to be somewhere in the middle of the desired passband. Then a simple low-pass filter with real coefficients can excise the portion of interest. Another motive is to reduce the highest frequency, which reduces the minimum rate for alias-free sampling. A frequency shift does not undermine the mathematical tractability of the complex signal representation. So in that sense, the down-converted signal is still analytic. However, restoring the real-valued representation is no longer a simple matter of just extracting the real component. Up-conversion may be required, and if the signal has been sampled (discrete-time), interpolation (upsampling) might also be necessary to avoid aliasing.\nIf \n\n\n\n\nω\n\n0\n\n\n\n\n{\\displaystyle \\omega _{0}}\n\n is chosen larger than the highest frequency of \n\n\n\n\ns\n\n\na\n\n\n\n(\nt\n)\n,\n\n\n{\\displaystyle s_{\\mathrm {a} }(t),}\n\n then \n\n\n\n\n\n\ns\n\n\na\n\n\n\n_\n\n\n(\nt\n)\n\n\n{\\displaystyle {\\underline {s_{\\mathrm {a} }}}(t)}\n\n has no positive frequencies. In that case, extracting the real component restores them, but in reverse order; the low-frequency components are now high ones and vice versa. This can be used to demodulate a type of single sideband signal called lower sideband or inverted sideband.\nSometimes \n\n\n\n\nω\n\n0\n\n\n\n\n{\\displaystyle \\omega _{0}}\n\n is chosen to minimize\nAlternatively,[4] \n\n\n\n\nω\n\n0\n\n\n\n\n{\\displaystyle \\omega _{0}}\n\n can be chosen to minimize the mean square error in linearly approximating the unwrapped instantaneous phase \n\n\n\nϕ\n(\nt\n)\n\n\n{\\displaystyle \\phi (t)}\n\n:\nor another alternative (for some optimum \n\n\n\nθ\n\n\n{\\displaystyle \\theta }\n\n):\nIn the field of time-frequency signal processing, it was shown that the analytic signal was needed in the definition of the Wigner–Ville distribution so that the method can have the desirable properties needed for practical applications.[5]\nSometimes the complex envelope is identified as synonymous with complex amplitude;[a][b] other times it is presented as a time-dependent generalisation.[c] Their relationship is not unlike that in the real-valued case: varying envelope generalizing constant amplitude.\nThe concept of analytic signal is well-defined for signals of a single variable which typically is time. For signals of two or more variables, an analytic signal can be defined in different ways, and two approaches are presented below.\nA straightforward generalization of the analytic signal can be done for a multi-dimensional signal once it is established what is meant by negative frequencies for this case. This can be done by introducing a unit vector \n\n\n\n\n\n\nu\n^\n\n\n\n\n\n{\\displaystyle {\\boldsymbol {\\hat {u}}}}\n\n in the Fourier domain and label any frequency vector \n\n\n\n\nξ\n\n\n\n{\\displaystyle {\\boldsymbol {\\xi }}}\n\n as negative if \n\n\n\n\nξ\n\n⋅\n\n\n\nu\n^\n\n\n\n<\n0\n\n\n{\\displaystyle {\\boldsymbol {\\xi }}\\cdot {\\boldsymbol {\\hat {u}}}<0}\n\n. The analytic signal is then produced by removing all negative frequencies and multiply the result by 2, in accordance to the procedure described for the case of one-variable signals. However, there is no particular direction for \n\n\n\n\n\n\nu\n^\n\n\n\n\n\n{\\displaystyle {\\boldsymbol {\\hat {u}}}}\n\n which must be chosen unless there are some additional constraints. Therefore, the choice of \n\n\n\n\n\n\nu\n^\n\n\n\n\n\n{\\displaystyle {\\boldsymbol {\\hat {u}}}}\n\n is ad hoc, or application specific.\nThe real and imaginary parts of the analytic signal correspond to the two elements of the vector-valued monogenic signal, as it is defined for one-variable signals. However, the monogenic signal can be extended to arbitrary number of variables in a straightforward manner, producing an (n + 1)-dimensional vector-valued function for the case of n-variable signals.", 
    "dbpedia_url": "http://dbpedia.org/resource/Analytic_signal", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Analytic_signal\n"
}