{
    "about": "An anti-aliasing filter (AAF) is a filter used before a signal sampler to restrict the bandwidth of a signal to approximately or completely satisfy the sampling theorem over the band of interest. Since the theorem states that unambiguous reconstruction of the signal from its samples is possible when the power of frequencies above the Nyquist frequency is zero, a real anti-aliasing filter trades off between bandwidth and aliasing. A realizable anti-aliasing filter will typically either permit some aliasing to occur or else attenuate some in-band frequencies close to the Nyquist limit. For this reason, many practical systems sample higher than required to ensure that all frequencies of interest can be reconstructed, a practice called oversampling.", 
    "classification": "Digital Signal Processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Anti-aliasing_filter\n", 
    "full_text": "An anti-aliasing filter (AAF) is a filter used before a signal sampler to restrict the bandwidth of a signal to approximately or completely satisfy the sampling theorem over the band of interest. Since the theorem states that unambiguous reconstruction of the signal from its samples is possible when the power of frequencies above the Nyquist frequency is zero, a real anti-aliasing filter trades off between bandwidth and aliasing. A realizable anti-aliasing filter will typically either permit some aliasing to occur or else attenuate some in-band frequencies close to the Nyquist limit. For this reason, many practical systems sample higher than required to ensure that all frequencies of interest can be reconstructed, a practice called oversampling.\n\n\nIn the case of optical image sampling, as by image sensors in digital cameras, the anti-aliasing filter is also known as an optical low-pass filter (OLPF), blur filter, or AA filter. The mathematics of sampling in two spatial dimensions is similar to the mathematics of time-domain sampling, but the filter implementation technologies are different. The typical implementation in digital cameras is two layers of birefringent material such as lithium niobate, which spreads each optical point into a cluster of four points.[1]\nThe choice of spot separation for such a filter involves a tradeoff among sharpness, aliasing, and fill factor (the ratio of the active refracting area of a microlens array to the total contiguous area occupied by the array). In a monochrome or three-CCD or Foveon X3 camera, the microlens array alone, if near 100% effective, can provide a significant anti-aliasing effect,[2] while in color filter array (CFA, e.g. Bayer filter) cameras, an additional filter is generally needed to reduce aliasing to an acceptable level.[3][4][5]\nThe Pentax K-3 from Ricoh introduced a unique sensor-based anti-aliasing filter. The filter works by micro vibrating the sensor element. The user can turn the vibration on or off, selecting anti-aliasing or no anti-aliasing.[6]\nAnti-aliasing filters are commonly used at the input of digital signal processing system's analog to digital converter; similar filters are used as reconstruction filters at the output of such systems, for example in music players. In the latter case, the filter prevents imaging, the reverse process of aliasing where in-band frequencies are mirrored out of band.\nA technique known as oversampling is commonly used in audio ADCs. The idea is to use a higher intermediate digital sample rate, so that a nearly-ideal digital filter can sharply cut off aliasing near the original low Nyquist frequency and give better phase response, while a much simpler analog filter can stop frequencies above the new higher Nyquist frequency. Because analog filters have relatively high cost and limited performance, relaxing the demands on the analog filter can greatly reduce both aliasing and cost. Furthermore, because some noise is averaged out, the higher sampling rate can moderately improve SNR.\nAlternatively, a signal may be intentionally oversampled without an intermediate frequency to reduce the requirements on the anti-alias filter. For example, CD audio typically extends up to 20 kHz, but is sampled with a 22.05 kHz Nyquist rate. By oversampling by 2.05 kHz, both aliasing and attenuation of higher audio frequencies can be prevented even with less than ideal filters.\nOften, an anti-aliasing filter is a low-pass filter; however, this is not a requirement. Generalizations of the Nyquist–Shannon sampling theorem allow sampling of other band-limited passband signals instead of baseband signals.\nFor signals that are bandwidth limited, but not centered at zero, a band-pass filter can be used as an anti-aliasing filter. For example, this could be done with a single-sideband modulated or frequency modulated signal. If one desired to sample an FM radio broadcast centered at 87.9 MHz and bandlimited to a 200 kHz band, then an appropriate anti-alias filter would be centered on 87.9 MHz with 200 kHz bandwidth (or pass-band of 87.8 MHz to 88.0 MHz), and the sampling rate would be no less than 176.2 MHz, but should also satisfy other constraints to prevent aliasing.\nIt is very important to avoid input signal overload when using an anti-aliasing filter. If the signal is strong enough, it can cause clipping at the analog-to-digital converter, even after filtering. When distortion due to clipping occurs after the anti-aliasing filter, it can create components outside the passband of the anti-aliasing filter; these components can then alias, causing the reproduction of other non-harmonically-related frequencies.", 
    "name": "Anti Aliasing Filter"
}