{
    "about": "The Applied Element Method (AEM) is a numerical analysis used in predicting the continuum and discrete behavior of structures. The modeling method in AEM adopts the concept of discrete cracking allowing it to automatically track structural collapse behavior passing through all stages of loading: elastic, crack initiation and propagation in tension-weak materials, reinforcement yield, element separation, element contact and collision, as well as collision with the ground and adjacent structures.", 
    "name": "Applied Element Method", 
    "classification": "Numerical Analysis", 
    "full_text": "The Applied Element Method (AEM) is a numerical analysis used in predicting the continuum and discrete behavior of structures. The modeling method in AEM adopts the concept of discrete cracking allowing it to automatically track structural collapse behavior passing through all stages of loading: elastic, crack initiation and propagation in tension-weak materials, reinforcement yield, element separation, element contact and collision, as well as collision with the ground and adjacent structures.\n\n\nExploration of the approach employed in the applied element method began in 1995 at the University of Tokyo as part of Dr.Hatem Tagel-Din's research studies. The term itself \"Applied Element Method,\" however was first coined in 2000 in a paper called \"Applied element method for structural analysis: Theory and application for linear Materials.\".[1] Since then AEM has been the subject of research by a number of academic institutions and the driving factor in real-world applications. Research has verified its accuracy for: elastic analysis;[1] crack initiation and propagation; estimation of failure loads at reinforced concrete structures;[2] reinforced concrete structures under cyclic loading;[3] buckling and post-buckling behavior;[4] nonlinear dynamic analysis of structures subjected to severe earthquakes;[5] fault-rupture propagation;[6] nonlinear behavior of brick structures;[7] and the analysis of glass reinforced polymers (GFRP) walls under blast loads.[8]\nIn AEM, the structure is divided virtually and modeled as an assemblage of relatively small elements. The elements are then connected through a set of normal and shear springs located at contact points distributed along the element faces. Normal and shear springs are responsible for the transfer of normal and shear stresses from one element to the next.\nThe modeling of objects in AEM is very similar to modeling objects in FEM. Each object is divided into a series of elements connected and forming a mesh. The main difference between AEM and FEM, however, is how the elements are joined together. In AEM the elements are connected by a series of non-linear springs representing the material behavior.\nThere are three types of springs used in AEM:\nWhen the average strain value at the element face reaches the separation strain, all springs at this face are removed and elements are no longer connected until a collision occurs, at which point they collide together as rigid bodies.\nSeparation strain represents the strain at which adjacent elements are totally separated at the connecting face. This parameter is not available in the elastic material model. For concrete, all springs between the adjacent faces including reinforcement bar springs are cut. If the elements meet again, they will behave as two different rigid bodies that have now contacted each other. For steel, the bars are cut if the stress point reaches ultimate stress or if the concrete reaches the separation strain.\nContact or collision is detected without any user intervention. Elements are able to separate, contract and/or make contact with other elements. In AEM three contact methods include Corner-to-Face, Edge-to-Edge, and Corner-to-Ground.\nThe spring stiffness in a 2D model can be calculated from the following equations:\nWhere d is the distance between springs, T is the thickness of the element, a is the length of the representative area, E is the Young's modulus, and G is the shear modulus of the material. The above equation's indicate that each spring represents the stiffness of an area (T·d) within the length of the studied material.\nTo model reinforcement bars embedded in concrete, a spring is placed inside the element at the location of the bar; the area (T·d) is replaced by the actual cross section area of the reinforcement bar. Similar to modeling embedded steel sections, the area (T·d) may be replaced by the area of the steel section represented by the spring.\nAlthough the element motion moves as a rigid body, its internal deformations are represented by the spring deformation around each element. This means the element shape does not change during analysis, but the behavior of assembly of elements is deformable. The two elements are assumed to be connected by only one pair of normal and shear springs. To have a general stiffness matrix, the locations of element and contact springs are assumed in a general position. The stiffness matrix components corresponding to each degree of freedom are determined by assuming a unit displacement in the studied direction and by determining forces at the centroid of each element. The 2D element stiffness matrix size is 6 × 6; the components of the upper left quarter of the stiffness matrix are shown below:\nThe stiffness matrix depends on the contact spring stiffness and the spring location. The stiffness matrix is for only one pair of contact springs. However, the global stiffness matrix is determined by summing up the stiffness matrices of individual pairs of springs around each element. Consequently, the developed stiffness matrix has total effects from all pairs of springs, according to the stress situation around the element. This technique can be used in both load and displacement control cases. The 3D stiffness matrix may be deduced similarly.\nThe applied element method is currently being used in the following applications:", 
    "dbpedia_url": "http://dbpedia.org/resource/Applied_element_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Applied_element_method\n"
}