{
    "about": "In computer science, approximate string matching (often colloquially referred to as fuzzy string searching) is the technique of finding strings that match a pattern approximately (rather than exactly). The problem of approximate string matching is typically divided into two sub-problems: finding approximate substring matches inside a given string and finding dictionary strings that match the pattern approximately.", 
    "name": "Approximate String Matching", 
    "classification": "Pattern Matching", 
    "full_text": "In computer science, approximate string matching (often colloquially referred to as fuzzy string searching) is the technique of finding strings that match a pattern approximately (rather than exactly). The problem of approximate string matching is typically divided into two sub-problems: finding approximate substring matches inside a given string and finding dictionary strings that match the pattern approximately.\n\n\nThe closeness of a match is measured in terms of the number of primitive operations necessary to convert the string into an exact match. This number is called the edit distance between the string and the pattern. The usual primitive operations are:[1]\nThese three operations may be generalized as forms of substitution by adding a NULL character (here symbolized by *) wherever a character has been deleted or inserted:\nSome approximate matchers also treat transposition, in which the positions of two letters in the string are swapped, to be a primitive operation. Changing cost to cots is an example of a transposition.[2]\nDifferent approximate matchers impose different constraints. Some matchers use a single global unweighted cost, that is, the total number of primitive operations necessary to convert the match to the pattern. For example, if the pattern is coil, foil differs by one substitution, coils by one insertion, oil by one deletion, and foal by two substitutions. If all operations count as a single unit of cost and the limit is set to one, foil, coils, and oil will count as matches while foal will not.\nOther matchers specify the number of operations of each type separately, while still others set a total cost but allow different weights to be assigned to different operations. Some matchers permit separate assignments of limits and weights to individual groups in the pattern.\nOne possible definition of the approximate string matching problem is the following: Given a pattern string \n\n\n\nP\n=\n\np\n\n1\n\n\n\np\n\n2\n\n\n.\n.\n.\n\np\n\nm\n\n\n\n\n{\\displaystyle P=p_{1}p_{2}...p_{m}}\n\n and a text string \n\n\n\nT\n=\n\nt\n\n1\n\n\n\nt\n\n2\n\n\n…\n\nt\n\nn\n\n\n\n\n{\\displaystyle T=t_{1}t_{2}\\dots t_{n}}\n\n, find a substring \n\n\n\n\nT\n\n\nj\n′\n\n,\nj\n\n\n=\n\nt\n\n\nj\n′\n\n\n\n…\n\nt\n\nj\n\n\n\n\n{\\displaystyle T_{j',j}=t_{j'}\\dots t_{j}}\n\n in T, which, of all substrings of T, has the smallest edit distance to the pattern P.\nA brute-force approach would be to compute the edit distance to P for all substrings of T, and then choose the substring with the minimum distance. However, this algorithm would have the running time O(n3 m).\nA better solution, which was proposed by Sellers[3], relies on dynamic programming. It uses an alternative formulation of the problem: for each position j in the text T and each position i in the pattern P, compute the minimum edit distance between the i first characters of the pattern, \n\n\n\n\nP\n\ni\n\n\n\n\n{\\displaystyle P_{i}}\n\n, and any substring \n\n\n\n\nT\n\n\nj\n′\n\n,\nj\n\n\n\n\n{\\displaystyle T_{j',j}}\n\n of T that ends at position j.\nFor each position j in the text T, and each position i in the pattern P, go through all substrings of T ending at position j, and determine which one of them has the minimal edit distance to the i first characters of the pattern P. Write this minimal distance as E(i, j). After computing E(i, j) for all i and j, we can easily find a solution to the original problem: it is the substring for which E(m, j) is minimal (m being the length of the pattern P.)\nComputing E(m, j) is very similar to computing the edit distance between two strings. In fact, we can use the Levenshtein distance computing algorithm for E(m, j), the only difference being that we must initialize the first row with zeros, and save the path of computation, that is, whether we used E(i − 1,j), E(i,j − 1) or E(i − 1,j − 1) in computing E(i, j).\nIn the array containing the E(x, y) values, we then choose the minimal value in the last row, let it be E(x2, y2), and follow the path of computation backwards, back to the row number 0. If the field we arrived at was E(0, y1), then T[y1 + 1] ... T[y2] is a substring of T with the minimal edit distance to the pattern P.\nComputing the E(x, y) array takes O(mn) time with the dynamic programming algorithm, while the backwards-working phase takes O(n + m) time.\nTraditionally, approximate string matching algorithms are classified into two categories: on-line and off-line. With on-line algorithms the pattern can be processed before searching but the text cannot. In other words, on-line techniques do searching without an index. Early algorithms for on-line approximate matching were suggested by Wagner and Fisher[4] and by Sellers. [5] Both algorithms are based on dynamic programming but solve different problems. Sellers' algorithm searches approximately for a substring in a text while the algorithm of Wagner and Fisher calculates Levenshtein distance, being appropriate for dictionary fuzzy search only.\nOn-line searching techniques have been repeatedly improved. Perhaps the most famous improvement is the bitap algorithm (also known as the shift-or and shift-and algorithm), which is very efficient for relatively short pattern strings. The Bitap algorithm is the heart of the Unix searching utility agrep. A review of on-line searching algorithms was done by G. Navarro.[6]\nAlthough very fast on-line techniques exist, their performance on large data is unacceptable. Text preprocessing or indexing makes searching dramatically faster. Today, a variety of indexing algorithms have been presented. Among them are suffix trees[7], metric trees[8] and n-gram methods.[9][10] A detailed survey of indexing techniques that allows one to find an arbitrary substring in a text is given by Navarro et al.[11]. A computational survey of dictionary methods (i.e., methods that permit finding all dictionary words that approximately match a search pattern) is given by Boytsov [12].\nThe most common application of approximate matchers until recently has been spell checking.[13] With the availability of large amounts of DNA data, matching of nucleotide sequences has become an important application.[14] Approximate matching is also used in spam filtering.[15]String matching cannot be used for most binary data, such as images and music. They require different algorithms, such as acoustic fingerprinting.\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Approximate_string_matching", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Approximate_string_matching\n"
}