{
    "about": "Apriori[1] is an algorithm for frequent item set mining and association rule learning over transactional databases. It proceeds by identifying the frequent individual items in the database and extending them to larger and larger item sets as long as those item sets appear sufficiently often in the database. The frequent item sets determined by Apriori can be used to determine association rules which highlight general trends in the database: this has applications in domains such as market basket analysis.", 
    "name": "Apriori Algorithm", 
    "classification": "Data Mining Algorithms", 
    "full_text": "Apriori[1] is an algorithm for frequent item set mining and association rule learning over transactional databases. It proceeds by identifying the frequent individual items in the database and extending them to larger and larger item sets as long as those item sets appear sufficiently often in the database. The frequent item sets determined by Apriori can be used to determine association rules which highlight general trends in the database: this has applications in domains such as market basket analysis.\n\n\nThe Apriori algorithm was proposed by Agrawal and Srikant in 1994. Apriori is designed to operate on databases containing transactions (for example, collections of items bought by customers, or details of a website frequentation). Other algorithms are designed for finding association rules in data having no transactions (Winepi and Minepi), or having no timestamps (DNA sequencing). Each transaction is seen as a set of items (an itemset). Given a threshold \n\n\n\nC\n\n\n{\\displaystyle C}\n\n, the Apriori algorithm identifies the item sets which are subsets of at least \n\n\n\nC\n\n\n{\\displaystyle C}\n\n transactions in the database.\nApriori uses a \"bottom up\" approach, where frequent subsets are extended one item at a time (a step known as candidate generation), and groups of candidates are tested against the data. The algorithm terminates when no further successful extensions are found.\nApriori uses breadth-first search and a Hash tree structure to count candidate item sets efficiently. It generates candidate item sets of length \n\n\n\nk\n\n\n{\\displaystyle k}\n\n from item sets of length \n\n\n\nk\n−\n1\n\n\n{\\displaystyle k-1}\n\n. Then it prunes the candidates which have an infrequent sub pattern. According to the downward closure lemma, the candidate set contains all frequent \n\n\n\nk\n\n\n{\\displaystyle k}\n\n-length item sets. After that, it scans the transaction database to determine frequent item sets among the candidates.\nThe pseudo code for the algorithm is given below for a transaction database \n\n\n\nT\n\n\n{\\displaystyle T}\n\n, and a support threshold of \n\n\n\nϵ\n\n\n{\\displaystyle \\epsilon }\n\n. Usual set theoretic notation is employed, though note that \n\n\n\nT\n\n\n{\\displaystyle T}\n\n is a multiset. \n\n\n\n\nC\n\nk\n\n\n\n\n{\\displaystyle C_{k}}\n\n is the candidate set for level \n\n\n\nk\n\n\n{\\displaystyle k}\n\n. At each step, the algorithm is assumed to generate the candidate sets from the large item sets of the preceding level, heeding the downward closure lemma. \n\n\n\nc\no\nu\nn\nt\n[\nc\n]\n\n\n{\\displaystyle count[c]}\n\n accesses a field of the data structure that represents candidate set \n\n\n\nc\n\n\n{\\displaystyle c}\n\n, which is initially assumed to be zero. Many details are omitted below, usually the most important part of the implementation is the data structure used for storing the candidate sets, and counting their frequencies.\n\n\n\n\n\n\n\n\n\n\nA\np\nr\ni\no\nr\ni\n\n(\nT\n,\nϵ\n)\n\n\n\n\n\n\n\nL\n\n1\n\n\n←\n{\n\nl\na\nr\ng\ne\n \n1\n−\ni\nt\ne\nm\ns\ne\nt\ns\n\n}\n\n\n\n\n\n\nk\n←\n2\n\n\n\n\n\n\n\n\nwhile\n\n\n \n\nL\n\nk\n−\n1\n\n\n≠\n \n∅\n\n\n\n\n\n\n\n\nC\n\nk\n\n\n←\n{\na\n∪\n{\nb\n}\n∣\na\n∈\n\nL\n\nk\n−\n1\n\n\n∧\nb\n∉\na\n}\n−\n{\nc\n∣\n{\ns\n∣\ns\n⊆\nc\n∧\n\n|\n\ns\n\n|\n\n=\nk\n−\n1\n}\n⊈\n\nL\n\nk\n−\n1\n\n\n}\n\n\n\n\n\n\n\n\n\n\nfor\n\n\n \nt\nr\na\nn\ns\na\nc\nt\ni\no\nn\ns\n\n \nt\n∈\nT\n\n\n\n\n\n\n\n\n\nC\n\nt\n\n\n←\n{\nc\n∣\nc\n∈\n\nC\n\nk\n\n\n∧\nc\n⊆\nt\n}\n\n\n\n\n\n\n\n\n\n\n\nfor\n\n\n \nc\na\nn\nd\ni\nd\na\nt\ne\ns\n\n \nc\n∈\n\nC\n\nt\n\n\n\n\n\n\n\n\n\n\n\n\n\nc\no\nu\nn\nt\n\n\n[\nc\n]\n←\n\n\nc\no\nu\nn\nt\n\n\n[\nc\n]\n+\n1\n\n\n\n\n\n\n\n\nL\n\nk\n\n\n←\n{\nc\n∣\nc\n∈\n\nC\n\nk\n\n\n∧\n \n\n\nc\no\nu\nn\nt\n\n\n[\nc\n]\n≥\nϵ\n}\n\n\n\n\n\n\n\nk\n←\nk\n+\n1\n\n\n\n\n\n\n\n\nreturn\n\n\n \n\n⋃\n\nk\n\n\n\nL\n\nk\n\n\n\n\n\n\n\n\n{\\displaystyle {\\begin{aligned}&\\mathrm {Apriori} (T,\\epsilon )\\\\&\\qquad L_{1}\\gets \\{\\mathrm {large~1-itemsets} \\}\\\\&\\qquad k\\gets 2\\\\&\\qquad \\mathrm {\\textbf {while}} ~L_{k-1}\\neq \\ \\emptyset \\\\&\\qquad \\qquad C_{k}\\gets \\{a\\cup \\{b\\}\\mid a\\in L_{k-1}\\land b\\not \\in a\\}-\\{c\\mid \\{s\\mid s\\subseteq c\\land |s|=k-1\\}\\nsubseteq L_{k-1}\\}\\\\&\\qquad \\qquad \\mathrm {{\\textbf {for}}~transactions} ~t\\in T\\\\&\\qquad \\qquad \\qquad C_{t}\\gets \\{c\\mid c\\in C_{k}\\land c\\subseteq t\\}\\\\&\\qquad \\qquad \\qquad \\mathrm {{\\textbf {for}}~candidates} ~c\\in C_{t}\\\\&\\qquad \\qquad \\qquad \\qquad {\\mathit {count}}[c]\\gets {\\mathit {count}}[c]+1\\\\&\\qquad \\qquad L_{k}\\gets \\{c\\mid c\\in C_{k}\\land ~{\\mathit {count}}[c]\\geq \\epsilon \\}\\\\&\\qquad \\qquad k\\gets k+1\\\\&\\qquad \\mathrm {\\textbf {return}} ~\\bigcup _{k}L_{k}\\end{aligned}}}\n\n\nConsider the following database, where each row is a transaction and each cell is an individual item of the transaction:\nThe association rules that can be determined from this database are the following:\nwe can also illustrate this through a variety of examples\nAssume that a large supermarket tracks sales data by stock-keeping unit (SKU) for each item: each item, such as \"butter\" or \"bread\", is identified by a numerical SKU. The supermarket has a database of transactions where each transaction is a set of SKUs that were bought together.\nLet the database of transactions consist of following itemsets:\nWe will use Apriori to determine the frequent item sets of this database. To do so, we will say that an item set is frequent if it appears in at least 3 transactions of the database: the value 3 is the support threshold.\nThe first step of Apriori is to count up the number of occurrences, called the support, of each member item separately. By scanning the database for the first time, we obtain the following result\nAll the itemsets of size 1 have a support of at least 3, so they are all frequent.\nThe next step is to generate a list of all pairs of the frequent items.\nFor example, regarding the pair {1,2}: the first table of Example 2 shows items 1 and 2 appearing together in three of the itemsets; therefore, we say item {1,2} has support of three.\nThe pairs {1,2}, {2,3}, {2,4}, and {3,4} all meet or exceed the minimum support of 3, so they are frequent. The pairs {1,3} and {1,4} are not. Now, because {1,3} and {1,4} are not frequent, any larger set which contains {1,3} or {1,4} cannot be frequent. In this way, we can prune sets: we will now look for frequent triples in the database, but we can already exclude all the triples that contain one of these two pairs:\nin the example, there are no frequent triplets -- {2,3,4} is below the minimal threshold, and the other triplets were excluded because they were super sets of pairs that were already below the threshold.\nWe have thus determined the frequent sets of items in the database, and illustrated how some items were not counted because one of their subsets was already known to be below the threshold.\nApriori, while historically significant, suffers from a number of inefficiencies or trade-offs, which have spawned other algorithms. Candidate generation generates large numbers of subsets (the algorithm attempts to load up the candidate set with as many as possible before each scan). Bottom-up subset exploration (essentially a breadth-first traversal of the subset lattice) finds any maximal subset S only after all \n\n\n\n\n2\n\n\n|\n\nS\n\n|\n\n\n\n−\n1\n\n\n{\\displaystyle 2^{|S|}-1}\n\n of its proper subsets.\nLater algorithms such as Max-Miner[2] try to identify the maximal frequent item sets without enumerating their subsets, and perform \"jumps\" in the search space rather than a purely bottom-up approach.", 
    "dbpedia_url": "http://dbpedia.org/resource/Apriori_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Apriori_algorithm\n"
}