{
    "about": "In computer science and operations research, the artificial bee colony algorithm (ABC) is an optimization algorithm based on the intelligent foraging behaviour of honey bee swarm, proposed by Karaboga in 2005.[1]", 
    "name": "Artificial Bee Colony Algorithm", 
    "classification": "Evolutionary Algorithms", 
    "full_text": "In computer science and operations research, the artificial bee colony algorithm (ABC) is an optimization algorithm based on the intelligent foraging behaviour of honey bee swarm, proposed by Karaboga in 2005.[1]\n\n\nIn the ABC model, the colony consists of three groups of bees: employed bees, onlookers and scouts. It is assumed that there is only one artificial employed bee for each food source. In other words, the number of employed bees in the colony is equal to the number of food sources around the hive. Employed bees go to their food source and come back to hive and dance on this area. The employed bee whose food source has been abandoned becomes a scout and starts to search for finding a new food source. Onlookers watch the dances of employed bees and choose food sources depending on dances. The main steps of the algorithm are given below.:[2]\nIn ABC, a population based algorithm, the position of a food source represents a possible solution to the optimization problem and the nectar amount of a food source corresponds to the quality (fitness) of the associated solution. The number of the employed bees is equal to the number of solutions in the population. At the first step, a randomly distributed initial population (food source positions) is generated. After initialization, the population is subjected to repeat the cycles of the search processes of the employed, onlooker, and scout bees, respectively. An employed bee produces a modification on the source position in her memory and discovers a new food source position. Provided that the nectar amount of the new one is higher than that of the previous source, the bee memorizes the new source position and forgets the old one. Otherwise she keeps the position of the one in her memory. After all employed bees complete the search process, they share the position information of the sources with the onlookers on the dance area. Each onlooker evaluates the nectar information taken from all employed bees and then chooses a food source depending on the nectar amounts of sources. As in the case of the employed bee, she produces a modification on the source position in her memory and checks its nectar amount. Providing that its nectar is higher than that of the previous one, the bee memorizes the new position and forgets the old one. The sources abandoned are determined and new sources are randomly produced to be replaced with the abandoned ones by artificial scouts.\nABC is a swarm intelligence algorithm proposed by Karaboga in 2005, which is inspired by the behavior of honey bees. Since the development of ABC, it has been applied to solve different kinds of problems. Artificial bee colony (ABC) algorithm is a recently proposed optimization technique which simulates the intelligent foraging behavior of honey bees. A set of honey bees is called swarm which can successfully accomplish tasks through social cooperation. In the ABC algorithm, there are three types of bees: employed bees, onlooker bees, and scout bees. The employed bees search food around the food source in their memory; meanwhile they share the information of these food sources to the onlooker bees. The onlooker bees tend to select good food sources from those found by the employed bees. The food source that has higher quality (fitness) will have a large chance to be selected by the onlooker bees than the one of lower quality. The scout bees are translated from a few employed bees, which abandon their food sources and search new ones.\nIn the ABC algorithm, the first half of the swarm consists of employed bees, and the second half constitutes the onlooker bees.\nThe number of employed bees or the onlooker bees is equal to the number of solutions in the swarm. The ABC generates a randomly distributed initial population of SN solutions (food sources), where SN denotes the swarm size.\nLet \n\n\n\n\nX\n\ni\n\n\n=\n{\n\nx\n\ni\n,\n1\n\n\n,\n\nx\n\ni\n,\n2\n\n\n,\n…\n,\n\nx\n\ni\n,\nn\n\n\n}\n\n\n{\\displaystyle X_{i}=\\{x_{i,1},x_{i,2},\\ldots ,x_{i,n}\\}}\n\n represent the \n\n\n\n\ni\n\nt\nh\n\n\n\n\n{\\displaystyle i^{th}}\n\n solution in the swarm, Where \n\n\n\nn\n\n\n{\\displaystyle n}\n\n is the dimension size. Each employed bee \n\n\n\n\nX\n\ni\n\n\n\n\n{\\displaystyle X_{i}}\n\n generates a new candidate solution \n\n\n\n\nV\n\ni\n\n\n\n\n{\\displaystyle V_{i}}\n\n in the neighborhood of its present position as equation below:\nWhere \n\n\n\n\nX\n\nj\n\n\n\n\n{\\displaystyle X_{j}}\n\n is a randomly selected candidate solution (\n\n\n\ni\n≠\nj\n\n\n{\\displaystyle i\\neq j}\n\n), \n\n\n\nk\n\n\n{\\displaystyle k}\n\n is a random dimension index selected from the set \n\n\n\n{\n1\n,\n2\n,\n…\n,\nn\n}\n\n\n{\\displaystyle \\{1,2,\\ldots ,n\\}}\n\n , and \n\n\n\n\nΦ\n\n\ni\n\nk\n\n\n\n\n\n\n{\\displaystyle \\Phi _{i_{k}}}\n\n is a random number within \n\n\n\n[\n−\n1\n,\n1\n]\n\n\n{\\displaystyle [-1,1]}\n\n. Once the new candidate solution \n\n\n\n\nV\n\ni\n\n\n\n\n{\\displaystyle V_{i}}\n\n is generated, a greedy selection is used. If the fitness value of \n\n\n\n\nV\n\ni\n\n\n\n\n{\\displaystyle V_{i}}\n\n is better than that of its parent \n\n\n\n\nX\n\ni\n\n\n\n\n{\\displaystyle X_{i}}\n\n, then update \n\n\n\n\nX\n\ni\n\n\n\n\n{\\displaystyle X_{i}}\n\n with \n\n\n\n\nV\n\ni\n\n\n\n\n{\\displaystyle V_{i}}\n\n; otherwise keep \n\n\n\n\nX\n\ni\n\n\n\n\n{\\displaystyle X_{i}}\n\n unchanged. After all employed bees complete the search process; they share the information of their food sources with the onlooker bees through waggle dances. An onlooker bee evaluates the nectar information taken from all employed bees and chooses a food source with a probability related to its nectar amount. This probabilistic selection is really a roulette wheel selection mechanism which is described as equation below:\nWhere \n\n\n\nf\ni\n\nt\n\ni\n\n\n\n\n{\\displaystyle fit_{i}}\n\n is the fitness value of the \n\n\n\n\ni\n\nt\nh\n\n\n\n\n{\\displaystyle i^{th}}\n\n solution in the swarm. As seen, the better the solution \n\n\n\ni\n\n\n{\\displaystyle i}\n\n, the higher the probability of the \n\n\n\n\ni\n\nt\nh\n\n\n\n\n{\\displaystyle i^{th}}\n\nfood source selected. If a position cannot be improved over a predefined number (called limit) of cycles, then the food source is abandoned. Assume that the abandoned source is \n\n\n\n\nX\n\ni\n\n\n\n\n{\\displaystyle X_{i}}\n\n, and then the scout bee discovers a new food source to be replaced with \n\n\n\n\ni\n\nt\nh\n\n\n\n\n{\\displaystyle i^{th}}\n\n as equation below:\nWhere \n\n\n\nr\na\nn\nd\n(\n0\n,\n1\n)\n\n\n{\\displaystyle rand(0,1)}\n\n is a random number within\n\n\n\n[\n0\n,\n1\n]\n\n\n{\\displaystyle [0,1]}\n\n based on a normal distribution and \n\n\n\nl\nb\n,\nu\nb\n\n\n{\\displaystyle lb,ub}\n\n, are lower and upper boundaries of the \n\n\n\n\ni\n\nt\nh\n\n\n\n\n{\\displaystyle i^{th}}\n\n dimension, respectively.", 
    "dbpedia_url": "http://dbpedia.org/resource/Artificial_bee_colony_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Artificial_bee_colony_algorithm\n"
}