{
    "about": "Audio signal processing or audio processing is the intentional alteration of audio signals often through an audio effect or effects unit. As audio signals may be electronically represented in either digital or analog format, signal processing may occur in either domain. Analog processors operate directly on the electrical signal, while digital processors operate mathematically on the digital representation of that signal.", 
    "name": "Audio Signal Processing", 
    "classification": "Signal Processing", 
    "full_text": "Audio signal processing or audio processing is the intentional alteration of audio signals often through an audio effect or effects unit. As audio signals may be electronically represented in either digital or analog format, signal processing may occur in either domain. Analog processors operate directly on the electrical signal, while digital processors operate mathematically on the digital representation of that signal.\n\n\nAudio signals are electronic representations of sound waves—longitudinal waves which travel through air, consisting of compressions and rarefactions. The energy contained in audio signals is typically measured in decibels. Audio processing was necessary for early radio broadcasting, as there were many problems with studio to transmitter links.[1]\n\"Analog\" indicates something that is mathematically represented by a set of continuous values; for example, the analog clock uses constantly moving hands on a physical clock face, where moving the hands directly alters the information that clock is providing. Thus, an analog signal is one represented by a continuous stream of data, in this case along an electrical circuit in the form of voltage, current or charge changes (compare with digital signals below). Analog signal processing (ASP) then involves physically altering the continuous signal by changing the voltage or current or charge via various electrical means.\nHistorically, before the advent of widespread digital technology, ASP was the only method by which to manipulate a signal. Since that time, as computers and software became more advanced, digital signal processing has become the method of choice.\nA digital representation expresses the pressure wave-form as a sequence of symbols, usually binary numbers. This permits signal processing using digital circuits such as microprocessors and computers. Although such a conversion can be prone to loss, most modern audio systems use this approach as the techniques of digital signal processing are much more powerful and efficient than analog domain signal processing.[2]\nProcessing methods and application areas include storage, level compression, data compression, transmission, enhancement (e.g., equalization, filtering, noise cancellation, echo or reverb removal or addition, etc.)\nTraditionally the most important audio processing (in audio broadcasting) takes place just before the transmitter. Studio audio processing is limited in the modern era due to digital audio systems (mixers, routers) being pervasive in the studio.[dubious – discuss]\nIn audio broadcasting, the audio processor must\nAudio unprocessed by reverb and delay is metaphorically referred to as \"dry\", while processed audio is referred to as \"wet\".[3]", 
    "dbpedia_url": "http://dbpedia.org/resource/Audio_signal_processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Audio_signal_processing\n"
}