{
    "about": "Audio normalization is the application of a constant amount of gain to an audio recording to bring the average or peak amplitude to a target level (the norm). Because the same amount of gain is applied across the entire recording, the signal-to-noise ratio and relative dynamics are unchanged.", 
    "name": "Audio Normalization", 
    "classification": "Digital Signal Processing", 
    "full_text": "Audio normalization is the application of a constant amount of gain to an audio recording to bring the average or peak amplitude to a target level (the norm). Because the same amount of gain is applied across the entire recording, the signal-to-noise ratio and relative dynamics are unchanged.\nNormalization differs from dynamic range compression, which applies varying levels of gain over a recording to fit the level within a minimum and maximum range.\nNormalization is one of the functions commonly provided by a digital audio workstation.\n\n\nOne type of normalization is peak normalization, wherein the gain is changed to bring the highest PCM sample value or analog signal peak to a given level – usually 0 dBFS, the loudest level allowed in a digital system.[1]\nSince it only searches for the highest level, peak normalization alone does not account for the apparent loudness of the content. As such, peak normalization is generally used to change the volume in such a way to ensure optimal use of available dynamic range during the mastering stage of a digital recording. When combined with compression/limiting, however, peak normalization becomes a feature that can provide a loudness advantage over non-peak normalized material. This feature of digital recording systems, compression and limiting followed by peak normalization, enables contemporary trends in programme loudness.[2][3]\nAnother type of normalization is based on a measure of loudness, wherein the gain is changed to bring the average amplitude to a target level. This average can be a simple measurement of average power, such as the RMS value, or it can be a measure of human-perceived loudness, such as that offered by ReplayGain, Sound Check and EBU R128.[1]\nDepending on the dynamic range of the content and the target level, loudness normalization can result in peaks that exceed the recording medium's limits. Software offering such normalization typically provides the option of using dynamic range compression to prevent clipping when this happens. In this situation, signal-to-noise ratio and relative dynamics are altered.", 
    "dbpedia_url": "http://dbpedia.org/resource/Audio_normalization", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Audio_normalization\n"
}