{
    "about": "In mathematics and computer algebra, automatic differentiation (AD), also called algorithmic differentiation or computational differentiation,[1][2] is a set of techniques to numerically evaluate the derivative of a function specified by a computer program. AD exploits the fact that every computer program, no matter how complicated, executes a sequence of elementary arithmetic operations (addition, subtraction, multiplication, division, etc.) and elementary functions (exp, log, sin, cos, etc.). By applying the chain rule repeatedly to these operations, derivatives of arbitrary order can be computed automatically, accurately to working precision, and using at most a small constant factor more arithmetic operations than the original program.", 
    "name": "Automatic Differentiation", 
    "classification": "Computer Algebra", 
    "full_text": "In mathematics and computer algebra, automatic differentiation (AD), also called algorithmic differentiation or computational differentiation,[1][2] is a set of techniques to numerically evaluate the derivative of a function specified by a computer program. AD exploits the fact that every computer program, no matter how complicated, executes a sequence of elementary arithmetic operations (addition, subtraction, multiplication, division, etc.) and elementary functions (exp, log, sin, cos, etc.). By applying the chain rule repeatedly to these operations, derivatives of arbitrary order can be computed automatically, accurately to working precision, and using at most a small constant factor more arithmetic operations than the original program.\nAutomatic differentiation is not:\nThese classical methods run into problems: symbolic differentiation leads to inefficient code (unless carefully done) and faces the difficulty of converting a computer program into a single expression, while numerical differentiation can introduce round-off errors in the discretization process and cancellation. Both classical methods have problems with calculating higher derivatives, where the complexity and errors increase. Finally, both classical methods are slow at computing the partial derivatives of a function with respect to many inputs, as is needed for gradient-based optimization algorithms. Automatic differentiation solves all of these problems, at the expense of introducing more software dependencies.\n\n\nFundamental to AD is the decomposition of differentials provided by the chain rule. For the simple composition y = g(h(x)) = g(w) the chain rule gives\nUsually, two distinct modes of AD are presented, forward accumulation (or forward mode) and reverse accumulation (or reverse mode). Forward accumulation specifies that one traverses the chain rule from inside to outside (that is, first one computes dw/dx and then dy/dw, while reverse accumulation has the traversal from outside to inside.\nGenerally, both forward and reverse accumulation are specific manifestations of applying the operator of program composition, with the appropriate one of the two mappings \n\n\n\n(\nw\n,\ny\n)\n\n\n{\\displaystyle (w,y)}\n\n being fixed.\nIn forward accumulation AD, one first fixes the independent variable to which differentiation is performed and computes the derivative of each sub-expression recursively. In a pen-and-paper calculation, one can do so by repeatedly substituting the derivative of the inner functions in the chain rule:\nThis can be generalized to multiple variables as a matrix product of Jacobians.\nCompared to reverse accumulation, forward accumulation is very natural and easy to implement as the flow of derivative information coincides with the order of evaluation. One simply augments each variable w with its derivative ẇ (stored as a numerical value, not a symbolic expression),\nas denoted by the dot. The derivatives are then computed in sync with the evaluation steps and combined with other derivatives via the chain rule.\nAs an example, consider the function:\nFor clarity, the individual sub-expressions have been labeled with the variables wi.\nThe choice of the independent variable to which differentiation is performed affects the seed values ẇ1 and ẇ2. Suppose one is interested in the derivative of this function with respect to x1. In this case, the seed values should be set to:\nWith the seed values set, one may then propagate the values using the chain rule as shown in both the table below. Figure 2 shows a pictorial depiction of this process as a computational graph.\nTo compute the gradient of this example function, which requires the derivatives of f with respect to not only x1 but also x2, one must perform an additional sweep over the computational graph using the seed values \n\n\n\n\n\n\n\nw\n˙\n\n\n\n\n1\n\n\n=\n0\n;\n\n\n\n\nw\n˙\n\n\n\n\n2\n\n\n=\n1\n\n\n{\\displaystyle {\\dot {w}}_{1}=0;{\\dot {w}}_{2}=1}\n\n.\nThe computational complexity of one sweep of forward accumulation is proportional to the complexity of the original code.\nForward accumulation is more efficient than reverse accumulation for functions f : ℝn → ℝm with m ≫ n as only n sweeps are necessary, compared to m sweeps for reverse accumulation.\nIn reverse accumulation AD, one first fixes the dependent variable to be differentiated and computes the derivative with respect to each sub-expression recursively. In a pen-and-paper calculation, one can perform the equivalent by repeatedly substituting the derivative of the outer functions in the chain rule:\nIn reverse accumulation, the quantity of interest is the adjoint, denoted with a bar (w̄); it is a derivative of a chosen dependent variable with respect to a subexpression w:\nReverse accumulation traverses the chain rule from outside to inside, or in the case of the computational graph in Figure 3, from top to bottom. The example function is real-valued, and thus there is only one seed for the derivative computation, and only one sweep of the computational graph is needed in order to calculate the (two-component) gradient. This is only half the work when compared to forward accumulation, but reverse accumulation requires the storage of the intermediate variables wi as well as the instructions that produced them in a data structure known as a Wengert list (or \"tape\"),[3][4] which may represent a significant memory issue if the computational graph is large. This can be mitigated to some extent by storing only a subset of the intermediate variables and then reconstructing the necessary work variables by repeating the evaluations, a technique known as checkpointing.\nThe operations to compute the derivative using reverse accumulation are shown in the table below (note the reversed order):\nThe data flow graph of a computation can be manipulated to calculate the gradient of its original calculation. This is done by adding an adjoint node for each primal node, connected by adjoint edges which parallel the primal edges but flow in the opposite direction. The nodes in the adjoint graph represent multiplication by the derivatives of the functions calculated by the nodes in the primal. For instance, addition in the primal causes fanout in the adjoint; fanout in the primal causes addition in the adjoint; a unary function y = f(x) in the primal causes x̄ = ȳ f′(x) in the adjoint; etc.\nReverse accumulation is more efficient than forward accumulation for functions f : ℝn → ℝm with m ≪ n as only m sweeps are necessary, compared to n sweeps for forward accumulation.\nReverse mode AD was first published in 1970 by Seppo Linnainmaa in his master thesis.[5][6][7]\nBackpropagation of errors in multilayer perceptrons, a technique used in machine learning, is a special case of reverse mode AD.\nForward and reverse accumulation are just two (extreme) ways of traversing the chain rule. The problem of computing a full Jacobian of f : ℝn → ℝm with a minimum number of arithmetic operations is known as the optimal Jacobian accumulation (OJA) problem, which is NP-complete.[8] Central to this proof is the idea that there may exist algebraic dependencies between the local partials that label the edges of the graph. In particular, two or more edge labels may be recognized as equal. The complexity of the problem is still open if it is assumed that all edge labels are unique and algebraically independent.\nForward mode automatic differentiation is accomplished by augmenting the algebra of real numbers and obtaining a new arithmetic. An additional component is added to every number which will represent the derivative of a function at the number, and all arithmetic operators are extended for the augmented algebra. The augmented algebra is the algebra of dual numbers. This approach was generalized by the theory of operational calculus on programming spaces (see Analytic programming space), through tensor algebra of the dual space.\nReplace every number \n\n\n\n\nx\n\n\n{\\displaystyle \\,x}\n\n with the number \n\n\n\nx\n+\n\nx\n′\n\nε\n\n\n{\\displaystyle x+x'\\varepsilon }\n\n, where \n\n\n\n\nx\n′\n\n\n\n{\\displaystyle x'}\n\n is a real number, but \n\n\n\nε\n\n\n{\\displaystyle \\varepsilon }\n\n is an abstract number with the property \n\n\n\n\nε\n\n2\n\n\n=\n0\n\n\n{\\displaystyle \\varepsilon ^{2}=0}\n\n (an infinitesimal; see Smooth infinitesimal analysis). Using only this, we get for the regular arithmetic\nand likewise for subtraction and division.\nNow, we may calculate polynomials in this augmented arithmetic. If \n\n\n\nP\n(\nx\n)\n=\n\np\n\n0\n\n\n+\n\np\n\n1\n\n\nx\n+\n\np\n\n2\n\n\n\nx\n\n2\n\n\n+\n⋯\n+\n\np\n\nn\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle P(x)=p_{0}+p_{1}x+p_{2}x^{2}+\\cdots +p_{n}x^{n}}\n\n, then\n\n\n\n\n\n\n\n\nP\n(\nx\n+\n\nx\n′\n\nε\n)\n\n\n\n=\n\np\n\n0\n\n\n+\n\np\n\n1\n\n\n(\nx\n+\n\nx\n′\n\nε\n)\n+\n⋯\n+\n\np\n\nn\n\n\n(\nx\n+\n\nx\n′\n\nε\n\n)\n\nn\n\n\n\n\n\n\n\n\n=\n\np\n\n0\n\n\n+\n\np\n\n1\n\n\nx\n+\n⋯\n+\n\np\n\nn\n\n\n\nx\n\nn\n\n\n+\n\np\n\n1\n\n\n\nx\n′\n\nε\n+\n2\n\np\n\n2\n\n\nx\n\nx\n′\n\nε\n+\n⋯\n+\nn\n\np\n\nn\n\n\n\nx\n\nn\n−\n1\n\n\n\nx\n′\n\nε\n\n\n\n\n\n\n=\nP\n(\nx\n)\n+\n\nP\n\n(\n1\n)\n\n\n(\nx\n)\n\nx\n′\n\nε\n\n\n\n\n\n\n{\\displaystyle {\\begin{aligned}P(x+x'\\varepsilon )&=p_{0}+p_{1}(x+x'\\varepsilon )+\\cdots +p_{n}(x+x'\\varepsilon )^{n}\\\\&=p_{0}+p_{1}x+\\cdots +p_{n}x^{n}+p_{1}x'\\varepsilon +2p_{2}xx'\\varepsilon +\\cdots +np_{n}x^{n-1}x'\\varepsilon \\\\&=P(x)+P^{(1)}(x)x'\\varepsilon \\end{aligned}}}\n\n\nwhere \n\n\n\n\nP\n\n(\n1\n)\n\n\n\n\n{\\displaystyle P^{(1)}}\n\n denotes the derivative of \n\n\n\nP\n\n\n{\\displaystyle P}\n\n with respect to its first argument, and \n\n\n\n\nx\n′\n\n\n\n{\\displaystyle x'}\n\n, called a seed, can be chosen arbitrarily.\nThe new arithmetic consists of ordered pairs, elements written \n\n\n\n⟨\nx\n,\n\nx\n′\n\n⟩\n\n\n{\\displaystyle \\langle x,x'\\rangle }\n\n, with ordinary arithmetics on the first component, and first order differentiation arithmetic on the second component, as described above. Extending the above results on polynomials to analytic functions we obtain a list of the basic arithmetic and some standard functions for the new arithmetic:\nand in general for the primitive function \n\n\n\ng\n\n\n{\\displaystyle g}\n\n,\nwhere \n\n\n\n\ng\n\nu\n\n\n\n\n{\\displaystyle g_{u}}\n\n and \n\n\n\n\ng\n\nv\n\n\n\n\n{\\displaystyle g_{v}}\n\n are the derivatives of \n\n\n\ng\n\n\n{\\displaystyle g}\n\n with respect to its first and second arguments, respectively.\nWhen a binary basic arithmetic operation is applied to mixed arguments—the pair \n\n\n\n⟨\nu\n,\n\nu\n′\n\n⟩\n\n\n{\\displaystyle \\langle u,u'\\rangle }\n\n and the real number \n\n\n\nc\n\n\n{\\displaystyle c}\n\n—the real number is first lifted to \n\n\n\n⟨\nc\n,\n0\n⟩\n\n\n{\\displaystyle \\langle c,0\\rangle }\n\n. The derivative of a function \n\n\n\nf\n:\n\nR\n\n→\n\nR\n\n\n\n{\\displaystyle f:\\mathbb {R} \\rightarrow \\mathbb {R} }\n\n at the point \n\n\n\n\nx\n\n0\n\n\n\n\n{\\displaystyle x_{0}}\n\n is now found by calculating \n\n\n\nf\n(\n⟨\n\nx\n\n0\n\n\n,\n1\n⟩\n)\n\n\n{\\displaystyle f(\\langle x_{0},1\\rangle )}\n\n using the above arithmetic, which gives \n\n\n\n⟨\nf\n(\n\nx\n\n0\n\n\n)\n,\n\nf\n′\n\n(\n\nx\n\n0\n\n\n)\n⟩\n\n\n{\\displaystyle \\langle f(x_{0}),f'(x_{0})\\rangle }\n\n as the result.\nMultivariate functions can be handled with the same efficiency and mechanisms as univariate functions by adopting a directional derivative operator. That is, if it is sufficient to compute \n\n\n\n\ny\n′\n\n=\n∇\nf\n(\nx\n)\n⋅\n\nx\n′\n\n\n\n{\\displaystyle y'=\\nabla f(x)\\cdot x'}\n\n, the directional derivative \n\n\n\n\ny\n′\n\n∈\n\n\nR\n\n\nm\n\n\n\n\n{\\displaystyle y'\\in \\mathbb {R} ^{m}}\n\n of \n\n\n\nf\n:\n\n\nR\n\n\nn\n\n\n→\n\n\nR\n\n\nm\n\n\n\n\n{\\displaystyle f:\\mathbb {R} ^{n}\\rightarrow \\mathbb {R} ^{m}}\n\n at \n\n\n\nx\n∈\n\n\nR\n\n\nn\n\n\n\n\n{\\displaystyle x\\in \\mathbb {R} ^{n}}\n\n in the direction \n\n\n\n\nx\n′\n\n∈\n\n\nR\n\n\nn\n\n\n\n\n{\\displaystyle x'\\in \\mathbb {R} ^{n}}\n\n, this may be calculated as \n\n\n\n(\n⟨\n\ny\n\n1\n\n\n,\n\ny\n\n1\n\n′\n\n⟩\n,\n…\n,\n⟨\n\ny\n\nm\n\n\n,\n\ny\n\nm\n\n′\n\n⟩\n)\n=\nf\n(\n⟨\n\nx\n\n1\n\n\n,\n\nx\n\n1\n\n′\n\n⟩\n,\n…\n,\n⟨\n\nx\n\nn\n\n\n,\n\nx\n\nn\n\n′\n\n⟩\n)\n\n\n{\\displaystyle (\\langle y_{1},y'_{1}\\rangle ,\\ldots ,\\langle y_{m},y'_{m}\\rangle )=f(\\langle x_{1},x'_{1}\\rangle ,\\ldots ,\\langle x_{n},x'_{n}\\rangle )}\n\n using the same arithmetic as above. If all the elements of \n\n\n\n∇\nf\n\n\n{\\displaystyle \\nabla f}\n\n are desired, then \n\n\n\nn\n\n\n{\\displaystyle n}\n\n function evaluations are required. Note that in many optimization applications, the directional derivative is indeed sufficient.\nThe above arithmetic can be generalized to calculate second order and higher derivatives of multivariate functions. However, the arithmetic rules quickly grow very complicated: complexity will be quadratic in the highest derivative degree. Instead, truncated Taylor polynomial algebra can be used. The resulting arithmetic, defined on generalized dual numbers, allows to efficiently compute using functions as if they were a new data type. Once the Taylor polynomial of a function is known, the derivatives are easily extracted. A rigorous, general formulation is achieved through the tensor series expansion using operational calculus on programming spaces.\nOperational calculus on programming spaces [9] generalizes concepts of automatic differentiation and provides a framework that enables analytic conclusions about programs through algebraic means. This formulation using tensor algebra is a broad generalization of the dual numbers approach. Theory allows computations on the operator level, before the operator is applied to a particular program, favoring efficient implementation.\nOperational calculus on programming spaces [9] was first proposed by Žiga Sajovic, mentored by Martin Vuk, to unify existing approaches under a single theory and provide a rigorous framework for program analysis through calculus.\nA differentiable programming space \n\n\n\n\n\n\nP\n\n\n\n0\n\n\n\n\n{\\displaystyle {\\mathcal {P}}_{0}}\n\n is any subspace of \n\n\n\n\n\n\nF\n\n\n\n0\n\n\n:\n\n\nV\n\n\n→\n\n\nV\n\n\n\n\n{\\displaystyle {\\mathcal {F}}_{0}:{\\mathcal {V}}\\to {\\mathcal {V}}}\n\n such that\nwhere \n\n\n\nT\n(\n\n\n\nV\n\n\n\n∗\n\n\n)\n\n\n{\\displaystyle T({\\mathcal {V}}^{*})}\n\n is the tensor algebra of the dual space \n\n\n\n\n\n\nV\n\n\n\n∗\n\n\n\n\n{\\displaystyle {\\mathcal {V}}^{*}}\n\n. When all elements of \n\n\n\n\n\n\nP\n\n\n\n0\n\n\n\n\n{\\displaystyle {\\mathcal {P}}_{0}}\n\n are analytic, we call \n\n\n\n\n\n\nP\n\n\n\n0\n\n\n\n\n{\\displaystyle {\\mathcal {P}}_{0}}\n\n an analytic programming space.\nProofs can be found in.[9]\nThis means that we can represent calculation of derivatives of the map \n\n\n\nP\n:\n\n\nV\n\n\n→\n\n\nV\n\n\n\n\n{\\displaystyle P:{\\mathcal {V}}\\to {\\mathcal {V}}}\n\n, with only one mapping \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n. We define the operator \n\n\n\n\nτ\n\nn\n\n\n\n\n{\\displaystyle \\tau _{n}}\n\n as a direct sum of operators\nThe image \n\n\n\n\nτ\n\nk\n\n\nP\n(\n\nx\n\n)\n\n\n{\\displaystyle \\tau _{k}P(\\mathbf {x} )}\n\n is a multitensor of order \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, which is a direct sum of the maps value and all derivatives of order \n\n\n\nn\n≤\nk\n\n\n{\\displaystyle n\\leq k}\n\n, all evaluated at the point \n\n\n\n\nx\n\n\n\n{\\displaystyle \\mathbf {x} }\n\n:\nThe operator \n\n\n\n\nτ\n\nn\n\n\n\n\n{\\displaystyle \\tau _{n}}\n\n satisfies the recursive relation.\nthat can be used to recursively construct programming spaces of arbitrary order. Only explicit knowledge of \n\n\n\nτ\n:\n\n\n\nP\n\n\n\n0\n\n\n→\n\n\n\nP\n\n\n\n1\n\n\n\n\n{\\displaystyle \\tau :{\\mathcal {P}}_{0}\\to {\\mathcal {P}}_{1}}\n\n is required for the construction of \n\n\n\n\n\n\nP\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\mathcal {P}}_{n}}\n\n from \n\n\n\n\n\n\nP\n\n\n\n1\n\n\n\n\n{\\displaystyle {\\mathcal {P}}_{1}}\n\n, which is evident from the above theorem.\nThe paper [9] proposed an abstract virtual machine capable of constructing and implementing the theory. Such a machine provides a framework for analytic study of algorithmic procedures through algebraic means.\nThis claim allows a simple definition of such a machine.\nExpansion into a series offers valuable insights into programs through methods of analysis.\nThere exists a space spanned by the set \n\n\n\n\n\n\nD\n\n\n\nn\n\n\n=\n{\n\n∂\n\nk\n\n\n;\n\n0\n≤\nk\n≤\nn\n}\n\n\n{\\displaystyle {\\mathcal {D}}^{n}=\\{\\partial ^{k};\\quad 0\\leq k\\leq n\\}}\n\n over a field \n\n\n\nK\n\n\n{\\displaystyle K}\n\n. Thus, the expression\nis well defined. The operator \n\n\n\n\ne\n\nh\n∂\n\n\n\n\n{\\displaystyle e^{h\\partial }}\n\n is a mapping between function spaces\nIt also defines a map\nby taking the image of the map \n\n\n\n\ne\n\nh\n∂\n\n\n(\nP\n)\n\n\n{\\displaystyle e^{h\\partial }(P)}\n\n at a certain point \n\n\n\n\nv\n\n∈\n\n\nV\n\n\n\n\n{\\displaystyle \\mathbf {v} \\in {\\mathcal {V}}}\n\n.\nWe may construct a map from the space of programs, to the space of polynomials. Note that the space of multivariate polynomials \n\n\n\n\n\nV\n\n\n→\nK\n\n\n{\\displaystyle {\\mathcal {V}}\\to K}\n\n is isomorphic to symmetric algebra \n\n\n\nS\n(\n\n\n\nV\n\n\n\n∗\n\n\n)\n\n\n{\\displaystyle S({\\mathcal {V}}^{*})}\n\n, which is in turn a quotient of tensor algebra \n\n\n\nT\n(\n\n\n\nV\n\n\n\n∗\n\n\n)\n\n\n{\\displaystyle T({\\mathcal {V}}^{*})}\n\n. To any element of \n\n\n\n\n\nV\n\n\n⊗\nT\n(\n\n\n\nV\n\n\n\n∗\n\n\n)\n\n\n{\\displaystyle {\\mathcal {V}}\\otimes T({\\mathcal {V}}^{*})}\n\n one can attach corresponding element of \n\n\n\n\n\nV\n\n\n⊗\nS\n(\n\n\n\nV\n\n\n\ni\n∗\n\n\n)\n\n\n{\\displaystyle {\\mathcal {V}}\\otimes S({\\mathcal {V}}^{i*})}\n\n namely a polynomial map \n\n\n\n\n\nV\n\n\n→\n\n\nV\n\n\n\n\n{\\displaystyle {\\mathcal {V}}\\to {\\mathcal {V}}}\n\n. Thus, we consider the completion of the symmetric algebra \n\n\n\nS\n(\n\n\n\nV\n\n\n\n∗\n\n\n)\n\n\n{\\displaystyle S({\\mathcal {V}}^{*})}\n\n as the Formal power series \n\n\n\n\n\nS\n\n\n(\n\n\n\nV\n\n\n\n∗\n\n\n)\n\n\n{\\displaystyle {\\mathcal {S}}({\\mathcal {V}}^{*})}\n\n, which is in turn isomorphic to a quotient of tensor series algebra \n\n\n\n\n\nT\n\n\n(\n\n\n\nV\n\n\n\n∗\n\n\n)\n\n\n{\\displaystyle {\\mathcal {T}}({\\mathcal {V}}^{*})}\n\n, arriving at\nFor any element \n\n\n\n\n\nv\n\n\n0\n\n\n∈\n\n\nV\n\n\n\n\n{\\displaystyle \\mathbf {v} _{0}\\in {\\mathcal {V}}}\n\n, the expression \n\n\n\n\ne\n\nh\n∂\n\n\n(\n⋅\n,\n\n\nv\n\n\n0\n\n\n)\n\n\n{\\displaystyle e^{h\\partial }(\\cdot ,\\mathbf {v} _{0})}\n\n is a map \n\n\n\n\n\nP\n\n\n→\n\n\nV\n\n\n⊗\n\n\nS\n\n\n(\n\n\n\nV\n\n\n\n∗\n\n\n)\n\n\n{\\displaystyle {\\mathcal {P}}\\to {\\mathcal {V}}\\otimes {\\mathcal {S}}({\\mathcal {V}}^{*})}\n\n, mapping a program to a Formal power series. We can express the correspondence between multi-tensors in \n\n\n\n\n\nV\n\n\n⊗\nT\n(\n\n\n\nV\n\n\n\n∗\n\n\n)\n\n\n{\\displaystyle {\\mathcal {V}}\\otimes T({\\mathcal {V}}^{*})}\n\n and polynomial maps \n\n\n\n\n\nV\n\n\n→\n\n\nV\n\n\n\n\n{\\displaystyle {\\mathcal {V}}\\to {\\mathcal {V}}}\n\n given by multiple contractions for all possible indices.\nProof can be found in.[9] Evaluated at \n\n\n\nh\n=\n1\n\n\n{\\displaystyle h=1}\n\n, the operator is a generalization of the Shift operator widely used in physics. For a specific \n\n\n\n\nv\n\n0\n\n\n∈\n\n\nV\n\n\n\n\n{\\displaystyle v_{0}\\in {\\mathcal {V}}}\n\n it is heron denoted by\nWhen the choice of \n\n\n\n\nv\n\n0\n\n\n∈\n\n\nV\n\n\n\n\n{\\displaystyle v_{0}\\in {\\mathcal {V}}}\n\n is arbitrary, we omit it from expressions for brevity.\nTheory offers a generalization of both forward and reverse mode of automatic differentiation to arbitrary order, under a single invariant operator in the theory. This condenses complex notions to simple expressions allowing meaningful manipulations before being applied to a particular programming space.\nProof can be found in.[9]\nBoth forward and reverse mode (generalized to arbitrary order) are obtainable using this operator, by fixing the appropriate one of the two maps. This generalizes both concepts under a single operator in the theory. For example, by considering projections of the operator onto the space spanned by \n\n\n\n\n\nD\n\n\n=\n{\n1\n,\n∂\n}\n\n\n{\\displaystyle {\\mathcal {D}}=\\{1,\\partial \\}}\n\n, and fixing the second map \n\n\n\ng\n\n\n{\\displaystyle g}\n\n, we retrieve the basic first order forward mode of automatic differentiation, or reverse mode, by fixing \n\n\n\nf\n\n\n{\\displaystyle f}\n\n.\nThus the operator alleviates the need for explicit implementation of the higher order chain rule (see Faà di Bruno's formula), as it is encoded in the structure of the operator itself, which can be efficiently implemented by manipulating its generating map (see [9]).\nIt is useful to be able to use the \n\n\n\nk\n\n\n{\\displaystyle k}\n\n-th derivative of a program \n\n\n\nP\n∈\n\n\nP\n\n\n\n\n{\\displaystyle P\\in {\\mathcal {P}}}\n\n as part of a different differentiable program \n\n\n\n\nP\n\n1\n\n\n\n\n{\\displaystyle P_{1}}\n\n. As such, we must be able to treat the derivative itself as a differentiable program \n\n\n\n\nP\n\n′\nk\n\n\n∈\n\n\nP\n\n\n\n\n{\\displaystyle P^{\\prime k}\\in {\\mathcal {P}}}\n\n, while only coding the original program \n\n\n\nP\n\n\n{\\displaystyle P}\n\n.\nBy the above Theorem, \n\n\n\nn\n\n\n{\\displaystyle n}\n\n-differentiable \n\n\n\nk\n\n\n{\\displaystyle k}\n\n-th derivatives of a program \n\n\n\nP\n∈\n\n\n\nP\n\n\n\n0\n\n\n\n\n{\\displaystyle P\\in {\\mathcal {P}}_{0}}\n\n can be extracted by\nThus, we gained the ability of writing a differentiable program acting on derivatives of another program, stressed as crucial by other authors.[10]\nForward-mode AD is implemented by a nonstandard interpretation of the program in which real numbers are replaced by dual numbers, constants are lifted to dual numbers with a zero epsilon coefficient, and the numeric primitives are lifted to operate on dual numbers. This nonstandard interpretation is generally implemented using one of two strategies: source code transformation or operator overloading.\nThe source code for a function is replaced by an automatically generated source code that includes statements for calculating the derivatives interleaved with the original instructions.\nSource code transformation can be implemented for all programming languages, and it is also easier for the compiler to do compile time optimizations. However, the implementation of the AD tool itself is more difficult.\nOperator overloading is a possibility for source code written in a language supporting it. Objects for real numbers and elementary mathematical operations must be overloaded to cater for the augmented arithmetic depicted above. This requires no change in the form or sequence of operations in the original source code for the function to be differentiated, but often requires changes in basic data types for numbers and vectors to support overloading and often also involves the insertion of special flagging operations.\nOperator overloading for forward accumulation is easy to implement, and also possible for reverse accumulation. However, current compilers lag behind in optimizing the code when compared to forward accumulation.\nOperator overloading, for both forward and reverse accumulation, can be well-suited to applications where the objects are vectors of real numbers rather than scalars. This is because the tape then comprises vector operations; this can facilitate computationally efficient implementations where each vector operation performs many scalar operations. Vector adjoint algorithmic differentiation (vector AAD) techniques may be used, for example, to differentiate values calculated by Monte-Carlo simulation.", 
    "dbpedia_url": "http://dbpedia.org/resource/Automatic_differentiation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Automatic_differentiation\n"
}