{
    "about": "A real time interferometric autocorrelator is an electronic tool used to examine the autocorrelation of, among other things, optical beam intensity and spectral components through examination of variable beam path differences. See Optical autocorrelation.", 
    "name": "Autocorrelator", 
    "classification": "Signal Processing", 
    "full_text": "A real time interferometric autocorrelator is an electronic tool used to examine the autocorrelation of, among other things, optical beam intensity and spectral components through examination of variable beam path differences. See Optical autocorrelation.\n\n\nIn an interferometric autocorrelator, the input beam is split into a fixed path beam and a variable path beam using a standard beamsplitter. The fixed path beam travels a known and constant distance, whereas the variable path beam has its path length changed via rotating mirrors or other path changing mechanisms. At the end of the two paths, the beams are ideally parallel, but slightly separated, and using a correctly positioned lens, the two beams are crossed inside a second harmonic generating (SHG) crystal. The autocorrelation term of the output is then passed into a photomultiplying tube (PMT) and measured.\nConsidering the input beam as a single pulse with envelope \n\n\n\nE\n\n(\nt\n)\n\n\n\n{\\displaystyle E\\left(t\\right)}\n\n, the constant fixed path distance as \n\n\n\n\nD\n\nF\n\n\n\n\n{\\displaystyle D_{F}}\n\n, and the variable path distance as a function of time \n\n\n\n\nD\n\nV\n\n\n\n(\nt\n)\n\n\n\n{\\displaystyle D_{V}\\left(t\\right)}\n\n, the input to the SHG can be viewed as\nThis comes from \n\n\n\nc\n\n\n{\\displaystyle c}\n\n being the speed of light and \n\n\n\nD\n\n/\n\nc\n\n\n{\\displaystyle D/c}\n\n being the time for the beam to travel the given path. In general, SHG produces output proportional to the square of the input, which in this case is\nThe first two terms are based only on the fixed and variable paths respectively, but the third term is based on the difference between them, as is evident in\nThe PMT used is assumed to be much slower than the envelope function \n\n\n\nE\n\n(\nt\n)\n\n\n\n{\\displaystyle E\\left(t\\right)}\n\n, so it effectively integrates the incoming signal\nSince both the fixed path and variable path terms are not dependent on each other, they would constitute a background \"noise\" in examination of the autocorrelation term and would ideally be removed first. This can be accomplished by examining the momentum vectors\nIf the fixed and variable momentum vectors are assumed to be of approximately equal magnitude, the second harmonic momentum vector will fall geometrically between them. Assuming enough space is given in the component setup, the PMT could be fitted with a slit to decrease the effect the divergent fixed and variable beams have on the autocorrelation measurement, without losing much of the autocorrelation term. \n\n\n\nS\n\n(\nt\n)\n\n\n\n{\\displaystyle S\\left(t\\right)}\n\n can then be assumed to be nearly equal to\nwhich gives the autocorrelation as a function of \n\n\n\nA\n\n(\nt\n)\n\n\n\n{\\displaystyle A\\left(t\\right)}\n\n, the difference in path lengths.", 
    "dbpedia_url": "http://dbpedia.org/resource/Autocorrelator", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Autocorrelator\n"
}