{
    "about": "Autocorrelation, also known as serial correlation, is the correlation of a signal with itself at different points in time. Informally, it is the similarity between observations as a function of the time lag between them. The analysis of autocorrelation is a mathematical tool for finding repeating patterns, such as the presence of a periodic signal obscured by noise, or identifying the missing fundamental frequency in a signal implied by its harmonic frequencies. It is often used in signal processing for analyzing functions or series of values, such as time domain signals.", 
    "name": "Autocorrelation", 
    "classification": "Signal Processing", 
    "full_text": "Autocorrelation, also known as serial correlation, is the correlation of a signal with itself at different points in time. Informally, it is the similarity between observations as a function of the time lag between them. The analysis of autocorrelation is a mathematical tool for finding repeating patterns, such as the presence of a periodic signal obscured by noise, or identifying the missing fundamental frequency in a signal implied by its harmonic frequencies. It is often used in signal processing for analyzing functions or series of values, such as time domain signals.\nUnit root processes, trend stationary processes, autoregressive processes, and moving average processes are specific forms of processes with autocorrelation.\n\n\nDifferent fields of study define autocorrelation differently, and not all of these definitions are equivalent. In some fields, the term is used interchangeably with autocovariance.\nIn statistics, the autocorrelation of a random process is the correlation between values of the process at different times, as a function of the two times or of the time lag. Let X be a stochastic process, and t be any point in time. (t may be an integer for a discrete-time process or a real number for a continuous-time process.) Then Xt is the value (or realization) produced by a given run of the process at time t. Suppose that the process has mean μt and variance σt2 at time t, for each t. Then the definition of the autocorrelation between times s and t is\nwhere \"E\" is the expected value operator. Note that this expression is not well-defined for all-time series or processes, because the mean may not exist, or the variance may be zero (for a constant process) or infinite (for processes with distribution lacking well-behaved moments, such as certain types of power law). If the function R is well-defined, its value must lie in the range [−1, 1], with 1 indicating perfect correlation and −1 indicating perfect anti-correlation.\nIf Xt is a wide-sense stationary process then the mean μ and the variance σ2 are time-independent, and further the autocorrelation depends only on the lag between t and s: the correlation depends only on the time-distance between the pair of values but not on their position in time. This further implies that the autocorrelation can be expressed as a function of the time-lag, and that this would be an even function of the lag τ = s − t. This gives the more familiar form\nand the fact that this is an even function can be stated as\nIt is common practice in some disciplines, other than statistics and time series analysis, to drop the normalization by σ2 and use the term \"autocorrelation\" interchangeably with \"autocovariance\". However, the normalization is important both because the interpretation of the autocorrelation as a correlation provides a scale-free measure of the strength of statistical dependence, and because the normalization has an effect on the statistical properties of the estimated autocorrelations.\nIn signal processing, the above definition is often used without the normalization, that is, without subtracting the mean and dividing by the variance. When the autocorrelation function is normalized by mean and variance, it is sometimes referred to as the autocorrelation coefficient.[1] or autocovariance function.\nGiven a signal \n\n\n\nf\n(\nt\n)\n\n\n{\\displaystyle f(t)}\n\n, the continuous autocorrelation \n\n\n\n\nR\n\nf\nf\n\n\n(\nτ\n)\n\n\n{\\displaystyle R_{ff}(\\tau )}\n\n is most often defined as the continuous cross-correlation integral of \n\n\n\nf\n(\nt\n)\n\n\n{\\displaystyle f(t)}\n\n with itself, at lag \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n.\nwhere \n\n\n\n\n\nf\n¯\n\n\n\n\n{\\displaystyle {\\overline {f}}}\n\n represents the complex conjugate, \n\n\n\n\ng\n\n−\n1\n\n\n\n\n{\\displaystyle g_{-1}}\n\n is a function which manipulates the function \n\n\n\nf\n\n\n{\\displaystyle f}\n\n and is defined as \n\n\n\n\ng\n\n−\n1\n\n\n(\nf\n)\n(\nu\n)\n=\nf\n(\n−\nu\n)\n\n\n{\\displaystyle g_{-1}(f)(u)=f(-u)}\n\n and \n\n\n\n∗\n\n\n{\\displaystyle *}\n\n represents convolution.\nFor a real function, \n\n\n\n\n\nf\n¯\n\n\n=\nf\n\n\n{\\displaystyle {\\overline {f}}=f}\n\n.\nNote that the parameter \n\n\n\nu\n\n\n{\\displaystyle u}\n\n in the integral is a dummy variable and is only necessary to calculate the integral. It has no specific meaning.\nThe discrete autocorrelation \n\n\n\nR\n\n\n{\\displaystyle R}\n\n at lag \n\n\n\nl\n\n\n{\\displaystyle l}\n\n for a discrete signal \n\n\n\ny\n(\nn\n)\n\n\n{\\displaystyle y(n)}\n\n is\nThe above definitions work for signals that are square integrable, or square summable, that is, of finite energy. Signals that \"last forever\" are treated instead as random processes, in which case different definitions are needed, based on expected values. For wide-sense-stationary random processes, the autocorrelations are defined as\nFor processes that are not stationary, these will also be functions of \n\n\n\nt\n\n\n{\\displaystyle t}\n\n, or \n\n\n\nn\n\n\n{\\displaystyle n}\n\n.\nFor processes that are also ergodic, the expectation can be replaced by the limit of a time average. The autocorrelation of an ergodic process is sometimes defined as or equated to[1]\nThese definitions have the advantage that they give sensible well-defined single-parameter results for periodic functions, even when those functions are not the output of stationary ergodic processes.\nAlternatively, signals that last forever can be treated by a short-time autocorrelation function analysis, using finite time integrals. (See short-time Fourier transform for a related process.)\nMulti-dimensional autocorrelation is defined similarly. For example, in three dimensions the autocorrelation of a square-summable discrete signal would be\nWhen mean values are subtracted from signals before computing an autocorrelation function, the resulting function is usually called an auto-covariance function.\nIn the following, we will describe properties of one-dimensional autocorrelations only, since most properties are easily transferred from the one-dimensional case to the multi-dimensional cases.\nFor data expressed as a discrete sequence, it is frequently necessary to compute the autocorrelation with high computational efficiency. A brute force method based on the signal processing definition \n\n\n\n\nR\n\nx\nx\n\n\n(\nj\n)\n=\n\n∑\n\nn\n\n\n\nx\n\nn\n\n\n\n\n\n\nx\n¯\n\n\n\nn\n−\nj\n\n\n\n\n{\\displaystyle R_{xx}(j)=\\sum _{n}x_{n}\\,{\\overline {x}}_{n-j}}\n\n can be used when the signal size is small. For example, to calculate the autocorrelation of the real signal sequence \n\n\n\nx\n=\n(\n2\n,\n3\n,\n−\n1\n)\n\n\n{\\displaystyle x=(2,3,-1)}\n\n (i.e. \n\n\n\n\nx\n\n0\n\n\n=\n2\n,\n\nx\n\n1\n\n\n=\n3\n,\n\nx\n\n2\n\n\n=\n−\n1\n\n\n{\\displaystyle x_{0}=2,x_{1}=3,x_{2}=-1}\n\n, and \n\n\n\n\nx\n\ni\n\n\n=\n0\n\n\n{\\displaystyle x_{i}=0}\n\n for all other values of i) by hand, we first recognize that the definition just given is same as the \"usual\" multiplication, but with right shifts, where each vertical addition gives the autocorrelation for particular lag values:\nThus the required autocorrelation sequence is \n\n\n\n\nR\n\nx\nx\n\n\n=\n(\n−\n2\n,\n3\n,\n14\n,\n3\n,\n−\n2\n)\n\n\n{\\displaystyle R_{xx}=(-2,3,14,3,-2)}\n\n, where \n\n\n\n\nR\n\nx\nx\n\n\n(\n0\n)\n=\n14\n,\n\n\n{\\displaystyle R_{xx}(0)=14,}\n\n \n\n\n\n\nR\n\nx\nx\n\n\n(\n−\n1\n)\n=\n\nR\n\nx\nx\n\n\n(\n1\n)\n=\n3\n,\n\n\n{\\displaystyle R_{xx}(-1)=R_{xx}(1)=3,}\n\n and \n\n\n\n\nR\n\nx\nx\n\n\n(\n−\n2\n)\n=\n\nR\n\nx\nx\n\n\n(\n2\n)\n=\n−\n2\n,\n\n\n{\\displaystyle R_{xx}(-2)=R_{xx}(2)=-2,}\n\n the autocorrelation for other lag values being zero. In this calculation we do not perform the carry-over operation during addition as is usual in normal multiplication. Note that we can halve the number of operations required by exploiting the inherent symmetry of the autocorrelation. If the signal happens to be periodic, i.e. \n\n\n\nx\n=\n(\n…\n,\n2\n,\n3\n,\n−\n1\n,\n2\n,\n3\n,\n−\n1\n,\n…\n)\n,\n\n\n{\\displaystyle x=(\\ldots ,2,3,-1,2,3,-1,\\ldots ),}\n\n then we get a circular autocorrelation (similar to circular convolution) where the left and right tails of the previous autocorrelation sequence will overlap and give \n\n\n\n\nR\n\nx\nx\n\n\n=\n(\n…\n,\n14\n,\n1\n,\n1\n,\n14\n,\n1\n,\n1\n,\n…\n)\n\n\n{\\displaystyle R_{xx}=(\\ldots ,14,1,1,14,1,1,\\ldots )}\n\n which has the same period as the signal sequence \n\n\n\nx\n.\n\n\n{\\displaystyle x.}\n\n The procedure can be regarded as an application of the convolution property of z-transform of a discrete signal.\nWhile the brute force algorithm is order n2, several efficient algorithms exist which can compute the autocorrelation in order n log(n). For example, the Wiener–Khinchin theorem allows computing the autocorrelation from the raw data X(t) with two Fast Fourier transforms (FFT):[2]\nwhere IFFT denotes the inverse Fast Fourier transform. The asterisk denotes complex conjugate.\nAlternatively, a multiple τ correlation can be performed by using brute force calculation for low τ values, and then progressively binning the X(t) data with a logarithmic density to compute higher values, resulting in the same n log(n) efficiency, but with lower memory requirements.[3][4]\nFor a discrete process with known mean and variance for which we observe \n\n\n\nn\n\n\n{\\displaystyle n}\n\n observations \n\n\n\n{\n\nX\n\n1\n\n\n,\n\n\nX\n\n2\n\n\n,\n\n…\n,\n\n\nX\n\nn\n\n\n}\n\n\n{\\displaystyle \\{X_{1},\\,X_{2},\\,\\ldots ,\\,X_{n}\\}}\n\n, an estimate of the autocorrelation may be obtained as\nfor any positive integer \n\n\n\nk\n<\nn\n\n\n{\\displaystyle k<n}\n\n. When the true mean \n\n\n\nμ\n\n\n{\\displaystyle \\mu }\n\n and variance \n\n\n\n\nσ\n\n2\n\n\n\n\n{\\displaystyle \\sigma ^{2}}\n\n are known, this estimate is unbiased. If the true mean and variance of the process are not known there are a several possibilities:\nThe advantage of estimates of the last type is that the set of estimated autocorrelations, as a function of \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, then form a function which is a valid autocorrelation in the sense that it is possible to define a theoretical process having exactly that autocorrelation. Other estimates can suffer from the problem that, if they are used to calculate the variance of a linear combination of the \n\n\n\nX\n\n\n{\\displaystyle X}\n\n's, the variance calculated may turn out to be negative.\nIn regression analysis using time series data, autocorrelation in a variable of interest is typically modeled either with an autoregressive model (AR), a moving average model (MA), their combination as an autoregressive moving average model (ARMA), or an extension of the latter called an autoregressive integrated moving average model (ARIMA). With multiple interrelated data series, vector autoregression (VAR) or its extensions are used.\nIn ordinary least squares (OLS), the adequacy of a model specification can be checked in part by establishing whether there is autocorrelation of the regression residuals. Problematic autocorrelation of the errors, which themselves are unobserved, can generally be detected because it produces autocorrelation in the observable residuals. (Errors are also known as \"error terms\" in econometrics.) Autocorrelation of the errors violates the ordinary least squares assumption that the error terms are uncorrelated, meaning that the Gauss Markov theorem does not apply, and that OLS estimators are no longer the Best Linear Unbiased Estimators (BLUE). While it does not bias the OLS coefficient estimates, the standard errors tend to be underestimated (and the t-scores overestimated) when the autocorrelations of the errors at low lags are positive.\nThe traditional test for the presence of first-order autocorrelation is the Durbin–Watson statistic or, if the explanatory variables include a lagged dependent variable, Durbin's h statistic. The Durbin-Watson can be linearly mapped however to the Pearson correlation between values and their lags.[7] A more flexible test, covering autocorrelation of higher orders and applicable whether or not the regressors include lags of the dependent variable, is the Breusch–Godfrey test. This involves an auxiliary regression, wherein the residuals obtained from estimating the model of interest are regressed on (a) the original regressors and (b) k lags of the residuals, where k is the order of the test. The simplest version of the test statistic from this auxiliary regression is TR2, where T is the sample size and R2 is the coefficient of determination. Under the null hypothesis of no autocorrelation, this statistic is asymptotically distributed as \n\n\n\n\nχ\n\n2\n\n\n\n\n{\\displaystyle \\chi ^{2}}\n\n with k degrees of freedom.\nResponses to nonzero autocorrelation include generalized least squares and the Newey–West HAC estimator (Heteroskedasticity and Autocorrelation Consistent).[8]\nIn the estimation of a moving average model (MA), the autocorrelation function is used to determine the appropriate number of lagged error terms to be included. This is based on the fact that for an MA process of order q, we have \n\n\n\nR\n(\nτ\n)\n≠\n0\n\n\n{\\displaystyle R(\\tau )\\neq 0}\n\n, for \n\n\n\nτ\n=\n0\n,\n1\n,\n…\n,\nq\n\n\n{\\displaystyle \\tau =0,1,\\ldots ,q}\n\n, and \n\n\n\nR\n(\nτ\n)\n=\n0\n\n\n{\\displaystyle R(\\tau )=0}\n\n, for \n\n\n\nτ\n>\nq\n\n\n{\\displaystyle \\tau >q}\n\n.\nSerial dependence is closely linked to the notion of autocorrelation, but represents a distinct concept (see Correlation and dependence). In particular, it is possible to have serial dependence but no (linear) correlation, or a measured correlation but no actual statistical dependence. In some fields however, the two terms are used as synonyms.\nRandom variables in a time series have serial dependence if the value at some time t in the series is statistically dependent on the value at another time s. A series is serially independent if there is no dependence between any pair.\nIf a time series {Xt} is stationary, then statistical dependence between the pair (Xt , Xs) would imply that there is statistical dependence between all pairs of values at the same lag s−t.", 
    "dbpedia_url": "http://dbpedia.org/resource/Autocorrelation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Autocorrelation\n"
}