{
    "about": "In statistics and signal processing, an autoregressive (AR) model is a representation of a type of random process; as such, it is used to describe certain time-varying processes in nature, economics, etc. The autoregressive model specifies that the output variable depends linearly on its own previous values and on a stochastic term (an imperfectly predictable term); thus the model is in the form of a stochastic difference equation.", 
    "name": "Autoregressive Model", 
    "classification": "Signal Processing", 
    "full_text": "In statistics and signal processing, an autoregressive (AR) model is a representation of a type of random process; as such, it is used to describe certain time-varying processes in nature, economics, etc. The autoregressive model specifies that the output variable depends linearly on its own previous values and on a stochastic term (an imperfectly predictable term); thus the model is in the form of a stochastic difference equation.\nTogether with the moving-average (MA) model, it is a special case and key component of the more general ARMA and ARIMA models of time series, which have a more complicated stochastic structure; it is also a special case of the vector autoregressive model (VAR), which consists of a system of more than one stochastic difference equation.\nContrary to the moving-average model, the autoregressive model is not always stationary as it may contain a unit root.\n\n\nThe notation \n\n\n\nA\nR\n(\np\n)\n\n\n{\\displaystyle AR(p)}\n\n indicates an autoregressive model of order p. The AR(p) model is defined as\nwhere \n\n\n\n\nφ\n\n1\n\n\n,\n…\n,\n\nφ\n\np\n\n\n\n\n{\\displaystyle \\varphi _{1},\\ldots ,\\varphi _{p}}\n\n are the parameters of the model, \n\n\n\nc\n\n\n{\\displaystyle c}\n\n is a constant, and \n\n\n\n\nε\n\nt\n\n\n\n\n{\\displaystyle \\varepsilon _{t}}\n\n is white noise. This can be equivalently written using the backshift operator B as\nso that, moving the summation term to the left side and using polynomial notation, we have\nAn autoregressive model can thus be viewed as the output of an all-pole infinite impulse response filter whose input is white noise.\nSome parameter constraints are necessary for the model to remain wide-sense stationary. For example, processes in the AR(1) model with \n\n\n\n\n|\n\n\nφ\n\n1\n\n\n\n|\n\n≥\n1\n\n\n{\\displaystyle |\\varphi _{1}|\\geq 1}\n\n are not stationary. More generally, for an AR(p) model to be wide-sense stationary, the roots of the polynomial \n\n\n\n\n\nz\n\np\n\n\n−\n\n∑\n\ni\n=\n1\n\n\np\n\n\n\nφ\n\ni\n\n\n\nz\n\np\n−\ni\n\n\n\n\n\n{\\displaystyle \\textstyle z^{p}-\\sum _{i=1}^{p}\\varphi _{i}z^{p-i}}\n\n must lie within the unit circle, i.e., each root \n\n\n\n\nz\n\ni\n\n\n\n\n{\\displaystyle z_{i}}\n\n must satisfy \n\n\n\n\n|\n\n\nz\n\ni\n\n\n\n|\n\n<\n1\n\n\n{\\displaystyle |z_{i}|<1}\n\n.\nIn an AR process, a one-time shock affects values of the evolving variable infinitely far into the future. For example, consider the AR(1) model \n\n\n\n\nX\n\nt\n\n\n=\nc\n+\n\nφ\n\n1\n\n\n\nX\n\nt\n−\n1\n\n\n+\n\nε\n\nt\n\n\n\n\n{\\displaystyle X_{t}=c+\\varphi _{1}X_{t-1}+\\varepsilon _{t}}\n\n. A non-zero value for \n\n\n\n\nε\n\nt\n\n\n\n\n{\\displaystyle \\varepsilon _{t}}\n\n at say time t=1 affects \n\n\n\n\nX\n\n1\n\n\n\n\n{\\displaystyle X_{1}}\n\n by the amount \n\n\n\n\nε\n\n1\n\n\n\n\n{\\displaystyle \\varepsilon _{1}}\n\n. Then by the AR equation for \n\n\n\n\nX\n\n2\n\n\n\n\n{\\displaystyle X_{2}}\n\n in terms of \n\n\n\n\nX\n\n1\n\n\n\n\n{\\displaystyle X_{1}}\n\n, this affects \n\n\n\n\nX\n\n2\n\n\n\n\n{\\displaystyle X_{2}}\n\n by the amount \n\n\n\n\nφ\n\n1\n\n\n\nε\n\n1\n\n\n\n\n{\\displaystyle \\varphi _{1}\\varepsilon _{1}}\n\n. Then by the AR equation for \n\n\n\n\nX\n\n3\n\n\n\n\n{\\displaystyle X_{3}}\n\n in terms of \n\n\n\n\nX\n\n2\n\n\n\n\n{\\displaystyle X_{2}}\n\n, this affects \n\n\n\n\nX\n\n3\n\n\n\n\n{\\displaystyle X_{3}}\n\n by the amount \n\n\n\n\nφ\n\n1\n\n\n2\n\n\n\nε\n\n1\n\n\n\n\n{\\displaystyle \\varphi _{1}^{2}\\varepsilon _{1}}\n\n. Continuing this process shows that the effect of \n\n\n\n\nε\n\n1\n\n\n\n\n{\\displaystyle \\varepsilon _{1}}\n\n never ends, although if the process is stationary then the effect diminishes toward zero in the limit.\nBecause each shock affects X values infinitely far into the future from when they occur, any given value Xt is affected by shocks occurring infinitely far into the past. This can also be seen by rewriting the autoregression\n(where the constant term has been suppressed by assuming that the variable has been measured as deviations from its mean) as\nWhen the polynomial division on the right side is carried out, the polynomial in the backshift operator applied to \n\n\n\n\nε\n\nt\n\n\n\n\n{\\displaystyle \\varepsilon _{t}}\n\n has an infinite order—that is, an infinite number of lagged values of \n\n\n\n\nε\n\nt\n\n\n\n\n{\\displaystyle \\varepsilon _{t}}\n\n appear on the right side of the equation.\nThe autocorrelation function of an AR(p) process can be expressed as[citation needed]\nwhere \n\n\n\n\ny\n\nk\n\n\n\n\n{\\displaystyle y_{k}}\n\n are the roots of the polynomial\nwhere B is the backshift operator, where \n\n\n\nϕ\n(\n⋅\n)\n\n\n{\\displaystyle \\phi (\\cdot )}\n\n is the function defining the autoregression, and where \n\n\n\n\nφ\n\nk\n\n\n\n\n{\\displaystyle \\varphi _{k}}\n\n are the coefficients in the autoregression.\nThe autocorrelation function of an AR(p) process is a sum of decaying exponentials.\nThe simplest AR process is AR(0), which has no dependence between the terms. Only the error/innovation/noise term contributes to the output of the process, so in the figure, AR(0) corresponds to white noise.\nFor an AR(1) process with a positive \n\n\n\nφ\n\n\n{\\displaystyle \\varphi }\n\n, only the previous term in the process and the noise term contribute to the output. If \n\n\n\nφ\n\n\n{\\displaystyle \\varphi }\n\n is close to 0, then the process still looks like white noise, but as \n\n\n\nφ\n\n\n{\\displaystyle \\varphi }\n\n approaches 1, the output gets a larger contribution from the previous term relative to the noise. This results in a \"smoothing\" or integration of the output, similar to a low pass filter.\nFor an AR(2) process, the previous two terms and the noise term contribute to the output. If both \n\n\n\n\nφ\n\n1\n\n\n\n\n{\\displaystyle \\varphi _{1}}\n\n and \n\n\n\n\nφ\n\n2\n\n\n\n\n{\\displaystyle \\varphi _{2}}\n\n are positive, the output will resemble a low pass filter, with the high frequency part of the noise decreased. If \n\n\n\n\nφ\n\n1\n\n\n\n\n{\\displaystyle \\varphi _{1}}\n\n is positive while \n\n\n\n\nφ\n\n2\n\n\n\n\n{\\displaystyle \\varphi _{2}}\n\n is negative, then the process favors changes in sign between terms of the process. The output oscillates. This can be likened to edge detection or detection of change in direction.\nAn AR(1) process is given by:\nwhere \n\n\n\n\nε\n\nt\n\n\n\n\n{\\displaystyle \\varepsilon _{t}}\n\n is a white noise process with zero mean and constant variance \n\n\n\n\nσ\n\nε\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{\\varepsilon }^{2}}\n\n. (Note: The subscript on \n\n\n\n\nφ\n\n1\n\n\n\n\n{\\displaystyle \\varphi _{1}}\n\n has been dropped.) The process is wide-sense stationary if \n\n\n\n\n|\n\nφ\n\n|\n\n<\n1\n\n\n{\\displaystyle |\\varphi |<1}\n\n since it is obtained as the output of a stable filter whose input is white noise. (If \n\n\n\nφ\n=\n1\n\n\n{\\displaystyle \\varphi =1}\n\n then \n\n\n\n\nX\n\nt\n\n\n\n\n{\\displaystyle X_{t}}\n\n has infinite variance, and is therefore not wide sense stationary.) Assuming \n\n\n\n\n|\n\nφ\n\n|\n\n<\n1\n\n\n{\\displaystyle |\\varphi |<1}\n\n, the mean \n\n\n\nE\n⁡\n(\n\nX\n\nt\n\n\n)\n\n\n{\\displaystyle \\operatorname {E} (X_{t})}\n\n is identical for all values of t by the very definition of wide sense stationarity. If the mean is denoted by \n\n\n\nμ\n\n\n{\\displaystyle \\mu }\n\n, it follows from\nthat\nand hence\nIn particular, if \n\n\n\nc\n=\n0\n\n\n{\\displaystyle c=0}\n\n, then the mean is 0.\nThe variance is\nwhere \n\n\n\n\nσ\n\nε\n\n\n\n\n{\\displaystyle \\sigma _{\\varepsilon }}\n\n is the standard deviation of \n\n\n\n\nε\n\nt\n\n\n\n\n{\\displaystyle \\varepsilon _{t}}\n\n. This can be shown by noting that\nand then by noticing that the quantity above is a stable fixed point of this relation.\nThe autocovariance is given by\nIt can be seen that the autocovariance function decays with a decay time (also called time constant) of \n\n\n\nτ\n=\n−\n1\n\n/\n\nln\n⁡\n(\nφ\n)\n\n\n{\\displaystyle \\tau =-1/\\ln(\\varphi )}\n\n [to see this, write \n\n\n\n\nB\n\nn\n\n\n=\nK\n\nφ\n\n\n|\n\nn\n\n|\n\n\n\n\n\n{\\displaystyle B_{n}=K\\varphi ^{|n|}}\n\n where \n\n\n\nK\n\n\n{\\displaystyle K}\n\n is independent of \n\n\n\nn\n\n\n{\\displaystyle n}\n\n. Then note that \n\n\n\n\nφ\n\n\n|\n\nn\n\n|\n\n\n\n=\n\ne\n\n\n|\n\nn\n\n|\n\nln\n⁡\nφ\n\n\n\n\n{\\displaystyle \\varphi ^{|n|}=e^{|n|\\ln \\varphi }}\n\n and match this to the exponential decay law \n\n\n\n\ne\n\n−\nn\n\n/\n\nτ\n\n\n\n\n{\\displaystyle e^{-n/\\tau }}\n\n].\nThe spectral density function is the Fourier transform of the autocovariance function. In discrete terms this will be the discrete-time Fourier transform:\nThis expression is periodic due to the discrete nature of the \n\n\n\n\nX\n\nj\n\n\n\n\n{\\displaystyle X_{j}}\n\n, which is manifested as the cosine term in the denominator. If we assume that the sampling time (\n\n\n\nΔ\nt\n=\n1\n\n\n{\\displaystyle \\Delta t=1}\n\n) is much smaller than the decay time (\n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n), then we can use a continuum approximation to \n\n\n\n\nB\n\nn\n\n\n\n\n{\\displaystyle B_{n}}\n\n:\nwhich yields a Lorentzian profile for the spectral density:\nwhere \n\n\n\nγ\n=\n1\n\n/\n\nτ\n\n\n{\\displaystyle \\gamma =1/\\tau }\n\n is the angular frequency associated with the decay time \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n.\nAn alternative expression for \n\n\n\n\nX\n\nt\n\n\n\n\n{\\displaystyle X_{t}}\n\n can be derived by first substituting \n\n\n\nc\n+\nφ\n\nX\n\nt\n−\n2\n\n\n+\n\nε\n\nt\n−\n1\n\n\n\n\n{\\displaystyle c+\\varphi X_{t-2}+\\varepsilon _{t-1}}\n\n for \n\n\n\n\nX\n\nt\n−\n1\n\n\n\n\n{\\displaystyle X_{t-1}}\n\n in the defining equation. Continuing this process N times yields\nFor N approaching infinity, \n\n\n\n\nφ\n\nN\n\n\n\n\n{\\displaystyle \\varphi ^{N}}\n\n will approach zero and:\nIt is seen that \n\n\n\n\nX\n\nt\n\n\n\n\n{\\displaystyle X_{t}}\n\n is white noise convolved with the \n\n\n\n\nφ\n\nk\n\n\n\n\n{\\displaystyle \\varphi ^{k}}\n\n kernel plus the constant mean. If the white noise \n\n\n\n\nε\n\nt\n\n\n\n\n{\\displaystyle \\varepsilon _{t}}\n\n is a Gaussian process then \n\n\n\n\nX\n\nt\n\n\n\n\n{\\displaystyle X_{t}}\n\n is also a Gaussian process. In other cases, the central limit theorem indicates that \n\n\n\n\nX\n\nt\n\n\n\n\n{\\displaystyle X_{t}}\n\n will be approximately normally distributed when \n\n\n\nφ\n\n\n{\\displaystyle \\varphi }\n\n is close to one.\nThe AR(1) model is the discrete time analogy of the continuous Ornstein-Uhlenbeck process. It is therefore sometimes useful to understand the properties of the AR(1) model cast in an equivalent form. In this form, the AR(1) model is given by:\nBy putting this in the form \n\n\n\n\nX\n\nt\n+\n1\n\n\n=\nc\n+\nϕ\n\nX\n\nt\n\n\n\n\n\n{\\displaystyle X_{t+1}=c+\\phi X_{t}\\,}\n\n, and then expanding the series for \n\n\n\n\nX\n\nt\n+\nn\n\n\n\n\n{\\displaystyle X_{t+n}}\n\n, one can show that:\nThe partial autocorrelation of an AR(p) process is zero at lag p + 1 and greater, so the appropriate maximum lag is the one beyond which the partial autocorrelations are all zero.\nThere are many ways to estimate the coefficients, such as the ordinary least squares procedure or method of moments (through Yule–Walker equations).\nThe AR(p) model is given by the equation\nIt is based on parameters \n\n\n\n\nφ\n\ni\n\n\n\n\n{\\displaystyle \\varphi _{i}}\n\n where i = 1, ..., p. There is a direct correspondence between these parameters and the covariance function of the process, and this correspondence can be inverted to determine the parameters from the autocorrelation function (which is itself obtained from the covariances). This is done using the Yule–Walker equations.\nThe Yule–Walker equations, named for Udny Yule and Gilbert Walker,[1][2] are the following set of equations.[3]\nwhere m = 0, ..., p, yielding p + 1 equations. Here \n\n\n\n\nγ\n\nm\n\n\n\n\n{\\displaystyle \\gamma _{m}}\n\n is the autocovariance function of Xt, \n\n\n\n\nσ\n\nε\n\n\n\n\n{\\displaystyle \\sigma _{\\varepsilon }}\n\n is the standard deviation of the input noise process, and \n\n\n\n\nδ\n\nm\n,\n0\n\n\n\n\n{\\displaystyle \\delta _{m,0}}\n\n is the Kronecker delta function.\nBecause the last part of an individual equation is non-zero only if m = 0, the set of equations can be solved by representing the equations for m > 0 in matrix form, thus getting the equation\nwhich can be solved for all \n\n\n\n{\n\nφ\n\nm\n\n\n;\nm\n=\n1\n,\n2\n,\n⋯\n,\np\n}\n.\n\n\n{\\displaystyle \\{\\varphi _{m};m=1,2,\\cdots ,p\\}.}\n\n The remaining equation for m = 0 is\nwhich, once \n\n\n\n{\n\nφ\n\nm\n\n\n;\nm\n=\n1\n,\n2\n,\n⋯\n,\np\n}\n\n\n{\\displaystyle \\{\\varphi _{m};m=1,2,\\cdots ,p\\}}\n\n are known, can be solved for \n\n\n\n\nσ\n\nε\n\n\n2\n\n\n.\n\n\n{\\displaystyle \\sigma _{\\varepsilon }^{2}.}\n\n\nAn alternative formulation is in terms of the autocorrelation function. The AR parameters are determined by the first p+1 elements \n\n\n\nρ\n(\nτ\n)\n\n\n{\\displaystyle \\rho (\\tau )}\n\n of the autocorrelation function. The full autocorrelation function can then be derived by recursively calculating [4]\nExamples for some Low-order AR(p) processes\nThe above equations (the Yule–Walker equations) provide several routes to estimating the parameters of an AR(p) model, by replacing the theoretical covariances with estimated values.[citation needed] Some of these variants can be described as follows:\nOther possible approaches to estimation include maximum likelihood estimation. Two distinct variants of maximum likelihood are available: in one (broadly equivalent to the forward prediction least squares scheme) the likelihood function considered is that corresponding to the conditional distribution of later values in the series given the initial p values in the series; in the second, the likelihood function considered is that corresponding to the unconditional joint distribution of all the values in the observed series. Substantial differences in the results of these approaches can occur if the observed series is short, or if the process is close to non-stationarity.\nThe power spectral density of an AR(p) process with noise variance \n\n\n\n\nV\na\nr\n\n(\n\nZ\n\nt\n\n\n)\n=\n\nσ\n\nZ\n\n\n2\n\n\n\n\n{\\displaystyle \\mathrm {Var} (Z_{t})=\\sigma _{Z}^{2}}\n\n is[4]\nFor white noise (AR(0))\nFor AR(1)\nAR(2) processes can be split into three groups depending on the characteristics of their roots:\nOtherwise the process has real roots, and:\nThe process is non-stationary when the roots are outside the unit circle. The process is stable when the roots are within the unit circle, or equivalently when the coefficients are in the triangle \n\n\n\n−\n1\n≤\n\nφ\n\n2\n\n\n≤\n1\n−\n\n|\n\n\nφ\n\n1\n\n\n\n|\n\n\n\n{\\displaystyle -1\\leq \\varphi _{2}\\leq 1-|\\varphi _{1}|}\n\n.\nThe full PSD function can be expressed in real form as:\nThe impulse response of a system is the change in an evolving variable in response to a change in the value of a shock term k periods earlier, as a function of k. Since the AR model is a special case of the vector autoregressive model, the computation of the impulse response in Vector autoregression#Impulse response applies here.\nOnce the parameters of the autoregression\nhave been estimated, the autoregression can be used to forecast an arbitrary number of periods into the future. First use t to refer to the first period for which data is not yet available; substitute the known prior values Xt-i for i=1, ..., p into the autoregressive equation while setting the error term \n\n\n\n\nε\n\nt\n\n\n\n\n{\\displaystyle \\varepsilon _{t}}\n\n equal to zero (because we forecast Xt to equal its expected value, and the expected value of the unobserved error term is zero). The output of the autoregressive equation is the forecast for the first unobserved period. Next, use t to refer to the next period for which data is not yet available; again the autoregressive equation is used to make the forecast, with one difference: the value of X one period prior to the one now being forecast is not known, so its expected value—the predicted value arising from the previous forecasting step—is used instead. Then for future periods the same procedure is used, each time using one more forecast value on the right side of the predictive equation until, after p predictions, all p right-side values are predicted values from prior steps.\nThere are four sources of uncertainty regarding predictions obtained in this manner: (1) uncertainty as to whether the autoregressive model is the correct model; (2) uncertainty about the accuracy of the forecasted values that are used as lagged values in the right side of the autoregressive equation; (3) uncertainty about the true values of the autoregressive coefficients; and (4) uncertainty about the value of the error term \n\n\n\n\nε\n\nt\n\n\n\n\n\n{\\displaystyle \\varepsilon _{t}\\,}\n\n for the period being predicted. Each of the last three can be quantified and combined to give a confidence interval for the n-step-ahead predictions; the confidence interval will become wider as n increases because of the use of an increasing number of estimated values for the right-side variables.\nThe predictive performance of the autoregressive model can be assessed as soon as estimation has been done if cross-validation is used. In this approach, some of the initially available data was used for parameter estimation purposes, and some (from available observations later in the data set) was held back for out-of-sample testing. Alternatively, after some time has passed after the parameter estimation was conducted, more data will have become available and predictive performance can be evaluated then using the new data.\nIn either case, there are two aspects of predictive performance that can be evaluated: one-step-ahead and n-step-ahead performance. For one-step-ahead performance, the estimated parameters are used in the autoregressive equation along with observed values of X for all periods prior to the one being predicted, and the output of the equation is the one-step-ahead forecast; this procedure is used to obtain forecasts for each of the out-of-sample observations. To evaluate the quality of n-step-ahead forecasts, the forecasting procedure in the previous section is employed to obtain the predictions.\nGiven a set of predicted values and a corresponding set of actual values for X for various time periods, a common evaluation technique is to use the mean squared prediction error; other measures are also available (see Forecasting#Forecasting accuracy).\nThe question of how to interpret the measured forecasting accuracy arises—for example, what is a \"high\" (bad) or a \"low\" (good) value for the mean squared prediction error? There are two possible points of comparison. First, the forecasting accuracy of an alternative model, estimated under different modeling assumptions or different estimation techniques, can be used for comparison purposes. Second, the out-of-sample accuracy measure can be compared to the same measure computed for the in-sample data points (that were used for parameter estimation) for which enough prior data values are available (that is, dropping the first p data points, for which p prior data points are not available). Since the model was estimated specifically to fit the in-sample points as well as possible, it will usually be the case that the out-of-sample predictive performance will be poorer than the in-sample predictive performance. But if the predictive quality deteriorates out-of-sample by \"not very much\" (which is not precisely definable), then the forecaster may be satisfied with the performance.", 
    "dbpedia_url": "http://dbpedia.org/resource/Autoregressive_model", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Autoregressive_model\n"
}