{
    "about": "In theoretical computer science, Baker's technique is a method for designing polynomial-time approximation schemes (PTASs) for problems on planar graphs. It is named after Brenda Baker, who announced it in a 1983 conference and published it in the Journal of the ACM in 1994.", 
    "name": "Baker'S Technique", 
    "classification": "Approximation Algorithms", 
    "full_text": "In theoretical computer science, Baker's technique is a method for designing polynomial-time approximation schemes (PTASs) for problems on planar graphs. It is named after Brenda Baker, who announced it in a 1983 conference and published it in the Journal of the ACM in 1994.\nThe idea for Baker's technique is to break the graph into layers, such that the problem can be solved optimally on each layer, then combine the solutions from each layer in a reasonable way that will result in a feasible solution. This technique has given PTASs for the following problems: subgraph isomorphism, maximum independent set, minimum vertex cover, minimum dominating set, minimum edge dominating set, maximum triangle matching, and many others.\nThe bidimensionality theory of Erik Demaine, Fedor Fomin, Hajiaghayi, and Dimitrios Thilikos and its offshoot simplifying decompositions (Demaine, Hajiaghayi & Kawarabayashi (2005),Demaine, Hajiaghayi & Kawarabayashi (2011)) generalizes and greatly expands the applicability of Baker's technique for a vast set of problems on planar graphs and more generally graphs excluding a fixed minor, such as bounded genus graphs, as well as to other classes of graphs not closed under taking minors such as the 1-planar graphs.\n\n\nThe example that we will use to demonstrate Baker's technique is the maximum weight independent set problem.\nNotice that the above algorithm is feasible because each \n\n\n\n\nS\n\nℓ\n\n\n\n\n{\\displaystyle S^{\\ell }}\n\n is the union of disjoint independent sets.\nDynamic programming is used when we compute the maximum-weight independent set for each \n\n\n\n\nG\n\ni\n\n\nℓ\n\n\n\n\n{\\displaystyle G_{i}^{\\ell }}\n\n. This dynamic program works because each \n\n\n\n\nG\n\ni\n\n\nℓ\n\n\n\n\n{\\displaystyle G_{i}^{\\ell }}\n\n is a \n\n\n\nk\n\n\n{\\displaystyle k}\n\n-outerplanar graph. Many NP-complete problems can be solved with dynamic programming on \n\n\n\nk\n\n\n{\\displaystyle k}\n\n-outerplanar graphs.", 
    "dbpedia_url": "http://dbpedia.org/resource/Baker's_technique", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Baker's_technique\n"
}