{
    "about": "Bandlimiting is the limiting of a signal's Fourier transform or power spectral density to zero above a certain finite frequency. A band-limited signal is one whose Fourier transform or power spectral density has bounded support.", 
    "name": "Bandlimiting", 
    "classification": "Digital Signal Processing", 
    "full_text": "Bandlimiting is the limiting of a signal's Fourier transform or power spectral density to zero above a certain finite frequency. A band-limited signal is one whose Fourier transform or power spectral density has bounded support.\nThe signal may be either random (stochastic) or non-random (deterministic).\nIn general, infinitely many terms are required in a continuous Fourier series representation, but if a finite number of Fourier series terms can be calculated from that signal, that signal is considered to be band-limited.\n\n\nA bandlimited signal can be fully reconstructed from its samples, provided that the sampling rate exceeds twice the maximum frequency in the bandlimited signal. This minimum sampling frequency is called the Nyquist rate. This result, usually attributed to Nyquist and Shannon, is known as the Nyquist–Shannon sampling theorem.\nAn example of a simple deterministic bandlimited signal is a sinusoid of the form \n\n\n\nx\n(\nt\n)\n=\nsin\n⁡\n(\n2\nπ\nf\nt\n+\nθ\n)\n \n\n\n{\\displaystyle x(t)=\\sin(2\\pi ft+\\theta )\\ }\n\n. If this signal is sampled at a rate \n\n\n\n\nf\n\ns\n\n\n=\n\n\n1\nT\n\n\n>\n2\nf\n\n\n{\\displaystyle f_{s}={\\frac {1}{T}}>2f}\n\n so that we have the samples \n\n\n\nx\n(\nn\nT\n)\n \n\n\n{\\displaystyle x(nT)\\ }\n\n, for all integers \n\n\n\nn\n\n\n{\\displaystyle n}\n\n, we can recover \n\n\n\nx\n(\nt\n)\n \n\n\n{\\displaystyle x(t)\\ }\n\n completely from these samples. Similarly, sums of sinusoids with different frequencies and phases are also bandlimited to the highest of their frequencies.\nThe signal whose Fourier transform is shown in the figure is also bandlimited. Suppose \n\n\n\nx\n(\nt\n)\n \n\n\n{\\displaystyle x(t)\\ }\n\n is a signal whose Fourier transform is \n\n\n\nX\n(\nf\n)\n \n\n\n{\\displaystyle X(f)\\ }\n\n, the magnitude of which is shown in the figure. The highest frequency component in \n\n\n\nx\n(\nt\n)\n \n\n\n{\\displaystyle x(t)\\ }\n\n is \n\n\n\nB\n \n\n\n{\\displaystyle B\\ }\n\n. As a result, the Nyquist rate is\nor twice the highest frequency component in the signal, as shown in the figure. According to the sampling theorem, it is possible to reconstruct \n\n\n\nx\n(\nt\n)\n \n\n\n{\\displaystyle x(t)\\ }\n\n completely and exactly using the samples\nas long as\nThe reconstruction of a signal from its samples can be accomplished using the Whittaker–Shannon interpolation formula.\n[further explanation needed]\nA bandlimited signal cannot be also timelimited. More precisely, a function and its Fourier transform cannot both have finite support. This fact can be proved by using complex analysis and properties of Fourier transform.\nProof: Assume that a signal f(t) which has finite support in both domains exists. Let's sample it faster than the Nyquist frequency, and compute respective Fourier transform \n\n\n\nF\nT\n(\nf\n)\n=\n\nF\n\n1\n\n\n(\nw\n)\n\n\n{\\displaystyle FT(f)=F_{1}(w)}\n\n and discrete-time fourier transform \n\n\n\nD\nT\nF\nT\n(\nf\n)\n=\n\nF\n\n2\n\n\n(\nw\n)\n\n\n{\\displaystyle DTFT(f)=F_{2}(w)}\n\n. According to properties of DTFT, \n\n\n\n\nF\n\n2\n\n\n(\nw\n)\n=\n\n∑\n\nn\n=\n−\n∞\n\n\n+\n∞\n\n\n\nF\n\n1\n\n\n(\nw\n+\nn\n\nf\n\nx\n\n\n)\n\n\n{\\displaystyle F_{2}(w)=\\sum _{n=-\\infty }^{+\\infty }F_{1}(w+nf_{x})}\n\n, where \n\n\n\n\nf\n\nx\n\n\n\n\n{\\displaystyle f_{x}}\n\n is the frequency used for discretization. If f is bandlimited, \n\n\n\n\nF\n\n1\n\n\n\n\n{\\displaystyle F_{1}}\n\n is zero outside of a certain interval, so with large enough \n\n\n\n\nf\n\nx\n\n\n\n\n{\\displaystyle f_{x}}\n\n, \n\n\n\n\nF\n\n2\n\n\n\n\n{\\displaystyle F_{2}}\n\n will be zero in some intervals too, since individual supports of \n\n\n\n\nF\n\n1\n\n\n\n\n{\\displaystyle F_{1}}\n\n in sum of \n\n\n\n\nF\n\n2\n\n\n\n\n{\\displaystyle F_{2}}\n\n won't overlap. According to DTFT definition, \n\n\n\n\nF\n\n2\n\n\n\n\n{\\displaystyle F_{2}}\n\n is a sum of trigonometric functions, and since f(t) is time-limited, this sum will be finite, so \n\n\n\n\nF\n\n2\n\n\n\n\n{\\displaystyle F_{2}}\n\n will be actually a trigonometric polynomial. All trigonometric polynomials are holomorphic on a whole complex plane, and there is a simple theorem in complex analysis that says that all zeros of non-constant holomorphic function are isolated. But this contradicts our earlier finding that \n\n\n\n\nF\n\n2\n\n\n\n\n{\\displaystyle F_{2}}\n\n has intervals full of zeros, because points in such intervals are not isolated. Thus the only time- and bandwidth-limited signal is a constant zero.\nOne important consequence of this result is that it is impossible to generate a truly bandlimited signal in any real-world situation, because a bandlimited signal would require infinite time to transmit. All real-world signals are, by necessity, timelimited, which means that they cannot be bandlimited. Nevertheless, the concept of a bandlimited signal is a useful idealization for theoretical and analytical purposes. Furthermore, it is possible to approximate a bandlimited signal to any arbitrary level of accuracy desired.\nA similar relationship between duration in time and bandwidth in frequency also forms the mathematical basis for the uncertainty principle in quantum mechanics. In that setting, the \"width\" of the time domain and frequency domain functions are evaluated with a variance-like measure. Quantitatively, the uncertainty principle imposes the following condition on any real waveform:\nwhere\nIn time–frequency analysis, these limits are known as the Gabor limit, and are interpreted as a limit on the simultaneous time–frequency resolution one may achieve.", 
    "dbpedia_url": "http://dbpedia.org/resource/Bandlimiting", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Bandlimiting\n"
}