{
    "about": "The Barabási–Albert (BA) model is an algorithm for generating random scale-free networks using a preferential attachment mechanism. Several natural and human-made systems, including the Internet, the world wide web, citation networks, and some social networks are thought to be approximately scale-free and certainly contain few nodes (called hubs) with unusually high degree as compared to the other nodes of the network. BA model tries to explain existence of such nodes in real networks. The algorithm is named for its inventors Albert-László Barabási and Réka Albert and is a special case of a more general model called Price's model[1]", 
    "name": "BarabáSi–Albert Model", 
    "classification": "Graph Algorithms", 
    "full_text": "The Barabási–Albert (BA) model is an algorithm for generating random scale-free networks using a preferential attachment mechanism. Several natural and human-made systems, including the Internet, the world wide web, citation networks, and some social networks are thought to be approximately scale-free and certainly contain few nodes (called hubs) with unusually high degree as compared to the other nodes of the network. BA model tries to explain existence of such nodes in real networks. The algorithm is named for its inventors Albert-László Barabási and Réka Albert and is a special case of a more general model called Price's model[1]\n\n\nMany observed networks (at least approximately) fall into the class of scale-free networks, meaning that they have power-law (or scale-free) degree distributions, while random graph models such as the Erdős–Rényi (ER) model and the Watts–Strogatz (WS) model do not exhibit power laws. The Barabási–Albert model is one of several proposed models that generate scale-free networks. It incorporates two important general concepts: growth and preferential attachment. Both growth and preferential attachment exist widely in real networks.\nGrowth means that the number of nodes in the network increases over time.\nPreferential attachment means that the more connected a node is, the more likely it is to receive new links. Nodes with higher degree have stronger ability to grab links added to the network. Intuitively, the preferential attachment can be understood if we think in terms of social networks connecting people. Here a link from A to B means that person A \"knows\" or \"is acquainted with\" person B. Heavily linked nodes represent well-known people with lots of relations. When a newcomer enters the community, s/he is more likely to become acquainted with one of those more visible people rather than with a relative unknown. The BA model was proposed by assuming that in the World Wide Web, new pages link preferentially to hubs, i.e. very well known sites such as Google, rather than to pages that hardly anyone knows. If someone selects a new page to link to by randomly choosing an existing link, the probability of selecting a particular page would be proportional to its degree. The BA model claims that this explains the preferential attachment probability rule. However, in spite of being quite a useful model, empirical evidence suggests that the mechanism in its simplest form does not apply to the World Wide Web as shown in \"Technical Comment to 'Emergence of Scaling in Random Networks'\".  However, later Bianconi–Barabási model addresses this issue by introducing a fitness parameter. Preferential attachment is an example of a positive feedback cycle where initially random variations (one node initially having more links or having started accumulating links earlier than another) are automatically reinforced, thus greatly magnifying differences. This is also sometimes called the Matthew effect, \"the rich get richer\", and in chemistry autocatalysis.\nThe network begins with an initial connected network of \n\n\n\n\nm\n\n0\n\n\n\n\n{\\displaystyle m_{0}}\n\n nodes.\nNew nodes are added to the network one at a time. Each new node is connected to \n\n\n\nm\n≤\n\nm\n\n0\n\n\n\n\n{\\displaystyle m\\leq m_{0}}\n\n existing nodes with a probability that is proportional to the number of links that the existing nodes already have. Formally, the probability \n\n\n\n\np\n\ni\n\n\n\n\n{\\displaystyle p_{i}}\n\n that the new node is connected to node \n\n\n\ni\n\n\n{\\displaystyle i}\n\n is[2]\nwhere \n\n\n\n\nk\n\ni\n\n\n\n\n{\\displaystyle k_{i}}\n\n is the degree of node \n\n\n\ni\n\n\n{\\displaystyle i}\n\n and the sum is made over all pre-existing nodes \n\n\n\nj\n\n\n{\\displaystyle j}\n\n (i.e. the denominator results in twice the current number of edges in the network). Heavily linked nodes (\"hubs\") tend to quickly accumulate even more links, while nodes with only a few links are unlikely to be chosen as the destination for a new link. The new nodes have a \"preference\" to attach themselves to the already heavily linked nodes.\nThe degree distribution resulting from the BA model is scale free, in particular, it is a power law of the form\nThe h-index or Hirsch index distribution was shown to also be scale free and was proposed as the lobby index, to be used as a centrality measure[4]\nFurthermore, an analytic result for the density of nodes with h-index 1 can be obtained in the case where \n\n\n\n\nm\n\n0\n\n\n=\n1\n\n\n{\\displaystyle m_{0}=1}\n\n\nThe average path length of the BA model increases approximately logarithmically with the size of the network. The actual form has a double logarithmic correction and goes as[5]\nThe BA model has a systematically shorter average path length than a random graph.\nCorrelations between the degrees of connected nodes develop spontaneously in the BA model because of the way the network evolves. The probability, \n\n\n\n\nn\n\nk\nℓ\n\n\n\n\n{\\displaystyle n_{k\\ell }}\n\n, of finding a link that connects a node of degree \n\n\n\nk\n\n\n{\\displaystyle k}\n\n to an ancestor node of degree \n\n\n\nℓ\n\n\n{\\displaystyle \\ell }\n\n in the BA model for the special case of \n\n\n\nm\n=\n1\n\n\n{\\displaystyle m=1}\n\n is given by\nThis is certainly not the result expected if the distributions were uncorrelated, \n\n\n\n\nn\n\nk\nℓ\n\n\n=\n\nk\n\n−\n3\n\n\n\nℓ\n\n−\n3\n\n\n\n\n{\\displaystyle n_{k\\ell }=k^{-3}\\ell ^{-3}}\n\n.[2]\nFor general \n\n\n\nm\n\n\n{\\displaystyle m}\n\n, the fraction of links who connect a node of degree \n\n\n\nk\n\n\n{\\displaystyle k}\n\n to a node of degree \n\n\n\nℓ\n\n\n{\\displaystyle \\ell }\n\n is[6]\nAlso, the nearest-neighbor degree distribution \n\n\n\np\n(\nℓ\n∣\nk\n)\n\n\n{\\displaystyle p(\\ell \\mid k)}\n\n, that is, the degree distribution of the neighbors of a node with degree \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, is given by[6]\nIn other words, if we select a node with degree \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, and then select one of its neighbors randomly, the probability that this randomly selected neighbor will have degree \n\n\n\nℓ\n\n\n{\\displaystyle \\ell }\n\n is given by the expression \n\n\n\np\n(\nℓ\n\n|\n\nk\n)\n\n\n{\\displaystyle p(\\ell |k)}\n\n above.\nWhile there is no analytical result for the clustering coefficient of the BA model, the empirically determined clustering coefficients are generally significantly higher for the BA model than for random networks. The clustering coefficient also scales with network size following approximately a power law\nEdit: Analytical result for the clustering coefficient of the BA model was obtained by Klemm and Eguíluz[7] and proven by Bollobás.[8] A mean-field approach to study the clustering coefficient was applied by Fronczak, Fronczak and Holyst.[9]\nThis behavior is still distinct from the behavior of small-world networks where clustering is independent of system size. In the case of hierarchical networks, clustering as a function of node degree also follows a power-law,\nThis result was obtained analytically by Dorogovtsev, Goltsev and Mendes.[10]\nThe spectral density of BA model has a different shape from the semicircular spectral density of random graph. It has a triangle-like shape with the top lying well above the semicircle and edges decaying as a power law. [11]\nBy definition, the BA model describes a time developing phenomenon and hence, besides its scale-free property, one could also look for its dynamic scaling property. In the BA network nodes can also be characterized by generalized degree \n\n\n\nq\n\n\n{\\displaystyle q}\n\n, the product of the square root of the birth time of each node and their corresponding degree \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, instead of the degree \n\n\n\nk\n\n\n{\\displaystyle k}\n\n alone since the time of birth matters in the BA network. We find that the generalized degree distribution \n\n\n\nF\n(\nq\n,\nt\n)\n\n\n{\\displaystyle F(q,t)}\n\n has some non-trivial features and exhibits dynamic scaling\nIt implies that the distinct plots of \n\n\n\nF\n(\nq\n,\nt\n)\n\n\n{\\displaystyle F(q,t)}\n\n vs \n\n\n\nq\n\n\n{\\displaystyle q}\n\n would collapse into a universal curve if we plots \n\n\n\nF\n(\nq\n,\nt\n)\n\nt\n\n1\n\n/\n\n2\n\n\n\n\n{\\displaystyle F(q,t)t^{1/2}}\n\n vs \n\n\n\nq\n\n/\n\n\nt\n\n1\n\n/\n\n2\n\n\n\n\n{\\displaystyle q/t^{1/2}}\n\n.[12]\nModel A retains growth but does not include preferential attachment. The probability of a new node connecting to any pre-existing node is equal. The resulting degree distribution in this limit is geometric,[13] indicating that growth alone is not sufficient to produce a scale-free structure.\nModel B retains preferential attachment but eliminates growth. The model begins with a fixed number of disconnected nodes and adds links, preferentially choosing high degree nodes as link destinations. Though the degree distribution early in the simulation looks scale-free, the distribution is not stable, and it eventually becomes nearly Gaussian as the network nears saturation. So preferential attachment alone is not sufficient to produce a scale-free structure.\nThe failure of models A and B to lead to a scale-free distribution indicates that growth and preferential attachment are needed simultaneously to reproduce the stationary power-law distribution observed in real networks.[2]\nThe first use of a preferential attachment mechanism to explain power-law distributions appears to have been by Yule in 1925.[14] The modern master equation method, which yields a more transparent derivation, was applied to the problem by Herbert A. Simon in 1955[15] in the course of studies of the sizes of cities and other phenomena. It was first applied to the growth of networks by Derek de Solla Price in 1976[16] who was interested in the networks of citation between scientific papers. The name \"preferential attachment\" and the present popularity of scale-free network models is due to the work of Albert-László Barabási and Réka Albert, who rediscovered the process independently in 1999 and applied it to degree distributions on the web.[3]", 
    "dbpedia_url": "http://dbpedia.org/resource/Barabási–Albert_model", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Barabási–Albert_model\n"
}