{
    "about": "Baseband is a signal that has a very narrow frequency range, i.e. a spectral magnitude that is nonzero only for frequencies in the vicinity of the origin (termed f = 0) and negligible elsewhere.[1] In telecommunications and signal processing, baseband signals are transmitted without modulation, that is, without any shift in the range of frequencies of the signal,[2] and are low-frequency—contained within the band of frequencies from close to 0 hertz up to a higher cut-off frequency or maximum bandwidth. Baseband can be synonymous with lowpass or non-modulated, and is differentiated from passband, bandpass, carrier-modulated, intermediate frequency, or radio frequency (RF).", 
    "name": "Baseband", 
    "classification": "Signal Processing", 
    "full_text": "Baseband is a signal that has a very narrow frequency range, i.e. a spectral magnitude that is nonzero only for frequencies in the vicinity of the origin (termed f = 0) and negligible elsewhere.[1] In telecommunications and signal processing, baseband signals are transmitted without modulation, that is, without any shift in the range of frequencies of the signal,[2] and are low-frequency—contained within the band of frequencies from close to 0 hertz up to a higher cut-off frequency or maximum bandwidth. Baseband can be synonymous with lowpass or non-modulated, and is differentiated from passband, bandpass, carrier-modulated, intermediate frequency, or radio frequency (RF).\n\n\nA baseband bandwidth is equal to the highest frequency of a signal or system, or an upper bound on such frequencies,[3] for example the upper cut-off frequency of a Lowpass filter. By contrast, passband bandwidth is the difference between a highest frequency and a nonzero lowest frequency.\nA baseband channel or lowpass channel (or system, or network) is a communication channel that can transfer frequencies that are very near zero.[4] Examples are serial cables and local area networks (LANs), as opposed to passband channels such as radio frequency channels and passband filtered wires of the analog telephone network. Frequency division multiplexing (FDM) allows an analog telephone wire to carry a baseband telephone call, concurrently as one or several carrier-modulated telephone calls.\nDigital baseband transmission, also known as line coding,[5] aims at transferring a digital bit stream over baseband channel, typically an unfiltered wire, contrary to passband transmission, also known as carrier-modulated transmission.[6] Passband transmission makes communication possible over a bandpass filtered channel, such as the telephone network local-loop or a band-limited wireless channel.[citation needed]\nThe word \"BASE\" in Ethernet physical layer standards, for example 10BASE5, 100BASE-TX and 1000BASE-SX, implies baseband digital transmission (i.e. that a line code and an unfiltered wire are used).[citation needed]\nA baseband processor also known as BP or BBP is used to process the down-converted digital signal to retrieve essential data for the wireless digital system. The baseband processing block in receivers is usually responsible for providing observable data: code pseudo-ranges and carrier phase measurements, as well as navigation data.[citation needed]\nA baseband signal or lowpass signal is a signal that can include frequencies that are very near zero, by comparison with its highest frequency (for example, a sound waveform can be considered as a baseband signal, whereas a radio signal or any other modulated signal is not).[7]\nAn equivalent baseband signal or equivalent lowpass signal is—in analog and digital modulation methods for (band-pass) signals with constant or varying carrier frequency (for example ASK, PSK QAM, and FSK)—a complex valued representation of the modulated physical signal (the so-called passband signal or RF signal). The equivalent baseband signal is \n\n\n\nZ\n(\nt\n)\n=\nI\n(\nt\n)\n+\nj\nQ\n(\nt\n)\n\n\n\n{\\displaystyle Z(t)=I(t)+jQ(t)\\,}\n\n where \n\n\n\nI\n(\nt\n)\n\n\n{\\displaystyle I(t)}\n\n is the inphase signal, \n\n\n\nQ\n(\nt\n)\n\n\n{\\displaystyle Q(t)}\n\n the quadrature phase signal, and \n\n\n\nj\n\n\n{\\displaystyle j}\n\n the imaginary unit. In a digital modulation method, the \n\n\n\nI\n(\nt\n)\n\n\n{\\displaystyle I(t)}\n\n and \n\n\n\nQ\n(\nt\n)\n\n\n{\\displaystyle Q(t)}\n\n signals of each modulation symbol are evident from the constellation diagram. The frequency spectrum of this signal includes negative as well as positive frequencies. The physical passband signal corresponds to\nwhere \n\n\n\nω\n\n\n{\\displaystyle \\omega }\n\n is the carrier angular frequency in rad/s.[8]\nA signal at baseband is often used to modulate a higher frequency carrier signal in order that it may be transmitted via radio. Modulation results in shifting the signal up to much higher frequencies (radio frequencies, or RF) than it originally spanned. A key consequence of the usual double-sideband amplitude modulation (AM) is that the range of frequencies the signal spans (its spectral bandwidth) is doubled. Thus, the RF bandwidth of a signal (measured from the lowest frequency as opposed to 0 Hz) is twice its baseband bandwidth. Steps may be taken to reduce this effect, such as single-sideband modulation. Some transmission schemes such as frequency modulation use even more bandwidth.[citation needed]\nThe figure shows what happens with AM modulation:", 
    "dbpedia_url": "http://dbpedia.org/resource/Baseband", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Baseband\n"
}