{
    "about": "The Baudhayana sūtras are a group of Vedic Sanskrit texts which cover dharma, daily ritual, mathematics, etc. They belong to the Taittiriya branch of the Krishna Yajurveda school and are among the earliest texts of the sutra genre, perhaps compiled in the 8th to 7th centuries BCE.[1]", 
    "name": "Baudhayana Sequences", 
    "classification": "Signal Processing", 
    "full_text": "The Baudhayana sūtras are a group of Vedic Sanskrit texts which cover dharma, daily ritual, mathematics, etc. They belong to the Taittiriya branch of the Krishna Yajurveda school and are among the earliest texts of the sutra genre, perhaps compiled in the 8th to 7th centuries BCE.[1]\nThe Baudhayana sūtras consist of six texts:\nThe Baudhāyana Śulbasûtra is noted for containing several early mathematical results, including an approximation of the square root of 2 and the statement of a version of the Pythagorean theorem.\n\n\nHis shrauta sūtras related to performing Vedic sacrifices has followers in some Smārta brāhmaṇas (Iyers) and some Iyengars of Tamil Nadu, Yajurvedis or Namboothiris of Kerala, Gurukkal Brahmins, among others. The followers of this sūtra follow a different method and do 24 Tila-tarpaṇa, as Lord Krishna had done tarpaṇa on the day before amāvāsyā; they call themselves Baudhāyana Amavasya.\nThe Dharmasūtra of Baudhāyana like that of Apastamba also forms a part of the larger Kalpasutra. Likewise, it is composed of praśnas which literally means ‘questions’ or books. The structure of this Dharmasūtra is not very clear because it came down in an incomplete manner. Moreover, the text has undergone alterations in the form of additions and explanations over a period of time. The praśnas consist of the Srautasutra and other ritual treatises, the Sulvasutra which deals with vedic geometry, and the Grhyasutra which deals with domestic rituals.[3]\nThere are no commentaries on this Dharmasūtra with the exception of Govindasvāmin's Vivaraṇa. The date of the commentary is uncertain but according to Olivelle it is not very ancient. Also the commentary is inferior in comparison to that of Haradatta on Āpastamba and Gautama.[4]\nThis Dharmasūtra is divided into four books. Olivelle states that Book One and the first sixteen chapters of Book Two are the ‘Proto-Baudhayana’[3] even though this section has undergone alteration. Scholars like Bühler and Kane agree that the last two books of the Dharmasūtra are later additions. Chapter 17 and 18 in Book Two lays emphasis on various types of ascetics and acetic practices.[3]\nThe first book is primarily devoted to the student and deals in topics related to studentship. It also refers to social classes, the role of the king, marriage, and suspension of Vedic recitation. Book two refers to penances, inheritance, women, householder, orders of life, ancestral offerings. Book three refers to holy householders, forest hermit and penances. Book four primarily refers to the yogic practices and penances along with offenses regarding marriage.[5]\n\nIt is also referred to as Baudhayana theorem. The most notable of the rules (the Sulbasūtra-s do not contain any proofs for the rules which they describe, since they are sūtra-s, formulae, concise) in the Baudhāyana Sulba Sūtra says:\nदीर्घचतुरश्रस्याक्ष्णया रज्जु: पार्श्र्वमानी तिर्यग् मानी च यत् पृथग् भूते कुरूतस्तदुभयं करोति ॥\n\ndīrghachatursrasyākṣaṇayā rajjuḥ pārśvamānī, tiryagmānī,\ncha yatpṛthagbhūte kurutastadubhayāṅ karoti.\nThe lines are to be referring to a rectangle, although some interpretations consider this to refer to a square. In either case, it states that the square of the hypotenuse equals the sum of the squares of the sides. If restricted to right-angled isosceles triangles, however, it would constitute a less general claim, but the text seems to be quite open to unequal sides.\nIf this refers to a rectangle, it is the earliest recorded statement of the Pythagorean theorem.\nBaudhāyana also provides a non-axiomatic demonstration using a rope measure of the reduced form of the Pythagorean theorem for an isosceles right triangle:\nSequences of Pythagorean triples used in cryptography as random sequences and for the generation of keys have been dubbed \"Baudhayana sequences\" in a 2014 paper.[7]\nAnother problem tackled by Baudhāyana is that of finding a circle whose area is the same as that of a square (the reverse of squaring the circle). His sūtra i.58 gives this construction:\nExplanation:\nBaudhāyana i.61-2 (elaborated in Āpastamba Sulbasūtra i.6) gives the length of the diagonal of a square in terms of its sides, which is equivalent to a formula for the square root of 2:\nThat is,\nwhich is correct to five decimals.[8]\nOther theorems include: diagonals of rectangle bisect each other, diagonals of rhombus bisect at right angles, area of a square formed by joining the middle points of a square is half of original, the midpoints of a rectangle joined forms a rhombus whose area is half the rectangle, etc.\nNote the emphasis on rectangles and squares; this arises from the need to specify yajña bhūmikās—i.e. the altar on which a rituals were conducted, including fire offerings (yajña).", 
    "dbpedia_url": "http://dbpedia.org/resource/Baudhayana_sequences", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Baudhayana_sequences\n"
}