{
    "about": "The beat receiver or beat receptor is a direct-conversion heterodyne detector designed by inventor Nikola Tesla prior to 1896 to receive continuous un-modulated radio waves (CW) and produce an audible note through the mixing of locally generated radio-frequency currents with radio-frequency currents from an antenna or receiving structure.  This is achieved by the application of a locally generated radio-frequency magnetic field to radio-frequency currents flowing in a conductor.[1]", 
    "name": "Beat Receptor", 
    "classification": "Signal Processing", 
    "full_text": "The beat receiver or beat receptor is a direct-conversion heterodyne detector designed by inventor Nikola Tesla prior to 1896 to receive continuous un-modulated radio waves (CW) and produce an audible note through the mixing of locally generated radio-frequency currents with radio-frequency currents from an antenna or receiving structure.  This is achieved by the application of a locally generated radio-frequency magnetic field to radio-frequency currents flowing in a conductor.[1]\nThe beat receiver consists of an LC circuit made up of a capacitor plus a steel wire or band that is stretched through the field of a powerful electro-magnet. The capacitor is of comparatively large value because the conductor is short.  The tuned circuit is excited by radio-frequency alternating current magneto-inductively coupled from the receiver's antenna.\nThe electromagnet is excited by stable radio-frequency alternating current produced by a local isochronous electro-mechanical oscillator known as a beat frequency oscillator or BFO.[2]  It consists of two chambers in the center of which is placed a vibrating membrane.  This is inclosed in a magnetic field, consisting of a powerful coil encircling the device, and which is excited by a direct current.  The membrane is caused to vibrate by passing interrupted, compressed air through the two chambers.  In the process of vibration, an electromagnetic force is produced in a coil secured to the vibrating disc.\nThe frequency of the locally produced oscillation is set close to the frequency of the received signal.  The steel wire, brought under tension and mechanically tuned, is caused to vibrate at the resulting audible beat frequency of the local and received oscillations.\nThe pioneering work of Tesla and Fessenden led to the development of basic intermediate frequency circuitry.[4]", 
    "dbpedia_url": "http://dbpedia.org/resource/Beat_receptor", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Beat_receptor\n"
}