{
    "about": "The Berlekamp–Massey algorithm is an algorithm that will find the shortest linear feedback shift register (LFSR) for a given binary output sequence. The algorithm will also find the minimal polynomial of a linearly recurrent sequence in an arbitrary field. The field requirement means that the Berlekamp–Massey algorithm requires all non-zero elements to have a multiplicative inverse.[1] Reeds and Sloane offer an extension to handle a ring.[2]", 
    "name": "Berlekamp–Massey Algorithm", 
    "classification": "Error Detection And Correction", 
    "full_text": "The Berlekamp–Massey algorithm is an algorithm that will find the shortest linear feedback shift register (LFSR) for a given binary output sequence. The algorithm will also find the minimal polynomial of a linearly recurrent sequence in an arbitrary field. The field requirement means that the Berlekamp–Massey algorithm requires all non-zero elements to have a multiplicative inverse.[1] Reeds and Sloane offer an extension to handle a ring.[2]\nElwyn Berlekamp invented an algorithm for decoding Bose–Chaudhuri–Hocquenghem (BCH) codes.[3][4] James Massey recognized its application to linear feedback shift registers and simplified the algorithm.[5][6] Massey termed the algorithm the LFSR Synthesis Algorithm (Berlekamp Iterative Algorithm),[7] but it is now known as the Berlekamp–Massey algorithm.\n\n\nThe Berlekamp–Massey algorithm is an alternate method to solve the set of linear equations described in Reed–Solomon Peterson decoder, which can be summarized as:\nIn the code examples below, C(x) is a potential instance of Λ(x). The error locator polynomial C(x) for L errors is defined as:\nor reversed:\nThe goal of the algorithm is to determine the minimal degree L and C(x) which results in all syndromes\nbeing equal to 0:\nAlgorithm: C(x) is initialized to 1, L is the current number of assumed errors, and initialized to zero. N is the total number of syndromes. n is used as the main iterator and to index the syndromes from 0 to (N-1). B(x) is a copy of the last C(x) since L was updated and initialized to 1. b is a copy of the last discrepancy d (explained below) since L was updated and initialized to 1. m is the number of iterations since L, B(x), and b were updated and initialized to 1.\nEach iteration of the algorithm calculates a discrepancy d. At iteration k this would be:\nIf d is zero, the algorithm assumes that C(x) and L are correct for the moment, increments m, and continues.\nIf d is not zero, the algorithm adjusts C(x) so that a recalculation of d would be zero:\nThe xm term shifts B(x) so it follows the syndromes corresponding to 'b'. If the previous update of L occurred on iteration j, then m = k - j, and a recalculated discrepancy would be:\nThis would change a recalculated discrepancy to:\nThe algorithm also needs to increase L (number of errors) as needed. If L equals the actual number of errors, then during the iteration process, the discrepancies will become zero before n becomes greater than or equal to (2 L). Otherwise L is updated and algorithm will update B(x), b, increase L, and reset m = 1. The formula L = (n + 1 - L) limits L to the number of available syndromes used to calculate discrepancies, and also handles the case where L increases by more than 1.\nThe algorithm from Massey (1969, p. 124) for an arbitrary field:\nThe following is the Berlekamp–Massey algorithm specialized for the binary finite field F2 (also written GF(2)). The field elements are '0' and '1'. The field operations '+' and '−' are identical and are equivalent to the 'exclusive or' operation, XOR. The multiplication operator '*' becomes the logical AND operation. The division operator reduces to the identity operation (i.e., field division is only defined for dividing by 1, and x/1 = x).\nAt the end of the algorithm, \n\n\n\nL\n\n\n{\\displaystyle L}\n\n is the length of the minimal LFSR for the stream, and we have \n\n\n\n\nc\n\nL\n\n\n\ns\n\na\n\n\n+\n\nc\n\nL\n−\n1\n\n\n\ns\n\na\n+\n1\n\n\n+\n\nc\n\nL\n−\n2\n\n\n\ns\n\na\n+\n2\n\n\n+\n⋯\n=\n0\n\n\n{\\displaystyle c_{L}s_{a}+c_{L-1}s_{a+1}+c_{L-2}s_{a+2}+\\cdots =0}\n\n for all \n\n\n\na\n\n\n{\\displaystyle a}\n\n.", 
    "dbpedia_url": "http://dbpedia.org/resource/Berlekamp–Massey_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Berlekamp–Massey_algorithm\n"
}