{
    "about": "In the mathematical field of numerical analysis, a Bernstein polynomial, named after Sergei Natanovich Bernstein, is a polynomial in the Bernstein form, that is a linear combination of Bernstein basis polynomials.", 
    "name": "Bernstein Polynomial", 
    "classification": "Numerical Analysis", 
    "full_text": "In the mathematical field of numerical analysis, a Bernstein polynomial, named after Sergei Natanovich Bernstein, is a polynomial in the Bernstein form, that is a linear combination of Bernstein basis polynomials.\nA numerically stable way to evaluate polynomials in Bernstein form is de Casteljau's algorithm.\nPolynomials in Bernstein form were first used by Bernstein in a constructive proof for the Stone–Weierstrass approximation theorem. With the advent of computer graphics, Bernstein polynomials, restricted to the interval [0, 1], became important in the form of Bézier curves.\n\n\nThe n + 1 Bernstein basis polynomials of degree n are defined as\nwhere \n\n\n\n\n\n\n(\n\n\nn\nν\n\n\n)\n\n\n\n\n\n{\\displaystyle {n \\choose \\nu }}\n\n is a binomial coefficient.\nThe Bernstein basis polynomials of degree n form a basis for the vector space Πn of polynomials of degree at most n.\nA linear combination of Bernstein basis polynomials\nis called a Bernstein polynomial or polynomial in Bernstein form of degree n.[1]\nThe coefficients \n\n\n\n\nβ\n\nν\n\n\n\n\n{\\displaystyle \\beta _{\\nu }}\n\n are called Bernstein coefficients or Bézier coefficients.\nThe first few Bernstein basis polynomials are:\nThe Bernstein basis polynomials have the following properties:\nLet ƒ be a continuous function on the interval [0, 1]. Consider the Bernstein polynomial\nIt can be shown that\nuniformly on the interval [0, 1].[2] This is a stronger statement than the proposition that the limit holds for each value of x separately; that would be pointwise convergence rather than uniform convergence. Specifically, the word uniformly signifies that\nBernstein polynomials thus afford one way to prove the Weierstrass approximation theorem that every real-valued continuous function on a real interval [a, b] can be uniformly approximated by polynomial functions over R.[3]\nA more general statement for a function with continuous kth derivative is\nwhere additionally\nis an eigenvalue of Bn; the corresponding eigenfunction is a polynomial of degree k.\nSuppose K is a random variable distributed as the number of successes in n independent Bernoulli trials with probability x of success on each trial; in other words, K has a binomial distribution with parameters n and x. Then we have the expected value E(K/n) = x.\nBy the weak law of large numbers of probability theory,\nfor every δ > 0. Moreover, this relation holds uniformly in x, which can be seen from its proof via Chebyshev's inequality, taking into account that the variance of K/n, equal to x(1-x)/n, is bounded from above by 1/(4n) irrespective of x.\nBecause ƒ, being continuous on a closed bounded interval, must be uniformly continuous on that interval, one infers a statement of the form\nuniformly in x. Taking into account that ƒ is bounded (on the given interval) one gets for the expectation\nuniformly in x. To this end one splits the sum for the expectation in two parts. On one part the difference does not exceed ε; this part cannot contribute more than ε. On the other part the difference exceeds ε, but does not exceed 2M, where M is an upper bound for |ƒ(x)|; this part cannot contribute more than 2M times the small probability that the difference exceeds ε.\nFinally, one observes that the absolute value of the difference between expectations never exceeds the expectation of the absolute value of the difference, and that E(ƒ(K/n)) is just the Bernstein polynomial Bn(ƒ, x).\nSee for instance.[4]", 
    "dbpedia_url": "http://dbpedia.org/resource/Bernstein_polynomial", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Bernstein_polynomial\n"
}