{
    "about": "Bidimensionality theory characterizes a broad range of graph problems (bidimensional) that admit efficient approximate, fixed-parameter or kernel solutions in a broad range of graphs. These graph classes include planar graphs, map graphs, bounded-genus graphs and graphs excluding any fixed minor. In particular, bidimensionality theory builds on the graph minor theory of Robertson and Seymour by extending the mathematical results and building new algorithmic tools. The theory was introduced in the work of Demaine, Fomin, Hajiaghayi, and Thilikos,[1] for which the authors received the Nerode Prize in 2015.", 
    "name": "Bidimensionality", 
    "classification": "Approximation Algorithms", 
    "full_text": "Bidimensionality theory characterizes a broad range of graph problems (bidimensional) that admit efficient approximate, fixed-parameter or kernel solutions in a broad range of graphs. These graph classes include planar graphs, map graphs, bounded-genus graphs and graphs excluding any fixed minor. In particular, bidimensionality theory builds on the graph minor theory of Robertson and Seymour by extending the mathematical results and building new algorithmic tools. The theory was introduced in the work of Demaine, Fomin, Hajiaghayi, and Thilikos,[1] for which the authors received the Nerode Prize in 2015.\n\n\nA parameterized problem \n\n\n\nΠ\n\n\n{\\displaystyle \\Pi }\n\n is a subset of \n\n\n\n\nΓ\n\n∗\n\n\n×\n\nN\n\n\n\n{\\displaystyle \\Gamma ^{*}\\times \\mathbb {N} }\n\n for some finite alphabet \n\n\n\nΓ\n\n\n{\\displaystyle \\Gamma }\n\n. An instance of a parameterized problem consists of (x,k), where k is called the parameter.\nA parameterized problem \n\n\n\nΠ\n\n\n{\\displaystyle \\Pi }\n\n is minor-bidimensional if\nExamples of minor-bidimensional problems are the parameterized versions of vertex cover, feedback vertex set, minimum maximal matching, and longest path.\nLet \n\n\n\n\nΓ\n\nr\n\n\n\n\n{\\displaystyle \\Gamma _{r}}\n\n be the graph obtained from the \n\n\n\n(\nr\n×\nr\n)\n\n\n{\\displaystyle (r\\times r)}\n\n-grid by triangulating internal faces such that all internal vertices become of degree 6, and then one corner of degree two joined by edges with all vertices of the external face. A parameterized problem \n\n\n\nΠ\n\n\n{\\displaystyle \\Pi }\n\n is contraction-bidimensional if\nExamples of contraction-bidimensional problems are dominating set, connected dominating set, max-leaf spanning tree, and edge dominating set.\nAll algorithmic applications of bidimensionality are based on the following combinatorial property: either the treewidth of a graph is small, or the graph contains a large grid as a minor or contraction. More precisely,\nHalin's grid theorem is an analogous excluded grid theorem for infinite graphs.[4]\nLet \n\n\n\nΠ\n\n\n{\\displaystyle \\Pi }\n\n be a minor-bidimensional problem such that for any graph G excluding some fixed graph as a minor and of treewidth at most t, deciding whether \n\n\n\n(\nG\n,\nk\n)\n∈\nΠ\n\n\n{\\displaystyle (G,k)\\in \\Pi }\n\n can be done in time \n\n\n\n\n2\n\nO\n(\nt\n)\n\n\n⋅\n\n|\n\nG\n\n\n|\n\n\nO\n(\n1\n)\n\n\n\n\n{\\displaystyle 2^{O(t)}\\cdot |G|^{O(1)}}\n\n. Then for every graph G excluding some fixed graph as a minor, deciding whether \n\n\n\n(\nG\n,\nk\n)\n∈\nΠ\n\n\n{\\displaystyle (G,k)\\in \\Pi }\n\n can be done in time \n\n\n\n\n2\n\nO\n(\n\n\nk\n\n\n)\n\n\n⋅\n\n|\n\nG\n\n\n|\n\n\nO\n(\n1\n)\n\n\n\n\n{\\displaystyle 2^{O({\\sqrt {k}})}\\cdot |G|^{O(1)}}\n\n. Similarly, for contraction-bidimensional problems, for graph G excluding some fixed apex graph as a minor, inclusion \n\n\n\n(\nG\n,\nk\n)\n∈\nΠ\n\n\n{\\displaystyle (G,k)\\in \\Pi }\n\n can be decided in time \n\n\n\n\n2\n\nO\n(\n\n\nk\n\n\n)\n\n\n⋅\n\n|\n\nG\n\n\n|\n\n\nO\n(\n1\n)\n\n\n\n\n{\\displaystyle 2^{O({\\sqrt {k}})}\\cdot |G|^{O(1)}}\n\n.\nThus many bidimensional problems like Vertex Cover, Dominating Set, k-Path, are solvable in time \n\n\n\n\n2\n\nO\n(\n\n\nk\n\n\n)\n\n\n⋅\n\n|\n\nG\n\n\n|\n\n\nO\n(\n1\n)\n\n\n\n\n{\\displaystyle 2^{O({\\sqrt {k}})}\\cdot |G|^{O(1)}}\n\n on graphs excluding some fixed graph as a minor.\nBidimensionality theory has been used to obtain polynomial-time approximation schemes for many bidimensional problems. If a minor (contraction) bidimensional problem has several additional properties [5][6] then the problem poses efficient polynomial-time approximation schemes on (apex) minor-free graphs.\nIn particular, by making use of bidimensionality, it was shown that feedback vertex set, vertex cover, connected vertex cover, cycle packing, diamond hitting set, maximum induced forest, maximum induced bipartite subgraph and maximum induced planar subgraph admit an EPTAS on H-minor-free graphs. Edge dominating set, dominating set, r-dominating set, connected dominating set, r-scattered set, minimum maximal matching, independent set, maximum full-degree spanning tree, maximum induced at most d-degree subgraph, maximum internal spanning tree, induced matching, triangle packing, partial r-dominating set and partial vertex cover admit an EPTAS on apex-minor-free graphs.\nA parameterized problem with a parameter k is said to admit a linear vertex kernel if there is a polynomial time reduction, called a kernelization algorithm, that maps the input instance to an equivalent instance with at most O(k) vertices.\nEvery minor-bidimensional problem \n\n\n\nΠ\n\n\n{\\displaystyle \\Pi }\n\n with additional properties, namely, with the separation property and with finite integer index, has a linear vertex kernel on graphs excluding some fixed graph as a minor. Similarly, every contraction-bidimensional problem \n\n\n\nΠ\n\n\n{\\displaystyle \\Pi }\n\n with the separation property and with finite integer index has a linear vertex kernel on graphs excluding some fixed apex graph as a minor.[7]", 
    "dbpedia_url": "http://dbpedia.org/resource/Bidimensionality", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Bidimensionality\n"
}