{
    "about": "Bilinear time–frequency distributions, or quadratic time–frequency distributions, arise in a sub-field of signal analysis and signal processing called time–frequency signal processing, and, in the statistical analysis of time series data. Such methods are used where one needs to deal with a situation where the frequency composition of a signal may be changing over time;[1] this sub-field used to be called time–frequency signal analysis, and is now more often called time–frequency signal processing due to the progress in using these methods to a wide range of signal-processing problems.", 
    "name": "Bilinear Time–Frequency Distribution", 
    "classification": "Digital Signal Processing", 
    "full_text": "Bilinear time–frequency distributions, or quadratic time–frequency distributions, arise in a sub-field of signal analysis and signal processing called time–frequency signal processing, and, in the statistical analysis of time series data. Such methods are used where one needs to deal with a situation where the frequency composition of a signal may be changing over time;[1] this sub-field used to be called time–frequency signal analysis, and is now more often called time–frequency signal processing due to the progress in using these methods to a wide range of signal-processing problems.\n\n\nMethods for analysing time series, in both signal analysis and time series analysis, have been developed as essentially separate methodologies applicable to, and based in, either the time or the frequency domain. A mixed approach is required in time–frequency analysis techniques which are especially effective in analyzing non-stationary signals, whose frequency distribution and magnitude vary with time. Examples of these are acoustic signals. Classes of \"quadratic time-frequency distributions\" (or bilinear time–frequency distributions\") are used for time–frequency signal analysis. This class is similar in formulation to Cohen's class distribution function that was used in 1966 in the context of quantum mechanics. This distribution function is mathematically similar to a generalized time–frequency representation which utilizes bilinear transformations. Compared with other time–frequency analysis techniques, such as short-time Fourier transform (STFT), the bilinear-transformation (or quadratic time–frequency distributions) may not have higher clarity for most practical signals, but it provides an alternative framework to investigate new definitions and new methods. While it does suffer from an inherent cross-term contamination when analyzing multi-component signals, by using a carefully chosen window function(s), the interference can be significantly mitigated, at the expense of resolution. All these bilinear distributions are inter-convertible to each other, cf. transformation between distributions in time–frequency analysis.\nThe Wigner–Ville distribution is a quadratic form that measures a local time-frequency energy given by:\nThe Wigner–Ville distribution remains real as it is the fourier transform of f(u + τ/2)·f*(u − τ/2), which has Hermitian symmetry in τ. It can also be written as a frequency integration by applying the Parseval formula:\nLet \n\n\n\nf\n=\n\nf\n\n1\n\n\n+\n\nf\n\n2\n\n\n\n\n{\\displaystyle f=f_{1}+f_{2}}\n\n be a composite signal. We can then write,\nwhere\nis the cross Wigner–Ville distribution of two signals. The interference term\nis a real function that creates non-zero values at unexpected locations(close to the origin) in the \n\n\n\n(\nu\n,\nξ\n)\n\n\n{\\displaystyle (u,\\xi )}\n\n plane. Interference terms present in a real signal can be avoided by computing the analytic part \n\n\n\n\nf\n\na\n\n\n(\nt\n)\n\n\n{\\displaystyle f_{a}(t)}\n\n.\nThe interference terms are oscillatory since the marginal integrals vanish and can be partially removed by smoothing \n\n\n\n\nP\n\nV\n\n\nf\n\n\n{\\displaystyle P_{V}f}\n\n with a kernel θ\nThe time-frequency resolution of this distribution depends on the spread of kernel θ in the neighborhood of \n\n\n\n(\nu\n,\nξ\n)\n\n\n{\\displaystyle (u,\\xi )}\n\n. Since the interferences take negative values, one can guarantee that all interferences are removed by imposing that\nThe spectrogram and scalogram are examples of positive time-frequency energy distributions. Let a linear transform \n\n\n\nT\nf\n(\nγ\n)\n=\n\n⟨\nf\n,\n\nϕ\n\nγ\n\n\n⟩\n\n\n\n{\\displaystyle Tf(\\gamma )=\\left\\langle f,\\phi _{\\gamma }\\right\\rangle }\n\n be defined over a family of time-frequency atoms \n\n\n\n\n\n{\n\nϕ\n\nγ\n\n\n}\n\n\nγ\n∈\nΓ\n\n\n\n\n{\\displaystyle \\left\\{\\phi _{\\gamma }\\right\\}_{\\gamma \\in \\Gamma }}\n\n. For any \n\n\n\n(\nu\n,\nξ\n)\n\n\n{\\displaystyle (u,\\xi )}\n\n there exists a unique atom \n\n\n\n\nϕ\n\nγ\n(\nu\n,\nξ\n)\n\n\n\n\n{\\displaystyle \\phi _{\\gamma (u,\\xi )}}\n\n centered in time-frequency at \n\n\n\n(\nu\n,\nξ\n)\n\n\n{\\displaystyle (u,\\xi )}\n\n. The resulting time-frequency energy density is\nFrom the Moyal formula,\nwhich is the time frequency averaging of a Wigner–Ville distribution. The smoothing kernel thus can be written as\nThe loss of time-frequency resolution depends on the spread of the distribution \n\n\n\n\nP\n\nV\n\n\n\nϕ\n\nγ\n(\nu\n,\nξ\n)\n\n\n(\n\nu\n′\n\n,\n\nξ\n′\n\n)\n\n\n{\\displaystyle P_{V}\\phi _{\\gamma (u,\\xi )}(u',\\xi ')}\n\n in the neighborhood of \n\n\n\n(\nu\n,\nξ\n)\n\n\n{\\displaystyle (u,\\xi )}\n\n.\nA spectrogram computed with windowed fourier atoms,\nFor a spectrogram, the Wigner–Ville averaging is therefore a 2-dimensional convolution with \n\n\n\n\nP\n\nV\n\n\ng\n\n\n{\\displaystyle P_{V}g}\n\n. If g is a Gaussian window,\n\n\n\n\nP\n\nV\n\n\ng\n\n\n{\\displaystyle P_{V}g}\n\n is a 2-dimensional Gaussian. This proves that averaging \n\n\n\n\nP\n\nV\n\n\nf\n\n\n{\\displaystyle P_{V}f}\n\n with a sufficiently wide Gaussian defines positive energy density. The general class of time-frequency distributions obtained by convolving \n\n\n\n\nP\n\nV\n\n\nf\n\n\n{\\displaystyle P_{V}f}\n\n with an arbitrary kernel θ is called a Cohen's class, discussed below.\nWigner Theorem. There is no positive quadratic energy distribution Pf that satisfies the following time and frequency marginal integrals:\nThe definition of Cohen's class of bilinear (or quadratic) time–frequency distributions is as follows:\nwhere \n\n\n\n\nA\n\nx\n\n\n(\nη\n,\nτ\n)\n\n\n{\\displaystyle A_{x}(\\eta ,\\tau )}\n\n is the ambiguity function (AF), which will be discussed later; and \n\n\n\nΦ\n(\nη\n,\nτ\n)\n\n\n{\\displaystyle \\Phi (\\eta ,\\tau )}\n\n is Cohen's kernel function, which is often a low-pass function, and normally serves to mask out the interference in the original Wigner representation, \n\n\n\nΦ\n≡\n1\n\n\n{\\displaystyle \\Phi \\equiv 1}\n\n.\nAn equivalent definition relies on a convolution of the Wigner distribution function (WD) instead of the AF :\nwhere the kernel function \n\n\n\nΠ\n(\nt\n,\nf\n)\n\n\n{\\displaystyle \\Pi (t,f)}\n\n is defined in the time-frequency domain instead of the ambiguity one. In the original Wigner representation, \n\n\n\nΠ\n=\n\nδ\n\n(\n0\n,\n0\n)\n\n\n\n\n{\\displaystyle \\Pi =\\delta _{(0,0)}}\n\n. The relationship between the two kernels is the same as the one between the WD and the AF, namely two successive Fourier transforms (cf. diagram).\ni.e.\nor equivalently\nThe class of bilinear (or quadratic) time–frequency distributions can be most easily understood in terms of the ambiguity function, an explanation of which follows.\nConsider the well known power spectral density \n\n\n\n\nP\n\nx\n\n\n(\nf\n)\n\n\n{\\displaystyle P_{x}(f)}\n\n and the signal auto-correlation function \n\n\n\n\nR\n\nx\n\n\n(\nτ\n)\n\n\n{\\displaystyle R_{x}(\\tau )}\n\n in the case of a stationary process. The relationship between these functions is as follows:\nFor a non-stationary signal \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n, these relations can be generalized using a time-dependent power spectral density or equivalently the famous Wigner distribution function of \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n as follows:\nIf the Fourier transform of the auto-correlation function is taken with respect to t instead of τ, we get the ambiguity function as follows:\nThe relationship between the Wigner distribution function, the auto-correlation function and the ambiguity function can then be illustrated by the following figure.\nBy comparing the definition of bilinear (or quadratic) time–frequency distributions with that of the Wigner distribution function, it is easily found that the latter is a special case of the former with \n\n\n\nΦ\n(\nη\n,\nτ\n)\n=\n1\n\n\n{\\displaystyle \\Phi (\\eta ,\\tau )=1}\n\n. Alternatively, bilinear (or quadratic) time–frequency distributions can be regarded as a masked version of the Wigner distribution function if a kernel function \n\n\n\nΦ\n(\nη\n,\nτ\n)\n≠\n1\n\n\n{\\displaystyle \\Phi (\\eta ,\\tau )\\neq 1}\n\n is chosen. A properly chosen kernel function can significantly reduce the undesirable cross-term of the Wigner distribution function.\nWhat is the benefit of the additional kernel function? The following figure shows the distribution of the auto-term and the cross-term of a multi-component signal in both the ambiguity and the Wigner distribution function.\nFor multi-component signals in general, the distribution of its auto-term and cross-term within its Wigner distribution function is generally not predictable, and hence the cross-term cannot be removed easily. However, as shown in the figure, for the ambiguity function, the auto-term of the multi-component signal will inherently tend to close the origin in the ητ-plane, and the cross-term will tend to be away from the origin. With this property, the cross-term in can be filtered out effortlessly if a proper low-pass kernel function is applied in ητ-domain. The following is an example that demonstrates how the cross-term is filtered out.\nThe Fourier transform of \n\n\n\nθ\n(\nu\n,\nξ\n)\n\n\n{\\displaystyle \\theta (u,\\xi )}\n\n is\nThe following proposition gives necessary and sufficient conditions to ensure that \n\n\n\n\nP\n\nθ\n\n\n\n\n{\\displaystyle P_{\\theta }}\n\n satisfies marginal energy properties like those of the Wigner–Ville distribution.\nAforementioned, the Wigner distribution function is a member of the class of quadratic time-frequency distributions (QTFDs) with the kernel function \n\n\n\nΦ\n(\nη\n,\nτ\n)\n=\n1\n\n\n{\\displaystyle \\Phi (\\eta ,\\tau )=1}\n\n. The definition of Wigner distribution is as follows:\nWe can design time-frequency energy distributions that satisfy the scaling property\nas does the Wigner–Ville distribution. If\nthen\nThis is equivalent to imposing that\nand hence\nThe Rihaczek and Choi–Williams distributions are examples of affine invariant Cohen's class distributions.\nThe kernel of Choi–Williams distribution is defined as follows:\nwhere α is an adjustable parameter.\nThe kernel of Rihaczek distribution is defined as follows:\nWith this particular kernel a simple calculation proves that\nThe kernel of cone-shape distribution function is defined as follows:\nwhere α is an adjustable parameter. See Transformation between distributions in time-frequency analysis. More such QTFDs and a full list can be found in, e.g., Cohen's text cited.\nA time-varying spectrum for non-stationary processes is defined from the expected Wigner–Ville distribution. Locally stationary processes appear in many physical systems where random fluctuations are produced by a mechanism that changes slowly in time. Such processes can be approximated locally by a stationary process. Let \n\n\n\nX\n(\nt\n)\n\n\n{\\displaystyle X(t)}\n\n be a real valued zero-mean process with covariance\nThe covariance operator K is defined for any deterministic signal \n\n\n\nf\n∈\n\nL\n\n2\n\n\n(\n\nR\n\n)\n\n\n{\\displaystyle f\\in L^{2}(\\mathbf {R} )}\n\n by\nFor locally stationary processes, the eigenvectors of K are well approximated by the Wigner–Ville spectrum.\nThe properties of the covariance \n\n\n\nR\n(\nt\n,\ns\n)\n\n\n{\\displaystyle R(t,s)}\n\n are studied as a function of \n\n\n\nτ\n=\nt\n−\ns\n\n\n{\\displaystyle \\tau =t-s}\n\n and \n\n\n\nu\n=\n\n\n\nt\n+\ns\n\n2\n\n\n\n\n{\\displaystyle u={\\frac {t+s}{2}}}\n\n:\nThe process is wide-sense stationary if the covariance depends only on \n\n\n\nτ\n=\nt\n−\ns\n\n\n{\\displaystyle \\tau =t-s}\n\n:\nThe eigenvectors are the complex exponentials \n\n\n\n\ne\n\ni\nω\nt\n\n\n\n\n{\\displaystyle e^{i\\omega t}}\n\n and the corresponding eigenvalues are given by the power spectrum\nFor non-stationary processes, Martin and Flandrin have introduced a time-varying spectrum\nTo avoid convergence issues we suppose that X has compact support so that \n\n\n\nC\n(\nu\n,\nτ\n)\n\n\n{\\displaystyle C(u,\\tau )}\n\n has compact support in \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n. From above we can write\nwhich proves that the time varying spectrum is the expected value of the Wigner–Ville transform of the process X. Here, the Wigner–Ville stochastic integral is interpreted as a mean-square integral:[2]", 
    "dbpedia_url": "http://dbpedia.org/resource/Bilinear_time–frequency_distribution", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Bilinear_time–frequency_distribution\n"
}