{
    "about": "A bin-centres test signal is one which has been constructed such that it has frequency components at FFT bin-centre frequencies. This allows analysis without an FFT window function on a synchronous measurement system.", 
    "classification": "Digital Signal Processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Bin-centres\n", 
    "full_text": "A bin-centres test signal is one which has been constructed such that it has frequency components at FFT bin-centre frequencies. This allows analysis without an FFT window function on a synchronous measurement system.\n\n\nWhen performing FFT-based spectral measurements, traditionally a window function has been used to reduce the effects of discontinuities at the ends of the FFT buffer, but these result in spectral leakage. When generating a single frequency test signal for FFT analysis, it is possible to create the frequency such that it aligns perfectly within an FFT bin-centre frequency. These frequencies are multiples of the frequency resolution of the FFT, given by the sample rate divided by the number of sample points. This results in no spectral leakage and all the power from the signal is present in only one FFT bin. Viewed in the time domain, a sine wave will fit in the centre of an FFT bin if it has a complete number of cycles within the length of the sample buffer. Such signals can be analysed without an FFT window function provided the system is synchronous (i.e., the signal generation and analysis are using the same clock source.) It follows that a stimulus can be constructed of many sine waves (as many as there are FFT bins) and the signal can still be analysed without an FFT window function. This is called multitone analysis. The amplitude and phase of these sine components can be freely adjusted in order to construct a signal with a particular frequency response characteristic.\nThe usage of bin-centre analysis techniques is mathematically inherent in FFT spectral analysis. Where it has changed has been with the introduction of digital spectral analysis systems capable of generating such signals and analysing them in a synchronous system. Within the world of audio frequency testing, traditionally single sine waves or noise signals have been used.\nIn order to measure a frequency response with a sine wave, the signal would have to be swept through the frequencies of interest in discrete steps, allowing time for it to settle while making a measurement of its amplitude at each step. Using a noise signal which is inherently random requires considerable averaging in order to get a clear idea of a trend. In addition, creation of weighted noise signals in the time domain presents many challenges.\nA bin-centres signal can give a frequency response with thousands of frequency points from a single capture of an FFT buffer and requires no averaging. Creation of stimuli that have specific spectral characteristics is also possible.", 
    "name": "Bin Centres"
}