{
    "about": "In mathematics and electronics engineering, a binary Golay code is a type of linear error-correcting code used in digital communications. The binary Golay code, along with the ternary Golay code, has a particularly deep and interesting connection to the theory of finite sporadic groups in mathematics.[1] These codes are named in honor of Marcel J. E. Golay whose 1949 paper [2] introducing them has been called, by E. R. Berlekamp, the \"best single published page\" in coding theory.[3]", 
    "name": "Binary Golay Code", 
    "classification": "Error Detection And Correction", 
    "full_text": "In mathematics and electronics engineering, a binary Golay code is a type of linear error-correcting code used in digital communications. The binary Golay code, along with the ternary Golay code, has a particularly deep and interesting connection to the theory of finite sporadic groups in mathematics.[1] These codes are named in honor of Marcel J. E. Golay whose 1949 paper [2] introducing them has been called, by E. R. Berlekamp, the \"best single published page\" in coding theory.[3]\nThere are two closely related binary Golay codes. The extended binary Golay code, G24 (sometimes just called the \"Golay code\" in finite group theory) encodes 12 bits of data in a 24-bit word in such a way that any 3-bit errors can be corrected or any 7-bit errors can be detected. The other, the perfect binary Golay code, G23, has codewords of length 23 and is obtained from the extended binary Golay code by deleting one coordinate position (conversely, the extended binary Golay code is obtained from the perfect binary Golay code by adding a parity bit). In standard code notation the codes have parameters [24, 12, 8] and [23, 12, 7], corresponding to the length of the codewords, the dimension of the code, and the minimum Hamming distance between two codewords, respectively.\n\n\nIn mathematical terms, the extended binary Golay code G24 consists of a 12-dimensional linear subspace W of the space V=F224 of 24-bit words such that any two distinct elements of W differ in at least 8 coordinates. W is called a linear code because it is a vector space. In all, W comprises 4096 = 212 elements.\nThe binary Golay code, G23 is a perfect code. That is, the spheres of radius three around code words form a partition of the vector space. G23 is a 12-dimensional subspace of the space F223.\nThe automorphism group of the perfect binary Golay code, G23, is the Mathieu group \n\n\n\n\nM\n\n23\n\n\n\n\n{\\displaystyle M_{23}}\n\n. The automorphism group of the extended binary Golay code is the Mathieu group \n\n\n\n\nM\n\n24\n\n\n\n\n{\\displaystyle M_{24}}\n\n, of order 210*33*5*7*11*23. \n\n\n\n\nM\n\n24\n\n\n\n\n{\\displaystyle M_{24}}\n\n is transitive on octads and on dodecads. The other Mathieu groups occur as stabilizers of one or several elements of W.\nIt is convenient to use the \"Miracle Octad Generator\" format, with co-ordinates in an array of 4 rows, 6 columns. Addition is taking the symmetric difference. All 6 columns have the same parity, which equals that of the top row.\nA partition of the 6 columns into 3 pairs of adjacent ones constitutes a trio. This is a partition into 3 octad sets. A subgroup, the projective special linear group PSL(2,7) x S3 of a trio subgroup of M24 is useful for generating a basis. PSL(2,7) permutes the octads internally, in parallel. S3 permutes the 3 octads bodily.\nThe basis begins with octad T:\nand 5 similar octads. The sum N of all 6 of these code words consists of all 1's. Adding N to a code word produces its complement.\nGriess (p. 59) uses the labeling:\nPSL(2,7) is naturally the linear fractional group generated by (0123456) and (0∞)(16)(23)(45). The 7-cycle acts on T to give a subspace including also the basis elements\nand\nThe resulting 7-dimensional subspace has a 3-dimensional quotient space upon ignoring the latter 2 octads.\nThere are 4 other code words of similar structure that complete the basis of 12 code words for this representation of W.\nIt should be noted that W has a subspace of dimension 4, symmetric under PSL(2,7) x S3, spanned by N and 3 dodecads formed of subsets {0,3,5,6}, {0,1,4,6}, and {0,1,2,5}.\nThe Voyager 1 and 2 spacecraft needed to transmit hundreds of color pictures of Jupiter and Saturn in their 1979, 1980, and 1981 fly-by's within a constrained telecommunications bandwidth.\nThe new[when?] American government standards for automatic link establishment in high frequency radio systems specify the use of an extended (24,12) Golay block code for forward error correction (FEC).\nThe minimum Hamming distance between any two code words (the number of bits by which any pair of code words differs) is eight.\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Binary_Golay_code", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Binary_Golay_code\n"
}