{
    "about": "Bitonic mergesort is a parallel algorithm for sorting. It is also used as a construction method for building a sorting network. The algorithm was devised by Ken Batcher. The resulting sorting networks consist of \n\n\n\nO\n(\nn\n\nlog\n\n2\n\n\n⁡\n(\nn\n)\n)\n\n\n{\\displaystyle O(n\\log ^{2}(n))}\n\n comparators and have a delay of \n\n\n\nO\n(\n\nlog\n\n2\n\n\n⁡\n(\nn\n)\n)\n\n\n{\\displaystyle O(\\log ^{2}(n))}\n\n, where \n\n\n\nn\n\n\n{\\displaystyle n}\n\n is the number of items to be sorted.[1]", 
    "name": "Bitonic Sorter", 
    "classification": "Sorting Algorithms", 
    "full_text": "Bitonic mergesort is a parallel algorithm for sorting. It is also used as a construction method for building a sorting network. The algorithm was devised by Ken Batcher. The resulting sorting networks consist of \n\n\n\nO\n(\nn\n\nlog\n\n2\n\n\n⁡\n(\nn\n)\n)\n\n\n{\\displaystyle O(n\\log ^{2}(n))}\n\n comparators and have a delay of \n\n\n\nO\n(\n\nlog\n\n2\n\n\n⁡\n(\nn\n)\n)\n\n\n{\\displaystyle O(\\log ^{2}(n))}\n\n, where \n\n\n\nn\n\n\n{\\displaystyle n}\n\n is the number of items to be sorted.[1]\nA sorted sequence is a monotonically non-decreasing (or non-increasing) sequence. A bitonic sequence is a sequence with \n\n\n\n\nx\n\n0\n\n\n≤\n⋯\n≤\n\nx\n\nk\n\n\n≥\n⋯\n≥\n\nx\n\nn\n−\n1\n\n\n\n\n{\\displaystyle x_{0}\\leq \\cdots \\leq x_{k}\\geq \\cdots \\geq x_{n-1}}\n\n for some \n\n\n\nk\n,\n0\n≤\nk\n<\nn\n\n\n{\\displaystyle k,0\\leq k<n}\n\n, or a circular shift of such a sequence.\n\n\nThe following is a bitonic sorting network with 16 inputs:\n\nThe 16 numbers enter at the inputs at the left end, slide along each of the 16 horizontal wires, and exit at the outputs at the right end. The network is designed to sort the elements, with the largest number at the bottom.\nThe arrows are comparators. Whenever two numbers reach the two ends of an arrow, they are compared to ensure that the arrow points toward the larger number. If they are out of order, they are swapped. The colored boxes are just for illustration and have no effect on the algorithm.\nEvery red box has the same structure: each input in the top half is compared to the corresponding input in the bottom half, with all arrows pointing down (dark red) or all up (light red). If the inputs happen to form a bitonic sequence, then the output will form two bitonic sequences. The top half of the output will be bitonic, and the bottom half will be bitonic, with every element of the top half less than or equal to every element of the bottom half (for dark red) or vice versa (for light red). This theorem is not obvious, but can be verified by carefully considering all the cases of how the various inputs might compare, using the zero-one principle.\nThe red boxes combine to form blue and green boxes. Every such box has the same structure: a red box is applied to the entire input sequence, then to each half of the result, then to each half of each of those results, and so on. All arrows point down (blue) or all point up (green). This structure is known as a butterfly network. If the input to this box happens to be bitonic, then the output will be completely sorted in increasing order (blue) or decreasing order (green). If a number enters the blue or green box, then the first red box will sort it into the correct half of the list. It will then pass through a smaller red box that sorts it into the correct quarter of the list within that half. This continues until it is sorted into exactly the correct position. Therefore, the output of the green or blue box will be completely sorted.\nThe green and blue boxes combine to form the entire sorting network. For any arbitrary sequence of inputs, it will sort them correctly, with the largest at the bottom. The output of each green or blue box will be a sorted sequence, so the output of each pair of adjacent lists will be bitonic, because the top one is blue and the bottom one is green. Each column of blue and green boxes takes N sorted sequences and concatenates them in pairs to form N/2 bitonic sequences, which are then sorted by the boxes in that column to form N/2 sorted sequences. This process starts with each input considered to be a sorted list of one element, and continues through all the columns until the last merges them into a single, sorted list. Because the last stage was blue, this final list will have the largest element at the bottom.\nEach green box performs the same operation as a blue box, but with the sort in the opposite direction. So, each green box could be replaced by a blue box followed by a crossover where all the wires move to the opposite position. This would allow all the arrows to point the same direction, but would prevent the horizontal lines from being straight. However, a similar crossover could be placed to the right of the bottom half of the outputs from any red block, and the sort would still work correctly, because the reverse of a bitonic sequence is still bitonic. If a red box then has a crossover before and after it, it can be rearranged internally so the two crossovers cancel, so the wires become straight again. Therefore, the following diagram is equivalent to the one above, where each green box has become a blue plus a crossover, and each orange box is a red box that absorbed two such crossovers:\n\nThe arrowheads are not drawn, because every comparator sorts in the same direction. The blue and red blocks perform the same operations as before. The orange blocks are equivalent to red blocks where the sequence order is reversed for the bottom half of its inputs and the bottom half of its outputs. This is the most common representation of a bitonic sorting network\nThe following is an implementation of the bitonic mergesort sorting algorithm in Python. The input is a boolean value up, and a list x of length a power of 2. The output is a sorted list that is ascending if up is true, and decreasing otherwise.\n\nThe following is another implementation in Java.", 
    "dbpedia_url": "http://dbpedia.org/resource/Bitonic_sorter", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Bitonic_sorter\n"
}