{
    "about": "Blind equalization is a digital signal processing technique in which the transmitted signal is inferred (equalized) from the received signal, while making use only of the transmitted signal statistics. Hence, the use of the word blind in the name.", 
    "name": "Blind Equalization", 
    "classification": "Signal Processing", 
    "full_text": "Blind equalization is a digital signal processing technique in which the transmitted signal is inferred (equalized) from the received signal, while making use only of the transmitted signal statistics. Hence, the use of the word blind in the name.\nBlind equalization is essentially blind deconvolution applied to digital communications. Nonetheless, the emphasis in blind equalization is on online estimation of the equalization filter, which is the inverse of the channel impulse response, rather than the estimation of the channel impulse response itself. This is due to blind deconvolution common mode of usage in digital communications systems, as a mean to extract the continuously transmitted signal from the received signal, with the channel impulse response being of secondary intrinsic importance.\nThe estimated equalizer is then convolved with the received signal to yield an estimation of the transmitted signal.\n\n\nAssuming a linear time invariant channel with impulse response \n\n\n\n{\nh\n[\nn\n]\n\n}\n\nn\n=\n−\n∞\n\n\n∞\n\n\n\n\n{\\displaystyle \\{h[n]\\}_{n=-\\infty }^{\\infty }}\n\n, the noiseless model relates the received signal \n\n\n\nr\n[\nk\n]\n\n\n{\\displaystyle r[k]}\n\n to the transmitted signal \n\n\n\ns\n[\nk\n]\n\n\n{\\displaystyle s[k]}\n\n via\nThe blind equalization problem can now be formulated as follows; Given the received signal \n\n\n\nr\n[\nk\n]\n\n\n{\\displaystyle r[k]}\n\n, find a filter \n\n\n\nw\n[\nk\n]\n\n\n{\\displaystyle w[k]}\n\n, called an equalization filter, such that\nwhere \n\n\n\n\n\n\ns\n^\n\n\n\n\n\n{\\displaystyle {\\hat {s}}}\n\n is an estimation of \n\n\n\ns\n\n\n{\\displaystyle s}\n\n. The solution \n\n\n\n\n\n\ns\n^\n\n\n\n\n\n{\\displaystyle {\\hat {s}}}\n\n to the blind equalization problem is not unique. In fact, it may be determined only up to a signed scale factor and an arbitrary time delay. That is, if \n\n\n\n{\n\n\n\ns\n~\n\n\n\n[\nn\n]\n,\n\n\n\nh\n~\n\n\n\n[\nn\n]\n}\n\n\n{\\displaystyle \\{{\\tilde {s}}[n],{\\tilde {h}}[n]\\}}\n\n are estimations of the transmitted signal and channel impulse response, respectively, then \n\n\n\n{\nc\n\n\n\ns\n~\n\n\n\n[\nn\n+\nd\n]\n,\n\n\n\nh\n~\n\n\n\n[\nn\n−\nd\n]\n\n/\n\nc\n}\n\n\n{\\displaystyle \\{c{\\tilde {s}}[n+d],{\\tilde {h}}[n-d]/c\\}}\n\n give rise to the same received signal \n\n\n\nr\n\n\n{\\displaystyle r}\n\n for any real scale factor \n\n\n\nc\n\n\n{\\displaystyle c}\n\n and integral time delay \n\n\n\nd\n\n\n{\\displaystyle d}\n\n. In fact, by symmetry, the roles of \n\n\n\ns\n\n\n{\\displaystyle s}\n\n and \n\n\n\nh\n\n\n{\\displaystyle h}\n\n are Interchangeable.\nIn the noisy model, an additional term, \n\n\n\nn\n[\nk\n]\n\n\n{\\displaystyle n[k]}\n\n, representing additive noise, is included. The model is therefore\nMany algorithms for the solution of the blind equalization problem have been suggested over the years. However, as one usually has access to only a finite number of samples from the received signal \n\n\n\nr\n(\nt\n)\n\n\n{\\displaystyle r(t)}\n\n, further restrictions must be imposed over the above models to render the blind equalization problem tractable. One such assumption, common to all algorithms described below is to assume that the channel has finite impulse response, \n\n\n\n{\nh\n[\nn\n]\n\n}\n\nn\n=\n−\nN\n\n\nN\n\n\n\n\n{\\displaystyle \\{h[n]\\}_{n=-N}^{N}}\n\n, where \n\n\n\nN\n\n\n{\\displaystyle N}\n\n is an arbitrary natural number.\nThis assumption may be justified on physical grounds, since the energy of any real signal must be finite, and therefore its impulse response must tend to zero. Thus it may be assumed that all coefficients beyond a certain point are negligibly small.\nIf the channel impulse response is assumed to be minimum phase, the problem becomes trivial.\nBussgang methods make use of the Least mean squares filter algorithm\nwith\nwhere \n\n\n\nμ\n\n\n{\\displaystyle \\mu }\n\n is an appropriate positive adaptation step and \n\n\n\n\ng\n\n\n\n{\\displaystyle \\mathbf {g} }\n\n is a suitable nonlinear function.\n\nPolyspectra techniques utilize higher order statistics in order to compute the equalizer.\n[1] C. RICHARD JOHNSON, JR., et. el., \"Blind Equalization Using the Constant Modulus Criterion: A Review\", PROCEEDINGS OF THE IEEE, VOL. 86, NO. 10, OCTOBER 1998.", 
    "dbpedia_url": "http://dbpedia.org/resource/Blind_equalization", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Blind_equalization\n"
}