{
    "about": "Blind signal separation (BSS), also known as blind source separation, is the separation of a set of source signals from a set of mixed signals, without the aid of information (or with very little information) about the source signals or the mixing process. This problem is in general highly underdetermined, but useful solutions can be derived under a surprising variety of conditions. Much of the early literature in this field focuses on the separation of temporal signals such as audio. However, blind signal separation is now routinely performed on multidimensional data, such as images and tensors, which may involve no time dimension whatsoever.", 
    "name": "Blind Signal Separation", 
    "classification": "Signal Processing", 
    "full_text": "Blind signal separation (BSS), also known as blind source separation, is the separation of a set of source signals from a set of mixed signals, without the aid of information (or with very little information) about the source signals or the mixing process. This problem is in general highly underdetermined, but useful solutions can be derived under a surprising variety of conditions. Much of the early literature in this field focuses on the separation of temporal signals such as audio. However, blind signal separation is now routinely performed on multidimensional data, such as images and tensors, which may involve no time dimension whatsoever.\n\n\nThe set of individual source signals, \n\n\n\ns\n(\nt\n)\n=\n(\n\ns\n\n1\n\n\n(\nt\n)\n,\n…\n,\n\ns\n\nn\n\n\n(\nt\n)\n\n)\n\nT\n\n\n\n\n{\\displaystyle s(t)=(s_{1}(t),\\dots ,s_{n}(t))^{T}}\n\n, is 'mixed' using a matrix, \n\n\n\nA\n=\n[\n\na\n\ni\nj\n\n\n]\n∈\n\n\nR\n\n\nm\n×\nn\n\n\n\n\n{\\displaystyle A=[a_{ij}]\\in \\mathbb {R} ^{m\\times n}}\n\n, to produce a set of 'mixed' signals, \n\n\n\nx\n(\nt\n)\n=\n(\n\nx\n\n1\n\n\n(\nt\n)\n,\n…\n,\n\nx\n\nm\n\n\n(\nt\n)\n\n)\n\nT\n\n\n\n\n{\\displaystyle x(t)=(x_{1}(t),\\dots ,x_{m}(t))^{T}}\n\n, as follows. Usually, \n\n\n\nn\n\n\n{\\displaystyle n}\n\n is equal to \n\n\n\nm\n\n\n{\\displaystyle m}\n\n. If \n\n\n\nm\n>\nn\n\n\n{\\displaystyle m>n}\n\n, then the system of equations is overdetermined can thus can be unmixed using a conventional linear method. If \n\n\n\nn\n>\nm\n\n\n{\\displaystyle n>m}\n\n, the system is underdetermined and a non-linear method must be employed to recover the unmixed signals. The signals themselves can be multidimensional.\n\n\n\n\nx\n(\nt\n)\n=\nA\n⋅\ns\n(\nt\n)\n\n\n{\\displaystyle x(t)=A\\cdot s(t)}\n\n\nThe above equation is effectively 'inverted' as follows. Blind source separation separates the set of mixed signals, \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n, through the determination of an 'unmixing' matrix, \n\n\n\nB\n=\n[\n\nB\n\ni\nj\n\n\n]\n∈\n\n\nR\n\n\nn\n×\nm\n\n\n\n\n{\\displaystyle B=[B_{ij}]\\in \\mathbb {R} ^{n\\times m}}\n\n, to 'recover' an approximation of the original signals, \n\n\n\ny\n(\nt\n)\n=\n(\n\ny\n\n1\n\n\n(\nt\n)\n,\n…\n,\n\ny\n\nn\n\n\n(\nt\n)\n\n)\n\nT\n\n\n\n\n{\\displaystyle y(t)=(y_{1}(t),\\dots ,y_{n}(t))^{T}}\n\n.[1][2]\n\n\n\n\ny\n(\nt\n)\n=\nB\n⋅\nx\n(\nt\n)\n\n\n{\\displaystyle y(t)=B\\cdot x(t)}\n\n\nAt a cocktail party, there is a group of people talking at the same time. You have multiple microphones picking up mixed signals, but you want to isolate the speech of a single person. BSS can be used to separate the individual sources by using mixed signals.[3]\nIn Figure 2, it shows the basic concept of BSS. The individual source signals are shown as well as the mixed signals which are received signals. BSS is used to separate the mixed signals with only knowing mixed signals and nothing about original signal or how they were mixed. The separated signals are only approximations of the source signals. The separated images, were separated using Python and the Shogun toolbox using Joint Approximation Diagonalization of Eigen-matrices (JADE) algorithm which is based off Independent component analysis, ICA.[4] This toolbox method can be used with multi-dimensions but for an easy visual aspect images(2-D) were used.\nBrain imaging is another ideal application for BSS. In electroencephalogram (EEG) and Magnetoencephalography (MEG), the interference from muscle activity masks the desired signal from brain activity. BSS, however, can be used to separate the two so an accurate representation of brain activity may be achieved.[3]\nOther applications:[3]\nSince the chief difficulty of the problem is its underdetermination, methods for blind source separation generally seek to narrow the set of possible solutions in a way that is unlikely to exclude the desired solution. In one approach, exemplified by principal and independent component analysis, one seeks source signals that are minimally correlated or maximally independent in a probabilistic or information-theoretic sense. A second approach, exemplified by nonnegative matrix factorization, is to impose structural constraints on the source signals. These structural constraints may be derived from a generative model of the signal, but are more commonly heuristics justified by good empirical performance. A common theme in the second approach is to impose some kind of low-complexity constraint on the signal, such as sparsity in some basis for the signal space. This approach can be particularly effective if one requires not the whole signal, but merely its most salient features.\nThere are different methods of blind signal separation:", 
    "dbpedia_url": "http://dbpedia.org/resource/Blind_signal_separation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Blind_signal_separation\n"
}