{
    "about": "In electrical engineering and applied mathematics, blind deconvolution is deconvolution without explicit knowledge of the impulse response function used in the convolution. In microscopy the term is used to describe deconvolution without knowledge of the microscopes point spread function. This is usually achieved by making appropriate assumptions of the input to estimate the impulse response by analyzing the output.", 
    "name": "Blind Deconvolution", 
    "classification": "Signal Processing", 
    "full_text": "In electrical engineering and applied mathematics, blind deconvolution is deconvolution without explicit knowledge of the impulse response function used in the convolution. In microscopy the term is used to describe deconvolution without knowledge of the microscopes point spread function. This is usually achieved by making appropriate assumptions of the input to estimate the impulse response by analyzing the output.\n\n\nIn image processing, blind deconvolution is a deconvolution technique that permits recovery of the target scene from a single or set of \"blurred\" images in the presence of a poorly determined or unknown point spread function (PSF). [2] Regular linear and non-linear deconvolution techniques utilize a known PSF. For blind deconvolution, the PSF is estimated from the image or image set, allowing the deconvolution to be performed. Researchers have been studying blind deconvolution methods for several decades, and have approached the problem from different directions.\nBlind deconvolution can be performed iteratively, whereby each iteration improves the estimation of the PSF and the scene, or non-iteratively, where one application of the algorithm, based on exterior information, extracts the PSF. Iterative methods include maximum a posteriori estimation and expectation-maximization algorithms. A good estimate of the PSF is helpful for quicker convergence but not necessary.\nExamples of non-iterative techniques include SeDDaRA,[3] the cepstrum transform and APEX. The cepstrum transform and APEX methods assume that the PSF has a specific shape, and one must estimate the width of the shape. For SeDDaRA, the information about the scene is provided in the form of a reference image. The algorithm estimates the PSF by comparing the spatial frequency information in the blurred image to that of the target image.\nIn the case of deconvolution of seismic data, the original unknown signal is made of spikes hence is possible to characterize with sparsity constraints[4] or regularizations such as l1 norm/l2 norm norm ratios,[5] suggested by W. C. Gray in 1978.[6]\nAudio deconvolution (often referred to as dereverberation) is a reverberation reduction in audio mixtures. It is part of audio processing of recordings in ill-posed cases such as the cocktail party effect. One possibility is to use ICA.[7]\nSuppose we have a signal transmitted through a channel. The channel can usually be modeled as a linear shift-invariant system, so the receptor receives a convolution of the original signal with the impulse response of the channel. If we want to reverse the effect of the channel, to obtain the original signal, we must process the received signal by a second linear system, inverting the response of the channel. This system is called an equalizer.\nIf we are given the original signal, we can use a supervising technique, such as finding a Wiener filter, but without it, we can still explore what we do know about it to attempt its recovery. For example, we can filter the received signal to obtain the desired spectral power density. This is what happens, for example, when the original signal is known to have no auto correlation, and we \"whiten\" the received signal.\nWhitening usually leaves some phase distortion in the results. Most blind deconvolution techniques use higher-order statistics of the signals, and permit the correction of such phase distortions. We can optimize the equalizer to obtain a signal with a PSF approximating what we know about the original PSF.\nBlind deconvolution algorithms often make use of high-order statistics, with moments higher than two. This can be implicit or explicit.[8]", 
    "dbpedia_url": "http://dbpedia.org/resource/Blind_deconvolution", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Blind_deconvolution\n"
}