{
    "about": "In electrical engineering and control theory, a Bode plot /ˈboʊdi/ is a graph of the frequency response of a system. It is usually a combination of a Bode magnitude plot, expressing the magnitude (usually in decibels) of the frequency response, and a Bode phase plot, expressing the phase shift. Both quantities are plotted against a horizontal axis proportional to the logarithm of frequency. Given that the decibel is itself a logarithmic scale, the Bode amplitude plot is log–log plot, whereas the Bode phase plot is a lin-log plot.[1]", 
    "name": "Bode Plot", 
    "classification": "Signal Processing", 
    "full_text": "In electrical engineering and control theory, a Bode plot /ˈboʊdi/ is a graph of the frequency response of a system. It is usually a combination of a Bode magnitude plot, expressing the magnitude (usually in decibels) of the frequency response, and a Bode phase plot, expressing the phase shift. Both quantities are plotted against a horizontal axis proportional to the logarithm of frequency. Given that the decibel is itself a logarithmic scale, the Bode amplitude plot is log–log plot, whereas the Bode phase plot is a lin-log plot.[1]\nAs originally conceived by Hendrik Wade Bode in the 1930s, the plot is only an asymptotic approximation of the frequency response, using straight line segments.[2] However, with the advent of low cost computing, it is often taken nowadays to mean the precise plot of the actual frequency response.\n\n\nAmong his several important contributions to circuit theory and control theory, engineer Hendrik Wade Bode, while working at Bell Labs in the United States in the 1930s, devised a simple but accurate method for graphing gain and phase-shift plots. These bear his name, Bode gain plot and Bode phase plot. \"Bode\" is pronounced /ˈboʊdi/ BOH-dee (Dutch: [ˈboːdə]).[3][4]\nBode was faced with the problem of designing stable amplifiers with feedback for use in telephone networks. He developed the graphical design technique of the Bode plots to show the gain margin and phase margin required to maintain stability under variations in circuit characteristics caused during manufacture or during operation.[5] The principles developed were applied to design problems of servomechanisms and other feedback control systems. The Bode plot is an example of analysis in the frequency domain.\nThe Bode plot for a linear, time-invariant system with transfer function \n\n\n\nH\n(\ns\n)\n\n\n{\\displaystyle H(s)}\n\n (\n\n\n\ns\n\n\n{\\displaystyle s}\n\n being the complex frequency in the Laplace domain) consists of a magnitude plot and a phase plot.\nThe Bode magnitude plot is the graph of the function \n\n\n\n\n|\n\nH\n(\ns\n=\nj\nω\n)\n\n|\n\n\n\n{\\displaystyle |H(s=j\\omega )|}\n\n of frequency \n\n\n\nω\n\n\n{\\displaystyle \\omega }\n\n (with \n\n\n\nj\n\n\n{\\displaystyle j}\n\n being the imaginary unit). The \n\n\n\nω\n\n\n{\\displaystyle \\omega }\n\n-axis of the magnitude plot is logarithmic and the magnitude is given in decibels, i.e., a value for the magnitude \n\n\n\n\n|\n\nH\n\n|\n\n\n\n{\\displaystyle |H|}\n\n is plotted on the axis at \n\n\n\n20\n\nlog\n\n10\n\n\n⁡\n\n|\n\nH\n\n|\n\n\n\n{\\displaystyle 20\\log _{10}|H|}\n\n.\nThe Bode phase plot is the graph of the phase of the transfer function \n\n\n\narg\n⁡\n\n(\nH\n(\ns\n=\nj\nω\n)\n)\n\n\n\n{\\displaystyle \\arg \\left(H(s=j\\omega )\\right)}\n\n in degrees plotted logarithmically as a function of \n\n\n\nω\n\n\n{\\displaystyle \\omega }\n\n.\nThe one-pole highpass RC-filter has the transfer function\nwhere \n\n\n\n\nτ\n\nc\n\n\n=\n1\n\n/\n\n\nω\n\nc\n\n\n\n\n{\\displaystyle \\tau _{c}=1/\\omega _{c}}\n\n is the inverse of the cut-off frequency \n\n\n\n\nω\n\nc\n\n\n=\n2\nπ\n\nf\n\nc\n\n\n=\n\n\n1\n\nR\nC\n\n\n\n\n\n{\\displaystyle \\omega _{c}=2\\pi f_{c}={\\frac {1}{RC}}}\n\n.\nTo obtain the Bode magnitude plot one calculates the magnitude of the transfer function along the imaginary axis\nThe last equality is obtained using the rules for complex numbers. On the Bode magnitude plot, decibels are used, and the plotted magnitude is:\nTo obtain the Bode phase plot one calculates the argument of \n\n\n\n\n\nH\n\n\nh\np\n\n\n\n\n(\n\nj\n\nω\n)\n\n\n{\\displaystyle \\mathrm {H_{\\mathrm {hp} }} (\\mathrm {j} \\omega )}\n\n:\nCare must be taken that the inverse tangent is set up to return degrees, not radians. The resulting Bode plot is shown in Figure 1(a) for \n\n\n\n\nf\n\nc\n\n\n=\n100\n\nH\nz\n\n\n\n{\\displaystyle f_{c}=100\\mathrm {Hz} }\n\n.\nA passive (unity pass band gain) lowpass RC filter has the following transfer function:\nwhere, again, \n\n\n\n\nτ\n\nc\n\n\n\n\n{\\displaystyle \\tau _{c}}\n\n is the inverse of the cut-off frequency. The corresponding Bode Plot is shown in Figure 1(b).\nThe magnitude and the phase of the transfer function are related. For minimum-phase systems there is a unique relationship between the magnitude and the phase, the Bode gain-phase relationship.[6]\nIf the transfer function is a rational function with real poles and zeros, then the Bode plot can be approximated with straight lines. These asymptotic approximations are called straight line Bode plots or uncorrected Bode plots and are useful because they can be drawn by hand following a few simple rules. Simple plots can even be predicted without drawing them.\nThe approximation can be taken further by correcting the value at each cutoff frequency. The plot is then called a corrected Bode plot.\nThis section illustrates that a Bode Plot is a visualization of the frequency response of a system.\nConsider a linear, time-invariant system with transfer function \n\n\n\nH\n(\ns\n)\n\n\n{\\displaystyle H(s)}\n\n. Assume that the system is subject to a sinusoidal input with frequency \n\n\n\nω\n\n\n{\\displaystyle \\omega }\n\n,\nthat is applied persistently, i.e. from a time \n\n\n\n−\n∞\n\n\n{\\displaystyle -\\infty }\n\n to a time \n\n\n\nt\n\n\n{\\displaystyle t}\n\n. The response will be of the form\ni.e., also a sinusoidal signal with amplitude \n\n\n\n\ny\n\n0\n\n\n\n\n{\\displaystyle y_{0}}\n\n shifted in phase with respect to the input by a phase \n\n\n\nφ\n\n\n{\\displaystyle \\varphi }\n\n.\nIt can be shown[6] that the magnitude of the response is\n\n\n\n\n\ny\n\n0\n\n\n=\n\n|\n\nH\n(\n\nj\n\nω\n)\n\n|\n\n\n\n\n{\\displaystyle y_{0}=|H(\\mathrm {j} \\omega )|\\;}\n\n\n\n \n \n \n \n(1)\nand that the phase shift is\n\n\n\n\nφ\n=\narg\n⁡\nH\n(\n\nj\n\nω\n)\n\n.\n\n\n{\\displaystyle \\varphi =\\arg H(\\mathrm {j} \\omega )\\;.}\n\n\n\n \n \n \n \n(2)\nA sketch for the proof of these equations is given in the appendix.\nIn summary, subjected to an input with frequency \n\n\n\nω\n\n\n{\\displaystyle \\omega }\n\n the system responds at the same frequency with an output that is amplified by a factor \n\n\n\n\n|\n\nH\n(\n\nj\n\nω\n)\n\n|\n\n\n\n{\\displaystyle |H(\\mathrm {j} \\omega )|}\n\n and phase-shifted by \n\n\n\narg\n⁡\n(\nH\n(\n\nj\n\nω\n)\n)\n\n\n{\\displaystyle \\arg(H(\\mathrm {j} \\omega ))}\n\n. These quantities, thus, characterize the frequency response and are shown in the Bode plot.\nFor many practical problems, the detailed Bode plots can be approximated with straight-line segments that are asymptotes of the precise response. The effect of each of the terms of a multiple element transfer function can be approximated by a set of straight lines on a Bode plot. This allows a graphical solution of the overall frequency response function. Before widespread availability of digital computers, graphical methods were extensively used to reduce the need for tedious calculation; a graphical solution could be used to identify feasible ranges of parameters for a new design.\nThe premise of a Bode plot is that one can consider the log of a function in the form:\nas a sum of the logs of its poles and zeros:\nThis idea is used explicitly in the method for drawing phase diagrams. The method for drawing amplitude plots implicitly uses this idea, but since the log of the amplitude of each pole or zero always starts at zero and only has one asymptote change (the straight lines), the method can be simplified.\nAmplitude decibels is usually done using \n\n\n\n\nd\nB\n\n=\n20\n\nlog\n\n10\n\n\n⁡\n(\nX\n)\n\n\n{\\displaystyle \\mathbf {dB} =20\\log _{10}(X)}\n\n to define decibels. Given a transfer function in the form\nwhere \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n and \n\n\n\n\ny\n\nn\n\n\n\n\n{\\displaystyle y_{n}}\n\n are constants, \n\n\n\ns\n=\n\nj\n\nω\n\n\n{\\displaystyle s=\\mathrm {j} \\omega }\n\n, \n\n\n\n\na\n\nn\n\n\n,\n\nb\n\nn\n\n\n>\n0\n\n\n{\\displaystyle a_{n},b_{n}>0}\n\n, and \n\n\n\nH\n\n\n{\\displaystyle H}\n\n is the transfer function:\nTo handle irreducible 2nd order polynomials, \n\n\n\na\n\nx\n\n2\n\n\n+\nb\nx\n+\nc\n\n\n{\\displaystyle ax^{2}+bx+c}\n\n can, in many cases, be approximated as \n\n\n\n(\n\n\na\n\n\nx\n+\n\n\nc\n\n\n\n)\n\n2\n\n\n\n\n{\\displaystyle ({\\sqrt {a}}x+{\\sqrt {c}})^{2}}\n\n.\nNote that zeros and poles happen when \n\n\n\nω\n\n\n{\\displaystyle \\omega }\n\n is equal to a certain \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n or \n\n\n\n\ny\n\nn\n\n\n\n\n{\\displaystyle y_{n}}\n\n. This is because the function in question is the magnitude of \n\n\n\nH\n(\n\nj\n\nω\n)\n\n\n{\\displaystyle H(\\mathrm {j} \\omega )}\n\n, and since it is a complex function, \n\n\n\n\n|\n\nH\n(\n\nj\n\nω\n)\n\n|\n\n=\n\n\nH\n⋅\n\nH\n\n∗\n\n\n\n\n\n\n{\\displaystyle |H(\\mathrm {j} \\omega )|={\\sqrt {H\\cdot H^{*}}}}\n\n. Thus at any place where there is a zero or pole involving the term \n\n\n\n(\ns\n+\n\nx\n\nn\n\n\n)\n\n\n{\\displaystyle (s+x_{n})}\n\n, the magnitude of that term is \n\n\n\n\n\n(\n\nx\n\nn\n\n\n+\n\nj\n\nω\n)\n⋅\n(\n\nx\n\nn\n\n\n−\n\nj\n\nω\n)\n\n\n=\n\n\n\nx\n\nn\n\n\n2\n\n\n+\n\nω\n\n2\n\n\n\n\n\n\n{\\displaystyle {\\sqrt {(x_{n}+\\mathrm {j} \\omega )\\cdot (x_{n}-\\mathrm {j} \\omega )}}={\\sqrt {x_{n}^{2}+\\omega ^{2}}}}\n\n.\nTo correct a straight-line amplitude plot:\nNote that this correction method does not incorporate how to handle complex values of \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n or \n\n\n\n\ny\n\nn\n\n\n\n\n{\\displaystyle y_{n}}\n\n. In the case of an irreducible polynomial, the best way to correct the plot is to actually calculate the magnitude of the transfer function at the pole or zero corresponding to the irreducible polynomial, and put that dot over or under the line at that pole or zero.\nGiven a transfer function in the same form as above:\nthe idea is to draw separate plots for each pole and zero, then add them up. The actual phase curve is given by \n\n\n\n−\narctan\n⁡\n\n(\n\n\n\n\n\nI\nm\n\n[\nH\n(\ns\n)\n]\n\n\n\nR\ne\n\n[\nH\n(\ns\n)\n]\n\n\n\n\n)\n\n\n\n{\\displaystyle -\\arctan \\left({\\tfrac {\\mathrm {Im} [H(s)]}{\\mathrm {Re} [H(s)]}}\\right)}\n\n.\nTo draw the phase plot, for each pole and zero:\nTo create a straight-line plot for the lowpass filter, introduced above, one considers the transfer function in terms of the angular frequency:\nThe above equation is the normalized form of the transfer function. The Bode plot is shown in Figure 1(b) above, and construction of the straight-line approximation is discussed next.\nThe magnitude (in decibels) of the transfer function above, (normalized and converted to angular frequency form), given by the decibel gain expression \n\n\n\n\nA\n\n\nv\nd\nB\n\n\n\n\n\n{\\displaystyle A_{\\mathrm {vdB} }}\n\n:\nthen plotted versus input frequency \n\n\n\nω\n\n\n{\\displaystyle \\omega }\n\n on a logarithmic scale, can be approximated by two lines and it forms the asymptotic (approximate) magnitude Bode plot of the transfer function:\nThese two lines meet at the corner frequency. From the plot, it can be seen that for frequencies well below the corner frequency, the circuit has an attenuation of 0 dB, corresponding to a unity pass band gain, i.e. the amplitude of the filter output equals the amplitude of the input. Frequencies above the corner frequency are attenuated – the higher the frequency, the higher the attenuation.\nThe phase Bode plot is obtained by plotting the phase angle of the transfer function given by\nversus \n\n\n\nω\n\n\n{\\displaystyle \\omega }\n\n, where \n\n\n\nω\n\n\n{\\displaystyle \\omega }\n\n and \n\n\n\n\nω\n\n\nc\n\n\n\n\n\n{\\displaystyle \\omega _{\\mathrm {c} }}\n\n are the input and cutoff angular frequencies respectively. For input frequencies much lower than corner, the ratio \n\n\n\n\n\nω\n\n\nω\n\n\nc\n\n\n\n\n\n\n\n\n{\\displaystyle {\\omega  \\over {\\omega _{\\mathrm {c} }}}}\n\n is small and therefore the phase angle is close to zero. As the ratio increases the absolute value of the phase increases and becomes –45 degrees when \n\n\n\nω\n=\n\nω\n\n\nc\n\n\n\n\n\n{\\displaystyle \\omega =\\omega _{\\mathrm {c} }}\n\n. As the ratio increases for input frequencies much greater than the corner frequency, the phase angle asymptotically approaches −90 degrees. The frequency scale for the phase plot is logarithmic.\nThe horizontal frequency axis, in both the magnitude and phase plots, can be replaced by the normalized (nondimensional) frequency ratio \n\n\n\n\n\nω\n\n\nω\n\n\nc\n\n\n\n\n\n\n\n\n{\\displaystyle {\\omega  \\over {\\omega _{\\mathrm {c} }}}}\n\n. In such a case the plot is said to be normalized and units of the frequencies are no longer used since all input frequencies are now expressed as multiples of the cutoff frequency \n\n\n\n\nω\n\n\nc\n\n\n\n\n\n{\\displaystyle \\omega _{\\mathrm {c} }}\n\n.\nFigures 2-5 further illustrate construction of Bode plots. This example with both a pole and a zero shows how to use superposition. To begin, the components are presented separately.\nFigure 2 shows the Bode magnitude plot for a zero and a low-pass pole, and compares the two with the Bode straight line plots. The straight-line plots are horizontal up to the pole (zero) location and then drop (rise) at 20 dB/decade. The second Figure 3 does the same for the phase. The phase plots are horizontal up to a frequency factor of ten below the pole (zero) location and then drop (rise) at 45°/decade until the frequency is ten times higher than the pole (zero) location. The plots then are again horizontal at higher frequencies at a final, total phase change of 90°.\nFigure 4 and Figure 5 show how superposition (simple addition) of a pole and zero plot is done. The Bode straight line plots again are compared with the exact plots. The zero has been moved to higher frequency than the pole to make a more interesting example. Notice in Figure 4 that the 20 dB/decade drop of the pole is arrested by the 20 dB/decade rise of the zero resulting in a horizontal magnitude plot for frequencies above the zero location. Notice in Figure 5 in the phase plot that the straight-line approximation is pretty approximate in the region where both pole and zero affect the phase. Notice also in Figure 5 that the range of frequencies where the phase changes in the straight line plot is limited to frequencies a factor of ten above and below the pole (zero) location. Where the phase of the pole and the zero both are present, the straight-line phase plot is horizontal because the 45°/decade drop of the pole is arrested by the overlapping 45°/decade rise of the zero in the limited range of frequencies where both are active contributors to the phase.\nFigure 2: Bode magnitude plot for zero and low-pass pole; curves labeled \"Bode\" are the straight-line Bode plots\nFigure 3: Bode phase plot for zero and low-pass pole; curves labeled \"Bode\" are the straight-line Bode plots\nFigure 4: Bode magnitude plot for pole-zero combination; the location of the zero is ten times higher than in Figures 2&3; curves labeled \"Bode\" are the straight-line Bode plots\nFigure 5: Bode phase plot for pole-zero combination; the location of the zero is ten times higher than in Figures 2&3; curves labeled \"Bode\" are the straight-line Bode plots\nBode plots are used to assess the stability of negative feedback amplifiers by finding the gain and phase margins of an amplifier. The notion of gain and phase margin is based upon the gain expression for a negative feedback amplifier given by\nwhere AFB is the gain of the amplifier with feedback (the closed-loop gain), β is the feedback factor and AOL is the gain without feedback (the open-loop gain). The gain AOL is a complex function of frequency, with both magnitude and phase.[note 1] Examination of this relation shows the possibility of infinite gain (interpreted as instability) if the product βAOL = −1. (That is, the magnitude of βAOL is unity and its phase is −180°, the so-called Barkhausen stability criterion). Bode plots are used to determine just how close an amplifier comes to satisfying this condition.\nKey to this determination are two frequencies. The first, labeled here as f180, is the frequency where the open-loop gain flips sign. The second, labeled here f0 dB, is the frequency where the magnitude of the product | β AOL | = 1 (in dB, magnitude 1 is 0 dB). That is, frequency f180 is determined by the condition:\nwhere vertical bars denote the magnitude of a complex number (for example, \n\n\n\n\n|\n\na\n+\n\nj\n\nb\n\n|\n\n=\n\n\n[\n\na\n\n2\n\n\n+\n\nb\n\n2\n\n\n]\n\n\n\n1\n2\n\n\n\n\n\n{\\displaystyle |a+\\mathrm {j} b|=\\left[a^{2}+b^{2}\\right]^{\\frac {1}{2}}}\n\n), and frequency f0 dB is determined by the condition:\nOne measure of proximity to instability is the gain margin. The Bode phase plot locates the frequency where the phase of βAOL reaches −180°, denoted here as frequency f180. Using this frequency, the Bode magnitude plot finds the magnitude of βAOL. If |βAOL|180 = 1, the amplifier is unstable, as mentioned. If AOL|180 < 1, instability does not occur, and the separation in dB of the magnitude of |βAOL|180 from |βAOL| = 1 is called the gain margin. Because a magnitude of one is 0 dB, the gain margin is simply one of the equivalent forms: \n\n\n\n20\n\nlog\n\n10\n\n\n⁡\n(\n\n|\n\nβ\n\nA\n\n\nO\nL\n\n\n\n\n\n|\n\n\n180\n\n\n)\n=\n20\n\nlog\n\n10\n\n\n⁡\n(\n\n|\n\n\nA\n\n\nO\nL\n\n\n\n\n|\n\n)\n−\n20\n\nlog\n\n10\n\n\n⁡\n(\n\nβ\n\n−\n1\n\n\n)\n\n\n{\\displaystyle 20\\log _{10}(|\\beta A_{\\mathrm {OL} }|_{180})=20\\log _{10}(|A_{\\mathrm {OL} }|)-20\\log _{10}(\\beta ^{-1})}\n\n.\nAnother equivalent measure of proximity to instability is the phase margin. The Bode magnitude plot locates the frequency where the magnitude of |βAOL| reaches unity, denoted here as frequency f0 dB. Using this frequency, the Bode phase plot finds the phase of βAOL. If the phase of βAOL( f0 dB) > −180°, the instability condition cannot be met at any frequency (because its magnitude is going to be < 1 when f = f180), and the distance of the phase at f0 dB in degrees above −180° is called the phase margin.\nIf a simple yes or no on the stability issue is all that is needed, the amplifier is stable if f0 dB < f180. This criterion is sufficient to predict stability only for amplifiers satisfying some restrictions on their pole and zero positions (minimum phase systems). Although these restrictions usually are met, if they are not another method must be used, such as the Nyquist plot.[7][8] Optimal gain and phase margins may be computed using Nevanlinna–Pick interpolation theory.[9]\nFigures 6 and 7 illustrate the gain behavior and terminology. For a three-pole amplifier, Figure 6 compares the Bode plot for the gain without feedback (the open-loop gain) AOL with the gain with feedback AFB (the closed-loop gain). See negative feedback amplifier for more detail.\nIn this example, AOL = 100 dB at low frequencies, and 1 / β = 58 dB. At low frequencies, AFB ≈ 58 dB as well.\nBecause the open-loop gain AOL is plotted and not the product β AOL, the condition AOL = 1 / β decides f0 dB. The feedback gain at low frequencies and for large AOL is AFB ≈ 1 / β (look at the formula for the feedback gain at the beginning of this section for the case of large gain AOL), so an equivalent way to find f0 dB is to look where the feedback gain intersects the open-loop gain. (Frequency f0 dB is needed later to find the phase margin.)\nNear this crossover of the two gains at f0 dB, the Barkhausen criteria are almost satisfied in this example, and the feedback amplifier exhibits a massive peak in gain (it would be infinity if β AOL = −1). Beyond the unity gain frequency f0 dB, the open-loop gain is sufficiently small that AFB ≈ AOL (examine the formula at the beginning of this section for the case of small AOL).\nFigure 7 shows the corresponding phase comparison: the phase of the feedback amplifier is nearly zero out to the frequency f180 where the open-loop gain has a phase of −180°. In this vicinity, the phase of the feedback amplifier plunges abruptly downward to become almost the same as the phase of the open-loop amplifier. (Recall, AFB ≈ AOL for small AOL.)\nComparing the labeled points in Figure 6 and Figure 7, it is seen that the unity gain frequency f0 dB and the phase-flip frequency f180 are very nearly equal in this amplifier, f180 ≈ f0 dB ≈ 3.332 kHz, which means the gain margin and phase margin are nearly zero. The amplifier is borderline stable.\nFigures 8 and 9 illustrate the gain margin and phase margin for a different amount of feedback β. The feedback factor is chosen smaller than in Figure 6 or 7, moving the condition | β AOL | = 1 to lower frequency. In this example, 1 / β = 77 dB, and at low frequencies AFB ≈ 77 dB as well.\nFigure 8 shows the gain plot. From Figure 8, the intersection of 1 / β and AOL occurs at f0 dB = 1 kHz. Notice that the peak in the gain AFB near f0 dB is almost gone.[note 2][10]\nFigure 9 is the phase plot. Using the value of f0 dB = 1 kHz found above from the magnitude plot of Figure 8, the open-loop phase at f0 dB is −135°, which is a phase margin of 45° above −180°.\nUsing Figure 9, for a phase of −180° the value of f180 = 3.332 kHz (the same result as found earlier, of course[note 3]). The open-loop gain from Figure 8 at f180 is 58 dB, and 1 / β = 77 dB, so the gain margin is 19 dB.\nStability is not the sole criterion for amplifier response, and in many applications a more stringent demand than stability is good step response. As a rule of thumb, good step response requires a phase margin of at least 45°, and often a margin of over 70° is advocated, particularly where component variation due to manufacturing tolerances is an issue.[10] See also the discussion of phase margin in the step response article.\nFigure 6: Gain of feedback amplifier AFB in dB and corresponding open-loop amplifier AOL. Parameter 1/β = 58 dB, and at low frequencies AFB ≈ 58 dB as well. The gain margin in this amplifier is nearly zero because | βAOL| = 1 occurs at almost f = f180°.\nFigure 7: Phase of feedback amplifier °AFB in degrees and corresponding open-loop amplifier °AOL. The phase margin in this amplifier is nearly zero because the phase-flip occurs at almost the unity gain frequency f = f0 dB where | βAOL| = 1.\nFigure 8: Gain of feedback amplifier AFB in dB and corresponding open-loop amplifier AOL. In this example, 1 / β = 77 dB. The gain margin in this amplifier is 19 dB.\nFigure 9: Phase of feedback amplifier AFB in degrees and corresponding open-loop amplifier AOL. The phase margin in this amplifier is 45°.\nThe Bode plotter is an electronic instrument resembling an oscilloscope, which produces a Bode diagram, or a graph, of a circuit's voltage gain or phase shift plotted against frequency in a feedback control system or a filter. An example of this is shown in Figure 10. It is extremely useful for analyzing and testing filters and the stability of feedback control systems, through the measurement of corner (cutoff) frequencies and gain and phase margins.\nThis is identical to the function performed by a vector network analyzer, but the network analyzer is typically used at much higher frequencies.\nFor education/research purposes, plotting Bode diagrams for given transfer functions facilitates better understanding and getting faster results (see external links).\nTwo related plots that display the same data in different coordinate systems are the Nyquist plot and the Nichols plot. These are parametric plots, with frequency as the input and magnitude and phase of the frequency response as the output. The Nyquist plot displays these in polar coordinates, with magnitude mapping to radius and phase to argument (angle). The Nichols plot displays these in rectangular coordinates, on the log scale.\nA Nyquist plot.\nA Nichols plot of the same response.\nThis section sketches a proof for the relation between frequency response and the magnitude and phase of the transfer function in Eqs.(1)-(2).\nSlightly changing the requirements for Eqs.(1)-(2) one assumes that the input has been applied starting at time \n\n\n\nt\n=\n0\n\n\n{\\displaystyle t=0}\n\n and one calculates the output in the limit \n\n\n\nt\n→\n∞\n\n\n{\\displaystyle t\\to \\infty }\n\n. In this case, the output is given by the convolution\nof the input signal with the inverse Laplace transform of the transfer function \n\n\n\nh\n(\nt\n)\n\n\n{\\displaystyle h(t)}\n\n. The integral can be split in the following way\nwhere the second term vanishes in the limit \n\n\n\nt\n→\n∞\n\n\n{\\displaystyle t\\to \\infty }\n\n if \n\n\n\nh\n\n\n{\\displaystyle h}\n\n has certain properties. Thus, inserting the sinusodial input signal one obtains\nSince \n\n\n\nh\n(\nt\n)\n\n\n{\\displaystyle h(t)}\n\n is a real function this can be written as\nThe term in brackets is the definition of the Laplace transform of \n\n\n\nh\n\n\n{\\displaystyle h}\n\n at \n\n\n\ns\n=\n\nj\n\nω\n\n\n{\\displaystyle s=\\mathrm {j} \\omega }\n\n. Inserting the definition in the form \n\n\n\nH\n(\n\nj\n\nω\n)\n=\n\n|\n\nH\n(\n\nj\n\nω\n)\n\n|\n\nexp\n⁡\n\n(\narg\n⁡\nH\n(\n\nj\n\nω\n)\n)\n\n\n\n{\\displaystyle H(\\mathrm {j} \\omega )=|H(\\mathrm {j} \\omega )|\\exp \\left(\\arg H(\\mathrm {j} \\omega )\\right)}\n\n one obtains the output signal\nstated in Eqs.(1)-(2).", 
    "dbpedia_url": "http://dbpedia.org/resource/Bode_plot", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Bode_plot\n"
}