{
    "about": "In statistics, the bootstrap error-adjusted single-sample technique (BEST or the BEAST) is a non-parametric method that is intended to allow an assessment to be made of the validity of a single sample. It is based on estimating a probability distribution representing what can be expected from valid samples.[1] This is done use a statistical method called bootstrapping, applied to previous samples that are known to be valid.", 
    "classification": "Computational Statistics", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Bootstrap_error-adjusted_single-sample_technique\n", 
    "full_text": "In statistics, the bootstrap error-adjusted single-sample technique (BEST or the BEAST) is a non-parametric method that is intended to allow an assessment to be made of the validity of a single sample. It is based on estimating a probability distribution representing what can be expected from valid samples.[1] This is done use a statistical method called bootstrapping, applied to previous samples that are known to be valid.\n\n\nBEST provides advantages over other methods such as the Mahalanobis metric, because it does not assume that for all spectral groups have equal covariances [clarification needed] or that each group is drawn for a normally distributed population.[2] A quantitative approach involves BEST along with a nonparametric cluster analysis algorithm. Multidimensional standard deviations[clarification needed] (MDSs) between clusters and spectral[clarification needed] data points are calculated, where BEST considers each frequency to be taken from a separate dimension.[clarification needed][3]\nBEST is based on a population, P, relative to some hyperspace, R, that represents the universe of possible samples. P* is the realized values of P based on a calibration set, T. T is used to find all possible variation in P. P* is bound by parameters C and B. C is the expectation value of P, written E(P), and B is a bootstrapping distribution called the Monte Carlo approximation. The standard deviation can be found using this technique. The values of B projected into hyperspace give rise to X. The hyperline from C to X gives rise to the skew adjusted standard deviation which is calculated in both directions of the hyperline.[4]\nBEST is used in detection of sample tampering in pharmaceutical products. Valid (unaltered) samples are defined as those that fall inside the cluster of training-set points when the BEST is trained with unaltered product samples. False (tampered) samples are those that fall outside of the same cluster.[1]\nMethods such as ICP-AES require capsules[clarification needed] to be emptied for analysis. A nondestructive method is valuable. A method such as NIRA[clarification needed] can be coupled to the BEST method in the following ways.[1]", 
    "name": "Bootstrap Error Adjusted Single Sample Technique"
}