{
    "about": "In numerical mathematics, the boundary knot method (BKM) is proposed as an alternative boundary-type meshfree distance function collocation scheme.", 
    "name": "Boundary Knot Method", 
    "classification": "Numerical Analysis", 
    "full_text": "In numerical mathematics, the boundary knot method (BKM) is proposed as an alternative boundary-type meshfree distance function collocation scheme.\nRecent decades have witnessed a research boom on the meshfree numerical PDE techniques since the construction of a mesh in the standard finite element method and boundary element method is not trivial especially for moving boundary, and higher-dimensional problems. The boundary knot method is different from the other methods based on the fundamental solutions, such as boundary element method, method of fundamental solutions and singular boundary method in that the former does not require special techniques to cure the singularity. The BKM is truly meshfree, spectral convergent (numerical observations), symmetric (self-adjoint PDEs), integration-free, and easy to learn and implement. The method has successfully been tested to the Helmholtz, diffusion, convection-diffusion, and Possion equations with very irregular 2D and 3D domains.\n\n\nThe BKM is basically a combination of the distance function, non-singular general solution, and dual reciprocity method (DRM). The distance function is employed in the BKM to approximate the inhomogeneous terms via the DRM, whereas the non-singular general solution of the partial differential equation leads to a boundary-only formulation for the homogeneous solution. Without the singular fundamental solution, the BKM removes the controversial artificial boundary in the method of fundamental solutions. Some preliminary numerical experiments show that the BKM can produce excellent results with relatively a small number of nodes for various linear and nonlinear problems.\nConsider the following problems,\nwhere \n\n\n\nL\n\n\n{\\displaystyle L}\n\n is the differential operator, \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n represents the computational domain, \n\n\n\n∂\n\nΩ\n\nD\n\n\n\n\n{\\displaystyle \\partial \\Omega _{D}}\n\n and \n\n\n\n∂\n\nΩ\n\nN\n\n\n\n\n{\\displaystyle \\partial \\Omega _{N}}\n\n denote the Dirichlet and Neumann boundaries respectively, satisfied \n\n\n\n∂\n\nΩ\n\nD\n\n\n∪\n∂\n\nΩ\n\nN\n\n\n=\n∂\nΩ\n\n\n{\\displaystyle \\partial \\Omega _{D}\\cup \\partial \\Omega _{N}=\\partial \\Omega }\n\n and \n\n\n\n∂\n\nΩ\n\nD\n\n\n∩\n∂\n\nΩ\n\nN\n\n\n=\n∅\n\n\n{\\displaystyle \\partial \\Omega _{D}\\cap \\partial \\Omega _{N}=\\varnothing }\n\n. The BKM employs the non-singular general solution of the operator \n\n\n\nL\n\n\n{\\displaystyle L}\n\n to approximate the numerical solution as follows,\nwhere \n\n\n\n\nr\n\ni\n\n\n=\n\n\n∥\n\n(\nx\n,\ny\n)\n\n−\n\n(\n\nx\n\ni\n\n\n,\n\ny\n\ni\n\n\n)\n\n∥\n\n\n2\n\n\n\n\n{\\displaystyle r_{i}=\\left\\|\\left(x,y\\right)-\\left(x_{i},y_{i}\\right)\\right\\|_{2}}\n\n denotes the Euclidean distance, \n\n\n\nϕ\n\n(\n⋅\n)\n\n\n\n{\\displaystyle \\phi \\left(\\cdot \\right)}\n\n is the general solution satisfied\nBy employing the collocation technique to satisfy the boundary conditions (2) and (3),\nwhere \n\n\n\n\n(\n\nx\n\nk\n\n\n,\n\ny\n\nk\n\n\n)\n\n\n\n|\n\n\nk\n=\n1\n\n\n\nm\n\n1\n\n\n\n\n\n\n{\\displaystyle \\left(x_{k},y_{k}\\right)|_{k=1}^{m_{1}}}\n\n and \n\n\n\n\n(\n\nx\n\nk\n\n\n,\n\ny\n\nk\n\n\n)\n\n\n\n|\n\n\nk\n=\n\nm\n\n1\n\n\n+\n1\n\n\nm\n\n\n\n\n{\\displaystyle \\left(x_{k},y_{k}\\right)|_{k=m_{1}+1}^{m}}\n\n denotes the collocation points located at Dirichlet boundary and Neumann boundary respectively. The unknown coefficients \n\n\n\n\nα\n\ni\n\n\n\n\n{\\displaystyle \\alpha _{i}}\n\n can be uniquely determined by above Eq. (6). And then the BKM solution at any location of computational domain can be evaluated by the formulation (4).\nIt has long been noted that boundary element method (BEM) is an alternative method to finite element method (FEM) and finite volume method (FVM) for infinite domain, thin-walled structures, and inverse problems, thanks to its dimensional reducibility. The major bottlenecks of BEM, however, are computationally expensive to evaluate integration of singular fundamental solution and to generate surface mesh or re-mesh. The method of fundamental solutions (MFS)[1] has in recent decade emerged to alleviate these drawbacks and getting increasing attentions. The MFS is integration-free, spectral convergence and meshfree.\nAs its name implies, the fundamental solution of the governing equations is used as the basis function in the MFS. To avoid singularity of the fundamental solution, the artificial boundary outside the physical domain is required and has been a major bottleneck for the wide use of the MFS, since such fictitious boundary may cause computational instability. The BKM is classified as one kind of boundary-type meshfree methods without using mesh and artificial boundary.\nThe BKM has since been widely tested. In,[2] the BKM is used to solve Laplace equation, Helmholtz Equation, and varying-parameter Helmholtz equations; in[3] by analogy with Fasshauer’s Hermite RBF interpolation, a symmetric BKM scheme is proposed in the presence of mixed boundary conditions; in,[4] numerical investigations are made on the convergence of BKM in the analysis of homogeneous Helmholtz, modified Helmholtz and convection-diffusion problems; in[5] the BKM is employed to deal with complicated geometry of two and three dimension Helmholtz and convection-diffusion problems; in[6] membrane vibration under mixed-type boundary conditions is investigated by symmetric boundary knot method; in[7] the BKM is applied to some inverse Helmholtz problems; in[8] the BKM solves Poisson equations; in[9] the BKM calculates Cauchy inverse inhomogeneous Helmholtz equations; in[10] the BKM simulates the anisotropic problems via the geodesic distance; in[11] [12] relationships among condition number, effective condition number, and regularizations are investigated; in[13] heat conduction in nonlinear functionally graded material is examined by the BKM; in[14] the BKM is also used to solve nonlinear Eikonal equation.", 
    "dbpedia_url": "http://dbpedia.org/resource/Boundary_knot_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Boundary_knot_method\n"
}