{
    "about": "In applied mathematics, the boundary particle method (BPM) is a boundary-only meshless (meshfree) collocation technique, in the sense that none of inner nodes are required in the numerical solution of nonhomogeneous partial differential equations. Numerical experiments show that the BPM has spectral convergence. Its interpolation matrix can be symmetric.", 
    "name": "Boundary Particle Method", 
    "classification": "Numerical Analysis", 
    "full_text": "In applied mathematics, the boundary particle method (BPM) is a boundary-only meshless (meshfree) collocation technique, in the sense that none of inner nodes are required in the numerical solution of nonhomogeneous partial differential equations. Numerical experiments show that the BPM has spectral convergence. Its interpolation matrix can be symmetric.\n\n\nIn recent decades, the dual reciprocity method (DRM)[1] and multiple reciprocity method (MRM)[2] have been emerging as promising techniques to evaluate the particular solution of nonhomogeneous partial differential equations in conjunction with the boundary discretization techniques, such as boundary element method (BEM). For instance, the so-called DR-BEM and MR-BEM are popular BEM techniques in the numerical solution of nonhomogeneous problems.\nThe DRM has become a common method to evaluate the particular solution. However, the DRM requires inner nodes to guarantee the convergence and stability. The MRM has an advantage over the DRM in that it does not require using inner nodes for nonhomogeneous problems.[citation needed] Compared with the DRM, the MRM is computationally more expensive in the construction of the interpolation matrices and has limited applicability to general nonhomogeneous problems due to its conventional use of high-order Laplacian operators in the annihilation process.\nThe recursive composite multiple reciprocity method (RC-MRM),[3][4] was proposed to overcome the above-mentioned problems. The key idea of the RC-MRM is to employ high-order composite differential operators instead of high-order Laplacian operators to eliminate a number of nonhomogeneous terms in the governing equation. The RC-MRM uses the recursive structures of the MRM interpolation matrix to reduce computational costs.\nThe boundary particle method (BPM) is a boundary-only discretization of an inhomogeneous partial differential equation by combining the RC-MRM with strong-form meshless boundary collocation discretization schemes, such as the method of fundamental solution (MFS), boundary knot method (BKM), regularized meshless method (RMM), singular boundary method (SBM), and Trefftz method (TM). The BPM has been applied to problems such as nonhomogeneous Helmholtz and convection-diffusion equation. The BPM interpolation representation is of a wavelet series.\nFor the application of the BPM to Helmholtz,[3] Poisson[4] and plate bending problems,[5] the high-order fundamental solution or general solution, harmonic function[6] or Trefftz function (T-complete functions)[7] are often used, for instance, those of Berger, Winkler, and vibrational thin plate equations.[8] The method has been applied to inverse Cauchy problem associated with Poisson[9] and nonhomogeneous Helmholtz equations.[10]\nThe BPM may encounter difficulty in the solution of problems having complex source functions, such as non-smooth, large-gradient functions, or a set of discrete measured data. The solution of such problems involves:[citation needed]\n(1) The complex functions or a set of discrete measured data can be interpolated by a sum of polynomial or trigonometric function series. Then, the RC-MRM can reduce the nonhomogeneous equation to a high-order homogeneous equation, and the BPM can be implemented to solve these problems with boundary-only discretization.\n(2) The domain decomposition may be used to in the BPM boundary-only solution of large-gradient source functions problems.", 
    "dbpedia_url": "http://dbpedia.org/resource/Boundary_particle_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Boundary_particle_method\n"
}