{
    "about": "In applied mathematics, branch and price is a method of combinatorial optimization for solving integer linear programming (ILP) and mixed integer linear programming (MILP) problems with many variables. The method is a hybrid of branch and bound and column generation methods.", 
    "name": "Branch And Price", 
    "classification": "Optimization Algorithms And Methods", 
    "full_text": "In applied mathematics, branch and price is a method of combinatorial optimization for solving integer linear programming (ILP) and mixed integer linear programming (MILP) problems with many variables. The method is a hybrid of branch and bound and column generation methods.\n\n\nBranch and price is a branch and bound method in which at each node of the search tree, columns may be added to the LP relaxation. At the start of the algorithm, sets of columns are excluded from the LP relaxation in order to reduce the computational and memory requirements and then columns are added back to the LP relaxation as needed. The approach is based on the observation that for large problems most columns will be nonbasic and have their corresponding variable equal to zero in any optimal solution. Thus, the large majority of the columns are irrelevant for solving the problem.\nThe algorithm typically begins by using a reformulation, such as Dantzig-Wolfe decomposition, to form what is known as the Master Problem. The decomposition is performed to obtain a problem formulation that gives better bounds when the relaxation is solved than when the relaxation of the original formulation is solved. But, the decomposition usually contains many variables and so a modified version, called the Restricted Master Problem, that only considers a subset of the columns is solved.[2] Then, to check for optimality, a subproblem called the pricing problem is solved to find columns that can enter the basis and reduce the objective function (for a minimization problem). This involves finding a column that has a negative reduced cost. Note that the pricing problem itself may be difficult to solve but since it is not necessary to find the column with the most negative reduced cost, heuristic and local search methods can be used.[3] The subproblem must only be solved to completion in order to prove that an optimal solution to the Restricted Master Problem is also an optimal solution to the Master Problem. Each time a column is found with negative reduced cost, it is added to the Restricted Master Problem and the relaxation is reoptimized. If no columns can enter the basis and the solution to the relaxation is not integer, then branching occurs.[1]\nMost branch and price algorithms are problem specific since the problem must be formulated in such a way so that effective branching rules can be formulated and so that the pricing problem is relatively easy to solve.[4]\nIf cutting planes are used to tighten LP relaxations within a branch and price algorithm, the method is known as branch price and cut.[5]\nThe branch and price method can be used to solve problems in a variety of application areas, including:", 
    "dbpedia_url": "http://dbpedia.org/resource/Branch_and_price", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Branch_and_price\n"
}