{
    "about": "In mathematics, the Butcher group, named after the New Zealand mathematician John C. Butcher by Hairer & Wanner (1974), is an infinite-dimensional Lie group[1] first introduced in numerical analysis to study solutions of non-linear ordinary differential equations by the Runge–Kutta method. It arose from an algebraic formalism involving rooted trees that provides formal power series solutions of the differential equation modeling the flow of a vector field. It was Cayley (1857), prompted by the work of Sylvester on change of variables in differential calculus, who first noted that the derivatives of a composition of functions can be conveniently expressed in terms of rooted trees and their combinatorics.", 
    "name": "Butcher Group", 
    "classification": "Numerical Analysis", 
    "full_text": "In mathematics, the Butcher group, named after the New Zealand mathematician John C. Butcher by Hairer & Wanner (1974), is an infinite-dimensional Lie group[1] first introduced in numerical analysis to study solutions of non-linear ordinary differential equations by the Runge–Kutta method. It arose from an algebraic formalism involving rooted trees that provides formal power series solutions of the differential equation modeling the flow of a vector field. It was Cayley (1857), prompted by the work of Sylvester on change of variables in differential calculus, who first noted that the derivatives of a composition of functions can be conveniently expressed in terms of rooted trees and their combinatorics.\nConnes & Kreimer (1999) pointed out that the Butcher group is the group of characters of the Hopf algebra of rooted trees that had arisen independently in their own work on renormalization in quantum field theory and Connes' work with Moscovici on local index theorems. This Hopf algebra, often called the Connes-Kreimer algebra, is essentially equivalent to the Butcher group, since its dual can be identified with the universal enveloping algebra of the Lie algebra of the Butcher group.[2] As they commented:\n\n\nA rooted tree is a graph with a distinguished node, called the root, in which every other node is connected to the root by a unique path. If the root of a tree t is removed and the nodes connected to the original node by a single bond are taken as new roots, the tree t breaks up into rooted trees t1, t2, ... Reversing this process a new tree t = [t1, t2, ...] can be constructed by joining the roots of the trees to a new common root. The number of nodes in a tree is denoted by |t|. A heap-ordering of a rooted tree t is an allocation of the numbers 1 through |t| to the nodes so that the numbers increase on any path going away from the root. Two heap orderings are equivalent, if there is an automorphism of rooted trees mapping one of them on the other. The number of equivalence classes of heap-orderings on a particular tree is denoted by α(t) and can be computed using the Butcher's formula:[3][4]\nwhere St denotes the symmetry group of t and the tree factorial is defined recursively by\nwith the tree factorial of an isolated root defined to be 1\nThe ordinary differential equation for the flow of a vector field on an open subset U of RN can be written\nwhere x(s) takes values in U, f is a smooth function from U to RN and x0 is the starting point of the flow at time s = 0.\nCayley (1857) gave a method to compute the higher order derivatives x(m)(s) in terms of rooted trees. His formula can be conveniently expressed using the elementary differentials introduced by Butcher. These are defined inductively by\nWith this notation\ngiving the power series expansion\nAs an example when N = 1, so that x and f are real-valued functions of a single real variable, the formula yields\nwhere the four terms correspond to the four rooted trees from left to right in Figure 3 above.\nIn a single variable this formula is the same as Faà di Bruno's formula of 1855; however in several variables it has to be written more carefully in the form\nwhere the tree structure is crucial.\nThe Hopf algebra H of rooted trees was defined by Connes & Kreimer (1998) in connection with Kreimer's previous work on renormalization in quantum field theory. It was later discovered that the Hopf algebra was the dual of a Hopf algebra defined earlier by Grossman & Larsen (1989) in a different context. The characters of H, i.e. the homomorphisms of the underlying commutative algebra into R, form a group, called the Butcher group. It corresponds to the formal group structure discovered in numerical analysis by Butcher (1972).\nThe Hopf algebra of rooted trees H is defined to be the polynomial ring in the variables t, where t runs through rooted trees.\nwhere the sum is over all proper rooted subtrees s of t; \n\n\n\n[\nt\n∖\ns\n]\n\n\n{\\displaystyle [t\\backslash s]}\n\n is the monomial given by the product the variables ti formed by the rooted trees that arise on erasing all the nodes of s and connected links from t. The number of such trees is denoted by n(t\\s).\nThe Butcher group is defined to be the set of algebra homomorphisms φ of H into R with group structure\nThe inverse in the Butcher group is given by\nand the identity by the counit ε.\nUsing complex coefficients in the construction of the Hopf algebra of rooted trees one obtains the complex Hopf algebra of rooted trees. Its C-valued characters form a group, called the complex Butcher group GC. The complex Butcher group GC is an infinite-dimensional complex Lie group[1] which appears as a toy model in the § Renormalization of quantum field theories.\nThe non-linear ordinary differential equation\ncan be solved approximately by the Runge-Kutta method. This iterative scheme requires an m x m matrix\nand a vector\nwith m components.\nThe scheme defines vectors xn by first finding a solution X1, ... , Xm of\nand then setting\nButcher (1963) showed that the solution of the corresponding ordinary differential equations\nhas the power series expansion\nwhere φj and φ are determined recursively by\nand\nThe power series above are called B-series or Butcher series.[3][5] The corresponding assignment φ is an element of the Butcher group. The homomorphism corresponding to the actual flow has\nButcher showed that the Runge-Kutta method gives an nth order approximation of the actual flow provided that φ and Φ agree on all trees with n nodes or less. Moreover, Butcher (1972) showed that the homomorphisms defined by the Runge-Kutta method form a dense subgroup of the Butcher group: in fact he showed that, given a homomorphism φ', there is a Runge-Kutta homomorphism φ agreeing with φ' to order n; and that if given homomorphims φ and φ' corresponding to Runge-Kutta data (A, b) and (A' , b' ), the product homomorphism \n\n\n\nφ\n⋆\n\nφ\n\n′\n\n\n\n\n{\\displaystyle \\varphi \\star \\varphi ^{\\prime }}\n\n corresponds to the data\nHairer & Wanner (1974) proved that the Butcher group acts naturally on the functions f. Indeed, setting\nthey proved that\nConnes & Kreimer (1998) showed that associated with the Butcher group G is an infinite-dimensional Lie algebra. The existence of this Lie algebra is predicted by a theorem of Milnor & Moore (1965): the commutativity and natural grading on H implies that the graded dual H* can be identified with the universal enveloping algebra of a Lie algebra \n\n\n\n\n\ng\n\n\n\n\n{\\displaystyle {\\mathfrak {g}}}\n\n. Connes and Kreimer explicitly identify \n\n\n\n\n\ng\n\n\n\n\n{\\displaystyle {\\mathfrak {g}}}\n\n with a space of derivations θ of H into R, i.e. linear maps such that\nthe formal tangent space of G at the identity ε. This forms a Lie algebra with Lie bracket\n\n\n\n\n\n\ng\n\n\n\n\n{\\displaystyle {\\mathfrak {g}}}\n\n is generated by the derivations θt defined by\nfor each rooted tree t.\nThe infinite-dimensional Lie algebra \n\n\n\n\n\ng\n\n\n\n\n{\\displaystyle {\\mathfrak {g}}}\n\n from Connes & Kreimer (1998) and the Lie algebra L(G) of the Butcher group as an infinite-dimensional Lie group are not the same. The Lie algebra L(G) can be identified with the Lie algebra of all derivations in the dual of H (i.e. the space of all linear maps from H to R), whereas \n\n\n\n\n\ng\n\n\n\n\n{\\displaystyle {\\mathfrak {g}}}\n\n is obtained from the graded dual. Hence \n\n\n\n\n\ng\n\n\n\n\n{\\displaystyle {\\mathfrak {g}}}\n\n turns out to be a (strictly smaller) Lie subalgebra of L(G).[1]\nConnes & Kreimer (1998) provided a general context for using Hopf algebraic methods to give a simple mathematical formulation of renormalization in quantum field theory. Renormalization was interpreted as Birkhoff factorization of loops in the character group of the associated Hopf algebra. The models considered by Kreimer (1999) had Hopf algebra H and character group G, the Butcher group. Brouder (2000) has given an account of this renormalization process in terms of Runge-Kutta data.\nIn this simplified setting, a renormalizable model has two pieces of input data:[6]\nNote that R satisfies the Rota-Baxter identity if and only if id – R does. An important example is the minimal subtraction scheme\nIn addition there is a projection P of H onto the augmentation ideal ker ε given by\nTo define the renormalized Feynman rules, note that the antipode S satisfies\nso that\nThe renormalized Feynman rules are given by a homomorphism \n\n\n\n\nΦ\n\nS\n\n\nR\n\n\n\n\n{\\displaystyle \\Phi _{S}^{R}}\n\n of H into V obtained by twisting the homomorphism Φ • S. The homomorphism \n\n\n\n\nΦ\n\nS\n\n\nR\n\n\n\n\n{\\displaystyle \\Phi _{S}^{R}}\n\n is uniquely specified by\nBecause of the precise form of Δ, this gives a recursive formula for \n\n\n\n\nΦ\n\nS\n\n\nR\n\n\n\n\n{\\displaystyle \\Phi _{S}^{R}}\n\n.\nFor the minimal subtraction scheme, this process can be interpreted in terms of Birkhoff factorization in the complex Butcher group. Φ can be regarded as a map γ of the unit circle into the complexification GC of G (maps into C instead of R). As such it has a Birkhoff factorization\nwhere γ+ is holomorphic on the interior of the closed unit disk and γ– is holomorphic on its complement in the Riemann sphere C \n\n\n\n∪\n{\n∞\n}\n\n\n{\\displaystyle \\cup \\{\\infty \\}}\n\n with γ–(∞) = 1. The loop γ+ corresponds to the renormalized homomorphism. The evaluation at z = 0 of γ+ or the renormalized homomorphism gives the dimensionally regularized values for each rooted tree.\nIn example, the Feynman rules depend on additional parameter μ, a \"unit of mass\". Connes & Kreimer (2001) showed that\nso that γμ– is independent of μ.\nThe complex Butcher group comes with a natural one-parameter group λw of automorphisms, dual to that on H\nfor w ≠ 0 in C.\nThe loops γμ and λw · γμ have the same negative part and, for t real,\ndefines a one-parameter subgroup of the complex Butcher group GC called the renormalization group flow (RG).\nIts infinitesimal generator β is an element of the Lie algebra of GC and is defined by\nIt is called the beta-function of the model.\nIn any given model, there is usually a finite-dimensional space of complex coupling constants. The complex Butcher group acts by diffeomorphims on this space. In particular the renormalization group defines a flow on the space of coupling constants, with the beta function giving the corresponding vector field.\nMore general models in quantum field theory require rooted trees to be replaced by Feynman diagrams with vertices decorated by symbols from a finite index set. Connes and Kreimer have also defined Hopf algebras in this setting and have shown how they can be used to systematize standard computations in renormalization theory.\nKreimer (2007) has given a \"toy model\" involving dimensional regularization for H and the algebra V. If c is a positive integer and qμ = q / μ is a dimensionless constant, Feynman rules can be defined recursively by\nwhere z = 1 – D/2 is the regularization parameter. These integrals can be computed explicitly in terms of the Gamma function using the formula\nIn particular\nTaking the renormalization scheme R of minimal subtraction, the renormalized quantities \n\n\n\n\nΦ\n\nS\n\n\nR\n\n\n(\nt\n)\n\n\n{\\displaystyle \\Phi _{S}^{R}(t)}\n\n are polynomials in \n\n\n\nlog\n⁡\n\nq\n\nμ\n\n\n2\n\n\n\n\n{\\displaystyle \\log q_{\\mu }^{2}}\n\n when evaluated at z = 0.", 
    "dbpedia_url": "http://dbpedia.org/resource/Butcher_group", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Butcher_group\n"
}