{
    "about": "The cache-oblivious distribution sort is a comparison-based sorting algorithm. It was introduced in 1999 in the context of the cache oblivious model. In the external memory model, the number of memory transfers it needs to perform a sort of \n\n\n\nN\n\n\n{\\displaystyle N}\n\n items on a machine with cache of size \n\n\n\nZ\n\n\n{\\displaystyle Z}\n\n and cache lines of length \n\n\n\nL\n\n\n{\\displaystyle L}\n\n is \n\n\n\nO\n(\n\n\nN\nL\n\n\n\nlog\n\nZ\n\n\n⁡\nN\n)\n\n\n{\\displaystyle O({\\frac {N}{L}}\\log _{Z}N)}\n\n, under the tall cache assumption that \n\n\n\nZ\n=\nΩ\n(\n\nL\n\n2\n\n\n)\n\n\n{\\displaystyle Z=\\Omega (L^{2})}\n\n. This number of memory transfers has been shown to be asymptotically optimal for comparison sorts. This distribution sort also achieves the asymptotically optimal runtime complexity of \n\n\n\nΘ\n(\nN\nlog\n⁡\nN\n)\n\n\n{\\displaystyle \\Theta (N\\log N)}\n\n.", 
    "classification": "Sorting Algorithms", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Cache-oblivious_distribution_sort\n", 
    "full_text": "The cache-oblivious distribution sort is a comparison-based sorting algorithm. It was introduced in 1999 in the context of the cache oblivious model. In the external memory model, the number of memory transfers it needs to perform a sort of \n\n\n\nN\n\n\n{\\displaystyle N}\n\n items on a machine with cache of size \n\n\n\nZ\n\n\n{\\displaystyle Z}\n\n and cache lines of length \n\n\n\nL\n\n\n{\\displaystyle L}\n\n is \n\n\n\nO\n(\n\n\nN\nL\n\n\n\nlog\n\nZ\n\n\n⁡\nN\n)\n\n\n{\\displaystyle O({\\frac {N}{L}}\\log _{Z}N)}\n\n, under the tall cache assumption that \n\n\n\nZ\n=\nΩ\n(\n\nL\n\n2\n\n\n)\n\n\n{\\displaystyle Z=\\Omega (L^{2})}\n\n. This number of memory transfers has been shown to be asymptotically optimal for comparison sorts. This distribution sort also achieves the asymptotically optimal runtime complexity of \n\n\n\nΘ\n(\nN\nlog\n⁡\nN\n)\n\n\n{\\displaystyle \\Theta (N\\log N)}\n\n.\n\n\nDistribution sort operates on a contiguous array of \n\n\n\nN\n\n\n{\\displaystyle N}\n\n elements. To sort the elements, it performs the following:\n\nAs mentioned in step 2 above, the goal of the distribution step is to distribute the sorted subarrays into q buckets \n\n\n\n\nB\n\n1\n\n\n,\n\nB\n\n2\n\n\n,\n…\n,\n\nB\n\nq\n\n\n.\n\n\n{\\displaystyle B_{1},B_{2},\\ldots ,B_{q}.}\n\n The distribution step algorithm maintains two invariants. The first is that each bucket has size at most \n\n\n\n2\n\n\nN\n\n\n\n\n{\\displaystyle 2{\\sqrt {N}}}\n\n at any time, and any element in bucket \n\n\n\n\nB\n\ni\n\n\n\n\n{\\displaystyle B_{i}}\n\n is no larger than any element in bucket \n\n\n\n\nB\n\ni\n+\n1\n\n\n.\n\n\n{\\displaystyle B_{i+1}.}\n\n The second is that every bucket has an associated pivot, a value which is greater than all elements in the bucket.\nInitially, the algorithm starts with one empty bucket with pivot \n\n\n\n∞\n\n\n{\\displaystyle \\infty }\n\n. As it fills buckets, it creates new buckets by splitting a bucket into two when it would be made overfull (by having at least \n\n\n\n(\n2\n\n\nN\n\n\n+\n1\n)\n\n\n{\\displaystyle (2{\\sqrt {N}}+1)}\n\n elements placed into it). The split is done by performing the linear time median finding algorithm, and partitioning based on this median. The pivot of the lower bucket will be set to the median found, and the pivot of the higher bucket will be set to the same as the bucket before the split. At the end of the distribution step, all elements are in the buckets, and the two invariants will still hold.\nTo accomplish this, each subarray and bucket will have a state associated with it. The state of a subarray consists of an index next of the next element to be read from the subarray, and a bucket number bnum indicating which bucket index the element should be copied to. By convention, \n\n\n\nb\nn\nu\nm\n=\n∞\n\n\n{\\displaystyle bnum=\\infty }\n\n if all elements in the subarray have been distributed. (Note that when we split a bucket, we have to increment all bnum values of all subarrays whose bnum value is greater than the index of the bucket that is split.) The state of a bucket consists of the value of the bucket's pivot, and the number of elements currently in the bucket.\nConsider the follow basic strategy: iterate through each subarray, attempting to copy over its element at position next. If the element is smaller than the pivot of bucket bnum, then place it in that bucket, possibly incurring a bucket split. Otherwise, increment bnum until a bucket whose pivot is large enough is found. Though this correctly distributes all elements, it does not exhibit a good cache performance.\nInstead, the distribution step is performed in a recursive divide-and-conquer. The step will be performed as a call to the function distribute, which takes three parameters i, j, and m. distribute(i,j,m) will distribute elements from the i-th through (i+m-1)-th subarrays into buckets, starting from \n\n\n\n\nB\n\nj\n\n\n\n\n{\\displaystyle B_{j}}\n\n. It requires as a precondition that each subarray r in the range \n\n\n\ni\n,\n…\n,\ni\n+\nm\n−\n1\n\n\n{\\displaystyle i,\\ldots ,i+m-1}\n\n has its \n\n\n\nb\nn\nu\nm\n[\nr\n]\n≥\nj\n\n\n{\\displaystyle bnum[r]\\geq j}\n\n. The execution of distribute(i,j,m) will guarantee that each \n\n\n\nb\nn\nu\nm\n[\nr\n]\n≥\nj\n+\nm\n\n\n{\\displaystyle bnum[r]\\geq j+m}\n\n. The whole distribution step is distribute\n\n\n\n(\n1\n,\n1\n,\n\n\nN\n\n\n)\n\n\n{\\displaystyle (1,1,{\\sqrt {N}})}\n\n. Pseudocode for the implementation of distribute is shown below:\nThe base case, where m=1, has a call to the subroutine copy_elems. In this base case, all elements from subarray i that belong to bucket j are added at once. If this leads to bucket j having too many elements, it splits the bucket with the procedure described beforehand.", 
    "name": "Cache Oblivious Distribution Sort"
}