{
    "about": "Carrier frequency offset (CFO) is one of many non-idealities in baseband receiver design. In designing a baseband receiver, we should notice not only the degradation invoked by non-ideal channel and noise, we should also regard RF and analog parts as the main consideration. Those non-idealities include sampling clock offset, IQ imbalance, power amplifier, phase noise and carrier frequency offset nonlinearity.", 
    "name": "Carrier Frequency Offset", 
    "classification": "Signal Processing", 
    "full_text": "Carrier frequency offset (CFO) is one of many non-idealities in baseband receiver design. In designing a baseband receiver, we should notice not only the degradation invoked by non-ideal channel and noise, we should also regard RF and analog parts as the main consideration. Those non-idealities include sampling clock offset, IQ imbalance, power amplifier, phase noise and carrier frequency offset nonlinearity.\nCarrier frequency offset often occurs when the local oscillator signal for down-conversion in the receiver does not synchronize with the carrier signal contained in the received signal. This phenomenon can be attributed to two important factors: frequency mismatch in the transmitter and the receiver oscillators; and the Doppler effect as the transmitter or the receiver is moving.\nWhen this occurs, the received signal will be shifted in frequency. For an OFDM system, the orthogonality among sub carriers is maintained only if the receiver uses a local oscillation signal that is synchronous with the carrier signal contained in the received signal. Otherwise, mismatch in carrier frequency can result in inter-carrier interference (ICI).The oscillators in the transmitter and the receiver can never be oscillating at identical frequency. Hence, carrier frequency offset always exists even if there is no Doppler effect.\nIn a standard-compliant communication system, such as the IEEE 802.11 WLAN the oscillator precision tolerance is specified to be less than ±20 ppm, so that CFO is in the range from - 40 ppm to +40 ppm.\n\n\nIf the TX oscillator runs at a frequency that is 20 ppm above the nominal frequency and if the RX oscillator is running at 20 ppm below, then the received baseband signal will have a CFO of 40 ppm. With a carrier frequency of 5.2 GHz in this standard, the CFO is up to ±208 kHz. In addition, if the transmitter or the receiver is moving, the Doppler effect adds some hundreds of hertz in frequency spreading.\nCompared to the CFO resulting from the oscillator mismatch, the Doppler effect in this case is relatively minor.\nGiven a carrier frequency offset,Δ\n\n\n\nf\n\n\n{\\displaystyle f}\n\n, the received continuous-time signal will be rotated by a constant frequency and is in the form of\n\n\n\n\n\nz\n\ni\n,\nn\n\n\n=\nz\n(\nt\n)\n\ne\n\nj\n2\nπ\nΔ\nf\nt\n\n\n\n\n|\n\n\nt\n=\ni\n(\nN\n+\n\nN\n\ng\n\n\n)\n\nT\n\ns\n\n\n+\n\nN\n\ng\n\n\n\nT\n\ns\n\n\n+\nn\n\nT\n\ns\n\n\n\n\n\n\n{\\displaystyle z_{i,n}=z(t)e^{j2\\pi \\Delta ft}|_{t=i(N+N_{g})T_{s}+N_{g}T_{s}+nT_{s}}}\n\n\nThe carrier frequency offset can first be normalized with respect to the sub carrier spacing (\n\n\n\n\nf\n\nS\n\n\n=\n1\n\n/\n\n(\nN\n\nT\n\ns\n\n\n)\n)\n\n\n{\\displaystyle f_{S}=1/(NT_{s}))}\n\n and then decomposed into the integral component \n\n\n\n(\n\nϵ\n\nI\n\n\n)\n\n\n{\\displaystyle (\\epsilon _{I})}\n\n and fractional component \n\n\n\n(\n\nϵ\n\nf\n\n\n)\n\n\n{\\displaystyle (\\epsilon _{f})}\n\n, that is, \n\n\n\nΔ\nf\n=\n(\n\nϵ\n\nI\n\n\n+\n\nϵ\n\nf\n\n\n)\n\nf\n\nS\n\n\n\n\n{\\displaystyle \\Delta f=(\\epsilon _{I}+\\epsilon _{f})f_{S}}\n\n and \n\n\n\n−\n0.5\n≤\n\nϵ\n\nf\n\n\n<\n0.5\n\n\n{\\displaystyle -0.5\\leq \\epsilon _{f}<0.5}\n\n. The received frequency-domain signal then becomes\n\n\n\n\n\nZ\n\ni\n,\nk\n\n\n=\n\nX\n\ni\n,\nk\n−\n\nϵ\n\nI\n\n\n\n\n\nH\n\nk\n−\n\nϵ\n\nI\n\n\n\n\n\n\n\nsin\n⁡\n(\nπ\n\nϵ\n\nf\n\n\n)\n\n\nN\nsin\n⁡\n(\nπ\n\nϵ\n\nf\n\n\n\n/\n\nN\n)\n\n\n\nexp\n⁡\n(\nj\n2\nπ\n\n\n\ni\n(\nN\n+\n\nN\n\ng\n\n\n)\n+\n\nN\n\ng\n\n\n\nN\n\n\n(\n\nϵ\n\nf\n\n\n+\n\nϵ\n\nI\n\n\n)\n)\nexp\n⁡\n(\nj\nπ\n\n\n\nN\n−\n1\n\nN\n\n\n\nϵ\n\nf\n\n\n)\n+\n\n∑\n\nl\n=\n−\nN\n\n/\n\n2\n,\nl\n≠\nk\n−\n\nϵ\n\nI\n\n\n\n\nN\n\n/\n\n2\n−\n1\n\n\n\n\nX\n\ni\n,\nl\n\n\n\nH\n\nl\n\n\n\n\n\nsin\n⁡\n(\nπ\n(\n\nϵ\n\nI\n\n\n+\n\nϵ\n\nf\n\n\n+\nl\n−\nk\n)\n)\n\n\nN\nsin\n⁡\n(\nπ\n(\n\nϵ\n\nI\n\n\n+\n\nϵ\n\nf\n\n\n+\nl\n−\nk\n)\n\n/\n\nN\n)\n\n\n\n\n×\nexp\n⁡\n(\nj\n2\nπ\n\n\n\ni\n(\nN\n+\n\nN\n\ng\n\n\n)\n+\n\nN\n\ng\n\n\n\nN\n\n\n\n(\n\nϵ\n\nI\n\n\n+\n\nϵ\n\nf\n\n\n\n)\nexp\n⁡\n(\nj\nπ\n\n\n\nN\n−\n1\n\nN\n\n\n(\n\nϵ\n\nI\n\n\n+\n\nϵ\n\nf\n\n\n+\nl\n−\nk\n)\n)\n+\n\nV\n\ni\n,\nk\n\n\n\n\n{\\displaystyle Z_{i,k}=X_{i,k-\\epsilon _{I}}H_{k-\\epsilon _{I}}{\\frac {\\sin(\\pi \\epsilon _{f})}{N\\sin(\\pi \\epsilon _{f}/N)}}\\exp(j2\\pi {\\frac {i(N+N_{g})+N_{g}}{N}}(\\epsilon _{f}+\\epsilon _{I}))\\exp(j\\pi {\\frac {N-1}{N}}\\epsilon _{f})+\\sum _{l=-N/2,l\\neq k-\\epsilon _{I}}^{N/2-1}{X_{i,l}H_{l}{\\frac {\\sin(\\pi (\\epsilon _{I}+\\epsilon _{f}+l-k))}{N\\sin(\\pi (\\epsilon _{I}+\\epsilon _{f}+l-k)/N)}}}\\times \\exp(j2\\pi {\\frac {i(N+N_{g})+N_{g}}{N}}{(\\epsilon _{I}+\\epsilon _{f}})\\exp(j\\pi {\\frac {N-1}{N}}(\\epsilon _{I}+\\epsilon _{f}+l-k))+V_{i,k}}\n\n\nThe second term of the equation denotes the ICI, namely signals from other subcarriers that interfere with the desired subcarrier signal. Also note that \n\n\n\n\nV\n\ni\n,\nk\n\n\n\n\n{\\displaystyle V_{i,k}}\n\n is the channel noise component. The fractional carrier frequency offset, \n\n\n\n\nϵ\n\nf\n\n\n\n\n{\\displaystyle \\epsilon _{f}}\n\n, results in attenuation in magnitude, phase shift, and ICI, while the integer carrier frequency offset, \n\n\n\n\nϵ\n\nI\n\n\n\n\n{\\displaystyle \\epsilon _{I}}\n\n, causes index shift as well as phase shift in the received frequency-domain signals. Note that the phase shift is identical in every subcarrier and is also proportional to the symbol index \n\n\n\ni\n\n\n{\\displaystyle i}\n\n.\nAn estimate of the CFO, if within a certain limit, can be obtained simultaneously when the coarse symbol timing is acquired by the algorithms mentioned earlier. The ML CFO estimator is given by\n\n\n\n\n\n\n\n\nΔ\nf\n\n^\n\n\n\n=\n\n\n1\n\n2\nπ\nL\n\nT\n\ns\n\n\n\n\n\n∠\n \n(\n\n∑\n\nr\n=\n0\n\n\nR\n−\n1\n\n\n\n\nz\n\nm\n−\nr\n\n\n\nz\n\nm\n−\nr\n−\nL\n\n\n∗\n\n\n\n)\n\n\n{\\displaystyle {\\widehat {\\Delta f}}={\\frac {1}{2\\pi LT_{s}}}\\angle \\ (\\sum _{r=0}^{R-1}{z_{m-r}z_{m-r-L}^{*}})}\n\n\nNote that the phase can only be resolved in \n\n\n\n\n[\n−\nπ\n,\nπ\n]\n\n\n\n{\\displaystyle \\left[-\\pi ,\\pi \\right]}\n\n, and the above formula estimates only the part of the CFO that is within \n\n\n\n\n[\n−\n1\n\n/\n\n(\n2\nL\n\nT\n\ns\n\n\n)\n,\n1\n\n/\n\n(\n2\nL\n\nT\n\ns\n\n\n)\n]\n\n\n\n{\\displaystyle \\left[-1/(2LT_{s}),1/(2LT_{s})\\right]}\n\n \n\n\n\nH\nz\n\n\n{\\displaystyle Hz}\n\n. If \n\n\n\nL\n=\nN\n\n\n{\\displaystyle L=N}\n\n, then \n\n\n\n\n\n\n\nΔ\nf\n\n^\n\n\n\n=\n\n\n\n\nϵ\n^\n\n\n\n\nf\n\n\n\nf\n\nS\n\n\n\n\n{\\displaystyle {\\widehat {\\Delta f}}={\\widehat {\\epsilon }}_{f}f_{S}}\n\n, the part of the CFO that is within plus and minus half the subcarrier spacing, also known as the fractional CFO. In the case in which \n\n\n\nL\n>\n1\n\n/\n\n(\nΔ\nf\n\nT\n\ns\n\n\n)\n\n\n{\\displaystyle L>1/(\\Delta fT_{s})}\n\n, frequency ambiguity occurs, and the total CFO must be resolved by additional integer CFO estimation.\nIf the preamble has U identical repetitions, where \n\n\n\nU\n>\n2\n\n\n{\\displaystyle U>2}\n\n, then another best linear unbiased estimator (BLUE) exploiting the correlation of the repeated segments is possible. Assume that there are R samples in a segment, so, in total, \n\n\n\nU\nR\n=\nN\n\n\n{\\displaystyle UR=N}\n\n samples are available. The BLUE estimation algorithm starts with computing several linear auto-correlation functions with \n\n\n\nu\nR\n\n\n{\\displaystyle uR}\n\n samples of delay,\n\n\n\n\n\nΦ\n\nB\nL\nU\nE\n(\nu\n)\n\n\n=\n\n\n1\n\nN\n−\nu\nR\n\n\n\n\n∑\n\nm\n=\nu\nR\n\n\nN\n−\n1\n\n\n\n\nz\n\nm\n\n\n\nz\n\nm\n−\nu\nR\n\n\n∗\n\n\n\n,\n \n \n \n \n \n \n \n0\n≤\nu\n≤\nK\n.\n\n\n{\\displaystyle \\Phi _{BLUE(u)}={\\frac {1}{N-uR}}\\sum _{m=uR}^{N-1}{z_{m}z_{m-uR}^{*}},\\ \\ \\ \\ \\ \\ \\ 0\\leq u\\leq K.}\n\n\nThen the phase differences between all pairs of auto-correlation functions with delay difference \n\n\n\nR\n\n\n{\\displaystyle R}\n\n are computed,\n\n\n\n\nϕ\n(\nu\n)\n=\n[\n∠\n\n{\n\nΦ\n\nB\nL\nU\nE\n\n\n(\nu\n)\n}\n\n]\n−\n∠\n\n{\n\nΦ\n\nB\nL\nU\nE\n\n\n(\nu\n−\n1\n)\n}\n\n\n]\n\n2\nπ\n\n\n \n \n \n \n \n1\n≤\nu\n≤\nK\n,\n\n\n{\\displaystyle \\phi (u)=[\\angle \\left\\{\\Phi _{BLUE}(u)\\right\\}]-\\angle \\left\\{\\Phi _{BLUE}(u-1)\\right\\}]_{2\\pi }\\ \\ \\ \\ \\ 1\\leq u\\leq K,}\n\n\nwhere \n\n\n\n[\n \n⋅\n \n\n]\n\n2\nπ\n\n\n\n\n{\\displaystyle [\\ \\cdot \\ ]_{2\\pi }}\n\n denotes a modulo-\n\n\n\n2\nπ\n\n\n{\\displaystyle 2\\pi }\n\n operation and \n\n\n\nK\n\n\n{\\displaystyle K}\n\n is a design parameter less than \n\n\n\nU\n\n\n{\\displaystyle U}\n\n. Note that each \n\n\n\nϕ\n(\nu\n)\n\n\n{\\displaystyle \\phi (u)}\n\n represents an estimate of the CFO, scaled by a constant. The smaller the constant \n\n\n\nu\n\n\n{\\displaystyle u}\n\n, the better accuracy it achieves. To gain an effective CFO estimate, the BLUE estimator uses a weighted average of all \n\n\n\nϕ\n(\nu\n)\n\n\n{\\displaystyle \\phi (u)}\n\n and computes\n\n\n\n\n\n\n\n\nΔ\nf\n\n^\n\n\n\n\n/\n\n\nf\n\nS\n\n\n=\n\n\nU\n\n2\nπ\n\n\n\n(\n\n∑\n\nu\n=\n1\n\n\nK\n\n\n\n\nw\n\nu\n\n\nϕ\n(\nu\n)\n\n)\n,\n\n\n{\\displaystyle {\\widehat {\\Delta f}}/f_{S}={\\frac {U}{2\\pi }}(\\sum _{u=1}^{K}{w_{u}\\phi (u)}),}\n\n\nwhere\n\n\n\n\n\nw\n\nu\n\n\n=\n3\n\n\n\n(\nU\n−\nu\n)\n(\nU\n−\nu\n+\n1\n)\n−\nK\n(\nU\n−\nK\n)\n\n\nK\n(\n4\n\nK\n\n2\n\n\n−\n6\nU\nK\n+\n3\n\nU\n\n2\n\n\n−\n1\n)\n\n\n\n\n\n{\\displaystyle w_{u}=3{\\frac {(U-u)(U-u+1)-K(U-K)}{K(4K^{2}-6UK+3U^{2}-1)}}}\n\n\nThe optimal \n\n\n\nK\n\n\n{\\displaystyle K}\n\n value for achieving the minimal variance of \n\n\n\n\n\n\n\nΔ\nf\n\n^\n\n\n\n\n\n{\\displaystyle {\\widehat {\\Delta f}}}\n\n is \n\n\n\nU\n\n/\n\n2\n\n\n{\\displaystyle U/2}\n\n. The range of estimated carrier frequency offset is \n\n\n\n−\nU\n\nf\n\nS\n\n\n\n/\n\n2\n≤\n\n\n\n\nΔ\nf\n\n^\n\n\n\n≤\nU\n\nf\n\nS\n\n\n\n/\n\n2\n\n\n{\\displaystyle -Uf_{S}/2\\leq {\\widehat {\\Delta f}}\\leq Uf_{S}/2}\n\n.\nWith some modification, this estimator can also be applied to preambles consisting of several repeated segments with specific sign changes. With proper acquired symbol timing, the received \n\n\n\nU\n\n\n{\\displaystyle U}\n\n segments of the preamble are multiplied by their respective signs, and then the same method as the BLUE estimator can be applied.\nIn the IEEE 802.16e OFDM mode standard, the oscillator deviation is within ±8 ppm. With the highest possible carrier frequency of 10.68 GHz, the maximum CFO is about ± 171 kHz when the transmitter LO and the receiver LO both have the largest yet opposite-sign frequency deviations, which is also equivalent to ± 1 1 sub carrier spacing \n\n\n\n(\n\nf\n\nS\n\n\n)\n\n\n{\\displaystyle (f_{S})}\n\n . In the 6 MHz DVB-T system, assuming that the oscillator deviation is within ±20 ppm and the carrier frequency is around 800 MHz, the maximum CFO can be up to ±38 subcarrier spacing \n\n\n\n(\n\nf\n\nS\n\n\n)\n\n\n{\\displaystyle (f_{S})}\n\n in the 8K transmission mode. From the previous discussion, it is clear that the estimated CFO obtained simultaneously in the coarse symbol boundary detection has ambiguity in frequency. In the following, algorithms for resolving such frequency ambiguity in the estimated carrier frequency offset will be presented.\nIn the 802.16e OFDM mode, the initial estimated CFO is within \n\n\n\n[\n−\n2\n\nf\n\nS\n\n\n,\n2\n\nf\n\nS\n\n\n]\n\n\n{\\displaystyle [-2f_{S},2f_{S}]}\n\n. Besides this estimation, additional frequency offset of \n\n\n\n±\n12\n\nf\n\nS\n\n\n\n\n{\\displaystyle \\pm 12f_{S}}\n\n, \n\n\n\n±\n8\n\nf\n\nS\n\n\n\n\n{\\displaystyle \\pm 8f_{S}}\n\n, or \n\n\n\n±\n4\n\nf\n\nS\n\n\n\n\n{\\displaystyle \\pm 4f_{S}}\n\n, is possible given a CFO range of \n\n\n\n±\n11\n\nf\n\nS\n\n\n\n\n{\\displaystyle \\pm 11f_{S}}\n\n. In order to estimate this additional integer CFO, a matched filter matching the fractional CFO-compensated received signal against the modulated long preamble waveforms can be used. The coefficients of the matched filter are the complex conjugate of the long preamble and they are modulated by a sinusoidal wave whose frequency is a possible integer CFO mentioned above. The output of the matched filter will have a maximum peak value if its coefficients are modulated by the carrier with the correct integer CFO. It is possible to deploy one such matched filter for each possible integer CFO. In this case, seven matched filters are needed. However, we can use only one set of matched filter hardware that handles different integer CFOs sequentially. In addition, as suggested previously in the symbol timing detection subsection, the coefficients of the matched filter can be quantized to -1, 0, 1 to reduce hardware complexity.\nIn MIMO-OFDM systems, the transmit antennas are often co-located, so are the receive antennas.\nHence, it is valid to assume that only one oscillator is referenced in either the transmitter side or the receiver side. As a result, a single CFO set is to be estimated for the multiple receive antennas. The ML estimation for the fractional CFO is quite popular in MIMO-OFDM systems.\nAnother fractional CFO estimation algorithm for MIMO-OFDM systems applies different weights to the receive Signals according to the respective degrees of channel fading\nThe preamble is designed so that each transmit antenna uses non-overlapping sub carriers to facilitate separation of signals from different transmit antennas. At each receive antenna, the cross-correlation between the received Signal and the known preamble is examined.\nThe magnitude of the cross-correlation output reflects the channel fading between the corresponding transmit and receive antenna pair.\nBased on the channel fading information, weights are applied to the received signals to emphasize those with stronger channel gains and at the same time to suppress those that are deeply faded.\nThen, the CFO is estimated based on the phase of delay correlation of weighted Signals.For integer CFO, frequency-domain cross-correlation and frequency-domain PN correlation can be used with slight modification. First, the received signals must be compensated by the estimated fractional CFO.\nThen, the compensated Signals are transformed into the frequency domain. The frequency-domain cross-correlation algorithm for one specific receive antenna is similar to that in the SISO case\nAlthough the CFO in the received Signal has been estimated and compensated in the receiver,some residual CFO may still exist. Besides, the CFO contained in the received signal may very well be time-varying and, thus, it needs to be continuously tracked.\nThe received signal also suffers from sampling clock offset (SCO), which may cause a gradual drift of the safe DFT window in addition to extra phase shift in the received frequency-domain Signals. In framebased OFDM systems, both the residual CFO tracking and the SCO tracking are inevitable, because the receiver may operate for a long period of time. In packet-based OFDM systems, however, the influences of these two offsets depend on the packet length and the magnitude of the offsets.\nThe SCO may not be easily estimated from the time-domain signal. However, it can be examined through the phase shift of the frequency-domain pilot Signals. The residual CFO can also be estimated in a similar way. In many OFDM wireless communication standards, for example, DVB-T, IEEE 802.11 a/g/n, and IEEE 802.16e OFDM mode, dedicated pilot subcarriers are allocated to facilitate receiver synchronization.\nThe phase shifts in the received frequency-domain Signals caused by the CFO are identical at all subcarriers provided that the ICI is ignored. On the other hand, the SCO causes phase shifts that are proportional to the respective sub carrier indices.\nThe received Signals contain ICI and noise, and therefore the phases deviate from the two ideal straight lines. Conventionally, the SCO can be estimated by computing a slope from the plot of measured pilot subcarrier phase differences versus pilot subcarrier indices. Moreover, joint estimation of CFO and SCO has also been studied extensively.\nIn order to suppress the ICI and thereby reduce SNR degradation, the residual CFO must be sufficiently small. For example, when using the 64QAM constellation, it is better to keep the residual CFO below O. OI/s to ensure that DSNR < 0 . 3 dB for moderate SNR.\nOn the other hand, when QPSK is used, the residual CFO can be up to 0.03 fs.", 
    "dbpedia_url": "http://dbpedia.org/resource/Carrier_frequency_offset", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Carrier_frequency_offset\n"
}