{
    "about": "Car–Parrinello molecular dynamics or CPMD refers to either a method used in molecular dynamics (also known as the Car–Parrinello method) or the computational chemistry software package used to implement this method.[1]", 
    "name": "Car–Parrinello Molecular Dynamics", 
    "classification": "Computational Physics", 
    "full_text": "Car–Parrinello molecular dynamics or CPMD refers to either a method used in molecular dynamics (also known as the Car–Parrinello method) or the computational chemistry software package used to implement this method.[1]\nThe CPMD method is related to the more common Born–Oppenheimer molecular dynamics (BOMD) method in that the quantum mechanical effect of the electrons is included in the calculation of energy and forces for the classical motion of the nuclei. However, whereas BOMD treats the electronic structure problem within the time-independent Schrödinger equation, CPMD explicitly includes the electrons as active degrees of freedom, via (fictitious) dynamical variables.\nThe software is a parallelized plane wave / pseudopotential implementation of density functional theory, particularly designed for ab initio molecular dynamics.[2]\n\n\nThe Car–Parrinello method is a type of molecular dynamics, usually employing periodic boundary conditions, planewave basis sets, and density functional theory, proposed by Roberto Car and Michele Parrinello in 1985, who were subsequently awarded the Dirac Medal by ICTP in 2009.\nIn contrast to Born–Oppenheimer molecular dynamics wherein the nuclear (ions) degree of freedom are propagated using ionic forces which are calculated at each iteration by approximately solving the electronic problem with conventional matrix diagonalization methods, the Car–Parrinello method explicitly introduces the electronic degrees of freedom as (fictitious) dynamical variables, writing an extended Lagrangian for the system which leads to a system of coupled equations of motion for both ions and electrons. In this way an explicit electronic minimization at each time step, as done in Born-Oppenheimer MD, is not needed: after an initial standard electronic minimization, the fictitious dynamics of the electrons keeps them on the electronic ground state corresponding to each new ionic configuration visited along the dynamics, thus yielding accurate ionic forces. In order to maintain this adiabaticity condition, it is necessary that the fictitious mass of the electrons is chosen small enough to avoid a significant energy transfer from the ionic to the electronic degrees of freedom. This small fictitious mass in turn requires that the equations of motion are integrated using a smaller time step than the one (1–10 fs) commonly used in Born–Oppenheimer molecular dynamics.\nIn CPMD the core electrons are usually described by a pseudopotential and the wavefunction of the valence electrons are approximated by a plane wave basis set.\nThe ground state electronic density (for fixed nuclei) is calculated self-consistently, usually using the density functional theory method. Then, using that density, forces on the nuclei can be computed, to update the trajectories (using, e.g. the Verlet integration algorithm). In addition, however, the coefficients used to obtain the electronic orbital functions can be treated as a set of extra spatial dimensions, and trajectories for the orbitals can be calculated in this context.\nCPMD is an approximation of the Born–Oppenheimer MD (BOMD) method. In BOMD the electrons' wavefunction must be minimized via matrix diagonalization at every step in the trajectory. CPMD uses fictitious dynamics[3] to keep the electrons close to the ground state, preventing the need for a costly self-consistent iterative minimization at each time step. The fictitious dynamics relies on the use of a fictitious electron mass (usually in the range of 400 – 800 a.u.) to ensure that there is very little energy transfer from nuclei to electrons, i.e. to ensure adiabaticity. Any increase in the fictitious electron mass resulting in energy transfer would cause the system to leave the ground-state BOMD surface.[4]\nwhere E[{ψi},{RI}] is the Kohn–Sham energy density functional, which outputs energy values when given Kohn–Sham orbitals and nuclear positions.\nwhere δij is the Kronecker delta.\nThe equations of motion are obtained by finding the stationary point of the Lagrangian under variations of ψi and RI, with the orthogonality constraint.[5]\nwhere Λij is a Lagrangian multiplier matrix to comply with the orthonormality constraint.\nIn the formal limit where μ → 0, the equations of motion approach Born–Oppenheimer molecular dynamics.[6]\n(1) Studying the behavior of water near a hydrophobic graphene sheet.[7]\n(2) Investigating the structure of liquid water at ambient temperature.[8]\n(3) Solving the heat transfer problems (heat conduction and thermal radiation) between Si/Ge superlattices.[9][10]\n(4) Probing the proton transfer along 1D water chains inside carbon nanotubes.[11]\n(5) Evaluating the critical point of aluminum.[12]", 
    "dbpedia_url": "http://dbpedia.org/resource/Car–Parrinello_molecular_dynamics", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Car–Parrinello_molecular_dynamics\n"
}