{
    "about": "In control theory, a causal system (also known as a physical or nonanticipative system) is a system where the output depends on past and current inputs but not future inputs—i.e., the output \n\n\n\ny\n(\n\nt\n\n0\n\n\n)\n\n\n{\\displaystyle y(t_{0})}\n\n only depends on the input \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n for values of \n\n\n\nt\n≤\n\nt\n\n0\n\n\n\n\n{\\displaystyle t\\leq t_{0}}\n\n.", 
    "name": "Causal System", 
    "classification": "Digital Signal Processing", 
    "full_text": "In control theory, a causal system (also known as a physical or nonanticipative system) is a system where the output depends on past and current inputs but not future inputs—i.e., the output \n\n\n\ny\n(\n\nt\n\n0\n\n\n)\n\n\n{\\displaystyle y(t_{0})}\n\n only depends on the input \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n for values of \n\n\n\nt\n≤\n\nt\n\n0\n\n\n\n\n{\\displaystyle t\\leq t_{0}}\n\n.\nThe idea that the output of a function at any time depends only on past and present values of input is defined by the property commonly referred to as causality. A system that has some dependence on input values from the future (in addition to possible dependence on past or current input values) is termed a non-causal or acausal system, and a system that depends solely on future input values is an anticausal system. Note that some authors have defined an anticausal system as one that depends solely on future and present input values or, more simply, as a system that does not depend on past input values.\nClassically, nature or physical reality has been considered to be a causal system. Physics involving special relativity or general relativity require more careful definitions of causality, as described elaborately in causality (physics).\nThe causality of systems also plays an important role in digital signal processing, where filters are constructed so that they are causal, sometimes by altering a non-causal formulation to remove the lack of causality so that it is realizable. For more information, see causal filter. For a causal system, the impulse response of the system must be 0 for all \n\n\n\nt\n<\n0\n\n\n{\\displaystyle t<0}\n\n. That is the sole necessary as well as sufficient condition for causality of a system, linear or non-linear. Note that similar rules apply to either discrete or continuous cases.\n\n\nDefinition 1: A system mapping \n\n\n\nx\n\n\n{\\displaystyle x}\n\n to \n\n\n\ny\n\n\n{\\displaystyle y}\n\n is causal if and only if, for any pair of input signals \n\n\n\n\nx\n\n1\n\n\n(\nt\n)\n\n\n{\\displaystyle x_{1}(t)}\n\n and \n\n\n\n\nx\n\n2\n\n\n(\nt\n)\n\n\n{\\displaystyle x_{2}(t)}\n\n such that\nthe corresponding outputs satisfy\nDefinition 2: Suppose \n\n\n\nh\n(\nt\n)\n\n\n{\\displaystyle h(t)}\n\n is the impulse response of the system \n\n\n\nH\n\n\n{\\displaystyle H}\n\n.[clarification needed] (only fully accurate for a system described by linear constant coefficient differential equation). The system \n\n\n\nH\n\n\n{\\displaystyle H}\n\n is causal if and only if\notherwise it is acausal.\nThe following examples are for systems with an input \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and output \n\n\n\ny\n\n\n{\\displaystyle y}\n\n.", 
    "dbpedia_url": "http://dbpedia.org/resource/Causal_system", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Causal_system\n"
}