{
    "about": "In signal processing, a causal filter is a linear and time-invariant causal system. The word causal indicates that the filter output depends only on past and present inputs. A filter whose output also depends on future inputs is non-causal, whereas a filter whose output depends only on future inputs is anti-causal. Systems (including filters) that are realizable (i.e. that operate in real time) must be causal because such systems cannot act on a future input. In effect that means the output sample that best represents the input at time \n\n\n\nt\n,\n\n\n{\\displaystyle t,}\n\n comes out slightly later. A common design practice for digital filters is to create a realizable filter by shortening and/or time-shifting a non-causal impulse response. If shortening is necessary, it is often accomplished as the product of the impulse-response with a window function.", 
    "name": "Causal Filter", 
    "classification": "Signal Processing", 
    "full_text": "In signal processing, a causal filter is a linear and time-invariant causal system. The word causal indicates that the filter output depends only on past and present inputs. A filter whose output also depends on future inputs is non-causal, whereas a filter whose output depends only on future inputs is anti-causal. Systems (including filters) that are realizable (i.e. that operate in real time) must be causal because such systems cannot act on a future input. In effect that means the output sample that best represents the input at time \n\n\n\nt\n,\n\n\n{\\displaystyle t,}\n\n comes out slightly later. A common design practice for digital filters is to create a realizable filter by shortening and/or time-shifting a non-causal impulse response. If shortening is necessary, it is often accomplished as the product of the impulse-response with a window function.\nAn example of an anti-causal filter is a maximum phase filter, which can be defined as a stable, anti-causal filter whose inverse is also stable and anti-causal.\nThe following definition is a moving (or \"sliding\") average of input data \n\n\n\ns\n(\nx\n)\n\n\n\n{\\displaystyle s(x)\\,}\n\n. A constant factor of 1/2 is omitted for simplicity:\nwhere x could represent a spatial coordinate, as in image processing. But if \n\n\n\nx\n\n\n\n{\\displaystyle x\\,}\n\n represents time \n\n\n\n(\nt\n)\n\n\n\n{\\displaystyle (t)\\,}\n\n, then a moving average defined that way is non-causal (also called non-realizable), because \n\n\n\nf\n(\nt\n)\n\n\n\n{\\displaystyle f(t)\\,}\n\n depends on future inputs, such as \n\n\n\ns\n(\nt\n+\n1\n)\n\n\n\n{\\displaystyle s(t+1)\\,}\n\n. A realizable output is\nwhich is a delayed version of the non-realizable output.\nAny linear filter (such as a moving average) can be characterized by a function h(t) called its impulse response. Its output is the convolution\nIn those terms, causality requires\nand general equality of these two expressions requires h(t) = 0 for all t < 0.\nLet h(t) be a causal filter with corresponding Fourier transform H(ω). Define the function\nwhich is non-causal. On the other hand, g(t) is Hermitian and, consequently, its Fourier transform G(ω) is real-valued. We now have the following relation\nwhere Θ(t) is the Heaviside unit step function.\nThis means that the Fourier transforms of h(t) and g(t) are related as follows\nwhere \n\n\n\n\n\n\nG\n^\n\n\n\n(\nω\n)\n\n\n\n{\\displaystyle {\\widehat {G}}(\\omega )\\,}\n\n is a Hilbert transform done in the frequency domain (rather than the time domain). The sign of \n\n\n\n\n\n\nG\n^\n\n\n\n(\nω\n)\n\n\n\n{\\displaystyle {\\widehat {G}}(\\omega )\\,}\n\n may depend on the definition of the Fourier Transform.\nTaking the Hilbert transform of the above equation yields this relation between \"H\" and its Hilbert transform:", 
    "dbpedia_url": "http://dbpedia.org/resource/Causal_filter", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Causal_filter\n"
}