{
    "about": "A cepstrum (/ˈkɛpstrumˈˌˈsɛpstrumˈ/) is the result of taking the inverse Fourier transform (IFT) of the logarithm of the estimated spectrum of a signal. It may be pronounced in the two ways given, the second having the advantage of avoiding confusion with 'kepstrum' which also exists (see below). There is a complex cepstrum, a real cepstrum, a power cepstrum, and a phase cepstrum. The power cepstrum in particular finds applications in the analysis of human speech.", 
    "name": "Cepstrum", 
    "classification": "Signal Processing", 
    "full_text": "A cepstrum (/ˈkɛpstrumˈˌˈsɛpstrumˈ/) is the result of taking the inverse Fourier transform (IFT) of the logarithm of the estimated spectrum of a signal. It may be pronounced in the two ways given, the second having the advantage of avoiding confusion with 'kepstrum' which also exists (see below). There is a complex cepstrum, a real cepstrum, a power cepstrum, and a phase cepstrum. The power cepstrum in particular finds applications in the analysis of human speech.\nThe name \"cepstrum\" was derived by reversing the first four letters of \"spectrum\". Operations on cepstra are labelled quefrency analysis (aka quefrency alanysis[1]), liftering, or cepstral analysis.\n\n\nThe power cepstrum was defined in a 1963 paper by Bogert et al.[1] The power cepstrum of a signal is defined as the squared magnitude of the inverse Fourier transform of the logarithm of the squared magnitude of the Fourier transform of a signal.[2]\nA short-time cepstrum analysis was proposed by Schroeder and Noll for application to pitch determination of human speech.[3][4][5]\nThe complex cepstrum was defined by Oppenheim in his development of homomorphic system theory[6] and is defined as the Inverse Fourier transform of the logarithm (with unwrapped phase) of the Fourier transform of the signal. This is sometimes called the spectrum of a spectrum.\nThe real cepstrum uses the logarithm function defined for real values. The real cepstrum is related to the power via the relationship (4 * real cepstrum)^2 = power cepstrum, and is related to the complex cepstrum as real cepstrum = 0.5*(complex cepstrum + time reversal of complex cepstrum).\nThe complex cepstrum uses the complex logarithm function defined for complex values. The phase cepstrum is related to the complex cepstrum as phase spectrum = (complex cepstrum - time reversal of complex cepstrum)^2.\nThe complex cepstrum holds information about magnitude and phase of the initial spectrum, allowing the reconstruction of the signal. The real cepstrum uses only the information of the magnitude of the spectrum.\nMany texts define the process as FT → abs() → log → IFT, i.e., that the cepstrum is the \"inverse Fourier transform of the log-magnitude Fourier spectrum\".[7][8] (the difference between squaring or taking the absolute value amounts to an overall factor of 2)\nThe kepstrum, which stands for \"Kolmogorov equation power series time response\", is similar to the cepstrum and has the same relation to it as expected value has to statistical average, i.e. cepstrum is the empirically measured quantity while kepstrum is the theoretical quantity. It was in use before the cepstrum.[9][10]\nThe cepstrum can be seen as information about rate of change in the different spectrum bands. It was originally invented for characterizing the seismic echoes resulting from earthquakes and bomb explosions. It has also been used to determine the fundamental frequency of human speech and to analyze radar signal returns. Cepstrum pitch determination is particularly effective because the effects of the vocal excitation (pitch) and vocal tract (formants) are additive in the logarithm of the power spectrum and thus clearly separate.[5]\nThe autocepstrum is defined as the cepstrum of the autocorrelation. The autocepstrum is more accurate than the cepstrum in the analysis of data with echoes.\nThe cepstrum is a representation used in homomorphic signal processing, to convert signals (such as a source and filter) combined by convolution into sums of their cepstra, for linear separation. In particular, the power cepstrum is often used as a feature vector for representing the human voice and musical signals. For these applications, the spectrum is usually first transformed using the mel scale. The result is called the mel-frequency cepstrum or MFC (its coefficients are called mel-frequency cepstral coefficients, or MFCCs). It is used for voice identification, pitch detection and much more. The cepstrum is useful in these applications because the low-frequency periodic excitation from the vocal cords and the formant filtering of the vocal tract, which convolve in the time domain and multiply in the frequency domain, are additive and in different regions in the frequency domain.\nThe independent variable of a cepstral graph is called the quefrency. The quefrency is a measure of time, though not in the sense of a signal in the time domain. For example, if the sampling rate of an audio signal is 44100 Hz and there is a large peak in the cepstrum whose quefrency is 100 samples, the peak indicates the presence of a pitch that is 44100/100 = 441 Hz. This peak occurs in the cepstrum because the harmonics in the spectrum are periodic, and the period corresponds to the pitch. Note that a pure sine wave should not be used to test the cepstrum for its pitch determination from quefrency as a pure sine wave does not contain any harmonics. Rather, a test signal containing harmonics should be used (such as the sum of at least two sines where the second sine is some harmonic (multiple) of the first sine).\nPlaying further on the anagram theme, a filter that operates on a cepstrum might be called a lifter. A low-pass lifter is similar to a low-pass filter in the frequency domain. It can be implemented by multiplying by a window in the quefrency domain and then converting back to the frequency domain, resulting in a smoother signal.\nA very important property of the cepstral domain is that the convolution of two signals can be expressed as the addition of their complex cepstra:", 
    "dbpedia_url": "http://dbpedia.org/resource/Cepstrum", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Cepstrum\n"
}