{
    "about": "Swerling models were introduced by Peter Swerling and are used to describe the statistical properties of the radar cross-section of complex objects.", 
    "classification": "Signal Processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Chi-squared_target_models\n", 
    "full_text": "Swerling models were introduced by Peter Swerling and are used to describe the statistical properties of the radar cross-section of complex objects.\n\n\nSwerling target models give the radar cross-section (RCS) of a given object using a distribution in the location-scale family of the chi-squared distribution.\nwhere \n\n\n\n\nσ\n\na\nv\n\n\n\n\n{\\displaystyle \\sigma _{av}}\n\n refers to the mean value of \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n. This is not always easy to determine, as certain objects may be viewed the most frequently from a limited range of angles. For instance, a sea-based radar system is most likely to view a ship from the side, the front, and the back, but never the top or the bottom. \n\n\n\nm\n\n\n{\\displaystyle m}\n\n is the degree of freedom divided by 2. The degree of freedom used in the chi-squared probability density function is a positive number related to the target model. Values of \n\n\n\nm\n\n\n{\\displaystyle m}\n\n between 0.3 and 2 have been found to closely approximate certain simple shapes, such as cylinders or cylinders with fins.\nSince the ratio of the standard deviation to the mean value of the chi-squared distribution is equal to \n\n\n\nm\n\n\n{\\displaystyle m}\n\n−1/2, larger values of \n\n\n\nm\n\n\n{\\displaystyle m}\n\n will result in smaller fluctuations. If \n\n\n\nm\n\n\n{\\displaystyle m}\n\n equals infinity, the target's RCS is non-fluctuating.\nSwerling target models are special cases of the Chi-Squared target models with specific degrees of freedom. There are five different Swerling models, numbered I through V:\nA model where the RCS varies according to a Chi-squared probability density function with two degrees of freedom (\n\n\n\nm\n=\n1\n\n\n{\\displaystyle m=1}\n\n). This applies to a target that is made up of many independent scatterers of roughly equal areas. As few as half a dozen scattering surfaces can produce this distribution. Swerling I describes a target whose radar cross-section is constant throughout a single scan, but varies independently from scan to scan. In this case, the pdf reduces to\nSwerling I has been shown to be a good approximation when determining the RCS of objects in aviation.\nSimilar to Swerling I, except the RCS values returned are independent from pulse to pulse, instead of scan to scan.\nA model where the RCS varies according to a Chi-squared probability density function with four degrees of freedom (\n\n\n\nm\n=\n2\n\n\n{\\displaystyle m=2}\n\n). This PDF approximates an object with one large scattering surface with several other small scattering surfaces. The RCS is constant through a single scan just as in Swerling I. The pdf becomes\nSimilar to Swerling III, but the RCS varies from pulse to pulse rather than from scan to scan.\nConstant RCS, corresponding to infinite degrees of freedom (\n\n\n\nm\n→\n∞\n\n\n{\\displaystyle m\\to \\infty }\n\n).", 
    "name": "Chi Squared Target Models"
}