{
    "about": "A chirp is a signal in which the frequency increases (up-chirp) or decreases (down-chirp) with time. In some sources, the term chirp is used interchangeably with sweep signal.[1] It is commonly used in sonar and radar, but has other applications, such as in spread-spectrum communications. In spread-spectrum usage, surface acoustic wave (SAW) devices such as reflective array compressors (RACs) are often used to generate and demodulate the chirped signals. In optics, ultrashort laser pulses also exhibit chirp, which, in optical transmission systems, interacts with the dispersion properties of the materials, increasing or decreasing total pulse dispersion as the signal propagates. The name is a reference to the chirping sound made by birds; see bird vocalization.", 
    "name": "Chirp", 
    "classification": "Signal Processing", 
    "full_text": "A chirp is a signal in which the frequency increases (up-chirp) or decreases (down-chirp) with time. In some sources, the term chirp is used interchangeably with sweep signal.[1] It is commonly used in sonar and radar, but has other applications, such as in spread-spectrum communications. In spread-spectrum usage, surface acoustic wave (SAW) devices such as reflective array compressors (RACs) are often used to generate and demodulate the chirped signals. In optics, ultrashort laser pulses also exhibit chirp, which, in optical transmission systems, interacts with the dispersion properties of the materials, increasing or decreasing total pulse dispersion as the signal propagates. The name is a reference to the chirping sound made by birds; see bird vocalization.\n\n\nIf a waveform is defined as:\nthen the instantaneous frequency is defined to be the phase rate:\nand the (instantaneous) chirpyness is defined to be the frequency rate:[a]\nIn a linear chirp, the instantaneous frequency \n\n\n\nf\n(\nt\n)\n\n\n{\\displaystyle f(t)}\n\n varies exactly linearly with time:\nwhere \n\n\n\n\nf\n\n0\n\n\n\n\n{\\displaystyle f_{0}}\n\n is the starting frequency (at time \n\n\n\nt\n=\n0\n\n\n{\\displaystyle t=0}\n\n), and \n\n\n\nk\n\n\n{\\displaystyle k}\n\n is the rate of frequency change or chirpyness.\nwhere \n\n\n\n\nf\n\n1\n\n\n\n\n{\\displaystyle f_{1}}\n\n is the final frequency and \n\n\n\n\nf\n\n0\n\n\n\n\n{\\displaystyle f_{0}}\n\n is the starting frequency. \n\n\n\nT\n\n\n{\\displaystyle T}\n\n is the time it takes to sweep from \n\n\n\n\nf\n\n0\n\n\n\n\n{\\displaystyle f_{0}}\n\n to \n\n\n\n\nf\n\n1\n\n\n\n\n{\\displaystyle f_{1}}\n\n.\nThe corresponding time-domain function for the phase of any oscillating signal is the integral of the frequency function, since one expects the phase to grow like \n\n\n\nϕ\n(\nt\n+\nΔ\nt\n)\n≃\nϕ\n(\nt\n)\n+\n2\nπ\nf\n(\nt\n)\n\nΔ\nt\n\n\n{\\displaystyle \\phi (t+\\Delta t)\\simeq \\phi (t)+2\\pi f(t)\\,\\Delta t}\n\n, i.e., that the derivative of the phase is the angular frequency \n\n\n\n\nϕ\n′\n\n(\nt\n)\n=\n2\nπ\n\nf\n(\nt\n)\n\n\n{\\displaystyle \\phi '(t)=2\\pi \\,f(t)}\n\n.\nFor the linear chirp, this results in:\nwhere \n\n\n\n\nϕ\n\n0\n\n\n\n\n{\\displaystyle \\phi _{0}}\n\n is the initial phase (at time \n\n\n\nt\n=\n0\n\n\n{\\displaystyle t=0}\n\n). Thus this is also called quadratic-phase signal.[3]\nThe corresponding time-domain function for a sinusoidal linear chirp is the sine of the phase in radians:\nIn a geometric chirp, also called an exponential chirp, the frequency of the signal varies with a geometric relationship over time. In other words, if two points in the waveform are chosen, \n\n\n\n\nt\n\n1\n\n\n\n\n{\\displaystyle t_{1}}\n\n and \n\n\n\n\nt\n\n2\n\n\n\n\n{\\displaystyle t_{2}}\n\n, and the time interval between them \n\n\n\n\nt\n\n2\n\n\n−\n\nt\n\n1\n\n\n\n\n{\\displaystyle t_{2}-t_{1}}\n\n is kept constant, the frequency ratio \n\n\n\nf\n(\n\nt\n\n2\n\n\n)\n\n/\n\nf\n(\n\nt\n\n1\n\n\n)\n\n\n{\\displaystyle f(t_{2})/f(t_{1})}\n\n will also be constant.\nIn an exponential chirp, the frequency of the signal varies exponentially as a function of time:\nwhere \n\n\n\n\nf\n\n0\n\n\n\n\n{\\displaystyle f_{0}}\n\n is the starting frequency (at \n\n\n\nt\n=\n0\n\n\n{\\displaystyle t=0}\n\n), and \n\n\n\nk\n\n\n{\\displaystyle k}\n\n is the rate of exponential change in frequency. Unlike the linear chirp, which has a constant chirpyness, an exponential chirp has an exponentially increasing frequency rate.\nThe corresponding time-domain function for the phase of an exponential chirp is the integral of the frequency:\nWhere \n\n\n\n\nϕ\n\n0\n\n\n\n\n{\\displaystyle \\phi _{0}}\n\n is the initial phase (at \n\n\n\nt\n=\n0\n\n\n{\\displaystyle t=0}\n\n).\nThe corresponding time-domain function for a sinusoidal exponential chirp is the sine of the phase in radians:\nAs was the case for the Linear Chirp, the instantaneous frequency of the Exponential Chirp consists of the fundamental frequency \n\n\n\nf\n(\nt\n)\n=\n\nf\n\n0\n\n\n\nk\n\nt\n\n\n\n\n{\\displaystyle f(t)=f_{0}k^{t}}\n\n accompanied by additional harmonics.[citation needed]\nA chirp signal can be generated with analog circuitry via a voltage-controlled oscillator (VCO), and a linearly or exponentially ramping control voltage. It can also be generated digitally by a digital signal processor (DSP) and digital to analog converter (DAC), using a direct digital synthesizer (DDS) and by varying the step in the numerically controlled oscillator. It can also be generated by a YIG oscillator.[clarification needed]\nA chirp signal shares the same spectral content with an impulse signal. However, unlike in the impulse signal, spectral components of the chirp signal have different phases,[4][5][6] i.e., their power spectra are alike but the phase spectra are distinct. Dispersion of a signal propagation medium may result in unintentional conversion of impulse signals into chirps. On the other hand, many practical applications, such as chirped pulse amplifiers or echolocation systems,[6] use chirp signals instead of impulses because of their inherently lower PAPR.\nChirp modulation, or linear frequency modulation for digital communication, was patented by Sidney Darlington in 1954 with significant later work performed by Winkler in 1962. This type of modulation employs sinusoidal waveforms whose instantaneous frequency increases or decreases linearly over time. These waveforms are commonly referred to as linear chirps or simply chirps.\nHence the rate at which their frequency changes is called the chirp rate. In binary chirp modulation, binary data is transmitted by mapping the bits into chirps of opposite chirp rates. For instance, over one bit period \"1\" is assigned a chirp with positive rate a and \"0\" a chirp with negative rate −a. Chirps have been heavily used in radar applications and as a result advanced sources for transmission and matched filters for reception of linear chirps are available.\nAnother kind of chirp is the projective chirp, of the form:\nhaving the three parameters a (scale), b (translation), and c (chirpiness). The projective chirp is ideally suited to image processing, and forms the basis for the projective chirplet transform.[2]\nA change in frequency of Morse code from the desired frequency, due to poor stability in the RF oscillator, is known as chirp,[7] and in the RST code is given an appended letter 'C'.", 
    "dbpedia_url": "http://dbpedia.org/resource/Chirp", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Chirp\n"
}