{
    "about": "Clipping is a form of distortion that limits a signal once it exceeds a threshold. Clipping may occur when a signal is recorded by a sensor that has constraints on the range of data it can measure, it can occur when a signal is digitized, or it can occur any other time an analog or digital signal is transformed, particularly in the presence of gain or overshoot and undershoot.", 
    "name": "Clipping (Signal Processing)", 
    "classification": "Signal Processing", 
    "full_text": "Clipping is a form of distortion that limits a signal once it exceeds a threshold. Clipping may occur when a signal is recorded by a sensor that has constraints on the range of data it can measure, it can occur when a signal is digitized, or it can occur any other time an analog or digital signal is transformed, particularly in the presence of gain or overshoot and undershoot.\nClipping may be described as hard, in cases where the signal is strictly limited at the threshold, producing a flat cutoff; or it may be described as soft, in cases where the clipped signal continues to follow the original at a reduced gain. Hard clipping results in many high frequency harmonics; soft clipping results in fewer higher order harmonics and intermodulation distortion components.\n\n\nIn the audio domain, clipping may be heard as general distortion or as pops.\nBecause the clipped waveform has more area underneath it than the smaller unclipped waveform, the amplifier produces more power than its rated (sine wave) output when it is clipping. This extra power can damage any part of the loudspeaker, including the woofer, or the tweeter, by causing over-excursion, or by overheating the voice coil. It may cause damage to the amplifier's power supply or simply blow a fuse.\nIn the frequency domain, clipping produces strong harmonics in the high frequency range (as the clipped waveform comes closer to a squarewave). The extra high frequency weighting of the signal could make tweeter damage more likely than if the signal was not clipped. However most loudspeakers are designed to handle signals like cymbal crashes that have even more high frequency weighting than amplifier clipping produces, so damage attributable to this characteristic is rare.\nMany electric guitar players intentionally overdrive their amplifiers (or insert a \"fuzz box\") to cause clipping in order to get a desired sound (see guitar distortion).\nSome audiophiles believe that the clipping behavior of vacuum tubes with little or no negative feedback is superior to that of transistors, in that vacuum tubes clip more gradually than transistors (i.e. soft clipping, and mostly even harmonics), resulting in harmonic distortion that is generally less objectionable. In general though, the distortion associated with clipping is unwanted, and is visible on an oscilloscope even if it is inaudible.[1] Even in a transistorised amplifier with hard clipping, the gain of the transistor will be reducing (leading to nonlinear distortion) as the output current increases and the voltage across the transistor reduces close to the saturation voltage (for bipolar transistors), and so \"full power\" for the purposes of measuring distortion in amplifiers is usually taken as a few percent below clipping.\nIn the image domain, clipping is seen as desaturated (washed-out) bright areas that turn to pure white if all color components clip.\nA circuit designer may intentionally use a clipper or clamper to keep a signal within a desired range.\nWhen an amplifier is pushed to create a signal with more power than it can support, it will amplify the signal only up to its maximum capacity, at which point the signal will be amplified no further.\nIn digital signal processing, clipping occurs when the signal is restricted by the range of a chosen representation. For example in a system using 16-bit signed integers, 32767 is the largest positive value that can be represented, and if during processing the amplitude of the signal is doubled, sample values of 32000 should become 64000, but instead they are truncated to the maximum, 32767. Clipping is preferable to the alternative in digital systems — wrapping — which occurs if the digital hardware is allowed to \"overflow\", ignoring the most significant bits of the magnitude, and sometimes even the sign of the sample value, resulting in gross distortion of the signal.\nThe incidence of clipping may be greatly reduced by using floating point numbers instead of integers. However, floating point numbers are usually less efficient to use, sometimes result in a loss of precision, and they can still clip if a number is extremely large or small.\nClipping can be detected by viewing the signal (on an oscilloscope, for example), and observing that the tops and bottoms of waves aren't smooth anymore. When working with images, some tools can highlight all pixels that are pure white, allowing the user to identify larger groups of white pixels and decide if too much clipping has occurred.\nTo avoid clipping, the signal can be dynamically reduced using a limiter. If not done carefully, this can still cause undesirable distortion, but it prevents any data from being completely lost.\nWhen clipping occurs, part of the original signal is lost, so perfect restoration is impossible. Thus, it is much preferable to avoid clipping in the first place. However, when repair is the only option, the goal is to make up a plausible replacement for the clipped part of the signal.", 
    "dbpedia_url": "http://dbpedia.org/resource/Clipping_(signal_processing)", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Clipping_(signal_processing)\n"
}