{
    "about": "The spectral coherence is a statistic that can be used to examine the relation between two signals or data sets. It is commonly used to estimate the power transfer between input and output of a linear system. If the signals are ergodic, and the system function linear, it can be used to estimate the causality between the input and output.", 
    "name": "Coherence (Signal Processing)", 
    "classification": "Signal Processing", 
    "full_text": "The spectral coherence is a statistic that can be used to examine the relation between two signals or data sets. It is commonly used to estimate the power transfer between input and output of a linear system. If the signals are ergodic, and the system function linear, it can be used to estimate the causality between the input and output.\n\n\nThe coherence (sometimes called magnitude-squared coherence) between two signals x(t) and y(t) is a real-valued function that is defined as:[1][2]\nwhere Gxy(f) is the Cross-spectral density between x and y, and Gxx(f) and Gyy(f) the autospectral density of x and y respectively. The magnitude of the spectral density is denoted as |G|. Given the restrictions noted above (ergodicity, linearity) the coherence function estimates the extent to which y(t) may be predicted from x(t) by an optimum linear least squares function.\nValues of coherence will always satisfy \n\n\n\n0\n≤\n\nC\n\nx\ny\n\n\n(\nf\n)\n≤\n1\n\n\n{\\displaystyle 0\\leq C_{xy}(f)\\leq 1}\n\n. For an ideal constant parameter linear system with a single input x(t) and single output y(t), the coherence will be equal to one. To see this, consider a linear system with an impulse response h(t) defined as: \n\n\n\ny\n(\nt\n)\n=\nh\n(\nt\n)\n∗\nx\n(\nt\n)\n\n\n{\\displaystyle y(t)=h(t)*x(t)}\n\n, where * denotes convolution. In the Fourier domain this equation becomes \n\n\n\nY\n(\nf\n)\n=\nH\n(\nf\n)\nX\n(\nf\n)\n\n\n{\\displaystyle Y(f)=H(f)X(f)}\n\n, where Y(f) is the Fourier transform of y(t) and H(f) is the linear system transfer function. Since, for an ideal linear system: \n\n\n\n\nG\n\ny\ny\n\n\n=\n\n|\n\nH\n(\nf\n)\n\n\n|\n\n\n2\n\n\n\nG\n\nx\nx\n\n\n(\nf\n)\n\n\n{\\displaystyle G_{yy}=|H(f)|^{2}G_{xx}(f)}\n\n and \n\n\n\n\nG\n\nx\ny\n\n\n=\nH\n(\nf\n)\n\nG\n\nx\nx\n\n\n(\nf\n)\n\n\n{\\displaystyle G_{xy}=H(f)G_{xx}(f)}\n\n, and since \n\n\n\n\nG\n\nx\nx\n\n\n(\nf\n)\n\n\n{\\displaystyle G_{xx}(f)}\n\n is real, the following identity holds,\nHowever, in the physical world an ideal linear system is rarely realized, noise is an inherent component of system measurement, and it is likely that a single input, single output linear system is insufficient to capture the complete system dynamics. In cases where the ideal linear system assumptions are insufficient, the Cauchy–Schwarz inequality guarantees a value of \n\n\n\n\nC\n\nx\ny\n\n\n≤\n1\n\n\n{\\displaystyle C_{xy}\\leq 1}\n\n.\nIf Cxy is less than one but greater than zero it is an indication that either: noise is entering the measurements, that the assumed function relating x(t) and y(t) is not linear, or that y(t) is producing output due to input x(t) as well as other inputs. If the coherence is equal to zero, it is an indication that x(t) and y(t) are completely unrelated, given the constraints mentioned above.\nThe coherence of a linear system therefore represents the fractional part of the output signal power that is produced by the input at that frequency. We can also view the quantity \n\n\n\n1\n−\n\nC\n\nx\ny\n\n\n\n\n{\\displaystyle 1-C_{xy}}\n\n as an estimate of the fractional power of the output that is not contributed by the input at a particular frequency. This leads naturally to definition of the coherent output spectrum:\n\n\n\n\n\nG\n\nv\nv\n\n\n\n\n{\\displaystyle G_{vv}}\n\n provides a spectral quantification of the output power that is uncorrelated with noise or other inputs.\nHere we illustrate the computation of coherence (denoted as \n\n\n\n\nγ\n\n2\n\n\n\n\n{\\displaystyle \\gamma ^{2}}\n\n) as shown in figure 1. Consider the two signals shown in the lower portion of figure 2. There appears to be a close relationship between the ocean surface water levels and the groundwater well levels. It is also clear that the barometric pressure has an effect on both the ocean water levels and groundwater levels.\nFigure 3 shows the autospectral density of ocean water level over a long period of time.\nAs expected, most of the energy is centered on the well-known tidal frequencies. Likewise, the autospectral density of groundwater well levels are shown in figure 4.\nIt is clear that variation of the groundwater levels have significant power at the ocean tidal frequencies. To estimate the extent at which the groundwater levels are influenced by the ocean surface levels, we compute the coherence between them. Let us assume that there is a linear relationship between the ocean surface height and the groundwater levels. We further assume that the ocean surface height controls the groundwater levels so that we take the ocean surface height as the input variable, and the groundwater well height as the output variable.\nThe computed coherence (figure 1) indicates that at most of the major ocean tidal frequencies the variation of groundwater level at this particular site is over 90% due to the forcing of the ocean tides. However, one must exercise caution in attributing causality. If the relation (transfer function) between the input and output is nonlinear, then values of the coherence can be erroneous. Another common mistake is to assume a causal input/output relation between observed variables, when in fact the causative mechanism is not in the system model. For example, it is clear that the atmospheric barometric pressure induces a variation in both the ocean water levels and the groundwater levels, but the barometric pressure is not included in the system model as an input variable. We have also assumed that the ocean water levels drive or control the groundwater levels. In reality it is a combination of hydrological forcing from the ocean water levels and the tidal potential that are driving both the observed input and output signals. Additionally, noise introduced in the measurement process, or by the spectral signal processing can contribute to or corrupt the coherence.\nIf the signals are non-stationary, (and therefore not ergodic), the above formulations may not be appropriate. For such signals, the concept of coherence has been extended by using the concept of time-frequency distributions to represent the time-varying spectral variations of non-stationary signals in lieu of traditional spectra. For more details, see.[3]\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Coherence_(signal_processing)", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Coherence_(signal_processing)\n"
}