{
    "about": "Collision detection typically refers to the computational problem of detecting the intersection of two or more objects. While the topic is most often associated with its use in video games and other physical simulations, it also has applications in robotics. In addition to determining whether two objects have collided, collision detection systems may also calculate time of impact (TOI), and report a contact manifold (the set of intersecting points).[1] Collision response deals with simulating what happens when a collision is detected (see physics engine, ragdoll physics). Solving collision detection problems requires extensive use of concepts from linear algebra and computational geometry.", 
    "name": "Collision Detection", 
    "classification": "Computational Physics", 
    "full_text": "Collision detection typically refers to the computational problem of detecting the intersection of two or more objects. While the topic is most often associated with its use in video games and other physical simulations, it also has applications in robotics. In addition to determining whether two objects have collided, collision detection systems may also calculate time of impact (TOI), and report a contact manifold (the set of intersecting points).[1] Collision response deals with simulating what happens when a collision is detected (see physics engine, ragdoll physics). Solving collision detection problems requires extensive use of concepts from linear algebra and computational geometry.\n\n\nIn physical simulation, we wish to conduct experiments, such as playing billiards. The physics of bouncing billiard balls are well understood, under the umbrella of rigid body motion and elastic collisions. An initial description of the situation would be given, with a very precise physical description of the billiard table and balls, as well as initial positions of all the balls. Given a force applied to the cue ball (probably resulting from a player hitting the ball with his or her cue stick), we want to calculate the trajectories, precise motion, and eventual resting places of all the balls with a computer program. A program to simulate this game would consist of several portions, one of which would be responsible for calculating the precise impacts between the billiard balls. This particular example also turns out to be ill conditioned: a small error in any calculation will cause drastic changes in the final position of the billiard balls.\nVideo games have similar requirements, with some crucial differences. While physical simulation needs to simulate real-world physics as precisely as possible, video games need to simulate real-world physics in an acceptable way, in real time and robustly. Compromises are allowed, so long as the resulting simulation is satisfying to the game players.\nPhysical simulators differ in the way they react on a collision. Some use the softness of the material to calculate a force, which will resolve the collision in the following time steps like it is in reality. Due to the low softness of some materials this is very CPU intensive. Some simulators estimate the time of collision by linear interpolation, roll back the simulation, and calculate the collision by the more abstract methods of conservation laws.\nSome iterate the linear interpolation (Newton's method) to calculate the time of collision with a much higher precision than the rest of the simulation. Collision detection utilizes time coherence to allow even finer time steps without much increasing CPU demand, such as in air traffic control.\nAfter an inelastic collision, special states of sliding and resting can occur and, for example, the Open Dynamics Engine uses constraints to simulate them. Constraints avoid inertia and thus instability. Implementation of rest by means of a scene graph avoids drift.\nIn other words, physical simulators usually function one of two ways, where the collision is detected a posteriori (after the collision occurs) or a priori (before the collision occurs). In addition to the a posteriori and a priori distinction, almost all modern collision detection algorithms are broken into a hierarchy of algorithms. Often the terms \"discrete\" and \"continuous\" are used rather than a posteriori and a priori.\nIn the a posteriori case, we advance the physical simulation by a small time step, then check if any objects are intersecting, or are somehow so close to each other that we deem them to be intersecting. At each simulation step, a list of all intersecting bodies is created, and the positions and trajectories of these objects are somehow \"fixed\" to account for the collision. We say that this method is a posteriori because we typically miss the actual instant of collision, and only catch the collision after it has actually happened.\nIn the a priori methods, we write a collision detection algorithm which will be able to predict very precisely the trajectories of the physical bodies. The instants of collision are calculated with high precision, and the physical bodies never actually interpenetrate. We call this a priori because we calculate the instants of collision before we update the configuration of the physical bodies.\nThe main benefits of the a posteriori methods are as follows. In this case, the collision detection algorithm need not be aware of the myriad of physical variables; a simple list of physical bodies is fed to the algorithm, and the program returns a list of intersecting bodies. The collision detection algorithm doesn't need to understand friction, elastic collisions, or worse, nonelastic collisions and deformable bodies. In addition, the a posteriori algorithms are in effect one dimension simpler than the a priori algorithms. Indeed, an a priori algorithm must deal with the time variable, which is absent from the a posteriori problem.\nOn the other hand, a posteriori algorithms cause problems in the \"fixing\" step, where intersections (which aren't physically correct) need to be corrected. Moreover, if the discrete step is too large, the collision could go undetected, resulting in an object which passes through another if it is sufficiently fast or small.\nThe benefits of the a priori algorithms are increased fidelity and stability. It is difficult (but not completely impossible) to separate the physical simulation from the collision detection algorithm. However, in all but the simplest cases, the problem of determining ahead of time when two bodies will collide (given some initial data) has no closed form solution—a numerical root finder is usually involved.\nSome objects are in resting contact, that is, in collision, but neither bouncing off, nor interpenetrating, such as a vase resting on a table. In all cases, resting contact requires special treatment: If two objects collide (a posteriori) or slide (a priori) and their relative motion is below a threshold, friction becomes stiction and both objects are arranged in the same branch of the scene graph.\nThe obvious approaches to collision detection for multiple objects are very slow. Checking every object against every other object will, of course, work, but is too inefficient to be used when the number of objects is at all large. Checking objects with complex geometry against each other in the obvious way, by checking each face against each other face, is itself quite slow. Thus, considerable research has been applied to speed up the problem.\nIn many applications, the configuration of physical bodies from one time step to the next changes very little. Many of the objects may not move at all. Algorithms have been designed so that the calculations done in a preceding time step can be reused in the current time step, resulting in faster completion of the calculation.\nAt the coarse level of collision detection, the objective is to find pairs of objects which might potentially intersect. Those pairs will require further analysis. An early high performance algorithm for this was developed by Ming C. Lin at the University of California, Berkeley [1], who suggested using axis-aligned bounding boxes for all n bodies in the scene.\nEach box is represented by the product of three intervals (i.e., a box would be \n\n\n\n\nI\n\n1\n\n\n×\n\nI\n\n2\n\n\n×\n\nI\n\n3\n\n\n=\n[\n\na\n\n1\n\n\n,\n\nb\n\n1\n\n\n]\n×\n[\n\na\n\n2\n\n\n,\n\nb\n\n2\n\n\n]\n×\n[\n\na\n\n3\n\n\n,\n\nb\n\n3\n\n\n]\n\n\n{\\displaystyle I_{1}\\times I_{2}\\times I_{3}=[a_{1},b_{1}]\\times [a_{2},b_{2}]\\times [a_{3},b_{3}]}\n\n.) A common algorithm for collision detection of bounding boxes is sweep and prune. We observe that two such boxes, \n\n\n\n\nI\n\n1\n\n\n×\n\nI\n\n2\n\n\n×\n\nI\n\n3\n\n\n\n\n{\\displaystyle I_{1}\\times I_{2}\\times I_{3}}\n\n and \n\n\n\n\nJ\n\n1\n\n\n×\n\nJ\n\n2\n\n\n×\n\nJ\n\n3\n\n\n\n\n{\\displaystyle J_{1}\\times J_{2}\\times J_{3}}\n\n intersect if, and only if, \n\n\n\n\nI\n\n1\n\n\n\n\n{\\displaystyle I_{1}}\n\n intersects \n\n\n\n\nJ\n\n1\n\n\n\n\n{\\displaystyle J_{1}}\n\n, \n\n\n\n\nI\n\n2\n\n\n\n\n{\\displaystyle I_{2}}\n\n intersects \n\n\n\n\nJ\n\n2\n\n\n\n\n{\\displaystyle J_{2}}\n\n and \n\n\n\n\nI\n\n3\n\n\n\n\n{\\displaystyle I_{3}}\n\n intersects \n\n\n\n\nJ\n\n3\n\n\n\n\n{\\displaystyle J_{3}}\n\n. We suppose that, from one time step to the next, \n\n\n\n\nI\n\nk\n\n\n\n\n{\\displaystyle I_{k}}\n\n and \n\n\n\n\nJ\n\nk\n\n\n\n\n{\\displaystyle J_{k}}\n\n intersect, then it is very likely that at the next time step, they will still intersect. Likewise, if they did not intersect in the previous time step, then they are very likely to continue not to.\nSo we reduce the problem to that of tracking, from frame to frame, which intervals do intersect. We have three lists of intervals (one for each axis) and all lists are the same length (since each list has length \n\n\n\nn\n\n\n{\\displaystyle n}\n\n, the number of bounding boxes.) In each list, each interval is allowed to intersect all other intervals in the list. So for each list, we will have an \n\n\n\nn\n×\nn\n\n\n{\\displaystyle n\\times n}\n\n matrix \n\n\n\nM\n=\n(\n\nm\n\ni\nj\n\n\n)\n\n\n{\\displaystyle M=(m_{ij})}\n\n of zeroes and ones: \n\n\n\n\nm\n\ni\nj\n\n\n\n\n{\\displaystyle m_{ij}}\n\n is 1 if intervals \n\n\n\ni\n\n\n{\\displaystyle i}\n\n and \n\n\n\nj\n\n\n{\\displaystyle j}\n\n intersect, and 0 if they do not intersect.\nBy our assumption, the matrix \n\n\n\nM\n\n\n{\\displaystyle M}\n\n associated to a list of intervals will remain essentially unchanged from one time step to the next. To exploit this, the list of intervals is actually maintained as a list of labeled endpoints. Each element of the list has the coordinate of an endpoint of an interval, as well as a unique integer identifying that interval. Then, we sort the list by coordinates, and update the matrix \n\n\n\nM\n\n\n{\\displaystyle M}\n\n as we go. It's not so hard to believe that this algorithm will work relatively quickly if indeed the configuration of bounding boxes does not change significantly from one time step to the next.\nIn the case of deformable bodies such as cloth simulation, it may not be possible to use a more specific pairwise pruning algorithm as discussed below, and an n-body pruning algorithm is the best that can be done.\nIf an upper bound can be placed on the velocity of the physical bodies in a scene, then pairs of objects can be pruned based on their initial distance and the size of the time step.\nOnce we've selected a pair of physical bodies for further investigation, we need to check for collisions more carefully. However, in many applications, individual objects (if they are not too deformable) are described by a set of smaller primitives, mainly triangles. So now, we have two sets of triangles, \n\n\n\nS\n=\n\n\nS\n\n1\n\n\n,\n\nS\n\n2\n\n\n,\n…\n,\n\nS\n\nn\n\n\n\n\n\n{\\displaystyle S={S_{1},S_{2},\\dots ,S_{n}}}\n\n and \n\n\n\nT\n=\n\n\nT\n\n1\n\n\n,\n\nT\n\n2\n\n\n,\n…\n,\n\nT\n\nn\n\n\n\n\n\n{\\displaystyle T={T_{1},T_{2},\\dots ,T_{n}}}\n\n (for simplicity, we will assume that each set has the same number of triangles.)\nThe obvious thing to do is to check all triangles \n\n\n\n\nS\n\nj\n\n\n\n\n{\\displaystyle S_{j}}\n\n against all triangles \n\n\n\n\nT\n\nk\n\n\n\n\n{\\displaystyle T_{k}}\n\n for collisions, but this involves \n\n\n\n\nn\n\n2\n\n\n\n\n{\\displaystyle n^{2}}\n\n comparisons, which is highly inefficient. If possible, it is desirable to use a pruning algorithm to reduce the number of pairs of triangles we need to check.\nThe most widely used family of algorithms is known as the hierarchical bounding volumes method. As a preprocessing step, for each object (in our example, \n\n\n\nS\n\n\n{\\displaystyle S}\n\n and \n\n\n\nT\n\n\n{\\displaystyle T}\n\n) we will calculate a hierarchy of bounding volumes. Then, at each time step, when we need to check for collisions between \n\n\n\nS\n\n\n{\\displaystyle S}\n\n and \n\n\n\nT\n\n\n{\\displaystyle T}\n\n, the hierarchical bounding volumes are used to reduce the number of pairs of triangles under consideration. For simplicity, we will give an example using bounding spheres, although it has been noted that spheres are undesirable in many cases.[citation needed]\nIf \n\n\n\nE\n\n\n{\\displaystyle E}\n\n is a set of triangles, we can precalculate a bounding sphere \n\n\n\nB\n(\nE\n)\n\n\n{\\displaystyle B(E)}\n\n. There are many ways of choosing \n\n\n\nB\n(\nE\n)\n\n\n{\\displaystyle B(E)}\n\n, we only assume that \n\n\n\nB\n(\nE\n)\n\n\n{\\displaystyle B(E)}\n\n is a sphere that completely contains \n\n\n\nE\n\n\n{\\displaystyle E}\n\n and is as small as possible.\nAhead of time, we can compute \n\n\n\nB\n(\nS\n)\n\n\n{\\displaystyle B(S)}\n\n and \n\n\n\nB\n(\nT\n)\n\n\n{\\displaystyle B(T)}\n\n. Clearly, if these two spheres do not intersect (and that is very easy to test), then neither do \n\n\n\nS\n\n\n{\\displaystyle S}\n\n and \n\n\n\nT\n\n\n{\\displaystyle T}\n\n. This is not much better than an n-body pruning algorithm, however.\nIf \n\n\n\nE\n=\n\n\nE\n\n1\n\n\n,\n\nE\n\n2\n\n\n,\n…\n,\n\nE\n\nm\n\n\n\n\n\n{\\displaystyle E={E_{1},E_{2},\\dots ,E_{m}}}\n\n is a set of triangles, then we can split it into two halves \n\n\n\nL\n(\nE\n)\n:=\n\n\nE\n\n1\n\n\n,\n\nE\n\n2\n\n\n,\n…\n,\n\nE\n\nm\n\n/\n\n2\n\n\n\n\n\n{\\displaystyle L(E):={E_{1},E_{2},\\dots ,E_{m/2}}}\n\n and \n\n\n\nR\n(\nE\n)\n:=\n\n\nE\n\nm\n\n/\n\n2\n+\n1\n\n\n,\n…\n,\n\nE\n\nm\n−\n1\n\n\n,\n\nE\n\nm\n\n\n\n\n\n{\\displaystyle R(E):={E_{m/2+1},\\dots ,E_{m-1},E_{m}}}\n\n. We can do this to \n\n\n\nS\n\n\n{\\displaystyle S}\n\n and \n\n\n\nT\n\n\n{\\displaystyle T}\n\n, and we can calculate (ahead of time) the bounding spheres \n\n\n\nB\n(\nL\n(\nS\n)\n)\n,\nB\n(\nR\n(\nS\n)\n)\n\n\n{\\displaystyle B(L(S)),B(R(S))}\n\n and \n\n\n\nB\n(\nL\n(\nT\n)\n)\n,\nB\n(\nR\n(\nT\n)\n)\n\n\n{\\displaystyle B(L(T)),B(R(T))}\n\n. The hope here is that these bounding spheres are much smaller than \n\n\n\nB\n(\nS\n)\n\n\n{\\displaystyle B(S)}\n\n and \n\n\n\nB\n(\nT\n)\n\n\n{\\displaystyle B(T)}\n\n. And, if, for instance, \n\n\n\nB\n(\nS\n)\n\n\n{\\displaystyle B(S)}\n\n and \n\n\n\nB\n(\nL\n(\nT\n)\n)\n\n\n{\\displaystyle B(L(T))}\n\n do not intersect, then there is no sense in checking any triangle in \n\n\n\nS\n\n\n{\\displaystyle S}\n\n against any triangle in \n\n\n\nL\n(\nT\n)\n\n\n{\\displaystyle L(T)}\n\n.\nAs a precomputation, we can take each physical body (represented by a set of triangles) and recursively decompose it into a binary tree, where each node \n\n\n\nN\n\n\n{\\displaystyle N}\n\n represents a set of triangles, and its two children represent \n\n\n\nL\n(\nN\n)\n\n\n{\\displaystyle L(N)}\n\n and \n\n\n\nR\n(\nN\n)\n\n\n{\\displaystyle R(N)}\n\n. At each node in the tree, we can precompute the bounding sphere \n\n\n\nB\n(\nN\n)\n\n\n{\\displaystyle B(N)}\n\n.\nWhen the time comes for testing a pair of objects for collision, their bounding sphere tree can be used to eliminate many pairs of triangles.\nMany variants of the algorithms are obtained by choosing something other than a sphere for \n\n\n\nB\n(\nT\n)\n\n\n{\\displaystyle B(T)}\n\n. If one chooses axis-aligned bounding boxes, one gets AABBTrees. Oriented bounding box trees are called OBBTrees. Some trees are easier to update if the underlying object changes. Some trees can accommodate higher order primitives such as splines instead of simple triangles.\nOnce we're done pruning, we are left with a number of candidate pairs to check for exact collision detection.\nA basic observation is that for any two convex objects which are disjoint, one can find a plane in space so that one object lies completely on one side of that plane, and the other object lies on the opposite side of that plane. This allows the development of very fast collision detection algorithms for convex objects.\nEarly work in this area involved \"separating plane\" methods. Two triangles collide essentially only when they can not be separated by a plane going through three vertices. That is, if the triangles are \n\n\n\n\n\nv\n\n1\n\n\n,\n\nv\n\n2\n\n\n,\n\nv\n\n3\n\n\n\n\n\n{\\displaystyle {v_{1},v_{2},v_{3}}}\n\n and \n\n\n\n\n\nv\n\n4\n\n\n,\n\nv\n\n5\n\n\n,\n\nv\n\n6\n\n\n\n\n\n{\\displaystyle {v_{4},v_{5},v_{6}}}\n\n where each \n\n\n\n\nv\n\nj\n\n\n\n\n{\\displaystyle v_{j}}\n\n is a vector in \n\n\n\n\n\n\nR\n\n\n\n3\n\n\n\n\n{\\displaystyle {\\mathbb {R}}^{3}}\n\n, then we can take three vertices, \n\n\n\n\nv\n\ni\n\n\n,\n\nv\n\nj\n\n\n,\n\nv\n\nk\n\n\n\n\n{\\displaystyle v_{i},v_{j},v_{k}}\n\n, find a plane going through all three vertices, and check to see if this is a separating plane. If any such plane is a separating plane, then the triangles are deemed to be disjoint. On the other hand, if none of these planes are separating planes, then the triangles are deemed to intersect. There are twenty such planes.\nIf the triangles are coplanar, this test is not entirely successful. One can add some extra planes, for instance, planes that are normal to triangle edges, to fix the problem entirely. In other cases, objects that meet at a flat face must necessarily also meet at an angle elsewhere, hence the overall collision detection will be able to find the collision.\nBetter methods have since been developed. Very fast algorithms are available for finding the closest points on the surface of two convex polyhedral objects. Early work by Ming C. Lin[2] used a variation on the simplex algorithm from linear programming. The Gilbert-Johnson-Keerthi distance algorithm has superseded that approach. These algorithms approach constant time when applied repeatedly to pairs of stationary or slow-moving objects, when used with starting points from the previous collision check.\nThe end result of all this algorithmic work is that collision detection can be done efficiently for thousands of moving objects in real time on typical personal computers and game consoles.\nWhere most of the objects involved are fixed, as is typical of video games, a priori methods using precomputation can be used to speed up execution.\nPruning is also desirable here, both n-body pruning and pairwise pruning, but the algorithms must take time and the types of motions used in the underlying physical system into consideration.\nWhen it comes to the exact pairwise collision detection, this is highly trajectory dependent, and one almost has to use a numerical root-finding algorithm to compute the instant of impact.\nAs an example, consider two triangles moving in time \n\n\n\n\n\nv\n\n1\n\n\n(\nt\n)\n,\n\nv\n\n2\n\n\n(\nt\n)\n,\n\nv\n\n3\n\n\n(\nt\n)\n\n\n\n{\\displaystyle {v_{1}(t),v_{2}(t),v_{3}(t)}}\n\n and \n\n\n\n\n\nv\n\n4\n\n\n(\nt\n)\n,\n\nv\n\n5\n\n\n(\nt\n)\n,\n\nv\n\n6\n\n\n(\nt\n)\n\n\n\n{\\displaystyle {v_{4}(t),v_{5}(t),v_{6}(t)}}\n\n. At any point in time, the two triangles can be checked for intersection using the twenty planes previously mentioned. However, we can do better, since these twenty planes can all be tracked in time. If \n\n\n\nP\n(\nu\n,\nv\n,\nw\n)\n\n\n{\\displaystyle P(u,v,w)}\n\n is the plane going through points \n\n\n\nu\n,\nv\n,\nw\n\n\n{\\displaystyle u,v,w}\n\n in \n\n\n\n\n\n\nR\n\n\n\n3\n\n\n\n\n{\\displaystyle {\\mathbb {R}}^{3}}\n\n then there are twenty planes \n\n\n\nP\n(\n\nv\n\ni\n\n\n(\nt\n)\n,\n\nv\n\nj\n\n\n(\nt\n)\n,\n\nv\n\nk\n\n\n(\nt\n)\n)\n\n\n{\\displaystyle P(v_{i}(t),v_{j}(t),v_{k}(t))}\n\n to track. Each plane needs to be tracked against three vertices, this gives sixty values to track. Using a root finder on these sixty functions produces the exact collision times for the two given triangles and the two given trajectory. We note here that if the trajectories of the vertices are assumed to be linear polynomials in \n\n\n\nt\n\n\n{\\displaystyle t}\n\n then the final sixty functions are in fact cubic polynomials, and in this exceptional case, it is possible to locate the exact collision time using the formula for the roots of the cubic. Some numerical analysts suggest that using the formula for the roots of the cubic is not as numerically stable as using a root finder for polynomials.[citation needed]\nAlternative algorithms are grouped under the spatial partitioning umbrella, which includes octrees, binary space partitioning (or BSP trees) and other, similar approaches. If one splits space into a number of simple cells, and if two objects can be shown not to be in the same cell, then they need not be checked for intersection. Since BSP trees can be precomputed, that approach is well suited to handling walls and fixed obstacles in games. These algorithms are generally older than the algorithms described above.\nBounding boxes (or Bounding volumes) are most often a 2D rectangle or 3D cuboid, but other shapes are possible. The bounding diamond, the minimum bounding parallelogram, the convex hull, the bounding circle or bounding ball, and the bounding ellipse have all been tried, but bounding boxes remain the most popular due to their simplicity.[3] Bounding boxes are typically used in the early (pruning) stage of collision detection, so that only objects with overlapping bounding boxes need be compared in detail.\nA triangle mesh object is commonly used in 3D body modeling. It is literal, a closed set. Normally the collision function is a triangle to triangle intercept or a bounding shape associated with the mesh. A triangle centroid is a center of mass location such that it would balance on a pencil tip. The simulation need only add a centroid dimension to the physics parameters. Given centroid points in both object and target it is possible to define the line segment connecting these two points.\nThe position vector of the centroid of a triangle is the average of the position vectors of its vertices. So if its vertices have Cartesian coordinates \n\n\n\n(\n\nx\n\n1\n\n\n,\n\ny\n\n1\n\n\n,\n\nz\n\n1\n\n\n)\n\n\n{\\displaystyle (x_{1},y_{1},z_{1})}\n\n, \n\n\n\n(\n\nx\n\n2\n\n\n,\n\ny\n\n2\n\n\n,\n\nz\n\n2\n\n\n)\n\n\n{\\displaystyle (x_{2},y_{2},z_{2})}\n\n and \n\n\n\n(\n\nx\n\n3\n\n\n,\n\ny\n\n3\n\n\n,\n\nz\n\n3\n\n\n)\n\n\n{\\displaystyle (x_{3},y_{3},z_{3})}\n\n then the centroid is \n\n\n\n(\n\n\n\n(\n\nx\n\n1\n\n\n+\n\nx\n\n2\n\n\n+\n\nx\n\n3\n\n\n)\n\n3\n\n\n,\n\n\n\n(\n\ny\n\n1\n\n\n+\n\ny\n\n2\n\n\n+\n\ny\n\n3\n\n\n)\n\n3\n\n\n,\n\n\n\n(\n\nz\n\n1\n\n\n+\n\nz\n\n2\n\n\n+\n\nz\n\n3\n\n\n)\n\n3\n\n\n)\n\n\n{\\displaystyle ({\\frac {(x_{1}+x_{2}+x_{3})}{3}},{\\frac {(y_{1}+y_{2}+y_{3})}{3}},{\\frac {(z_{1}+z_{2}+z_{3})}{3}})}\n\n.\nHere is the function for a line segment distance between two 3D points. \n\n\n\nd\ni\ns\nt\na\nn\nc\ne\n=\n\n\n(\nz\n2\n−\nz\n1\n\n)\n\n2\n\n\n+\n(\nx\n2\n−\nx\n1\n\n)\n\n2\n\n\n+\n(\ny\n2\n−\ny\n1\n\n)\n\n2\n\n\n\n\n\n\n{\\displaystyle distance={\\sqrt {(z2-z1)^{2}+(x2-x1)^{2}+(y2-y1)^{2}}}}\n\n\nHere the length/distance of the segment is an adjustable \"hit\" criteria size of segment. As the objects approach the length decreases to the threshold value. A triangle sphere becomes the effective geometry test. A sphere centered at the centroid can be sized to encompass all the triangle's vertices.\nVideo games have to split their very limited computing time between several tasks. Despite this resource limit, and the use of relatively primitive collision detection algorithms, programmers have been able to create believable, if inexact, systems for use in games[citation needed].\nFor a long time, video games had a very limited number of objects to treat, and so checking all pairs was not a problem. In two-dimensional games, in some cases, the hardware was able to efficiently detect and report overlapping pixels between sprites on the screen. In other cases, simply tiling the screen and binding each sprite into the tiles it overlaps provides sufficient pruning, and for pairwise checks, bounding rectangles or circles called hitboxes are used and deemed sufficiently accurate.\nThree-dimensional games have used spatial partitioning methods for \n\n\n\nn\n\n\n{\\displaystyle n}\n\n-body pruning, and for a long time used one or a few spheres per actual 3D object for pairwise checks. Exact checks are very rare, except in games attempting to simulate reality closely. Even then, exact checks are not necessarily used in all cases.\nBecause games do not need to mimic actual physics, stability is not as much of an issue. Almost all games use a posteriori collision detection, and collisions are often resolved using very simple rules. For instance, if a character becomes embedded in a wall, he might be simply moved back to his last known good location. Some games will calculate the distance the character can move before getting embedded into a wall, and only allow him to move that far.\nIn many cases for video games, approximating the characters by a point is sufficient for the purpose of collision detection with the environment. In this case, Binary space partitioning trees provide a viable, efficient and simple algorithm for checking if a point is embedded in the scenery or not. Such a data structure can also be used to handle \"resting position\" situation gracefully when a character is running along the ground. Collisions between characters, and collisions with projectiles and hazards, are treated separately.\nA robust simulator is one that will react to any input in a reasonable way. For instance, if we imagine a high speed racecar video game, from one simulation step to the next, it is conceivable that the cars would advance a substantial distance along the race track. If there is a shallow obstacle on the track (such as a brick wall), it is not entirely unlikely that the car will completely leap over it, and this is very undesirable. In other instances, the \"fixing\" that posteriori algorithms require isn't implemented correctly, and characters find themselves embedded in walls, or falling off into a deep void, sometimes referred to as \"black hell,\" \"blue hell,\" or \"green hell,\" depending on the predominant color. These are the hallmarks of a failing collision detection and physical simulation system. Big Rigs: Over the Road Racing is an infamous example of a game with a collision detection system failing, or not being present at all.", 
    "dbpedia_url": "http://dbpedia.org/resource/Collision_detection", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Collision_detection\n"
}