{
    "about": "In signal processing, a comb filter adds a delayed version of a signal to itself, causing constructive and destructive interference. The frequency response of a comb filter consists of a series of regularly spaced notches, giving the appearance of a comb.", 
    "name": "Comb Filter", 
    "classification": "Signal Processing", 
    "full_text": "In signal processing, a comb filter adds a delayed version of a signal to itself, causing constructive and destructive interference. The frequency response of a comb filter consists of a series of regularly spaced notches, giving the appearance of a comb.\n\n\nComb filters are used in a variety of signal processing applications. These include:\nIn acoustics, comb filtering can arise in some unwanted ways. For instance, when two loudspeakers are playing the same signal at different distances from the listener, there is a comb filtering effect on the signal.[1] In any enclosed space, listeners hear a mixture of direct sound and reflected sound. Because the reflected sound takes a longer path, it constitutes a delayed version of the direct sound and a comb filter is created where the two combine at the listener.[2]\nComb filters exist in two different forms, feedforward and feedback; the names refer to the direction in which signals are delayed before they are added to the input.\nComb filters may be implemented in discrete time or continuous time; this article will focus on discrete-time implementations; the properties of the continuous-time comb filter are very similar.\nThe general structure of a feedforward comb filter is shown on the right. It may be described by the following difference equation:\nwhere \n\n\n\nK\n\n\n{\\displaystyle K}\n\n is the delay length (measured in samples), and \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n is a scaling factor applied to the delayed signal. If we take the Z transform of both sides of the equation, we obtain:\nWe define the transfer function as:\nTo obtain the frequency response of a discrete-time system expressed in the Z domain, we make the substitution \n\n\n\nz\n=\n\ne\n\nj\nΩ\n\n\n\n\n{\\displaystyle z=e^{j\\Omega }}\n\n. Therefore, for our feedforward comb filter, we get:\nUsing Euler's formula, we find that the frequency response is also given by\nOften of interest is the magnitude response, which ignores phase. This is defined as:\nIn the case of the feedforward comb filter, this is:\nNotice that the \n\n\n\n(\n1\n+\n\nα\n\n2\n\n\n)\n\n\n{\\displaystyle (1+\\alpha ^{2})}\n\n term is constant, whereas the \n\n\n\n2\nα\ncos\n⁡\n(\nΩ\nK\n)\n\n\n{\\displaystyle 2\\alpha \\cos(\\Omega K)}\n\n term varies periodically. Hence the magnitude response of the comb filter is periodic.\nThe graphs to the right show the magnitude response for various values of \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n, demonstrating this periodicity. Some important properties:\nThe feedforward comb filter is one of the simplest finite impulse response filters.[3] Its response is simply the initial impulse with a second impulse after the delay.\nLooking again at the Z-domain transfer function of the feedforward comb filter:\nwe see that the numerator is equal to zero whenever \n\n\n\n\nz\n\nK\n\n\n=\n−\nα\n\n\n{\\displaystyle z^{K}=-\\alpha }\n\n. This has \n\n\n\nK\n\n\n{\\displaystyle K}\n\n solutions, equally spaced around a circle in the complex plane; these are the zeros of the transfer function. The denominator is zero at \n\n\n\n\nz\n\nK\n\n\n=\n0\n\n\n{\\displaystyle z^{K}=0}\n\n, giving \n\n\n\nK\n\n\n{\\displaystyle K}\n\n poles at \n\n\n\nz\n=\n0\n\n\n{\\displaystyle z=0}\n\n. This leads to a pole–zero plot like the ones shown below.\nSimilarly, the general structure of a feedback comb filter is shown on the right. It may be described by the following difference equation:\nIf we rearrange this equation so that all terms in \n\n\n\ny\n\n\n{\\displaystyle y}\n\n are on the left-hand side, and then take the Z transform, we obtain:\nThe transfer function is therefore:\nIf we make the substitution \n\n\n\nz\n=\n\ne\n\nj\nΩ\n\n\n\n\n{\\displaystyle z=e^{j\\Omega }}\n\n into the Z-domain expression for the feedback comb filter, we get:\nThe magnitude response is as follows:\nAgain, the response is periodic, as the graphs to the right demonstrate. The feedback comb filter has some properties in common with the feedforward form:\nHowever, there are also some important differences because the magnitude response has a term in the denominator:\nThe feedback comb filter is a simple type of infinite impulse response filter.[4] If stable, the response simply consists of a repeating series of impulses decreasing in amplitude over time.\nLooking again at the Z-domain transfer function of the feedback comb filter:\nThis time, the numerator is zero at \n\n\n\n\nz\n\nK\n\n\n=\n0\n\n\n{\\displaystyle z^{K}=0}\n\n, giving \n\n\n\nK\n\n\n{\\displaystyle K}\n\n zeros at \n\n\n\nz\n=\n0\n\n\n{\\displaystyle z=0}\n\n. The denominator is equal to zero whenever \n\n\n\n\nz\n\nK\n\n\n=\nα\n\n\n{\\displaystyle z^{K}=\\alpha }\n\n. This has \n\n\n\nK\n\n\n{\\displaystyle K}\n\n solutions, equally spaced around a circle in the complex plane; these are the poles of the transfer function. This leads to a pole–zero plot like the ones shown below.\nComb filters may also be implemented in continuous time. The feedforward form may be described by the following equation:\nwhere \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n is the delay (measured in seconds). This has the following transfer function:\nThe feedforward form consists of an infinite number of zeros spaced along the jω axis.\nThe feedback form has the equation:\nand the following transfer function:\nThe feedback form consists of an infinite number of poles spaced along the jω axis.\nContinuous-time implementations share all the properties of the respective discrete-time implementations.", 
    "dbpedia_url": "http://dbpedia.org/resource/Comb_filter", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Comb_filter\n"
}