{
    "about": "Compressed sensing (also known as compressive sensing, compressive sampling, or sparse sampling) is a signal processing technique for efficiently acquiring and reconstructing a signal, by finding solutions to underdetermined linear systems. This is based on the principle that, through optimization, the sparsity of a signal can be exploited to recover it from far fewer samples than required by the Shannon-Nyquist sampling theorem. There are two conditions under which recovery is possible.[1] The first one is sparsity which requires the signal to be sparse in some domain. The second one is incoherence which is applied through the isometric property which is sufficient for sparse signals.[2][3]", 
    "name": "Compressed Sensing", 
    "classification": "Signal Processing", 
    "full_text": "Compressed sensing (also known as compressive sensing, compressive sampling, or sparse sampling) is a signal processing technique for efficiently acquiring and reconstructing a signal, by finding solutions to underdetermined linear systems. This is based on the principle that, through optimization, the sparsity of a signal can be exploited to recover it from far fewer samples than required by the Shannon-Nyquist sampling theorem. There are two conditions under which recovery is possible.[1] The first one is sparsity which requires the signal to be sparse in some domain. The second one is incoherence which is applied through the isometric property which is sufficient for sparse signals.[2][3]\n\n\nA common goal of the engineering field of signal processing is to reconstruct a signal from a series of sampling measurements. In general, this task is impossible because there is no way to reconstruct a signal during the times that the signal is not measured. Nevertheless, with prior knowledge or assumptions about the signal, it turns out to be possible to perfectly reconstruct a signal from a series of measurements. Over time, engineers have improved their understanding of which assumptions are practical and how they can be generalized.\nAn early breakthrough in signal processing was the Nyquist–Shannon sampling theorem. It states that if the signal's highest frequency is less than half of the sampling rate, then the signal can be reconstructed perfectly. The main idea is that with prior knowledge about constraints on the signal’s frequencies, fewer samples are needed to reconstruct the signal.\nAround 2004, Emmanuel Candès, Terence Tao, and David Donoho proved that given knowledge about a signal's sparsity, the signal may be reconstructed with even fewer samples than the sampling theorem requires.[4][5] This idea is the basis of compressed sensing.\nCompressed sensing relies on L1 techniques, which several other scientific fields have used historically.[6] In statistics, the least squares method was complemented by the \n\n\n\n\nL\n\n1\n\n\n\n\n{\\displaystyle L^{1}}\n\n-norm, which was introduced by Laplace. Following the introduction of linear programming and Dantzig's simplex algorithm, the \n\n\n\n\nL\n\n1\n\n\n\n\n{\\displaystyle L^{1}}\n\n-norm was used in computational statistics. In statistical theory, the \n\n\n\n\nL\n\n1\n\n\n\n\n{\\displaystyle L^{1}}\n\n-norm was used by George W. Brown and later writers on median-unbiased estimators. It was used by Peter J. Huber and others working on robust statistics. The \n\n\n\n\nL\n\n1\n\n\n\n\n{\\displaystyle L^{1}}\n\n-norm was also used in signal processing, for example, in the 1970s, when seismologists constructed images of reflective layers within the earth based on data that did not seem to satisfy the Nyquist–Shannon criterion.[7] It was used in matching pursuit in 1993, the LASSO estimator by Robert Tibshirani in 1996[8] and basis pursuit in 1998.[9] There were theoretical results describing when these algorithms recovered sparse solutions, but the required type and number of measurements were sub-optimal and subsequently greatly improved by compressed sensing.[citation needed]\nAt first glance, compressed sensing might seem to violate the sampling theorem, because compressed sensing depends on the sparsity of the signal in question and not its highest frequency. This is a misconception, because the sampling theorem guarantees perfect reconstruction given sufficient, not necessary, conditions. A sampling method fundamentally different from classical fixed-rate sampling cannot \"violate\" the sampling theorem. Sparse signals with high frequency components can be highly under-sampled using compressed sensing compared to classical fixed-rate sampling.[10]\nAn underdetermined system of linear equations has more unknowns than equations and generally has an infinite number of solutions. In order to choose a solution to such a system, one must impose extra constraints or conditions (such as smoothness) as appropriate.\nIn compressed sensing, one adds the constraint of sparsity, allowing only solutions which have a small number of nonzero coefficients. Not all underdetermined systems of linear equations have a sparse solution. However, if there is a unique sparse solution to the underdetermined system, then the compressed sensing framework allows the recovery of that solution.\nCompressed sensing takes advantage of the redundancy in many interesting signals—they are not pure noise. In particular, many signals are sparse, that is, they contain many coefficients close to or equal to zero, when represented in some domain.[11] This is the same insight used in many forms of lossy compression.\nCompressed sensing typically starts with taking a weighted linear combination of samples also called compressive measurements in a basis different from the basis in which the signal is known to be sparse. The results found by Emmanuel Candès, Justin Romberg, Terence Tao and David Donoho, showed that the number of these compressive measurements can be small and still contain nearly all the useful information. Therefore, the task of converting the image back into the intended domain involves solving an underdetermined matrix equation since the number of compressive measurements taken is smaller than the number of pixels in the full image. However, adding the constraint that the initial signal is sparse enables one to solve this underdetermined system of linear equations.\nThe least-squares solution to such problems is to minimize the \n\n\n\n\nL\n\n2\n\n\n\n\n{\\displaystyle L^{2}}\n\n norm—that is, minimize the amount of energy in the system. This is usually simple mathematically (involving only a matrix multiplication by the pseudo-inverse of the basis sampled in). However, this leads to poor results for many practical applications, for which the unknown coefficients have nonzero energy.\nTo enforce the sparsity constraint when solving for the underdetermined system of linear equations, one can minimize the number of nonzero components of the solution. The function counting the number of non-zero components of a vector was called the \n\n\n\n\nL\n\n0\n\n\n\n\n{\\displaystyle L^{0}}\n\n \"norm\" by David Donoho[note 1].\nCandès. et al., proved that for many problems it is probable that the \n\n\n\n\nL\n\n1\n\n\n\n\n{\\displaystyle L^{1}}\n\n norm is equivalent to the \n\n\n\n\nL\n\n0\n\n\n\n\n{\\displaystyle L^{0}}\n\n norm, in a technical sense: This equivalence result allows one to solve the \n\n\n\n\nL\n\n1\n\n\n\n\n{\\displaystyle L^{1}}\n\n problem, which is easier than the \n\n\n\n\nL\n\n0\n\n\n\n\n{\\displaystyle L^{0}}\n\n problem. Finding the candidate with the smallest \n\n\n\n\nL\n\n1\n\n\n\n\n{\\displaystyle L^{1}}\n\n norm can be expressed relatively easily as a linear program, for which efficient solution methods already exist.[13] When measurements may contain a finite amount of noise, basis pursuit denoising is preferred over linear programming, since it preserves sparsity in the face of noise and can be solved faster than an exact linear program.\nTotal variation can be seen as a non-negative real-valued functional defined on the space of real-valued functions (for the case of functions of one variable) or on the space of integrable functions (for the case of functions of several variables). For signals, especially, total variation refers to the integral of the absolute gradient of the signal. In signal and image reconstruction, it is applied as total variation regularization where the underlying principle is that signals with excessive details have high total variation and that removing these details, while retaining important information such as edges, would reduce the total variation of the signal and make the signal subject closer to the original signal in the problem.\nFor the purpose of signal and image reconstruction, \n\n\n\nl\n1\n\n\n{\\displaystyle l1}\n\n minimization models are used. Other approaches also include the least-squares as has been discussed before in this article. These methods are extremely slow and return a not-so-perfect reconstruction of the signal. The current CS Regularization models attempt to address this problem by incorporating sparsity priors of the original image, one of which is the total variation (TV). Conventional TV approaches are designed to give piece-wise constant solutions. Some of these include (as discussed ahead) - constrained l1-minimization which uses an iterative scheme. This method, though fast, subsequently leads to over-smoothing of edges resulting in blurred image edges.[14] TV methods with iterative re-weighting have been implemented to reduce the influence of large gradient value magnitudes in the images. This has been used in computed tomography (CT) reconstruction as a method known as edge-preserving total variation. However, as gradient magnitudes are used for estimation of relative penalty weights between the data fidelity and regularization terms, this method is not robust to noise and artifacts and accurate enough for CS image/signal reconstruction and, therefore, fails to preserve smaller structures.\nRecent progress on this problem involves using an iteratively directional TV refinement for CS reconstruction.[15] This method would have 2 stages: the first stage would estimate and refine the initial orientation field - which is defined as a noisy point-wise initial estimate, through edge-detection, of the given image. In the second stage, the CS reconstruction model is presented by utilizing directional TV regularizer. More details about these TV-based approaches - iteratively reweighted l1 minimization, edge-preserving TV and iterative model using directional orientation field and TV- are provided below.\nIn the CS reconstruction models using constrained \n\n\n\n\nl\n\n1\n\n\n\n\n{\\displaystyle l_{1}}\n\n minimization, larger coefficients are penalized heavily in the \n\n\n\n\nl\n\n1\n\n\n\n\n{\\displaystyle l_{1}}\n\n norm. It was proposed to have a weighted formulation of \n\n\n\n\nl\n\n1\n\n\n\n\n{\\displaystyle l_{1}}\n\n minimization designed to more democratically penalize nonzero coefficients. An iterative algorithm is used for constructing the appropriate weights.[17] Each iteration requires solving one \n\n\n\n\nl\n\n1\n\n\n\n\n{\\displaystyle l_{1}}\n\n minimization problem by finding the local minimum of a concave penalty function that more closely resembles the \n\n\n\n\nl\n\n0\n\n\n\n\n{\\displaystyle l_{0}}\n\n norm. An additional parameter, usually to avoid any sharp transitions in the penalty function curve, is introduced into the iterative equation to ensure stability and so that a zero estimate in one iteration does not necessarily lead to a zero estimate in the next iteration. The method essentially involves using the current solution for computing the weights to be used in the next iteration.\nEarly iterations may find inaccurate sample estimates, however this method will down-sample these at a later stage to give more weight to the smaller non-zero signal estimates. One of the disadvantages is the need for defining a valid starting point as a global minimum might not be obtained every time due to the concavity of the function. Another disadvantage is that this method tends to uniformly penalize the image gradient irrespective of the underlying image structures. This causes over-smoothing of edges, especially those of low contrast regions,subsequently leading to loss of low contrast information.The advantages of this method include: reduction of the sampling rate for sparse signals; reconstruction of the image while being robust to the removal of noise and other artifacts; and use of very few iterations. This can also help in recovering images with sparse gradients.\nIn the figure shown below, P1 refers to the first-step of the iterative reconstruction process, of the projection matrix P of the fan-beam geometry, which is constrained by the data fidelity term. This may contain noise and artifacts as no regularization is performed. The minimization of P1 is solved through the conjugate gradient least squares method. P2 refers to the second step of the iterative reconstruction process wherein it utilizes the edge-preserving total variation regularization term to remove noise and artifacts, and thus improve the quality of the reconstructed image/signal. The minimization of P2 is done through a simple gradient descent method. Convergence is determined by testing, after each iteration, for image positivity, by checking if \n\n\n\n\nf\n\nk\n−\n1\n\n\n=\n0\n\n\n{\\displaystyle f^{k-1}=0}\n\n for the case when \n\n\n\n\nf\n\nk\n−\n1\n\n\n<\n0\n\n\n{\\displaystyle f^{k-1}<0}\n\n (Note that \n\n\n\nf\n\n\n{\\displaystyle f}\n\n refers to the different x-ray linear attenuation coefficients at different voxels of the patient image).\nThis is an iterative CT reconstruction algorithm with edge-preserving TV regularization to reconstruct CT images from highly undersampled data obtained at low dose CT through low current levels (milliampere). In order to reduce the imaging dose, one of the approaches used is to reduce the number of x-ray projections acquired by the scanner detectors. However, this insufficient projection data which is used to reconstruct the CT image can cause streaking artifacts. Furthermore, using these insufficient projections in standard TV algorithms end up making the problem under-determined and thus leading to infinitely many possible solutions. In this method, an additional penalty weighted function is assigned to the original TV norm. This allows for easier detection of sharp discontinuities in intensity in the images and thereby adapt the weight to store the recovered edge information during the process of signal/image reconstruction. The parameter \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n controls the amount of smoothing applied to the pixels at the edges to differentiate them from the non-edge pixels. The value of \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n is changed adaptively based on the values of the histogram of the gradient magnitude so that a certain percentage of pixels have gradient values larger than \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n. The edge-preserving total variation term, thus, becomes sparser and this speeds up the implementation. A two-step iteration process known as forward-backward splitting algorithm is used.[18] The optimization problem is split into two sub-problems which are then solved with the conjugate gradient least squares method[19] and the simple gradient descent method respectively. The method is stopped when the desired convergence has been achieved or if the maximum number of iterations is reached.\nSome of the disadvantages of this method are the absence of smaller structures in the reconstructed image and degradation of image resolution. This edge preserving TV algorithm, however, requires fewer iterations than the conventional TV algorithm.[14] Analyzing the horizontal and vertical intensity profiles of the reconstructed images, it can be seen that there are sharp jumps at edge points and negligible, minor fluctuation at non-edge points. Thus, this method leads to low relative error and higher correlation as compared to the TV method. It also effectively suppresses and removes any form of image noise and image artifacts such as streaking.\nTo prevent over-smoothing of edges and texture details and to obtain a reconstructed CS image which is accurate and robust to noise and artifacts, this method is used. First, an initial estimate of the noisy point-wise orientation field of the image \n\n\n\nI\n\n\n{\\displaystyle I}\n\n, \n\n\n\n\n\n\nd\n^\n\n\n\n\n\n{\\displaystyle {\\hat {d}}}\n\n, is obtained. This noisy orientation field is defined so that it can be refined at a later stage to reduce the noise influences in orientation field estimation.A coarse orientation field estimation is then introduced based on structure tensor which is formulated as:[20] \n\n\n\n\nJ\n\nρ\n\n\n(\n∇\n\nI\n\nσ\n\n\n)\n=\n\nG\n\nρ\n\n\n∗\n(\n∇\n\nI\n\nσ\n\n\n⊗\n∇\n\nI\n\nσ\n\n\n)\n=\n\n\n(\n\n\n\n\nJ\n\n11\n\n\n\n\n\nJ\n\n12\n\n\n\n\n\n\n\nJ\n\n12\n\n\n\n\n\nJ\n\n22\n\n\n\n\n\n)\n\n\n\n\n{\\displaystyle J_{\\rho }(\\nabla I_{\\sigma })=G_{\\rho }*(\\nabla I_{\\sigma }\\otimes \\nabla I_{\\sigma })={\\begin{pmatrix}J_{11}&J_{12}\\\\J_{12}&J_{22}\\end{pmatrix}}}\n\n. Here, \n\n\n\n\nJ\n\nρ\n\n\n\n\n{\\displaystyle J_{\\rho }}\n\n refers to the structure tensor related with the image pixel point (i,j) having standard deviation \n\n\n\nρ\n\n\n{\\displaystyle \\rho }\n\n. \n\n\n\nG\n\n\n{\\displaystyle G}\n\n refers to the Gaussian kernel \n\n\n\n(\n0\n,\n\nρ\n\n2\n\n\n)\n\n\n{\\displaystyle (0,\\rho ^{2})}\n\n with standard deviation \n\n\n\nρ\n\n\n{\\displaystyle \\rho }\n\n. \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n refers to the manually defined parameter for the image \n\n\n\nI\n\n\n{\\displaystyle I}\n\n below which the edge detection is insensitive to noise. \n\n\n\n∇\n\nI\n\nσ\n\n\n\n\n{\\displaystyle \\nabla I_{\\sigma }}\n\n refers to the gradient of the image \n\n\n\nI\n\n\n{\\displaystyle I}\n\n and \n\n\n\n(\n∇\n\nI\n\nσ\n\n\n⊗\n∇\n\nI\n\nσ\n\n\n)\n\n\n{\\displaystyle (\\nabla I_{\\sigma }\\otimes \\nabla I_{\\sigma })}\n\n refers to the tensor product obtained by using this gradient.\nThe structure tensor obtained is convolved with a Gaussian kernel \n\n\n\nG\n\n\n{\\displaystyle G}\n\n to improve the accuracy of the orientation estimate with \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n being set to high values to account for the unknown noise levels. For every pixel (i,j) in the image, the structure tensor J is a symmetric and positive semi-definite matrix. Convolving all the pixels in the image with \n\n\n\nG\n\n\n{\\displaystyle G}\n\n, gives orthonormal eigen vectors ω and υ of the \n\n\n\nJ\n\n\n{\\displaystyle J}\n\n matrix. ω points in the direction of the dominant orientation having the largest contrast and υ points in the direction of the structure orientation having the smallest contrast. The orientation field coarse initial estimation \n\n\n\n\n\n\nd\n^\n\n\n\n\n\n{\\displaystyle {\\hat {d}}}\n\n is defined as \n\n\n\n\n\n\nd\n^\n\n\n\n\n\n{\\displaystyle {\\hat {d}}}\n\n = υ. This estimate is accurate at strong edges. However, at weak edges or on regions with noise, its reliability decreases.\nTo overcome this drawback, a refined orientation model is defined in which the data term reduces the effect of noise and improves accuracy while the second penalty term with the L2-norm is a fidelity term which ensures accuracy of initial coarse estimation.\nThis orientation field is introduced into the directional total variation optimization model for CS reconstruction through the equation: \n\n\n\nm\ni\n\nn\n\n\nX\n\n\n\n∥\n∇\n\nX\n\n∙\nd\n\n∥\n\n1\n\n\n+\n\n\nλ\n2\n\n\n \n∥\nY\n−\nΦ\n\nX\n\n\n∥\n\n2\n\n\n2\n\n\n\n\n{\\displaystyle min_{\\mathrm {X} }\\lVert \\nabla \\mathrm {X} \\bullet d\\rVert _{1}+{\\frac {\\lambda }{2}}\\ \\lVert Y-\\Phi \\mathrm {X} \\rVert _{2}^{2}}\n\n. \n\n\n\n\nX\n\n\n\n{\\displaystyle \\mathrm {X} }\n\n is the objective signal which needs to be recovered. Y is the corresponding measurement vector, d is the iterative refined orientation field and \n\n\n\nΦ\n\n\n{\\displaystyle \\Phi }\n\n is the CS measurement matrix. This method undergoes a few iterations ultimately leading to convergence.\n\n\n\n\n\n\nd\n^\n\n\n\n\n\n{\\displaystyle {\\hat {d}}}\n\n is the orientation field approximate estimation of the reconstructed image \n\n\n\n\nX\n\nk\n−\n1\n\n\n\n\n{\\displaystyle X^{k-1}}\n\n from the previous iteration (in order to check for convergence and the subsequent optical performance, the previous iteration is used). For the two vector fields represented by \n\n\n\n\nX\n\n\n\n{\\displaystyle \\mathrm {X} }\n\n and \n\n\n\nd\n\n\n{\\displaystyle d}\n\n, \n\n\n\n\nX\n\n∙\nd\n\n\n{\\displaystyle \\mathrm {X} \\bullet d}\n\n refers to the multiplication of respective horizontal and vertical vector elements of \n\n\n\n\nX\n\n\n\n{\\displaystyle \\mathrm {X} }\n\n and \n\n\n\nd\n\n\n{\\displaystyle d}\n\n followed by their subsequent addition. These equations are reduced to a series of convex minimization problems which are then solved with a combination of variable splitting and augmented Lagrangian (FFT-based fast solver with a closed form solution) methods.[15] It (Augmented Lagrangian) is considered equivalent to the split Bregman iteration which ensures convergence of this method. The orientation field, d is defined as being equal to \n\n\n\n(\n\nd\n\nh\n\n\n,\n\nd\n\nv\n\n\n)\n\n\n{\\displaystyle (d_{h},d_{v})}\n\n, where \n\n\n\n\nd\n\nh\n\n\n,\n\nd\n\nv\n\n\n\n\n{\\displaystyle d_{h},d_{v}}\n\n define the horizontal and vertical estimates of \n\n\n\nd\n\n\n{\\displaystyle d}\n\n.\nThe Augmented Lagrangian method for the orientation field, \n\n\n\nm\ni\n\nn\n\n\nX\n\n\n\n∥\n∇\n\nX\n\n∙\nd\n\n∥\n\n1\n\n\n+\n\n\nλ\n2\n\n\n \n∥\nY\n−\nΦ\n\nX\n\n\n∥\n\n2\n\n\n2\n\n\n\n\n{\\displaystyle min_{\\mathrm {X} }\\lVert \\nabla \\mathrm {X} \\bullet d\\rVert _{1}+{\\frac {\\lambda }{2}}\\ \\lVert Y-\\Phi \\mathrm {X} \\rVert _{2}^{2}}\n\n, involves initializing \n\n\n\n\nd\n\nh\n\n\n,\n\nd\n\nv\n\n\n,\nH\n,\nV\n\n\n{\\displaystyle d_{h},d_{v},H,V}\n\n and then finding the approximate minimizer of \n\n\n\n\nL\n\n1\n\n\n\n\n{\\displaystyle L_{1}}\n\n with respect to these variables. The Lagrangian multipliers are then updated and the iterative process is stopped when convergence is achieved. For the iterative directional total variation refinement model, the augmented lagrangian method involves initializing \n\n\n\n\nX\n\n,\nP\n,\nQ\n,\n\nλ\n\nP\n\n\n,\n\nλ\n\nQ\n\n\n\n\n{\\displaystyle \\mathrm {X} ,P,Q,\\lambda _{P},\\lambda _{Q}}\n\n.[21]\nHere, \n\n\n\nH\n,\nV\n,\nP\n,\nQ\n\n\n{\\displaystyle H,V,P,Q}\n\n are newly introduced variables where \n\n\n\nH\n\n\n{\\displaystyle H}\n\n = \n\n\n\n∇\n\nd\n\nh\n\n\n\n\n{\\displaystyle \\nabla d_{h}}\n\n, \n\n\n\nV\n\n\n{\\displaystyle V}\n\n = \n\n\n\n∇\n\nd\n\nv\n\n\n\n\n{\\displaystyle \\nabla d_{v}}\n\n, \n\n\n\nP\n\n\n{\\displaystyle P}\n\n = \n\n\n\n∇\n\nX\n\n\n\n{\\displaystyle \\nabla \\mathrm {X} }\n\n, and \n\n\n\nQ\n\n\n{\\displaystyle Q}\n\n = \n\n\n\nP\n∙\nd\n\n\n{\\displaystyle P\\bullet d}\n\n. \n\n\n\n\nλ\n\nH\n\n\n,\n\nλ\n\nV\n\n\n,\n\nλ\n\nP\n\n\n,\n\nλ\n\nQ\n\n\n\n\n{\\displaystyle \\lambda _{H},\\lambda _{V},\\lambda _{P},\\lambda _{Q}}\n\n are the Lagrangian multipliers for \n\n\n\nH\n,\nV\n,\nP\n,\nQ\n\n\n{\\displaystyle H,V,P,Q}\n\n. For each iteration, the approximate minimizer of \n\n\n\n\nL\n\n2\n\n\n\n\n{\\displaystyle L_{2}}\n\n with respect to variables (\n\n\n\n\nX\n\n,\nP\n,\nQ\n\n\n{\\displaystyle \\mathrm {X} ,P,Q}\n\n) is calculated. And as in the field refinement model, the lagrangian multipliers are updated and the iterative process is stopped when convergence is achieved.\nFor the orientation field refinement model, the Lagrangian multipliers are updated in the iterative process as follows:\n\n\n\n\n(\n\nλ\n\nH\n\n\n\n)\n\nk\n\n\n=\n(\n\nλ\n\nH\n\n\n\n)\n\nk\n−\n1\n\n\n+\n\nγ\n\nH\n\n\n(\n\nH\n\nk\n\n\n−\n∇\n(\n\nd\n\nh\n\n\n\n)\n\nk\n\n\n)\n\n\n{\\displaystyle (\\lambda _{H})^{k}=(\\lambda _{H})^{k-1}+\\gamma _{H}(H^{k}-\\nabla (d_{h})^{k})}\n\n\n\n\n\n\n(\n\nλ\n\nV\n\n\n\n)\n\nk\n\n\n=\n(\n\nλ\n\nV\n\n\n\n)\n\nk\n−\n1\n\n\n+\n\nγ\n\nV\n\n\n(\n\nV\n\nk\n\n\n−\n∇\n(\n\nd\n\nv\n\n\n\n)\n\nk\n\n\n)\n\n\n{\\displaystyle (\\lambda _{V})^{k}=(\\lambda _{V})^{k-1}+\\gamma _{V}(V^{k}-\\nabla (d_{v})^{k})}\n\n\nFor the iterative directional total variation refinement model, the Lagrangian multipliers are updated as follows:\n\n\n\n\n(\n\nλ\n\nP\n\n\n\n)\n\nk\n\n\n=\n(\n\nλ\n\nP\n\n\n\n)\n\nk\n−\n1\n\n\n+\n\nγ\n\nP\n\n\n(\n\nP\n\nk\n\n\n−\n∇\n(\n\nX\n\n\n)\n\nk\n\n\n)\n\n\n{\\displaystyle (\\lambda _{P})^{k}=(\\lambda _{P})^{k-1}+\\gamma _{P}(P^{k}-\\nabla (\\mathrm {X} )^{k})}\n\n\n\n\n\n\n(\n\nλ\n\nQ\n\n\n\n)\n\nk\n\n\n=\n(\n\nλ\n\nQ\n\n\n\n)\n\nk\n−\n1\n\n\n+\n\nγ\n\nQ\n\n\n(\n\nQ\n\nk\n\n\n−\n\nP\n\nk\n\n\n∙\nd\n)\n\n\n{\\displaystyle (\\lambda _{Q})^{k}=(\\lambda _{Q})^{k-1}+\\gamma _{Q}(Q^{k}-P^{k}\\bullet d)}\n\n\nHere, \n\n\n\n\nγ\n\nH\n\n\n,\n\nγ\n\nV\n\n\n,\n\nγ\n\nP\n\n\n,\n\nγ\n\nQ\n\n\n\n\n{\\displaystyle \\gamma _{H},\\gamma _{V},\\gamma _{P},\\gamma _{Q}}\n\n are positive constants.\nBased on Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index (SSIM) metrics and known ground-truth images for testing performance, it is concluded that iterative directional total variation has a better reconstructed performance than the non-iterative methods in preserving edge and texture areas. The orientation field refinement model plays a major role in this improvement in performance as it increases the number of directionless pixels in the flat area while enhancing the orientation field consistency in the regions with edges.\nThe field of compressive sensing is related to several topics in signal processing and computational mathematics, such as underdetermined linear-systems, group testing, heavy hitters, sparse coding, multiplexing, sparse sampling, and finite rate of innovation. Its broad scope and generality has enabled several innovative CS-enhanced approaches in signal processing and compression, solution of inverse problems, design of radiating systems, radar and through-the-wall imaging, and antenna characterization.[22] Imaging techniques having a strong affinity with compressive sensing include coded aperture and computational photography. Implementations of compressive sensing in hardware at different technology readiness levels is available.[23]\nConventional CS reconstruction uses sparse signals (usually sampled at a rate less than the Nyquist sampling rate) for reconstruction through constrained \n\n\n\n\nl\n\n1\n\n\n\n\n{\\displaystyle l_{1}}\n\n minimization. One of the earliest applications of such an approach was in reflection seismology which used sparse reflected signals from band-limited data for tracking changes between sub-surface layers.[24] When the LASSO model came into prominence in the 1990s as a statistical method for selection of sparse models,[25] this method was further used in computational harmonic analysis for sparse signal representation from over-complete dictionaries. Some of the other applications include incoherent sampling of radar pulses. The work by Boyd et al.[16] has applied the LASSO model- for selection of sparse models- towards analog to digital converters (the current ones use a sampling rate higher than the Nyquist rate along with the quantized Shannon representation). This would involve a parallel architecture in which the polarity of the analog signal changes at a high rate followed by digitizing the integral at the end of each time-interval to obtain the converted digital signal.\nCompressed sensing is used in a mobile phone camera sensor. The approach allows a reduction in image acquisition energy per image by as much as a factor of 15 at the cost of complex decompression algorithms; the computation may require an off-device implementation.[26]\nCompressed sensing is used in single-pixel cameras from Rice University.[27] Bell Labs employed the technique in a lensless single-pixel camera that takes stills using repeated snapshots of randomly chosen apertures from a grid. Image quality improves with the number of snapshots, and generally requires a small fraction of the data of conventional imaging, while eliminating lens/focus-related aberrations.[28][29]\nCompressed sensing can be used to improve image reconstruction in holography by increasing the number of voxels one can infer from a single hologram.[30][31][32] It is also used for image retrieval from undersampled measurements in optical [33][34] and millimeter-wave [35] holography.\nCompressed sensing is being used in facial recognition applications.[36]\nCompressed sensing has been used [37][38] to shorten magnetic resonance imaging scanning sessions on conventional hardware.[39][40][41] Reconstruction methods include\nCompressed sensing addresses the issue of high scan time by enabling faster acquisition by measuring fewer Fourier coefficients. This produces a high-quality image with relatively lower scan time. Another application (also discussed ahead) is for CT reconstruction with fewer X-ray projections. Compressed sensing, in this case, removes the high spatial gradient parts - mainly, image noise and artifacts. This holds tremendous potential as one can obtain high-resolution CT images at low radiation doses (through lower current-mA settings).[45]\nCompressed sensing has showed outstanding results in the application of network tomography to network management. Network delay estimation and network congestion detection can both be modeled as underdetermined systems of linear equations where the coefficient matrix is the network routing matrix. Moreover, in the Internet, network routing matrices usually satisfy the criterion for using compressed sensing.[46]\nCommercial shortwave-infrared cameras based upon compressed sensing are available.[47] These cameras have light sensitivity from 0.9 µm to 1.7 µm, which are wavelengths invisible to the human eye.\nIn the field of radio astronomy, compressed sensing has been proposed for deconvolving an interferometric image.[48] In fact, the Högbom CLEAN algorithm that has been in use for the deconvolution of radio images since 1974, is similar to compressed sensing's matching pursuit algorithm.\nCompressed sensing combined with a moving aperture has been used to increase the acquisition rate of images in a transmission electron microscope.[49] In scanning mode, compressive sensing combined with random scanning of the electron beam has enabled both faster acquisition and less electron dose, which allows for imaging of electron beam sensitive materials.[50]", 
    "dbpedia_url": "http://dbpedia.org/resource/Compressed_sensing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Compressed_sensing\n"
}