{
    "about": "A comparison sort is a type of sorting algorithm that only reads the list elements through a single abstract comparison operation (often a \"less than or equal to\" operator or a three-way comparison) that determines which of two elements should occur first in the final sorted list. The only requirement is that the operator obey two of the properties of a total order:", 
    "name": "Comparison Sort", 
    "classification": "Sorting Algorithms", 
    "full_text": "A comparison sort is a type of sorting algorithm that only reads the list elements through a single abstract comparison operation (often a \"less than or equal to\" operator or a three-way comparison) that determines which of two elements should occur first in the final sorted list. The only requirement is that the operator obey two of the properties of a total order:\nIt is possible that both a ≤ b and b ≤ a; in this case either may come first in the sorted list. In a stable sort, the input order determines the sorted order in this case.\nA metaphor for thinking about comparison sorts is that someone has a set of unlabelled weights and a balance scale. Their goal is to line up the weights in order by their weight without any information except that obtained by placing two weights on the scale and seeing which one is heavier (or if they weigh the same).\n\n\nSome of the most well-known comparison sorts include:\nThere are fundamental limits on the performance of comparison sorts. A comparison sort must have an average-case lower bound of Ω(n log n) comparison operations,[1] which is known as linearithmic time. This is a consequence of the limited information available through comparisons alone — or, to put it differently, of the vague algebraic structure of totally ordered sets. In this sense, mergesort, heapsort, and introsort are asymptotically optimal in terms of the number of comparisons they must perform, although this metric neglects other operations. Non-comparison sorts (such as the examples discussed below) can achieve O(n) performance by using operations other than comparisons, allowing them to sidestep this lower bound (assuming elements are constant-sized).\nNote that comparison sorts may run faster on some lists; many adaptive sorts such as insertion sort run in O(n) time on an already-sorted or nearly-sorted list. The Ω(n log n) lower bound applies only to the case in which the input list can be in any possible order.\nAlso note that real-world measures of sorting speed may need to take into account the ability of some algorithms to optimally use relatively fast cached computer memory, or the application may benefit from sorting methods where sorted data begins to appear to the user quickly (and then user's speed of reading will be the limiting factor) as opposed to sorting methods where no output is available for display until the whole list is sorted.\nDespite these limitations, comparison sorts offer the notable practical advantage that control over the comparison function allows sorting of many different datatypes and fine control over how the list is sorted. For example, reversing the result of the comparison function allows the list to be sorted in reverse; and one can sort a list of tuples in lexicographic order by just creating a comparison function that compares each part in sequence:\nBalanced ternary notation allows comparisons to be made in one step, whose result will be one of \"less than\", \"greater than\" or \"equal to\".\nComparison sorts generally adapt more easily to complex orders such as the order of floating-point numbers. Additionally, once a comparison function is written, any comparison sort can be used without modification; non-comparison sorts typically require specialized versions for each datatype.\nThis flexibility, together with the efficiency of the above comparison sorting algorithms on modern computers, has led to widespread preference for comparison sorts in most practical work.\nSome sorting problems admit a strictly faster solution than the Ω(n log n) bound for comparison sorting; an example is integer sorting, where all keys are integers. When the keys form a small (compared to n) range, counting sort is an example algorithm that runs in linear time. Other integer sorting algorithms, such as radix sort, are not asymptotically faster than comparison sorting, but can be faster in practice.\nThe problem of sorting pairs of numbers by their sum is not subject to the Ω(n² log n) bound either (the square resulting from the pairing up); the best known algorithm still takes O(n² log n) time, but only O(n²) comparisons.\nThe number of comparisons that a comparison sort algorithm requires increases in proportion to \n\n\n\nn\nlog\n⁡\n(\nn\n)\n\n\n{\\displaystyle n\\log(n)}\n\n, where \n\n\n\nn\n\n\n{\\displaystyle n}\n\n is the number of elements to sort. This bound is asymptotically tight.\nGiven a list of distinct numbers (we can assume this because this is a worst-case analysis), there are n factorial permutations exactly one of which is the list in sorted order. The sort algorithm must gain enough information from the comparisons to identify the correct permutation. If the algorithm always completes after at most f(n) steps, it cannot distinguish more than 2f(n) cases because the keys are distinct and each comparison has only two possible outcomes. Therefore,\nFrom Stirling's approximation we know that\nThis provides the lower-bound part of the claim.\nAn identical upper bound follows from the existence of the algorithms that attain this bound in the worst case.\nThe above argument provides an absolute, rather than only asymptotic lower bound on the number of comparisons, namely \n\n\n\n⌈\n\nlog\n\n2\n\n\n⁡\n(\nn\n!\n)\n⌉\n\n\n{\\displaystyle \\lceil \\log _{2}(n!)\\rceil }\n\n comparisons. This lower bound is fairly good (it can be approached within a linear tolerance by a simple merge sort), but it is known to be inexact. For example, \n\n\n\n⌈\n\nlog\n\n2\n\n\n⁡\n(\n13\n!\n)\n⌉\n=\n33\n\n\n{\\displaystyle \\lceil \\log _{2}(13!)\\rceil =33}\n\n, but the minimal number of comparisons to sort 13 elements has been proved to be 34. Determining the exact number of comparisons needed to sort a given number of entries is a computationally hard problem even for small n, and no simple formula for the solution is known. For some of the few concrete values that have been computed, see  A036604.\nA similar bound applies to the average number of comparisons. Assuming that\nit is impossible to determine which order the input is in with fewer than log2(n!) comparisons on average.\nThis can be most easily seen using concepts from information theory. The Shannon entropy of such a random permutation is log2(n!) bits. Since a comparison can give only two results, the maximum amount of information it provides is 1 bit. Therefore, after k comparisons the remaining entropy of the permutation, given the results of those comparisons, is at least log2(n!) - k bits on average. To perform the sort, complete information is needed, so the remaining entropy must be 0. It follows that k must be at least log2(n!).\nNote that this differs from the worst case argument given above, in that it does not allow rounding up to the nearest integer. For example, for n = 3, the lower bound for the worst case is 3, the lower bound for the average case as shown above is approximately 2.58, while the highest lower bound for the average case is 8/3, approximately 2.67.\nIn the case that multiple items may have the same key, there is no obvious statistical interpretation for the term \"average case\", so an argument like the above cannot be applied without making specific assumptions about the distribution of keys.", 
    "dbpedia_url": "http://dbpedia.org/resource/Comparison_sort", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Comparison_sort\n"
}