{
    "about": "A complementarity problem is a type of mathematical optimization problem. It is the problem of optimizing (minimizing or maximizing) a function of two vector variables subject to certain requirements (constraints) which include: that the inner product of the two vectors must equal zero, i.e. orthogonal.[1] In particular for finite-dimensional real vector spaces this means that, if one has vectors X and Y with nonnegative components (xi ≥ 0 and yi ≥ 0 for all \n\n\n\ni\n\n\n{\\displaystyle i}\n\n: in the first quadrant if 2-dimensional, in the first octant if 3-dimensional), then for each pair of components xi and yi one of the pair must be zero, hence the name complementarity. e.g. X = (1, 0) and Y = (0, 2) are complementary, but X = (1, 1) and Y = (2, 0) are not. A complementarity problem is a special case of a variational inequality.", 
    "name": "Complementarity Theory", 
    "classification": "Numerical Analysis", 
    "full_text": "A complementarity problem is a type of mathematical optimization problem. It is the problem of optimizing (minimizing or maximizing) a function of two vector variables subject to certain requirements (constraints) which include: that the inner product of the two vectors must equal zero, i.e. orthogonal.[1] In particular for finite-dimensional real vector spaces this means that, if one has vectors X and Y with nonnegative components (xi ≥ 0 and yi ≥ 0 for all \n\n\n\ni\n\n\n{\\displaystyle i}\n\n: in the first quadrant if 2-dimensional, in the first octant if 3-dimensional), then for each pair of components xi and yi one of the pair must be zero, hence the name complementarity. e.g. X = (1, 0) and Y = (0, 2) are complementary, but X = (1, 1) and Y = (2, 0) are not. A complementarity problem is a special case of a variational inequality.\n\n\nComplementarity problems were originally studied because the Karush–Kuhn–Tucker conditions in linear programming and quadratic programming constitute a linear complementarity problem (LCP) or a mixed complementarity problem (MCP). In 1963 Lemke and Howson showed that, for two person games, computing a Nash equilibrium point is equivalent to an LCP. In 1968 Cottle and Dantzig unified linear and quadratic programming and bimatrix games. Since then the study of complementarity problems and variational inequalities has expanded enormously.\nAreas of mathematics and science that contributed to the development of complementarity theory include: optimization, equilibrium problems, variational inequality theory, fixed point theory, topological degree theory and nonlinear analysis.\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Complementarity_theory", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Complementarity_theory\n"
}