{
    "about": "In the field of numerical analysis, the condition number of a function with respect to an argument measures how much the output value of the function can change for a small change in the input argument. This is used to measure how sensitive a function is to changes or errors in the input, and how much error in the output results from an error in the input. Very frequently, one is solving the inverse problem – given \n\n\n\nf\n(\nx\n)\n=\ny\n,\n\n\n{\\displaystyle f(x)=y,}\n\n one is solving for x, and thus the condition number of the (local) inverse must be used. In linear regression the condition number can be used as a diagnostic for multicollinearity.[1][2]", 
    "name": "Condition Number", 
    "classification": "Numerical Analysis", 
    "full_text": "In the field of numerical analysis, the condition number of a function with respect to an argument measures how much the output value of the function can change for a small change in the input argument. This is used to measure how sensitive a function is to changes or errors in the input, and how much error in the output results from an error in the input. Very frequently, one is solving the inverse problem – given \n\n\n\nf\n(\nx\n)\n=\ny\n,\n\n\n{\\displaystyle f(x)=y,}\n\n one is solving for x, and thus the condition number of the (local) inverse must be used. In linear regression the condition number can be used as a diagnostic for multicollinearity.[1][2]\nThe condition number is an application of the derivative, and is formally defined as the value of the asymptotic worst-case relative change in output for a relative change in input. The \"function\" is the solution of a problem and the \"arguments\" are the data in the problem. The condition number is frequently applied to questions in linear algebra, in which case the derivative is straightforward but the error could be in many different directions, and is thus computed from the geometry of the matrix. More generally, condition numbers can be defined for non-linear functions in several variables.\nA problem with a low condition number is said to be well-conditioned, while a problem with a high condition number is said to be ill-conditioned. The condition number is a property of the problem. Paired with the problem are any number of algorithms that can be used to solve the problem, that is, to calculate the solution. Some algorithms have a property called backward stability. In general, a backward stable algorithm can be expected to accurately solve well-conditioned problems. Numerical analysis textbooks give formulas for the condition numbers of problems and identify the backward stable algorithms.\nAs a rule of thumb, if the condition number \n\n\n\nκ\n(\nA\n)\n=\n\n10\n\nk\n\n\n\n\n{\\displaystyle \\kappa (A)=10^{k}}\n\n, then you may lose up to \n\n\n\nk\n\n\n{\\displaystyle k}\n\n digits of accuracy on top of what would be lost to the numerical method due to loss of precision from arithmetic methods.[3] However, the condition number does not give the exact value of the maximum inaccuracy that may occur in the algorithm. It generally just bounds it with an estimate (whose computed value depends on the choice of the norm to measure the inaccuracy).\n\n\nFor example, the condition number associated with the linear equation Ax = b gives a bound on how inaccurate the solution x will be after approximation. Note that this is before the effects of round-off error are taken into account; conditioning is a property of the matrix, not the algorithm or floating point accuracy of the computer used to solve the corresponding system. In particular, one should think of the condition number as being (very roughly) the rate at which the solution, x, will change with respect to a change in b. Thus, if the condition number is large, even a small error in b may cause a large error in x. On the other hand, if the condition number is small then the error in x will not be much bigger than the error in b.\nThe condition number is defined more precisely to be the maximum ratio of the relative error in x divided by the relative error in b.\nLet e be the error in b. Assuming that A is a nonsingular matrix, the error in the solution A−1b is A−1e. The ratio of the relative error in the solution to the relative error in b is\nThis is easily transformed to\nThe maximum value (for nonzero b and e) is then seen to be the product of the two operator norms as follows:\nThe same definition is used for any consistent norm, i.e. one that satisfies\nWhen the condition number is exactly one (which can only happen if A is a scalar multiple of a linear isometry), then a solution algorithm can find (in principle, meaning if the algorithm introduces no errors of its own) an approximation of the solution whose precision is no worse than that of the data.\nHowever, it does not mean that the algorithm will converge rapidly to this solution, just that it won't diverge arbitrarily because of inaccuracy on the source data (backward error), provided that the forward error introduced by the algorithm does not diverge as well because of accumulating intermediate rounding errors.[clarification needed]\nThe condition number may also be infinite, but this implies that the problem is ill-posed (does not possess a unique, well-defined solution for each choice of data -- that is, the matrix is not invertible), and no algorithm can be expected to reliably find a solution.\nThe definition of the condition number depends on the choice of norm, as can be illustrated by two examples.\nIf \n\n\n\n\n∥\n⋅\n∥\n\n\n\n{\\displaystyle \\left\\|\\cdot \\right\\|}\n\n is the norm (usually noted as \n\n\n\n\n\n∥\n⋅\n∥\n\n\n2\n\n\n\n\n{\\displaystyle \\left\\|\\cdot \\right\\|_{2}}\n\n) defined in the square-summable sequence space ℓ2 (which matches the usual distance in a standard Euclidean space), then\nwhere \n\n\n\n\nσ\n\nmax\n\n\n(\nA\n)\n\n\n{\\displaystyle \\sigma _{\\max }(A)}\n\n and \n\n\n\n\nσ\n\nmin\n\n\n(\nA\n)\n\n\n{\\displaystyle \\sigma _{\\min }(A)}\n\n are maximal and minimal singular values of \n\n\n\nA\n\n\n{\\displaystyle A}\n\n respectively. Hence\nwhere \n\n\n\n\nλ\n\nmax\n\n\n(\nA\n)\n\n\n{\\displaystyle \\lambda _{\\max }(A)}\n\n and \n\n\n\n\nλ\n\nmin\n\n\n(\nA\n)\n\n\n{\\displaystyle \\lambda _{\\min }(A)}\n\n are maximal and minimal (by moduli) eigenvalues of \n\n\n\nA\n\n\n{\\displaystyle A}\n\n respectively.\nThe condition number with respect to L2 arises so often in numerical linear algebra that it is given a name, the condition number of a matrix.\nIf \n\n\n\n\n∥\n⋅\n∥\n\n\n\n{\\displaystyle \\left\\|\\cdot \\right\\|}\n\n is the norm (usually denoted by \n\n\n\n\n\n∥\n⋅\n∥\n\n\n∞\n\n\n\n\n{\\displaystyle \\left\\|\\cdot \\right\\|_{\\infty }}\n\n) defined in the sequence space ℓ∞ of all bounded sequences (which matches the maximum of distances measured on projections into the base subspaces), and \n\n\n\nA\n\n\n{\\displaystyle A}\n\n is lower triangular non-singular (i.e., \n\n\n\n∀\ni\n,\n\na\n\ni\ni\n\n\n≠\n0\n\n\n\n{\\displaystyle \\forall i,a_{ii}\\neq 0\\,}\n\n) then\nThe condition number computed with this norm is generally larger than the condition number computed with square-summable sequences, but it can be evaluated more easily (and this is often the only practicably computable condition number, when the problem to solve involves a non-linear algebra[clarification needed], for example when approximating irrational and transcendental functions or numbers with numerical methods.)\nIf the condition number is not too much larger than one (but it can still be a multiple of one), the matrix is well conditioned which means its inverse can be computed with good accuracy. If the condition number is very large, then the matrix is said to be ill-conditioned. Practically, such a matrix is almost singular, and the computation of its inverse, or solution of a linear system of equations is prone to large numerical errors. A matrix that is not invertible has condition number equal to infinity.\nCondition numbers can also be defined for nonlinear functions, and can be computed using calculus. The condition number varies with the point; in some cases one can use the maximum (or supremum) condition number over the domain of the function or domain of the question as an overall condition number, while in other cases the condition number at a particular point is of more interest.\nThe condition number of a differentiable function f in one variable as a function is \n\n\n\nx\n\nf\n′\n\n\n/\n\nf\n.\n\n\n{\\displaystyle xf'/f.}\n\n Evaluated at a point x this is:\nMost elegantly, this can be understood as (the absolute value of) the ratio of the logarithmic derivative of f, which is \n\n\n\n(\nlog\n⁡\nf\n\n)\n′\n\n=\n\nf\n′\n\n\n/\n\nf\n\n\n{\\displaystyle (\\log f)'=f'/f}\n\n and the logarithmic derivative of x, which is \n\n\n\n(\nlog\n⁡\nx\n\n)\n′\n\n=\n\nx\n′\n\n\n/\n\nx\n=\n1\n\n/\n\nx\n,\n\n\n{\\displaystyle (\\log x)'=x'/x=1/x,}\n\n yielding a ratio of \n\n\n\nx\n\nf\n′\n\n\n/\n\nf\n.\n\n\n{\\displaystyle xf'/f.}\n\n This is because the logarithmic derivative is the infinitesimal rate of relative change in a function: it is the derivative \n\n\n\n\nf\n′\n\n\n\n{\\displaystyle f'}\n\n scaled by the value of f. Note that if a function has a zero at a point, its condition number at the point is infinite, as infinitesimal changes in the input can change the output from zero to positive or negative, yielding a ratio with zero in the denominator, hence infinite relative change.\nMore directly, given a small change \n\n\n\nΔ\nx\n\n\n{\\displaystyle \\Delta x}\n\n in x, the relative change in x is \n\n\n\n[\n(\nx\n+\nΔ\nx\n)\n−\nx\n]\n\n/\n\nx\n=\n(\nΔ\nx\n)\n\n/\n\nx\n,\n\n\n{\\displaystyle [(x+\\Delta x)-x]/x=(\\Delta x)/x,}\n\n while the relative change in \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n is \n\n\n\n[\nf\n(\nx\n+\nΔ\nx\n)\n−\nf\n(\nx\n)\n]\n\n/\n\nf\n(\nx\n)\n.\n\n\n{\\displaystyle [f(x+\\Delta x)-f(x)]/f(x).}\n\n Taking the ratio yields:\nThe last term is the difference quotient (the slope of the secant line), and taking the limit yields the derivative.\nCondition numbers of common elementary functions are particularly important in computing significant figures, and can be computed immediately from the derivative; see significance arithmetic of transcendental functions. A few important ones are given below:\nCondition numbers can be defined for any function ƒ mapping its data from some domain (e.g. an m-tuple of real numbers x) into some codomain [e.g. an n-tuple of real numbers ƒ(x)], where both the domain and codomain are Banach spaces. They express how sensitive that function is to small changes (or small errors) in its arguments. This is crucial in assessing the sensitivity and potential accuracy difficulties of numerous computational problems, for example polynomial root finding or computing eigenvalues.\nThe condition number of ƒ at a point x (specifically, its relative condition number[4]) is then defined to be the maximum ratio of the fractional change in ƒ(x) to any fractional change in x, in the limit where the change δx in x becomes infinitesimally small:[4]\nwhere \n\n\n\n∥\n⋯\n∥\n\n\n{\\displaystyle \\Vert \\cdots \\Vert }\n\n is a norm on the domain/codomain of ƒ(x).\nIf ƒ is differentiable, this is equivalent to:[4]\nwhere J(x) denotes the Jacobian matrix of partial derivatives of ƒ at x and \n\n\n\n∥\nJ\n(\nx\n)\n∥\n\n\n{\\displaystyle \\Vert J(x)\\Vert }\n\n is the induced norm on the matrix.", 
    "dbpedia_url": "http://dbpedia.org/resource/Condition_number", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Condition_number\n"
}