{
    "about": "A continuous signal or a continuous-time signal is a varying quantity (a signal) whose domain, which is often time, is a continuum (e.g., a connected interval of the reals). That is, the function's domain is an uncountable set. The function itself need not be continuous. To contrast, a discrete time signal has a countable domain, like the natural numbers.", 
    "name": "Continuous Signal", 
    "classification": "Signal Processing", 
    "full_text": "A continuous signal or a continuous-time signal is a varying quantity (a signal) whose domain, which is often time, is a continuum (e.g., a connected interval of the reals). That is, the function's domain is an uncountable set. The function itself need not be continuous. To contrast, a discrete time signal has a countable domain, like the natural numbers.\nA signal of continuous amplitude and time is known as a continuous-time signal or an analog signal. This (a signal) will have some value at every instant of time. The electrical signals derived in proportion with the physical quantities such as temperature, pressure, sound etc. are generally continuous signals. Other examples of continuous signals are sine wave, cosine wave, triangular wave etc.\nThe signal is defined over a domain, which may or may not be finite, and there is a functional mapping from the domain to the value of the signal. The continuity of the time variable, in connection with the law of density of real numbers, means that the signal value can be found at any arbitrary point in time.\nA typical example of an infinite duration signal is:\n\n\n\n\nf\n(\nt\n)\n=\nsin\n⁡\n(\nt\n)\n,\n\nt\n∈\n\nR\n\n\n\n{\\displaystyle f(t)=\\sin(t),\\quad t\\in \\mathbb {R} }\n\n\nA finite duration counterpart of the above signal could be:\n\n\n\n\nf\n(\nt\n)\n=\nsin\n⁡\n(\nt\n)\n,\n\nt\n∈\n[\n−\nπ\n,\nπ\n]\n\n\n{\\displaystyle f(t)=\\sin(t),\\quad t\\in [-\\pi ,\\pi ]}\n\n and \n\n\n\nf\n(\nt\n)\n=\n0\n\n\n{\\displaystyle f(t)=0}\n\n otherwise.\nThe value of a finite (or infinite) duration signal may or may not be finite. For example,\n\n\n\n\nf\n(\nt\n)\n=\n\n\n1\nt\n\n\n,\n\nt\n∈\n[\n0\n,\n1\n]\n\n\n{\\displaystyle f(t)={\\frac {1}{t}},\\quad t\\in [0,1]}\n\n and \n\n\n\nf\n(\nt\n)\n=\n0\n\n\n{\\displaystyle f(t)=0}\n\n otherwise,\nis a finite duration signal but it takes an infinite value for \n\n\n\nt\n=\n0\n\n\n\n{\\displaystyle t=0\\,}\n\n.\nIn many disciplines, the convention is that a continuous signal must always have a finite value, which makes more sense in the case of physical signals.\nFor some purposes, infinite singularities are acceptable as long as the signal is integrable over any finite interval (for example, the \n\n\n\n\nt\n\n−\n1\n\n\n\n\n{\\displaystyle t^{-1}}\n\n signal is not integrable, but \n\n\n\n\nt\n\n−\n2\n\n\n\n\n{\\displaystyle t^{-2}}\n\n is).\nAny analog signal is continuous by nature. Discrete-time signals, used in digital signal processing, can be obtained by sampling and quantization of continuous signals.\nContinuous signal may also be defined over an independent variable other than time. Another very common independent variable is space and is particularly useful in image processing, where two space dimensions are used.\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Continuous_signal", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Continuous_signal\n"
}