{
    "about": "In mathematics, the Conway polynomial Cp,n for the finite field Fpn is a particular irreducible polynomial of degree n over Fp that can be used to define a standard representation of Fpn as a splitting field of Fp. Conway polynomials were named after John H. Conway by Richard A. Parker, who was the first to define them and compute examples. Conway polynomials satisfy a certain compatibility condition that had been proposed by Conway between the representation of a field and the representations of its subfields. They are important in computer algebra where they provide portability among different mathematical databases and computer algebra systems. Since Conway polynomials are expensive to compute, they must be stored to be used in practice. Databases of Conway polynomials are available in the computer algebra systems GAP,[1] Macaulay2,[2] Magma,[3] SageMath,[4] and at the web site of Frank Lübeck.[5]", 
    "name": "Conway Polynomial (Finite Fields)", 
    "classification": "Computer Algebra", 
    "full_text": "In mathematics, the Conway polynomial Cp,n for the finite field Fpn is a particular irreducible polynomial of degree n over Fp that can be used to define a standard representation of Fpn as a splitting field of Fp. Conway polynomials were named after John H. Conway by Richard A. Parker, who was the first to define them and compute examples. Conway polynomials satisfy a certain compatibility condition that had been proposed by Conway between the representation of a field and the representations of its subfields. They are important in computer algebra where they provide portability among different mathematical databases and computer algebra systems. Since Conway polynomials are expensive to compute, they must be stored to be used in practice. Databases of Conway polynomials are available in the computer algebra systems GAP,[1] Macaulay2,[2] Magma,[3] SageMath,[4] and at the web site of Frank Lübeck.[5]\n\n\nElements of Fpn may be represented as sums of the form an−1βn−1 + ... + a1β + a0 where β is a root of an irreducible polynomial of degree n over Fp and the aj are elements of Fp. Addition of field elements in this representation is simply vector addition. While there is a unique finite field of order pn up to isomorphism, the representation of the field elements depends on the choice of irreducible polynomial. The Conway polynomial is a way of standardizing this choice.\nThe non-zero elements of a finite field form a cyclic group under multiplication. A primitive element, α, of Fpn is an element that generates this group. Representing the non-zero field elements as powers of α allows multiplication in the field to be performed efficiently. The primitive polynomial for α is the monic polynomial of smallest possible degree with coefficients in Fp that has α as a root in Fpn (the minimal polynomial for α). It is necessarily irreducible. The Conway polynomial is chosen to be primitive, so that each of its roots generates the multiplicative group of the associated finite field.\nThe subfields of Fpn are fields Fpm with m dividing n. The cyclic group formed from the non-zero elements of Fpm is a subgroup of the cyclic group of Fpn. If α generates the latter, then the smallest power of α that generates the former is αr where r = (pn − 1)/(pm − 1). If fn is a primitive polynomial for Fpn with root α, and if fm is a primitive polynomial for Fpm, then by Conway's definition, fm and fn are compatible if αr is a root of fm. This necessitates that fn(x) divide fm(xr). This notion of compatibility is called norm-compatibility by some authors. The Conway polynomial for a finite field is chosen so as to be compatible with the Conway polynomials of each of its subfields. That it is possible to make the choice in this way was proved by Werner Nickel.[6]\nThe Conway polynomial Cp,n is defined as the lexicographically minimal monic primitive polynomial of degree n over Fp that is compatible with Cp,m for all m dividing n. This is an inductive definition on n: the base case is Cp,1(x) = x − α where α is the lexicographically minimal primitive element of Fp. The notion of lexicographical ordering used is the following:\nSince there does not appear to be any natural mathematical criterion that would single out one monic primitive polynomial satisfying the compatibility conditions over all the others, the imposition of lexicographical ordering in the definition of the Conway polynomial should be regarded as a convention.\nAlgorithms for computing Conway polynomials that are more efficient than brute-force search have been developed by Heath and Loehr.[7] Lübeck indicates[5] that their algorithm is a rediscovery of the method of Parker.", 
    "dbpedia_url": "http://dbpedia.org/resource/Conway_polynomial_(finite_fields)", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Conway_polynomial_(finite_fields)\n"
}