{
    "about": "Cristian's algorithm (introduced by Flaviu Cristian in 1989)[1] is a method for clock synchronization which can be used in many fields of distributive computer science but is primarily used in low-latency intranets. Cristian observed that this simple algorithm is probabilistic, in that it only achieves synchronization if the round-trip time (RTT) of the request is short compared to required accuracy. It also suffers in implementations using a single server, making it unsuitable for many distributive applications where redundancy may be crucial.", 
    "name": "Cristian'S Algorithm", 
    "classification": "Distributed Algorithms", 
    "full_text": "Cristian's algorithm (introduced by Flaviu Cristian in 1989)[1] is a method for clock synchronization which can be used in many fields of distributive computer science but is primarily used in low-latency intranets. Cristian observed that this simple algorithm is probabilistic, in that it only achieves synchronization if the round-trip time (RTT) of the request is short compared to required accuracy. It also suffers in implementations using a single server, making it unsuitable for many distributive applications where redundancy may be crucial.\nCristian algorithm works between a process P, and a time server S — connected to a source of UTC (Coordinated Universal Time). Put simply:\nThis method assumes that the RTT is split equally between request and response, which may not always be the case but is a reasonable assumption on a LAN connection.\nFurther accuracy can be gained by making multiple requests to S and using the response with the shortest RTT.\nWe can estimate the accuracy of the system as follows. Let min be the minimum time to transmit a message one-way. The earliest point at which S could have placed the time T, was min after P sent its request. Therefore, the time at S, when the message by P is received, is in the range (T + min) to (T + RTT - min). The width of this range is (RTT - 2*min). This gives an accuracy of (RTT/2 - min).\nOther time synchronization protocols:", 
    "dbpedia_url": "http://dbpedia.org/resource/Cristian's_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Cristian's_algorithm\n"
}