{
    "about": "In signal processing, cross-correlation is a measure of similarity of two series as a function of the displacement of one relative to the other. This is also known as a sliding dot product or sliding inner-product. It is commonly used for searching a long signal for a shorter, known feature. It has applications in pattern recognition, single particle analysis, electron tomography, averaging, cryptanalysis, and neurophysiology.", 
    "classification": "Signal Processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Cross-correlation\n", 
    "full_text": "In signal processing, cross-correlation is a measure of similarity of two series as a function of the displacement of one relative to the other. This is also known as a sliding dot product or sliding inner-product. It is commonly used for searching a long signal for a shorter, known feature. It has applications in pattern recognition, single particle analysis, electron tomography, averaging, cryptanalysis, and neurophysiology.\nFor continuous functions f and g, the cross-correlation is defined as:\nwhere \n\n\n\n\nf\n\n∗\n\n\n\n\n{\\displaystyle f^{*}}\n\n denotes the complex conjugate of \n\n\n\nf\n\n\n{\\displaystyle f}\n\n, and \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n is the displacement, also known as lag, although a positive value of \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n actually means that \n\n\n\ng\n(\nt\n+\nτ\n)\n\n\n{\\displaystyle g(t+\\tau )}\n\n leads \n\n\n\ng\n(\nt\n)\n\n\n{\\displaystyle g(t)}\n\n.\nSimilarly, for discrete functions, the cross-correlation is defined as:\nThe cross-correlation is similar in nature to the convolution of two functions.\nIn an autocorrelation, which is the cross-correlation of a signal with itself, there will always be a peak at a lag of zero, and its size will be the signal power.\nIn probability and statistics, the term cross-correlations is used for referring to the correlations between the entries of two random vectors X and Y, while the correlations of a random vector X are considered to be the correlations between the entries of X itself, those forming the correlation matrix (matrix of correlations) of X. If each of X and Y is a scalar random variable which is realized repeatedly in temporal sequence (a time series), then the correlations of the various temporal instances of X are known as autocorrelations of X, and the cross-correlations of X with Y across time are temporal cross-correlations.\nFurthermore, in probability and statistics the definition of correlation always includes a standardising factor in such a way that correlations have values between −1 and +1.\nIf \n\n\n\nX\n\n\n{\\displaystyle X}\n\n and \n\n\n\nY\n\n\n{\\displaystyle Y}\n\n are two independent random variables with probability density functions f and g, respectively, then the probability density of the difference \n\n\n\nY\n−\nX\n\n\n{\\displaystyle Y-X}\n\n is formally given by the cross-correlation (in the signal-processing sense) \n\n\n\nf\n⋆\ng\n\n\n{\\displaystyle f\\star g}\n\n; however this terminology is not used in probability and statistics. In contrast, the convolution \n\n\n\nf\n∗\ng\n\n\n{\\displaystyle f*g}\n\n (equivalent to the cross-correlation of f(t) and g(−t) ) gives the probability density function of the sum \n\n\n\nX\n+\nY\n\n\n{\\displaystyle X+Y}\n\n.\n\n\nAs an example, consider two real valued functions \n\n\n\nf\n\n\n{\\displaystyle f}\n\n and \n\n\n\ng\n\n\n{\\displaystyle g}\n\n differing only by an unknown shift along the x-axis. One can use the cross-correlation to find how much \n\n\n\ng\n\n\n{\\displaystyle g}\n\n must be shifted along the x-axis to make it identical to \n\n\n\nf\n\n\n{\\displaystyle f}\n\n. The formula essentially slides the \n\n\n\ng\n\n\n{\\displaystyle g}\n\n function along the x-axis, calculating the integral of their product at each position. When the functions match, the value of \n\n\n\n(\nf\n⋆\ng\n)\n\n\n{\\displaystyle (f\\star g)}\n\n is maximized. This is because when peaks (positive areas) are aligned, they make a large contribution to the integral. Similarly, when troughs (negative areas) align, they also make a positive contribution to the integral because the product of two negative numbers is positive.\nWith complex-valued functions \n\n\n\nf\n\n\n{\\displaystyle f}\n\n and \n\n\n\ng\n\n\n{\\displaystyle g}\n\n, taking the conjugate of \n\n\n\nf\n\n\n{\\displaystyle f}\n\n ensures that aligned peaks (or aligned troughs) with imaginary components will contribute positively to the integral.\nIn econometrics, lagged cross-correlation is sometimes referred to as cross-autocorrelation.[6]\nIn time series analysis, as applied in statistics, the cross-correlation between two time series is the normalized cross-covariance function.\nLet \n\n\n\n(\n\nX\n\nt\n\n\n,\n\nY\n\nt\n\n\n)\n\n\n{\\displaystyle (X_{t},Y_{t})}\n\n represent a pair of stochastic processes that are jointly wide-sense stationary. Then the cross-covariance and the cross-correlation are given by\nwhere \n\n\n\n\nμ\n\nX\n\n\n\n\n{\\displaystyle \\mu _{X}}\n\n and \n\n\n\n\nσ\n\nX\n\n\n\n\n{\\displaystyle \\sigma _{X}}\n\n are the mean and standard deviation of the process \n\n\n\n(\n\nX\n\nt\n\n\n)\n\n\n{\\displaystyle (X_{t})}\n\n, which are constant over time due to stationarity; and similarly for \n\n\n\n(\n\nY\n\nt\n\n\n)\n\n\n{\\displaystyle (Y_{t})}\n\n, respectively. \n\n\n\nE\n⁡\n[\n \n]\n\n\n{\\displaystyle \\operatorname {E} [\\ ]}\n\n indicates the expected value. That the cross-covariance and cross-correlation are independent of t is precisely the additional information (beyond being individually wide-sense stationary) conveyed by the requirement that \n\n\n\n(\n\nX\n\nt\n\n\n,\n\nY\n\nt\n\n\n)\n\n\n{\\displaystyle (X_{t},Y_{t})}\n\n are jointly wide-sense stationary.\nThe cross-correlation of a pair of jointly wide sense stationary stochastic processes can be estimated by averaging the product of samples measured from one process and samples measured from the other (and its time shifts). The samples included in the average can be an arbitrary subset of all the samples in the signal (e.g., samples within a finite time window or a sub-sampling[which?] of one of the signals). For a large number of samples, the average converges to the true cross-correlation.\nCross-correlations are useful for determining the time delay between two signals, e.g. for determining time delays for the propagation of acoustic signals across a microphone array.[8][9][clarification needed] After calculating the cross-correlation between the two signals, the maximum (or minimum if the signals are negatively correlated) of the cross-correlation function indicates the point in time where the signals are best aligned, i.e. the time delay between the two signals is determined by the argument of the maximum, or arg max of the cross-correlation, as in\nFor image-processing applications in which the brightness of the image and template can vary due to lighting and exposure conditions, the images can be first normalized. This is typically done at every step by subtracting the mean and dividing by the standard deviation. That is, the cross-correlation of a template, \n\n\n\nt\n(\nx\n,\ny\n)\n\n\n{\\displaystyle t(x,y)}\n\n with a subimage \n\n\n\nf\n(\nx\n,\ny\n)\n\n\n{\\displaystyle f(x,y)}\n\n is\nwhere \n\n\n\nn\n\n\n{\\displaystyle n}\n\n is the number of pixels in \n\n\n\nt\n(\nx\n,\ny\n)\n\n\n{\\displaystyle t(x,y)}\n\n and \n\n\n\nf\n(\nx\n,\ny\n)\n\n\n{\\displaystyle f(x,y)}\n\n, \n\n\n\n\n\nf\n¯\n\n\n\n\n{\\displaystyle {\\overline {f}}}\n\n is the average of f and \n\n\n\n\nσ\n\nf\n\n\n\n\n{\\displaystyle \\sigma _{f}}\n\n is standard deviation of f. In functional analysis terms, this can be thought of as the dot product of two normalized vectors. That is, if\nand\nthen the above sum is equal to\nwhere \n\n\n\n⟨\n⋅\n,\n⋅\n⟩\n\n\n{\\displaystyle \\langle \\cdot ,\\cdot \\rangle }\n\n is the inner product and \n\n\n\n∥\n⋅\n∥\n\n\n{\\displaystyle \\|\\cdot \\|}\n\n is the L² norm. Thus, if f and t are real matrices, their normalized cross-correlation equals the cosine of the angle between the unit vectors F and T, being thus 1 if and only if F equals T multiplied by a positive scalar.\nNormalized correlation is one of the methods used for template matching, a process used for finding incidences of a pattern or object within an image. It is also the 2-dimensional version of Pearson product-moment correlation coefficient.\nCaution must be applied when using cross correlation for nonlinear systems. In certain circumstances, which depend on the properties of the input, cross correlation between the input and output of a system with nonlinear dynamics can be completely blind to certain nonlinear effects.[10] This problem arises because some quadratic moments can equal zero and this can incorrectly suggest that there is little \"correlation\" (in the sense of statistical dependence) between two signals, when in fact the two signals are strongly related by nonlinear dynamics.", 
    "name": "Cross Correlation"
}