{
    "about": "In operations research, cuckoo search is an optimization algorithm developed by Xin-she Yang and Suash Deb in 2009.[1][2] It was inspired by the obligate brood parasitism of some cuckoo species by laying their eggs in the nests of other host birds (of other species). Some host birds can engage direct conflict with the intruding cuckoos. For example, if a host bird discovers the eggs are not their own, it will either throw these alien eggs away or simply abandon its nest and build a new nest elsewhere. Some cuckoo species such as the New World brood-parasitic Tapera have evolved in such a way that female parasitic cuckoos are often very specialized in the mimicry in colors and pattern of the eggs of a few chosen host species [3] Cuckoo search idealized such breeding behavior, and thus can be applied for various optimization problems.", 
    "name": "Cuckoo Search", 
    "classification": "Evolutionary Algorithms", 
    "full_text": "In operations research, cuckoo search is an optimization algorithm developed by Xin-she Yang and Suash Deb in 2009.[1][2] It was inspired by the obligate brood parasitism of some cuckoo species by laying their eggs in the nests of other host birds (of other species). Some host birds can engage direct conflict with the intruding cuckoos. For example, if a host bird discovers the eggs are not their own, it will either throw these alien eggs away or simply abandon its nest and build a new nest elsewhere. Some cuckoo species such as the New World brood-parasitic Tapera have evolved in such a way that female parasitic cuckoos are often very specialized in the mimicry in colors and pattern of the eggs of a few chosen host species [3] Cuckoo search idealized such breeding behavior, and thus can be applied for various optimization problems.\n\n\nCuckoo search (CS) uses the following representations:\nEach egg in a nest represents a solution, and a cuckoo egg represents a new solution. The aim is to use the new and potentially better solutions (cuckoos) to replace a not-so-good solution in the nests. In the simplest form, each nest has one egg. The algorithm can be extended to more complicated cases in which each nest has multiple eggs representing a set of solutions.\nCS is based on three idealized rules:\nIn addition, Yang and Deb discovered that the random-walk style search is better performed by Lévy flights rather than simple random walk.\nThe pseudo-code can be summarized as:\nAn important advantage of this algorithm is its simplicity. In fact, comparing with other population- or agent-based metaheuristic algorithms such as particle swarm optimization and harmony search, there is essentially only a single parameter \n\n\n\n\np\n\na\n\n\n\n\n{\\displaystyle p_{a}}\n\n in CS (apart from the population size \n\n\n\nn\n\n\n{\\displaystyle n}\n\n). Therefore, it is very easy to implement.\nAn important issue is the applications of Lévy flights and random walks in the generic equation for generating new solutions\nwhere \n\n\n\n\nE\n\nt\n\n\n\n\n{\\displaystyle E_{t}}\n\n is drawn from a standard normal distribution with zero mean and unity standard deviation for random walks, or drawn from Lévy distribution for Lévy flights. Obviously, the random walks can also be linked with the similarity between a cuckoo's egg and the host's egg which can be tricky in implementation. Here the step size \n\n\n\ns\n\n\n{\\displaystyle s}\n\n determines how far a random walker can go for a fixed number of iterations. The generation of Lévy step size is often tricky, and a comparison of three algorithms (including Mantegna's[4]) was performed by Leccardi[5] who found an implementation of Chambers et al.'s approach[6] to be the most computationally efficient due to the low number of random numbers required.\nIf s is too large, then the new solution generated will be too far away from the old solution (or even jump out side of the bounds). Then, such a move is unlikely to be accepted. If s is too small, the change is too small to be significant, and consequently such search is not efficient. So a proper step size is important to maintain the search as efficient as possible.\nAs an example, for simple isotropic random walks, we know that the average distance \n\n\n\nr\n\n\n{\\displaystyle r}\n\n traveled in the d-dimension space is\nwhere \n\n\n\nD\n=\n\ns\n\n2\n\n\n\n/\n\n2\nτ\n\n\n{\\displaystyle D=s^{2}/2\\tau }\n\n is the effective diffusion coefficient. Here \n\n\n\ns\n\n\n{\\displaystyle s}\n\n is the step size or distance traveled at each jump, and \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n is the time taken for each jump. The above equation implies that[7]\nFor a typical length scale L of a dimension of interest, the local search is typically limited in a region of \n\n\n\nr\n=\nL\n\n/\n\n10\n\n\n{\\displaystyle r=L/10}\n\n. For \n\n\n\nτ\n=\n1\n\n\n{\\displaystyle \\tau =1}\n\n and t=100 to 1000, we have \n\n\n\ns\n≈\n0.01\nL\n\n\n{\\displaystyle s\\approx 0.01L}\n\n for d=1, and \n\n\n\ns\n≈\n0.001\nL\n\n\n{\\displaystyle s\\approx 0.001L}\n\n for d=10. Therefore, we can use s/L=0.001 to 0.01 for most problems. Though the exact derivation may require detailed analysis of the behaviour of Lévy flights.[8]\nAlgorithm and convergence analysis will be fruitful, because there are many open problems related to metaheuristics[9]", 
    "dbpedia_url": "http://dbpedia.org/resource/Cuckoo_search", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Cuckoo_search\n"
}