{
    "about": "A cyclostationary process is a signal having statistical properties that vary cyclically with time.[1] A cyclostationary process can be viewed as multiple interleaved stationary processes. For example, the maximum daily temperature in New York City can be modeled as a cyclostationary process: the maximum temperature on July 21 is statistically different from the temperature on December 20; however, it is a reasonable approximation that the temperature on December 20 of different years has identical statistics. Thus, we can view the random process composed of daily maximum temperatures as 365 interleaved stationary processes, each of which takes on a new value once per year.", 
    "name": "Cyclostationary Process", 
    "classification": "Signal Processing", 
    "full_text": "A cyclostationary process is a signal having statistical properties that vary cyclically with time.[1] A cyclostationary process can be viewed as multiple interleaved stationary processes. For example, the maximum daily temperature in New York City can be modeled as a cyclostationary process: the maximum temperature on July 21 is statistically different from the temperature on December 20; however, it is a reasonable approximation that the temperature on December 20 of different years has identical statistics. Thus, we can view the random process composed of daily maximum temperatures as 365 interleaved stationary processes, each of which takes on a new value once per year.\n\n\nThere are two differing approaches to the treatment of cyclostationary processes.[2] The probabilistic approach is to view measurements as an instance of a stochastic process. As an alternative, the deterministic approach is to view the measurements as a single time series, from which a probability distribution for some event associated with the time series can be defined as the fraction of time that event occurs over the lifetime of the time series. In both approaches, the process or time series is said to be cyclostationary if and only if its associated probability distributions vary periodically with time. However, in the deterministic time-series approach, there is an alternative but equivalent definition: A time series that contains no finite-strength additive sine-wave components is said to exhibit cyclostationarity if and only if there exists some nonlinear time-invariant transformation of the time series that produces positive-strength additive sine-wave components.\nAn important special case of cyclostationary signals is one that exhibits cyclostationarity in second-order statistics (e.g., the autocorrelation function). These are called wide-sense cyclostationary signals, and are analogous to wide-sense stationary processes. The exact definition differs depending on whether the signal is treated as a stochastic process or as a deterministic time series.\nA stochastic process \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n of mean \n\n\n\nE\n⁡\n[\nx\n(\nt\n)\n]\n\n\n{\\displaystyle \\operatorname {E} [x(t)]}\n\n and autocorrelation function:\nwhere the star denotes complex conjugation, is said to be wide-sense cyclostationary with period \n\n\n\n\nT\n\n0\n\n\n\n\n{\\displaystyle T_{0}}\n\n if both \n\n\n\nE\n⁡\n[\nx\n(\nt\n)\n]\n\n\n{\\displaystyle \\operatorname {E} [x(t)]}\n\n and \n\n\n\n\nR\n\nx\n\n\n(\nt\n,\nτ\n)\n\n\n{\\displaystyle R_{x}(t,\\tau )}\n\n are cyclic in \n\n\n\nt\n\n\n{\\displaystyle t}\n\n with period \n\n\n\n\nT\n\n0\n\n\n,\n\n\n{\\displaystyle T_{0},}\n\n i.e.:[2]\nThe autocorrelation function is thus periodic in t and can be expanded in Fourier series:\nwhere \n\n\n\n\nR\n\nx\n\n\nn\n\n/\n\n\nT\n\n0\n\n\n\n\n(\nτ\n)\n\n\n{\\displaystyle R_{x}^{n/T_{0}}(\\tau )}\n\n is called cyclic autocorrelation function and equal to:\nThe frequencies \n\n\n\nn\n\n/\n\n\nT\n\n0\n\n\n,\n\nn\n∈\n\nZ\n\n,\n\n\n{\\displaystyle n/T_{0},\\,n\\in \\mathbb {Z} ,}\n\n are called cyclic frequencies.\nWide-sense stationary processes are a special case of cylostationary processes with only \n\n\n\n\nR\n\nx\n\n\n0\n\n\n(\nτ\n)\n≠\n0\n\n\n{\\displaystyle R_{x}^{0}(\\tau )\\neq 0}\n\n.\nA signal that is just a function of time and not a sample path of a stochastic process can exhibit cyclostationary properties in the framework of the fraction-of-time point of view. This way, the cyclic autocorrelation function can be defined by:[2]\nIf the time-series is a sample path of a stochastic process it is \n\n\n\n\nR\n\nx\n\n\nn\n\n/\n\n\nT\n\n0\n\n\n\n\n(\nτ\n)\n=\nE\n⁡\n\n[\n\n\n\n\nR\n^\n\n\n\n\nx\n\n\nn\n\n/\n\n\nT\n\n0\n\n\n\n\n(\nτ\n)\n]\n\n\n\n{\\displaystyle R_{x}^{n/T_{0}}(\\tau )=\\operatorname {E} \\left[{\\hat {R}}_{x}^{n/T_{0}}(\\tau )\\right]}\n\n. If the signal is further ergodic, all sample paths exhibits the same time-average and thus \n\n\n\n\nR\n\nx\n\n\nn\n\n/\n\n\nT\n\n0\n\n\n\n\n(\nτ\n)\n=\n\n\n\n\nR\n^\n\n\n\n\nx\n\n\nn\n\n/\n\n\nT\n\n0\n\n\n\n\n(\nτ\n)\n\n\n{\\displaystyle R_{x}^{n/T_{0}}(\\tau )={\\hat {R}}_{x}^{n/T_{0}}(\\tau )}\n\n in mean square error sense.\nThe Fourier transform of the cyclic autocorrelation function at cyclic frequency α is called cyclic spectrum or spectral correlation density function and is equal to:\nThe cyclic spectrum at zeroth cyclic frequency is also called average power spectral density.\nIt is worth noting that a cyclostationary stochastic process \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n with Fourier transform \n\n\n\nX\n(\nf\n)\n\n\n{\\displaystyle X(f)}\n\n may have correlated frequency components spaced apart by multiples of \n\n\n\n1\n\n/\n\n\nT\n\n0\n\n\n\n\n{\\displaystyle 1/T_{0}}\n\n, since:\nwith \n\n\n\nδ\n(\nf\n)\n\n\n{\\displaystyle \\delta (f)}\n\n the Dirac's delta function. Different frequencies \n\n\n\n\nf\n\n1\n,\n2\n\n\n\n\n{\\displaystyle f_{1,2}}\n\n are indeed always uncorrelated for a wide-sense stationary process since \n\n\n\n\nS\n\nx\n\n\nn\n\n/\n\n\nT\n\n0\n\n\n\n\n(\nf\n)\n≠\n0\n\n\n{\\displaystyle S_{x}^{n/T_{0}}(f)\\neq 0}\n\n only for \n\n\n\nn\n=\n0\n\n\n{\\displaystyle n=0}\n\n.\nAn example of cyclostationary signal is the linearly modulated digital signal :\nwhere \n\n\n\n\na\n\nk\n\n\n∈\n\nC\n\n\n\n{\\displaystyle a_{k}\\in \\mathbb {C} }\n\n are i.i.d. random variables. The waveform \n\n\n\np\n(\nt\n)\n\n\n{\\displaystyle p(t)}\n\n, with Fourier transform \n\n\n\nP\n(\nf\n)\n\n\n{\\displaystyle P(f)}\n\n, is the supporting pulse of the modulation.\nBy assuming \n\n\n\nE\n⁡\n[\n\na\n\nk\n\n\n]\n=\n0\n\n\n{\\displaystyle \\operatorname {E} [a_{k}]=0}\n\n and \n\n\n\nE\n⁡\n[\n\n|\n\n\na\n\nk\n\n\n\n\n|\n\n\n2\n\n\n]\n=\n\nσ\n\na\n\n\n2\n\n\n\n\n{\\displaystyle \\operatorname {E} [|a_{k}|^{2}]=\\sigma _{a}^{2}}\n\n, the auto-correlation function is:\nThe last summation is a periodic summation, hence a signal periodic in t. This way, \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n is a cyclostationary signal with period \n\n\n\n\nT\n\n0\n\n\n\n\n{\\displaystyle T_{0}}\n\n and cyclic autocorrelation function:\nwith \n\n\n\n∗\n\n\n{\\displaystyle *}\n\n indicating convolution. The cyclic spectrum is:\nTypical raised-cosine pulses adopted in digital communications have thus only \n\n\n\nn\n=\n−\n1\n,\n0\n,\n1\n\n\n{\\displaystyle n=-1,0,1}\n\n non-zero cyclic frequencies.\nIt is possible to generalise the class of autoregressive moving average models to incorporate cyclostationary behaviour. For example, Troutman[3] treated autoregressions in which the autoregression coefficients and residual variance are no longer constant but vary cyclically with time. His work follows a number of other studies of cyclostationary processes within the field of time series analysis.[4][5]\nMechanical signals produced by rotating or reciprocating machines are remarkably well modelled as cyclostationary processes. The cyclostationary family accepts all signals with hidden periodicities, either of the additive type (presence of tonal components) or multiplicative type (presence of periodic modulations). This happens to be the case for noise and vibration produced by gear mechanisms, bearings, internal combustion engines, turbofans, pumps, propellers, etc. The explicit modelling of mechanical signals as cyclostationary processes has been found useful in several applications, such as in noise, vibration, and harshness (NVH) and in condition monitoring.[6] In the latter field, cyclostationarity has been found to generalize the envelope spectrum, a popular analysis technique used in the diagnostics of bearing faults.\nOne peculiarity of rotating machine signals is that the period of the process is strictly linked to the angle of rotation of a specific component – the “cycle” of the machine. At the same time, a temporal description must be preserved to reflect the nature of dynamical phenomena that are governed by differential equations of time. Therefore, the angle-time autocorrelation function is used,\nwhere \n\n\n\nθ\n\n\n{\\displaystyle \\theta }\n\n stands for angle, \n\n\n\nt\n(\nθ\n)\n\n\n{\\displaystyle t(\\theta )}\n\n for the time instant corresponding to angle \n\n\n\nθ\n\n\n{\\displaystyle \\theta }\n\n and \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n for time delay. Processes whose angle-time autocorrelation function is a periodic function of angle, \n\n\n\n\nR\n\nx\n\n\n(\nθ\n;\nτ\n)\n=\n\nR\n\nx\n\n\n(\nθ\n+\nΘ\n;\nτ\n)\n\n\n{\\displaystyle R_{x}(\\theta ;\\tau )=R_{x}(\\theta +\\Theta ;\\tau )}\n\n for some angular period \n\n\n\nΘ\n\n\n{\\displaystyle \\Theta }\n\n, are called (wide-sense) angle-time cyclostationary. The double Fourier transform of the angle-time autocorrelation function defines the order-frequency spectral correlation,\nwhere \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n is an order (unit in events per revolution) and \n\n\n\nf\n\n\n{\\displaystyle f}\n\n a frequency (unit in Hz).", 
    "dbpedia_url": "http://dbpedia.org/resource/Cyclostationary_process", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Cyclostationary_process\n"
}