{
    "about": "\nThe dbx Model 700 Digital Audio Processor was a professional audio ADC/DAC combination unit, which digitized a stereo analog audio input into a bitstream, which was then encoded and encapsulated in an analog composite video signal, for recording to tape using a VCR as a transport. Unlike other similar pieces of equipment like the Sony PCM-F1, the Model 700 used a technique called Companded Predictive Delta Modulation, rather than the now-common pulse-code modulation. At the time of its introduction in the mid-1980s the device was the first commercial product to use this method, although it had been proposed in the 1960s and prototyped in the late '70s.[1]", 
    "name": "Dbx Model 700 Digital Audio Processor", 
    "classification": "Digital Signal Processing", 
    "full_text": "\nThe dbx Model 700 Digital Audio Processor was a professional audio ADC/DAC combination unit, which digitized a stereo analog audio input into a bitstream, which was then encoded and encapsulated in an analog composite video signal, for recording to tape using a VCR as a transport. Unlike other similar pieces of equipment like the Sony PCM-F1, the Model 700 used a technique called Companded Predictive Delta Modulation, rather than the now-common pulse-code modulation. At the time of its introduction in the mid-1980s the device was the first commercial product to use this method, although it had been proposed in the 1960s and prototyped in the late '70s.[1]\n\n\nUnlike the many digital recording formats that would follow (e.g. DAT and ADAT), the Model 700 had no capability for storage on its own, and relied on an analog recording medium supplied by the user. In general, any high-quality VHS VCR would do, although 3/4\" U-matic or Beta decks could also have been used. If viewed on a monitor, the output stream of a Model 700 looked like analog TV \"static\" or noise, with slight black bars running down either side.\nEarly on, the machine was hailed as \"the best recording device you can buy,\"[2] and Stereophile Magazine reviewed it positively.[3] Many people liked the format because it offered more dynamic range than analog tape, but without the \"hard clipping\" inherent in PCM audio recorders of the time. The Model 700 had been designed from the beginning to have many 'tape-like' characteristics, including \"soft saturation,\" and at a time when most professional and amateur recordists were used to analog tape, this was considered a significant feature. It also offered 14dB more dynamic range than 44.1kHz/16b audio, and because of its very high sample rate (644kHz), it did not contain the same anti-aliasing filters necessary in PCM recorders at the time, which were thought to cause undesirable harmonic interference.\nThe device sold for $4,600 in 1986,[2] and that was without a video recorder on which to store the output, putting it out of the reach of all but the most wealthy home users. However, its target market was professional and studio users, and here it enjoyed relative popularity for a short amount of time as a mastering or mixdown recorder, recording the final output from a multitrack system.\nThe Model 700 was available in several different versions. In its most basic incarnation, it had two line-level, balanced inputs. One popular upgrade was the addition of one or two microphone preamps, which were installed on removable cards into slots in the machine. These allowed stereo recording directly into the Model 700, bypassing a mixing console. Since the recorder had a significantly lower noise floor than most mixers of the same era, this method made the best use of the system's available dynamic range. Another, much more rare accessory was the Model 700D Disc Mastering Delay. This was a device used for mastering vinyl records, and attached to a proprietary 25-pin digital output on the back of the Model 700 recorder. Because of the nature of vinyl records (which rotate at a constant angular velocity but at a changing linear velocity with respect to the needle as it moves inwards), it is necessary to send the audio signal to the computer controlling the movement (pitch) of the cutting lathe. In this way, during quiet passages the pitch is decreased thus enabling more grooves per inch. The computer needs an audio signal that is exactly one rotation ahead of the actual audio fed to the cutting lathe, so that it can move the cutting head rapidly forward before a loud passage is grooved. The disc mastering delay achieved this just like the analog mastering tape decks that used an extra playback head for this purpose.\nThe Model 700 was developed and sold by the dbx corporation of Newton, Massachusetts, better known for their system of noise reduction for analog tape.\nThe Model 700 converted analog audio into digital data using a type of delta-sigma modulation, called \"Companded Predictive Delta Modulation,\" or \"CPDM\" (both trademarked). In a traditional, single-integrated delta-sigma ADC, the voltage of an input signal is compared to the output of an integrator. If the input signal is higher than the integrator's output, a 1 is recorded, and the integrator is given a command to increase by a certain amount. On each clock cycle, the comparison is repeated (and another 1 is recorded) until the integrator's output exceeds the input voltage, at which point a 0 is recorded and the integrator is told to decrease. In this way, the integrator attempts to follow the input signal as closely as it can. When fed a constant-voltage signal (or when the input is removed completely), the output will \"idle\" and produce a stream of alternating 1s and 0s. A decoder listening to this stream would produce a small sinusoidal or triangle-wave output, even though the correct output should be flat: this is a form of quantization error.\nWhere the Model 700 differs from classical delta-sigma modulation is in its replacement of the single integrator with a complex system of comparators and high-order linear prediction filters.[5] This was done in order to reduce the quantization error, and is accomplished in part by changing the effective \"step size\" of the encoder based on previously recorded information. (Thereby increasing or decreasing the slew rate.) The system also has two analog pre-processing steps which compress the input signal in both the amplitude and frequency domain, in order to more closely match the abilities of the encoder. This compression is done adaptively based on previously encoded signal, and is reversed on the decoding end.[6]", 
    "dbpedia_url": "http://dbpedia.org/resource/Dbx_Model_700_Digital_Audio_Processor", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Dbx_Model_700_Digital_Audio_Processor\n"
}