{
    "about": "A delimiter is a sequence of one or more characters used to specify the boundary between separate, independent regions in plain text or other data streams.[1] An example of a delimiter is the comma character, which acts as a field delimiter in a sequence of comma-separated values. Another example of a delimiter is the time gap used to separate letters and words in the transmission of Morse code.", 
    "name": "Delimiter", 
    "classification": "Pattern Matching", 
    "full_text": "A delimiter is a sequence of one or more characters used to specify the boundary between separate, independent regions in plain text or other data streams.[1] An example of a delimiter is the comma character, which acts as a field delimiter in a sequence of comma-separated values. Another example of a delimiter is the time gap used to separate letters and words in the transmission of Morse code.\nDelimiters represent one of various means to specify boundaries in a data stream. Declarative notation, for example, is an alternate method that uses a length field at the start of a data stream to specify the number of characters that the data stream contains.[2]\n\n\nDelimiters can be broken down into:\nField delimiters separate data fields. Record delimiters separate groups of fields.[3]\nFor example, the CSV file format uses a comma as the delimiter between fields, and an end-of-line indicator as the delimiter between records. For instance:\nspecifies a simple flat file database table using the CSV file format.\nBracket delimiters (also called block delimiters, region delimiters or balanced delimiters) mark both the start and end of a region of text.[4][5]\nCommon examples of bracket delimiters include:[6]\nComputing platforms historically use certain delimiters by convention.[14] The following tables depict just a few examples for comparison.\nProgramming languages (See also, Comparison of programming languages (syntax)).\nField and Record delimiters (See also, ASCII, Control character).\nDelimiter collision is a problem that occurs when an author or programmer introduces delimiters into text without actually intending them to be interpreted as boundaries between separate regions.[3][16] In the case of XML, for example, this can occur whenever an author attempts to specify an angle bracket character. In most file types there is both a field delimiter and a record delimiter, both of which are subject to collision. In the case of comma-separated values files, for example, field collision can occur whenever an author attempts to include a comma as part of a field value (e.g., salary = \"$30,000\"), and record delimiter collision would occur whenever a field contained multiple lines. Both record and field delimiter collision occur frequently in text files.\nIn some contexts, a malicious user or attacker may seek to exploit this problem intentionally. Consequently, delimiter collision can be the source of security vulnerabilities and exploits. Malicious users can take advantage of delimiter collision in languages such as SQL and HTML to deploy such well-known attacks as SQL injection and cross-site scripting, respectively.\nBecause delimiter collision is a very common problem, various methods for avoiding it have been invented. Some authors may attempt to avoid the problem by choosing a delimiter character (or sequence of characters) that is not likely to appear in the data stream itself. This ad hoc approach may be suitable, but it necessarily depends on a correct guess of what will appear in the data stream, and offers no security against malicious collisions. Other, more formal conventions are therefore applied as well.\nThe ASCII and Unicode character sets were designed to solve this problem by the provision of non-printing characters that can be used as delimiters. These are the range from ASCII 28 to 31.\nThe use of ASCII 31 Unit separator as a field separator and ASCII 30 Record separator solves the problem of both field and record delimiters that appear in a text data stream.[17]\nOne method for avoiding delimiter collision is to use escape characters. From a language design standpoint, these are adequate, but they have drawbacks:\nEscape sequences are similar to escape characters, except they usually consist of some kind of mnemonic instead of just a single character. One use is in string literals that include a doublequote (\") character. For example in Perl, the code:\nproduces the same output as:\nOne drawback of escape sequences, when used by people, is the need to memorize the codes that represent individual characters (see also: character entity reference, numeric character reference).\nIn contrast to escape sequences and escape characters, dual delimiters provide yet another way to avoid delimiter collision. Some languages, for example, allow the use of either a single quote (') or a double quote (\") to specify a string literal. For example, in Perl:\nproduces the desired output without requiring escapes. This approach, however, only works when the string does not contain both types of quotation marks.\nIn contrast to escape sequences and escape characters, padding delimiters provide yet another way to avoid delimiter collision. Visual Basic, for example, uses double quotes as delimiters. This is similar to escaping the delimiter.\nproduces the desired output without requiring escapes. Like regular escaping it can, however, become confusing when many quotes are used. The code to print the above source code would look more confusing:\nIn contrast to dual delimiters, multiple delimiters are even more flexible for avoiding delimiter collision.[19]\nFor example, in Perl:\nall produce the desired output through use of quote operators, which allow any convenient character to act as a delimiter. Although this method is more flexible, few languages support it. Perl and Ruby are two that do.[20][21]\nA content boundary is a special type of delimiter that is specifically designed to resist delimiter collision. It works by allowing the author to specify a sequence of characters that is guaranteed to always indicate a boundary between parts in a multi-part message, with no other possible interpretation.[22]\nThe delimiter is frequently generated from a random sequence of characters that is statistically improbable to occur in the content. This may be followed by an identifying mark such as a UUID, a timestamp, or some other distinguishing mark. Alternatively, the content may be scanned to guarantee that a delimiter does not appear in the text. This may allow the delimiter to be shorter or simpler, and increase the human readability of the document. (See e.g., MIME, Here documents).\nSome programming and computer languages allow the use of whitespace delimiters or indentation as a means of specifying boundaries between independent regions in text.[23]\nIn specifying a regular expression, alternate delimiters may also be used to simplify the syntax for match and substitution operations in Perl.[24]\nFor example, a simple match operation may be specified in Perl with the following syntax:\nThe syntax is flexible enough to specify match operations with alternate delimiters, making it easy to avoid delimiter collision:\nA Here document allows the inclusion of arbitrary content by describing a special end sequence. Many languages support this including PHP, bash scripts and perl. A here document starts by describing what the end sequence will be and continues until that sequence is seen at the start of a new line.[25]\nHere is an example in perl:\nThis code would print:\nBy using a special end sequence all manner of characters are allowed in the string.\nAlthough principally used as a mechanism for text encoding of binary data, ASCII armoring is a programming and systems administration technique that also helps to avoid delimiter collision in some circumstances.[26][27] This technique is contrasted from the other approaches described above because it is more complicated, and therefore not suitable for small applications and simple data storage formats. The technique employs a special encoding scheme, such as base64, to ensure that delimiter characters do not appear in transmitted data.\nThis technique is used, for example, in Microsoft's ASP.NET web development technology, and is closely associated with the \"VIEWSTATE\" component of that system.[28]\nThe following simplified example demonstrates how this technique works in practice.\nThe first code fragment shows a simple HTML tag in which the VIEWSTATE value contains characters that are incompatible with the delimiters of the HTML tag itself:\nThis first code fragment is not well-formed, and would therefore not work properly in a \"real world\" deployed system.\nIn contrast, the second code fragment shows the same HTML tag, except this time incompatible characters in the VIEWSTATE value are removed through the application of base64 encoding:\nA third code fragment shows the same HTML tag, except this time incompatible characters in the VIEWSTATE value are removed through the application of percent-encoding:\nThis prevents delimiter collision and ensures that incompatible characters will not appear inside the HTML code, regardless of what characters appear in the original (decoded) text.[28]", 
    "dbpedia_url": "http://dbpedia.org/resource/Delimiter", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Delimiter\n"
}