{
    "about": "The demon algorithm is a Monte Carlo method for efficiently sampling members of a microcanonical ensemble with a given energy. An additional degree of freedom, called 'the demon', is added to the system and is able to store and provide energy. If a drawn microscopic state has lower energy than the original state, the excess energy is transferred to the demon. For a sampled state that has higher energy than desired, the demon provides the missing energy if it is available. The demon can not have negative energy and it does not interact with the particles beyond exchanging energy. Note that the additional degree of freedom of the demon does not alter a system with many particles significantly on a macroscopic level.", 
    "name": "Demon Algorithm", 
    "classification": "Computational Physics", 
    "full_text": "The demon algorithm is a Monte Carlo method for efficiently sampling members of a microcanonical ensemble with a given energy. An additional degree of freedom, called 'the demon', is added to the system and is able to store and provide energy. If a drawn microscopic state has lower energy than the original state, the excess energy is transferred to the demon. For a sampled state that has higher energy than desired, the demon provides the missing energy if it is available. The demon can not have negative energy and it does not interact with the particles beyond exchanging energy. Note that the additional degree of freedom of the demon does not alter a system with many particles significantly on a macroscopic level.\n\n\nIn thermodynamical systems, equal macroscopic properties (e. g. temperature) can result from different microscopic properties (e. g. velocities of individual particles). Computer simulations of the full equations of motion for every individual particle to simulate microscopic properties is computationally very expensive. Monte Carlo methods can overcome this problem by sampling microscopic states according to stochastic rules instead of modeling the complete microphysics.\nThe microcanonical ensemble is a collection of microscopic states which have fixed energy, volume and number of particles. In an enclosed system with a certain number of particles, energy is the only macroscopic variable affected by the microphysics. The Monte Carlo simulation of a microcanonical ensemble thus requires sampling different microscopic states with the same energy. When the number of possible microscopic states of thermodynamical systems is very large, it is inefficient to randomly draw a state from all possible states and accept it for the simulation if it has the right energy, since many drawn states would be rejected.\nThe full procedure can be summarized by the following steps:\n1. Perform a random change in the state of a randomly chosen particle (e. g. change velocity or position).\n2. Calculate the change in energy \n\n\n\nΔ\nE\n\n\n{\\displaystyle \\Delta E}\n\n of the thermal system.\n3. Negative \n\n\n\nΔ\nE\n\n\n{\\displaystyle \\Delta E}\n\n, i. e. excess energy, is given to the demon by adding \n\n\n\n\n|\n\nΔ\nE\n\n|\n\n\n\n{\\displaystyle |\\Delta E|}\n\n to the demon. This case (\n\n\n\nΔ\nE\n<\n0\n\n\n{\\displaystyle \\Delta E<0}\n\n) is always accepted.\n4. The demon provides positive \n\n\n\nΔ\nE\n\n\n{\\displaystyle \\Delta E}\n\n to keep the total energy constant only if it has sufficient energy, i. e. \n\n\n\n\nE\n\nd\n\n\n>\nΔ\nE\n\n\n{\\displaystyle E_{d}>\\Delta E}\n\n. In this case the change is accepted, otherwise the randomly chosen change in velocity is rejected and the algorithm is restarted from the original microscopic state.\n5. If the change is accepted, repeat the algorithm for the new configuration.\nSince energy fluctuations per degree of freedom are only of order 1/N, the presence of the demon has little effect on macroscopic properties of systems with high numbers of particles. After many iterations of the algorithm, the interplay of demon and random energy changes equilibrates the system. Assuming that a particular system approaches all possible states over very long times (quasi-ergodicity), the resulting Monte Carlo dynamics realistically sample microscopic states that correspond to the given energy value. This is only true if macroscopic quantities are stable over many Monte Carlo steps, i. e. if the system is at equilibrium.", 
    "dbpedia_url": "http://dbpedia.org/resource/Demon_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Demon_algorithm\n"
}