{
    "about": "Depth-first search (DFS) is an algorithm for traversing or searching tree or graph data structures. One starts at the root (selecting some arbitrary node as the root in the case of a graph) and explores as far as possible along each branch before backtracking.", 
    "classification": "Graph Algorithms", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Depth-first_search\n", 
    "full_text": "Depth-first search (DFS) is an algorithm for traversing or searching tree or graph data structures. One starts at the root (selecting some arbitrary node as the root in the case of a graph) and explores as far as possible along each branch before backtracking.\nA version of depth-first search was investigated in the 19th century by French mathematician Charles Pierre Trémaux[1] as a strategy for solving mazes.[2][3]\n\n\nThe time and space analysis of DFS differs according to its application area. In theoretical computer science, DFS is typically used to traverse an entire graph, and takes time Θ(|V| + |E|),[4] linear in the size of the graph. In these applications it also uses space O(|V|) in the worst case to store the stack of vertices on the current search path as well as the set of already-visited vertices. Thus, in this setting, the time and space bounds are the same as for breadth-first search and the choice of which of these two algorithms to use depends less on their complexity and more on the different properties of the vertex orderings the two algorithms produce.\nFor applications of DFS in relation to specific domains, such as searching for solutions in artificial intelligence or web-crawling, the graph to be traversed is often either too large to visit in its entirety or infinite (DFS may suffer from non-termination). In such cases, search is only performed to a limited depth; due to limited resources, such as memory or disk space, one typically does not use data structures to keep track of the set of all previously visited vertices. When search is performed to a limited depth, the time is still linear in terms of the number of expanded vertices and edges (although this number is not the same as the size of the entire graph because some vertices may be searched more than once and others not at all) but the space complexity of this variant of DFS is only proportional to the depth limit, and as a result, is much smaller than the space needed for searching to the same depth using breadth-first search. For such applications, DFS also lends itself much better to heuristic methods for choosing a likely-looking branch. When an appropriate depth limit is not known a priori, iterative deepening depth-first search applies DFS repeatedly with a sequence of increasing limits. In the artificial intelligence mode of analysis, with a branching factor greater than one, iterative deepening increases the running time by only a constant factor over the case in which the correct depth limit is known due to the geometric growth of the number of nodes per level.\nDFS may also be used to collect a sample of graph nodes. However, incomplete DFS, similarly to incomplete BFS, is biased towards nodes of high degree.\nFor the following graph:\n\na depth-first search starting at A, assuming that the left edges in the shown graph are chosen before right edges, and assuming the search remembers previously visited nodes and will not repeat them (since this is a small graph), will visit the nodes in the following order: A, B, D, F, E, C, G. The edges traversed in this search form a Trémaux tree, a structure with important applications in graph theory.\nPerforming the same search without remembering previously visited nodes results in visiting nodes in the order A, B, D, F, E, A, B, D, F, E, etc. forever, caught in the A, B, D, F, E cycle and never reaching C or G.\nIterative deepening is one technique to avoid this infinite loop and would reach all nodes.\nA convenient description of a depth first search of a graph is in terms of a spanning tree of the vertices reached during the search. Based on this spanning tree, the edges of the original graph can be divided into three classes: forward edges, which point from a node of the tree to one of its descendants, back edges, which point from a node to one of its ancestors, and cross edges, which do neither. Sometimes tree edges, edges which belong to the spanning tree itself, are classified separately from forward edges. If the original graph is undirected then all of its edges are tree edges or back edges.\nAn enumeration of the vertices of a graph is said to be a DFS ordering if it is the possible output of the application of DFS to this graph.\nLet \n\n\n\nG\n=\n(\nV\n,\nE\n)\n\n\n{\\displaystyle G=(V,E)}\n\n be a graph with \n\n\n\nn\n\n\n{\\displaystyle n}\n\n vertices. For \n\n\n\nσ\n=\n(\n\nv\n\n1\n\n\n,\n…\n,\n\nv\n\nm\n\n\n)\n\n\n{\\displaystyle \\sigma =(v_{1},\\dots ,v_{m})}\n\n be a list of distinct elements of \n\n\n\nV\n\n\n{\\displaystyle V}\n\n, for \n\n\n\nv\n∈\nV\n∖\n{\n\nv\n\n1\n\n\n,\n…\n,\n\nv\n\nm\n\n\n}\n\n\n{\\displaystyle v\\in V\\setminus \\{v_{1},\\dots ,v_{m}\\}}\n\n, let \n\n\n\n\nν\n\nσ\n\n\n(\nv\n)\n\n\n{\\displaystyle \\nu _{\\sigma }(v)}\n\n be the greatest \n\n\n\ni\n\n\n{\\displaystyle i}\n\n such that \n\n\n\n\nv\n\ni\n\n\n\n\n{\\displaystyle v_{i}}\n\n is a neighbor of \n\n\n\nv\n\n\n{\\displaystyle v}\n\n, if such a \n\n\n\ni\n\n\n{\\displaystyle i}\n\n exists, and be \n\n\n\n0\n\n\n{\\displaystyle 0}\n\n otherwise.\nLet \n\n\n\nσ\n=\n(\n\nv\n\n1\n\n\n,\n…\n,\n\nv\n\nn\n\n\n)\n\n\n{\\displaystyle \\sigma =(v_{1},\\dots ,v_{n})}\n\n be an enumeration of the vertices of \n\n\n\nV\n\n\n{\\displaystyle V}\n\n. The enumeration \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n is said to be a DFS ordering (with source \n\n\n\n\nv\n\n1\n\n\n\n\n{\\displaystyle v_{1}}\n\n) if, for all \n\n\n\n1\n<\ni\n≤\nn\n\n\n{\\displaystyle 1<i\\leq n}\n\n, \n\n\n\n\nv\n\ni\n\n\n\n\n{\\displaystyle v_{i}}\n\n is the vertex \n\n\n\nw\n∈\nV\n∖\n{\n\nv\n\n1\n\n\n,\n…\n,\n\nv\n\ni\n\n\n−\n1\n}\n\n\n{\\displaystyle w\\in V\\setminus \\{v_{1},\\dots ,v_{i}-1\\}}\n\n such that \n\n\n\n\nν\n\n(\n\nv\n\n1\n\n\n,\n…\n,\n\nv\n\ni\n−\n1\n\n\n)\n\n\n(\nw\n)\n\n\n{\\displaystyle \\nu _{(v_{1},\\dots ,v_{i-1})}(w)}\n\n is maximal. Recall that \n\n\n\nN\n(\nv\n)\n\n\n{\\displaystyle N(v)}\n\n is the set of neighbors of \n\n\n\nv\n\n\n{\\displaystyle v}\n\n. Equivalently, \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n is a DFS ordering if, for all \n\n\n\n1\n≤\ni\n<\nj\n<\nk\n≤\nn\n\n\n{\\displaystyle 1\\leq i<j<k\\leq n}\n\n with \n\n\n\n\nv\n\ni\n\n\n∈\nN\n(\n\nv\n\nk\n\n\n)\n∖\nN\n(\n\nv\n\nj\n\n\n)\n\n\n{\\displaystyle v_{i}\\in N(v_{k})\\setminus N(v_{j})}\n\n, there exists a neighbor \n\n\n\n\nv\n\nm\n\n\n\n\n{\\displaystyle v_{m}}\n\n of \n\n\n\n\nv\n\nj\n\n\n\n\n{\\displaystyle v_{j}}\n\n such that \n\n\n\ni\n<\nm\n<\nj\n\n\n{\\displaystyle i<m<j}\n\n.\nIt is also possible to use the depth-first search to linearly order the vertices of the original graph (or tree). There are three common ways of doing this:\nInput: A graph G and a vertex v of G\nOutput: All vertices reachable from v labeled as discovered\nA recursive implementation of DFS:[5]\nA non-recursive implementation of DFS:[6]\nThese two variations of DFS visit the neighbors of each vertex in the opposite order from each other: the first neighbor of v visited by the recursive variation is the first one in the list of adjacent edges, while in the iterative variation the first visited neighbor is the last one in the list of adjacent edges. The recursive implementation will visit the nodes from the example graph in the following order: A, B, D, F, E, C, G. The non-recursive implementation will visit the nodes as: A, E, F, B, D, C, G.\nThe non-recursive implementation is similar to breadth-first search but differs from it in two ways:\nNote that this non-recursive implementation of DFS may use O(|E|) space in the worst case, for example on a complete graph.\nAlgorithms that use depth-first search as a building block include:\nThe computational complexity of DFS was investigated by John Reif, who showed that a decision version of it (establish whether some vertex u occurs before some vertex v in a DFS order of a rooted graph) is P-complete,[9] meaning that it is \"a nightmare for parallel processing\".[10]:189", 
    "name": "Depth First Search"
}