{
    "about": "Destination dispatch is an optimization technique used for multi-elevator installations, which groups passengers for the same destinations into the same elevators, thereby reducing waiting and travel times when compared to a traditional approach where all passengers wishing to ascend or descend enter the same lift and then request their destination.", 
    "name": "Destination Dispatch", 
    "classification": "Optimization Algorithms And Methods", 
    "full_text": "Destination dispatch is an optimization technique used for multi-elevator installations, which groups passengers for the same destinations into the same elevators, thereby reducing waiting and travel times when compared to a traditional approach where all passengers wishing to ascend or descend enter the same lift and then request their destination.\nUsing destination dispatch, passengers request travel to a particular floor using a keypad, touch screen or proximity card room-key prior in the lobby and are immediately directed to an appropriate elevator shaft.\n\n\nBased on information about the trips that passengers wish to make, the controller will dynamically allocate individuals to elevators to avoid excessive intermediate stops. Overall trip-times can be reduced by 25% with capacity up by 30%.[1]\nControllers can also offer different levels of service to passengers based on information contained in their key-cards. A high-privilege user may be allocated the nearest available elevator and always be guaranteed a direct service to their floor, and may be allocated an elevator with exclusive use; other users may be provided with extended door-opening times.[2]\nThe smooth operation of a destination dispatch system depends upon each passenger indicating their destination intention separately. In most cases, the elevator system has no way of differentiating a group of passengers from a single passenger if the group's destination is only keyed in a single time. This could potentially lead to an elevator stopping to pick up more passengers than the elevator actually has capacity for, creating delays for other users. This situation is handled by two solutions, a load vane sensor on the elevator or a group function button on keypad. The load vane tells the elevator controller that there is a high load in car and doesn't stop at other floors until the load is low enough to pick up more passengers. The group function button asks for how many passengers are going to a floor, and then the system sends the correct number of elevators to that floor if available.[citation needed]\nElevator manufacturers that offer destination dispatch include Otis Elevator, Kone Corporation, ThyssenKrupp, Schindler Group, Fujitec, Mitsubishi and Motion Control Engineering.", 
    "dbpedia_url": "http://dbpedia.org/resource/Destination_dispatch", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Destination_dispatch\n"
}