{
    "about": "Detection theory or signal detection theory is a means to quantify the ability to discern between information-bearing patterns (called stimulus in living organisms, signal in machines) and random patterns that distract from the information (called noise, consisting of background stimuli and random activity of the detection machine and of the nervous system of the operator). In the field of electronics, the separation of such patterns from a disguising background is referred to as signal recovery.[1]", 
    "name": "Detection Theory", 
    "classification": "Signal Processing", 
    "full_text": "Detection theory or signal detection theory is a means to quantify the ability to discern between information-bearing patterns (called stimulus in living organisms, signal in machines) and random patterns that distract from the information (called noise, consisting of background stimuli and random activity of the detection machine and of the nervous system of the operator). In the field of electronics, the separation of such patterns from a disguising background is referred to as signal recovery.[1]\nAccording to the theory, there are a number of determiners of how a detecting system will detect a signal, and where its threshold levels will be. The theory can explain how changing the threshold will affect the ability to discern, often exposing how adapted the system is to the task, purpose or goal at which it is aimed.\nWhen the detecting system is a human being, experience, expectations, physiological state (e.g., fatigue) and other factors can affect the threshold applied. For instance, a sentry in wartime might be likely to detect fainter stimuli than the same sentry in peacetime due to a lower criterion, however they might also be more likely to treat innocuous stimuli as a threat.\nMuch of the early work in detection theory was done by radar researchers.[2] By 1954, the theory was fully developed on the theoretical side as described by Peterson, Birdsall and Fox[3] and the foundation for the psychological theory was made by Wilson P. Tanner, David M. Green, and John A. Swets, also in 1954.[4] Detection theory was used in 1966 by John A. Swets and David M. Green for psychophysics.[5] Green and Swets criticized the traditional methods of psychophysics for their inability to discriminate between the real sensitivity of subjects and their (potential) response biases.[6]\nDetection theory has applications in many fields such as diagnostics of any kind, quality control, telecommunications, and psychology. The concept is similar to the signal to noise ratio used in the sciences and confusion matrices used in artificial intelligence. It is also usable in alarm management, where it is important to separate important events from background noise.\n\n\nSignal detection theory (SDT) is used when psychologists want to measure the way we make decisions under conditions of uncertainty, such as how we would perceive distances in foggy conditions. SDT assumes that the decision maker is not a passive receiver of information, but an active decision-maker who makes difficult perceptual judgments under conditions of uncertainty. In foggy circumstances, we are forced to decide how far away from us an object is, based solely upon visual stimulus which is impaired by the fog. Since the brightness of the object, such as a traffic light, is used by the brain to discriminate the distance of an object, and the fog reduces the brightness of objects, we perceive the object to be much farther away than it actually is (see also decision theory).\nTo apply signal detection theory to a data set where stimuli were either present or absent, and the observer categorized each trial as having the stimulus present or absent, the trials are sorted into one of four categories:\nBased on the proportions of these types of trials, numerical estimates of sensitivity can be obtained with statistics like the sensitivity index d' and A',[7] and response bias can be estimated with statistics like c and β.[7]\nSignal detection theory can also be applied to memory experiments, where items are presented on a study list for later testing. A test list is created by combining these 'old' items with novel, 'new' items that did not appear on the study list. On each test trial the subject will respond 'yes, this was on the study list' or 'no, this was not on the study list'. Items presented on the study list are called Targets, and new items are called Distractors. Saying 'Yes' to a target constitutes a Hit, while saying 'Yes' to a distractor constitutes a False Alarm.\nSignal Detection Theory has wide application, both in humans and other animals. Topics include memory, stimulus characterists of schedules of reinforcement, etc.\nConceptually, sensitivity refers to how hard or easy it is to detect that a target stimulus is present from background events. For example, in a recognition memory paradigm, having longer to study to-be-remembered words makes it easier to recognize previously seen or heard words. In contrast, having to remember 30 words rather than 5 makes the discrimination harder. One of the most commonly used statistics for computing sensitivity is the so-called sensitivity index or d'. There are also non-parametric measures, such as the area under the ROC-curve.[6]\nBias is the extent to which one response is more probable than another. That is, a receiver may be more likely to respond that a stimulus is present or more likely to respond that a stimulus is not present. Bias is independent of sensitivity. For example, if there is a penalty for either false alarms or misses, this may influence bias. If the stimulus is a bomber, then a miss (failing to detect the plane) may increase deaths, so a liberal bias is likely. In contrast, crying wolf (a false alarm) too often may make people less likely to respond, grounds for a conservative bias.\nIn the case of making a decision between two hypotheses, H1, absent, and H2, present, in the event of a particular observation, y, a classical approach is to choose H1 when p(H1|y) > p(H2|y) and H2 in the reverse case.[8] In the event that the two a posteriori probabilities are equal, one might choose to default to a single choice (either always choose H1 or always choose H2), or might randomly select either H1 or H2. The a priori probabilities of H1 and H2 can guide this choice, e.g. by always choosing the hypothesis with the higher a priori probability.\nWhen taking this approach, usually what one knows are the conditional probabilities, p(y|H1) and p(y|H2), and the a priori probabilities \n\n\n\np\n(\nH\n1\n)\n=\n\nπ\n\n1\n\n\n\n\n{\\displaystyle p(H1)=\\pi _{1}}\n\n and \n\n\n\np\n(\nH\n2\n)\n=\n\nπ\n\n2\n\n\n\n\n{\\displaystyle p(H2)=\\pi _{2}}\n\n. In this case,\n\n\n\n\np\n(\nH\n1\n\n|\n\ny\n)\n=\n\n\n\np\n(\ny\n\n|\n\nH\n1\n)\n⋅\n\nπ\n\n1\n\n\n\n\np\n(\ny\n)\n\n\n\n\n\n{\\displaystyle p(H1|y)={\\frac {p(y|H1)\\cdot \\pi _{1}}{p(y)}}}\n\n,\n\n\n\n\np\n(\nH\n2\n\n|\n\ny\n)\n=\n\n\n\np\n(\ny\n\n|\n\nH\n2\n)\n⋅\n\nπ\n\n2\n\n\n\n\np\n(\ny\n)\n\n\n\n\n\n{\\displaystyle p(H2|y)={\\frac {p(y|H2)\\cdot \\pi _{2}}{p(y)}}}\n\n\nwhere p(y) is the total probability of event y,\n\n\n\n\np\n(\ny\n\n|\n\nH\n1\n)\n⋅\n\nπ\n\n1\n\n\n+\np\n(\ny\n\n|\n\nH\n2\n)\n⋅\n\nπ\n\n2\n\n\n\n\n{\\displaystyle p(y|H1)\\cdot \\pi _{1}+p(y|H2)\\cdot \\pi _{2}}\n\n.\nH2 is chosen in case\n\n\n\n\n\n\n\np\n(\ny\n\n|\n\nH\n2\n)\n⋅\n\nπ\n\n2\n\n\n\n\np\n(\ny\n\n|\n\nH\n1\n)\n⋅\n\nπ\n\n1\n\n\n+\np\n(\ny\n\n|\n\nH\n2\n)\n⋅\n\nπ\n\n2\n\n\n\n\n\n≥\n\n\n\np\n(\ny\n\n|\n\nH\n1\n)\n⋅\n\nπ\n\n1\n\n\n\n\np\n(\ny\n\n|\n\nH\n1\n)\n⋅\n\nπ\n\n1\n\n\n+\np\n(\ny\n\n|\n\nH\n2\n)\n⋅\n\nπ\n\n2\n\n\n\n\n\n\n\n{\\displaystyle {\\frac {p(y|H2)\\cdot \\pi _{2}}{p(y|H1)\\cdot \\pi _{1}+p(y|H2)\\cdot \\pi _{2}}}\\geq {\\frac {p(y|H1)\\cdot \\pi _{1}}{p(y|H1)\\cdot \\pi _{1}+p(y|H2)\\cdot \\pi _{2}}}}\n\n\n\n\n\n\n⇒\n\n\n\np\n(\ny\n\n|\n\nH\n2\n)\n\n\np\n(\ny\n\n|\n\nH\n1\n)\n\n\n\n≥\n\n\n\nπ\n\n1\n\n\n\nπ\n\n2\n\n\n\n\n\n\n{\\displaystyle \\Rightarrow {\\frac {p(y|H2)}{p(y|H1)}}\\geq {\\frac {\\pi _{1}}{\\pi _{2}}}}\n\n\nand H1 otherwise.\nOften, the ratio \n\n\n\n\n\n\nπ\n\n1\n\n\n\nπ\n\n2\n\n\n\n\n\n\n{\\displaystyle {\\frac {\\pi _{1}}{\\pi _{2}}}}\n\n is called \n\n\n\n\nτ\n\nM\nA\nP\n\n\n\n\n{\\displaystyle \\tau _{MAP}}\n\n and \n\n\n\n\n\n\np\n(\ny\n\n|\n\nH\n2\n)\n\n\np\n(\ny\n\n|\n\nH\n1\n)\n\n\n\n\n\n{\\displaystyle {\\frac {p(y|H2)}{p(y|H1)}}}\n\n is called \n\n\n\nL\n(\ny\n)\n\n\n{\\displaystyle L(y)}\n\n, the likelihood ratio.\nUsing this terminology, H2 is chosen in case \n\n\n\nL\n(\ny\n)\n≥\n\nτ\n\nM\nA\nP\n\n\n\n\n{\\displaystyle L(y)\\geq \\tau _{MAP}}\n\n. This is called MAP testing, where MAP stands for \"maximum a posteriori\").\nTaking this approach minimizes the expected number of errors one will make.\nIn some cases, it is far more important to respond appropriately to H1 than it is to respond appropriately to H2. For example, if an alarm goes off, indicating H1 (an incoming bomber is carrying a nuclear weapon), it is much more important to shoot down the bomber if H1 = TRUE, than it is to send a fighter squadron to inspect a false alarm (i.e., H1 = FALSE, H2 = TRUE) (assuming a large supply of fighter squadrons). The Bayes criterion is an approach suitable for such cases.[8]\nHere a utility is associated with each of four situations:\nAs is shown below, what is important are the differences, \n\n\n\n\nU\n\n11\n\n\n−\n\nU\n\n21\n\n\n\n\n{\\displaystyle U_{11}-U_{21}}\n\n and \n\n\n\n\nU\n\n22\n\n\n−\n\nU\n\n12\n\n\n\n\n{\\displaystyle U_{22}-U_{12}}\n\n.\nSimilarly, there are four probabilities, \n\n\n\n\nP\n\n11\n\n\n\n\n{\\displaystyle P_{11}}\n\n, \n\n\n\n\nP\n\n12\n\n\n\n\n{\\displaystyle P_{12}}\n\n, etc., for each of the cases (which are dependent on one's decision strategy).\nThe Bayes criterion approach is to maximize the expected utility:\n\n\n\n\nU\n=\n\nP\n\n11\n\n\n⋅\n\nU\n\n11\n\n\n+\n\nP\n\n21\n\n\n⋅\n\nU\n\n21\n\n\n+\n\nP\n\n12\n\n\n⋅\n\nU\n\n12\n\n\n+\n\nP\n\n22\n\n\n⋅\n\nU\n\n22\n\n\n\n\n{\\displaystyle U=P_{11}\\cdot U_{11}+P_{21}\\cdot U_{21}+P_{12}\\cdot U_{12}+P_{22}\\cdot U_{22}}\n\n\n\n\n\n\nU\n=\n\nP\n\n11\n\n\n⋅\n\nU\n\n11\n\n\n+\n(\n1\n−\n\nP\n\n11\n\n\n)\n⋅\n\nU\n\n21\n\n\n+\n\nP\n\n12\n\n\n⋅\n\nU\n\n12\n\n\n+\n(\n1\n−\n\nP\n\n12\n\n\n)\n⋅\n\nU\n\n22\n\n\n\n\n{\\displaystyle U=P_{11}\\cdot U_{11}+(1-P_{11})\\cdot U_{21}+P_{12}\\cdot U_{12}+(1-P_{12})\\cdot U_{22}}\n\n\n\n\n\n\nU\n=\n\nU\n\n21\n\n\n+\n\nU\n\n22\n\n\n+\n\nP\n\n11\n\n\n⋅\n(\n\nU\n\n11\n\n\n−\n\nU\n\n21\n\n\n)\n−\n\nP\n\n12\n\n\n⋅\n(\n\nU\n\n22\n\n\n−\n\nU\n\n12\n\n\n)\n\n\n{\\displaystyle U=U_{21}+U_{22}+P_{11}\\cdot (U_{11}-U_{21})-P_{12}\\cdot (U_{22}-U_{12})}\n\n\nEffectively, one may maximize the sum,\n\n\n\n\n\nU\n′\n\n=\n\nP\n\n11\n\n\n⋅\n(\n\nU\n\n11\n\n\n−\n\nU\n\n21\n\n\n)\n−\n\nP\n\n12\n\n\n⋅\n(\n\nU\n\n22\n\n\n−\n\nU\n\n12\n\n\n)\n\n\n{\\displaystyle U'=P_{11}\\cdot (U_{11}-U_{21})-P_{12}\\cdot (U_{22}-U_{12})}\n\n,\nand make the following substitutions:\n\n\n\n\n\nP\n\n11\n\n\n=\n\nπ\n\n1\n\n\n⋅\n\n∫\n\n\nR\n\n1\n\n\n\n\np\n(\ny\n\n|\n\nH\n1\n)\n\nd\ny\n\n\n{\\displaystyle P_{11}=\\pi _{1}\\cdot \\int _{R_{1}}p(y|H1)\\,dy}\n\n\n\n\n\n\n\nP\n\n12\n\n\n=\n\nπ\n\n2\n\n\n⋅\n\n∫\n\n\nR\n\n1\n\n\n\n\np\n(\ny\n\n|\n\nH\n2\n)\n\nd\ny\n\n\n{\\displaystyle P_{12}=\\pi _{2}\\cdot \\int _{R_{1}}p(y|H2)\\,dy}\n\n\nwhere \n\n\n\n\nπ\n\n1\n\n\n\n\n{\\displaystyle \\pi _{1}}\n\n and \n\n\n\n\nπ\n\n2\n\n\n\n\n{\\displaystyle \\pi _{2}}\n\n are the a priori probabilities, \n\n\n\nP\n(\nH\n1\n)\n\n\n{\\displaystyle P(H1)}\n\n and \n\n\n\nP\n(\nH\n2\n)\n\n\n{\\displaystyle P(H2)}\n\n, and \n\n\n\n\nR\n\n1\n\n\n\n\n{\\displaystyle R_{1}}\n\n is the region of observation events, y, that are responded to as though H1 is true.\n\n\n\n\n⇒\n\nU\n′\n\n=\n\n∫\n\n\nR\n\n1\n\n\n\n\n\n{\n\nπ\n\n1\n\n\n⋅\n(\n\nU\n\n11\n\n\n−\n\nU\n\n21\n\n\n)\n⋅\np\n(\ny\n\n|\n\nH\n1\n)\n−\n\nπ\n\n2\n\n\n⋅\n(\n\nU\n\n22\n\n\n−\n\nU\n\n12\n\n\n)\n⋅\np\n(\ny\n\n|\n\nH\n2\n)\n}\n\n\nd\ny\n\n\n{\\displaystyle \\Rightarrow U'=\\int _{R_{1}}\\left\\{\\pi _{1}\\cdot (U_{11}-U_{21})\\cdot p(y|H1)-\\pi _{2}\\cdot (U_{22}-U_{12})\\cdot p(y|H2)\\right\\}\\,dy}\n\n\n\n\n\n\n\nU\n′\n\n\n\n{\\displaystyle U'}\n\n and thus \n\n\n\nU\n\n\n{\\displaystyle U}\n\n are maximized by extending \n\n\n\n\nR\n\n1\n\n\n\n\n{\\displaystyle R_{1}}\n\n over the region where\n\n\n\n\n\nπ\n\n1\n\n\n⋅\n(\n\nU\n\n11\n\n\n−\n\nU\n\n21\n\n\n)\n⋅\np\n(\ny\n\n|\n\nH\n1\n)\n−\n\nπ\n\n2\n\n\n⋅\n(\n\nU\n\n22\n\n\n−\n\nU\n\n12\n\n\n)\n⋅\np\n(\ny\n\n|\n\nH\n2\n)\n>\n0\n\n\n{\\displaystyle \\pi _{1}\\cdot (U_{11}-U_{21})\\cdot p(y|H1)-\\pi _{2}\\cdot (U_{22}-U_{12})\\cdot p(y|H2)>0}\n\n\nThis is accomplished by deciding H2 in case\n\n\n\n\n\nπ\n\n2\n\n\n⋅\n(\n\nU\n\n22\n\n\n−\n\nU\n\n12\n\n\n)\n⋅\np\n(\ny\n\n|\n\nH\n2\n)\n≥\n\nπ\n\n1\n\n\n⋅\n(\n\nU\n\n11\n\n\n−\n\nU\n\n21\n\n\n)\n⋅\np\n(\ny\n\n|\n\nH\n1\n)\n\n\n{\\displaystyle \\pi _{2}\\cdot (U_{22}-U_{12})\\cdot p(y|H2)\\geq \\pi _{1}\\cdot (U_{11}-U_{21})\\cdot p(y|H1)}\n\n\n\n\n\n\n⇒\nL\n(\ny\n)\n≡\n\n\n\np\n(\ny\n\n|\n\nH\n2\n)\n\n\np\n(\ny\n\n|\n\nH\n1\n)\n\n\n\n≥\n\n\n\n\nπ\n\n1\n\n\n⋅\n(\n\nU\n\n11\n\n\n−\n\nU\n\n21\n\n\n)\n\n\n\nπ\n\n2\n\n\n⋅\n(\n\nU\n\n22\n\n\n−\n\nU\n\n12\n\n\n)\n\n\n\n≡\n\nτ\n\nB\n\n\n\n\n{\\displaystyle \\Rightarrow L(y)\\equiv {\\frac {p(y|H2)}{p(y|H1)}}\\geq {\\frac {\\pi _{1}\\cdot (U_{11}-U_{21})}{\\pi _{2}\\cdot (U_{22}-U_{12})}}\\equiv \\tau _{B}}\n\n\nand H1 otherwise, where L(y) is the so-defined likelihood ratio.", 
    "dbpedia_url": "http://dbpedia.org/resource/Detection_theory", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Detection_theory\n"
}