{
    "about": "In applied mathematics, a DFT matrix is an expression of a discrete Fourier transform (DFT) as a transformation matrix, which can be applied to a signal through matrix multiplication.", 
    "name": "Dft Matrix", 
    "classification": "Digital Signal Processing", 
    "full_text": "In applied mathematics, a DFT matrix is an expression of a discrete Fourier transform (DFT) as a transformation matrix, which can be applied to a signal through matrix multiplication.\n\n\nAn N-point DFT is expressed as the multiplication \n\n\n\nX\n=\nW\nx\n\n\n{\\displaystyle X=Wx}\n\n, where \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is the original input signal, \n\n\n\nW\n\n\n{\\displaystyle W}\n\n is the N-by-N square DFT matrix, and \n\n\n\nX\n\n\n{\\displaystyle X}\n\n is the DFT of the signal.\nThe transformation matrix \n\n\n\nW\n\n\n{\\displaystyle W}\n\n can be defined as \n\n\n\nW\n=\n\n\n(\n\n\n\nω\n\nj\nk\n\n\n\nN\n\n\n\n)\n\n\nj\n,\nk\n=\n0\n,\n…\n,\nN\n−\n1\n\n\n\n\n{\\displaystyle W=\\left({\\frac {\\omega ^{jk}}{\\sqrt {N}}}\\right)_{j,k=0,\\ldots ,N-1}}\n\n, or equivalently:\nwhere \n\n\n\nω\n=\n\ne\n\n−\n2\nπ\ni\n\n/\n\nN\n\n\n\n\n{\\displaystyle \\omega =e^{-2\\pi i/N}}\n\n is a primitive Nth root of unity in which \n\n\n\ni\n=\n\n\n−\n1\n\n\n\n\n{\\displaystyle i={\\sqrt {-1}}}\n\n. This is the Vandermonde matrix for the roots of unity, up to the normalization factor. Note that the normalization factor in front of the sum \n\n\n\n(\n1\n\n/\n\n\n\nN\n\n\n)\n\n\n{\\displaystyle (1/{\\sqrt {N}})}\n\n and the sign of the exponent in ω are merely conventions, and differ in some treatments. All of the following discussion applies regardless of the convention, with at most minor adjustments. The only important thing is that the forward and inverse transforms have opposite-sign exponents, and that the product of their normalization factors be 1/N. However, the \n\n\n\n1\n\n/\n\n\n\nN\n\n\n\n\n{\\displaystyle 1/{\\sqrt {N}}}\n\n choice here makes the resulting DFT matrix unitary, which is convenient in many circumstances.\nFast Fourier transform algorithms utilize the symmetries of the matrix to reduce the time of multiplying a vector by this matrix, from the usual \n\n\n\nO\n(\n\nN\n\n2\n\n\n)\n\n\n{\\displaystyle O(N^{2})}\n\n. Similar techniques can be applied for multiplications by matrices such as Hadamard matrix and the Walsh matrix.\nThe two-point DFT is a simple case, in which the first entry is the DC (sum) and the second entry is the AC (difference).\nThe first row performs the sum, and the second row performs the difference.\nThe factor of \n\n\n\n1\n\n/\n\n\n\n2\n\n\n\n\n{\\displaystyle 1/{\\sqrt {2}}}\n\n is to make the transform unitary (see below).\nThe four-point DFT matrix is as follows:\nwhere \n\n\n\nω\n=\n\ne\n\n−\n\n\n\nπ\ni\n\n2\n\n\n\n\n=\n−\ni\n\n\n{\\displaystyle \\omega =e^{-{\\frac {\\pi i}{2}}}=-i}\n\n.\nThe first non-trivial integer power of two case is for eight points:\nwhere\n(Note that \n\n\n\n\nω\n\n8\n+\nn\n\n\n=\n\nω\n\nn\n\n\n\n\n{\\displaystyle \\omega ^{8+n}=\\omega ^{n}}\n\n.)\nThe following image depicts the DFT as a matrix multiplication, with elements of the matrix depicted by samples of complex exponentials:\n\nThe real part (cosine wave) is denoted by a solid line, and the imaginary part (sine wave) by a dashed line.\nThe top row is all ones (scaled by \n\n\n\n1\n\n/\n\n\n\n8\n\n\n\n\n{\\displaystyle 1/{\\sqrt {8}}}\n\n for unitarity), so it \"measures\" the DC component in the input signal. The next row is eight samples of negative one cycle of a complex exponential, i.e., a signal with a fractional frequency of −1/8, so it \"measures\" how much \"strength\" there is at fractional frequency +1/8 in the signal. Recall that a matched filter compares the signal with a time reversed version of whatever we're looking for, so when we're looking for fracfreq. 1/8 we compare with fracfreq. −1/8 so that is why this row is a negative frequency. The next row is negative two cycles of a complex exponential, sampled in eight places, so it has a fractional frequency of −1/4, and thus \"measures\" the extent to which the signal has a fractional frequency of +1/4.\nThe following summarizes how the 8-point DFT works, row by row, in terms of fractional frequency:\nEquivalently the last row can be said to have a fractional frequency of +1/8 and thus measure how much of the signal has a fractional frequency of −1/8. In this way, it could be said that the top rows of the matrix \"measure\" positive frequency content in the signal and the bottom rows measure negative frequency component in the signal.\nThe DFT is (or can be, through appropriate selection of scaling) a unitary transform, i.e., one that preserves energy. The appropriate choice of scaling to achieve unitarity is \n\n\n\n1\n\n/\n\n\n\nN\n\n\n\n\n{\\displaystyle 1/{\\sqrt {N}}}\n\n, so that the energy in the physical domain will be the same as the energy in the Fourier domain, i.e., to satisfy Parseval's theorem. (Other, non-unitary, scalings, are also commonly used for computational convenience; e.g., the convolution theorem takes on a slightly simpler form with the scaling shown in the discrete Fourier transform article.)\nFor other properties of the DFT matrix, including its eigenvalues, connection to convolutions, applications, and so on, see the discrete Fourier transform article.\nIf we make a very large matrix with complex exponentials in the rows (i.e., cosine real parts and sine imaginary parts), and increase the resolution without bound, we approach the kernel of the Fredholm integral equation of the 2nd kind, namely the Fourier operator that defines the continuous Fourier transform. A rectangular portion of this continuous Fourier operator can be displayed as an image, analogous to the DFT matrix, as shown at right, where greyscale pixel value denotes numerical quantity.", 
    "dbpedia_url": "http://dbpedia.org/resource/DFT_matrix", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/DFT_matrix\n"
}