{
    "about": "The difference-map algorithm is a search algorithm for general constraint satisfaction problems. It is a meta-algorithm in the sense that it is built from more basic algorithms that perform projections onto constraint sets. From a mathematical perspective, the difference-map algorithm is a dynamical system based on a mapping of Euclidean space. Solutions are encoded as fixed points of the mapping.", 
    "classification": "Search Algorithms", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Difference-map_algorithm\n", 
    "full_text": "The difference-map algorithm is a search algorithm for general constraint satisfaction problems. It is a meta-algorithm in the sense that it is built from more basic algorithms that perform projections onto constraint sets. From a mathematical perspective, the difference-map algorithm is a dynamical system based on a mapping of Euclidean space. Solutions are encoded as fixed points of the mapping.\nAlthough originally conceived as a general method for solving the phase problem, the difference-map algorithm has been used for the boolean satisfiability problem, protein structure prediction, Ramsey numbers, diophantine equations, and Sudoku,[1] as well as sphere- and disk-packing problems.[2] Since these applications include NP-complete problems, the scope of the difference map is that of an incomplete algorithm. Whereas incomplete algorithms can efficiently verify solutions (once a candidate is found), they cannot prove that a solution does not exist.\nThe difference-map algorithm is a generalization of two iterative methods: Fienup's Hybrid input output (HIO) algorithm for phase retrieval [3] and the Douglas-Rachford algorithm[4] for convex optimization. Iterative methods, in general, have a long history in phase retrieval and convex optimization. The use of this style of algorithm for hard, non-convex problems is a more recent development.\n\n\nThe problem to be solved must first be formulated as a set intersection problem in Euclidean space: find an \n\n\n\nx\n\n\n{\\displaystyle x}\n\n in the intersection of sets \n\n\n\nA\n\n\n{\\displaystyle A}\n\n and \n\n\n\nB\n\n\n{\\displaystyle B}\n\n. Another prerequisite is an implementation of the projections \n\n\n\n\nP\n\nA\n\n\n\n\n{\\displaystyle P_{A}}\n\n and \n\n\n\n\nP\n\nB\n\n\n\n\n{\\displaystyle P_{B}}\n\n that, given an arbitrary input point \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, return a point in the constraint set \n\n\n\nA\n\n\n{\\displaystyle A}\n\n or \n\n\n\nB\n\n\n{\\displaystyle B}\n\n that is nearest to \n\n\n\nx\n\n\n{\\displaystyle x}\n\n. One iteration of the algorithm is given by the mapping:\nThe real parameter \n\n\n\nβ\n\n\n{\\displaystyle \\beta }\n\n should not be equal to 0 but can have either sign; optimal values depend on the application and are determined through experimentation. As a first guess, the choice \n\n\n\nβ\n=\n1\n\n\n{\\displaystyle \\beta =1}\n\n (or \n\n\n\nβ\n=\n−\n1\n\n\n{\\displaystyle \\beta =-1}\n\n) is recommended because it reduces the number of projection computations per iteration:\nA point \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is a fixed point of the map \n\n\n\nx\n↦\nD\n(\nx\n)\n\n\n{\\displaystyle x\\mapsto D(x)}\n\n precisely when \n\n\n\n\nP\n\nA\n\n\n\n(\n\nf\n\nB\n\n\n(\nx\n)\n)\n\n=\n\nP\n\nB\n\n\n\n(\n\nf\n\nA\n\n\n(\nx\n)\n)\n\n\n\n{\\displaystyle P_{A}\\left(f_{B}(x)\\right)=P_{B}\\left(f_{A}(x)\\right)}\n\n. Since the left-hand side is an element of \n\n\n\nA\n\n\n{\\displaystyle A}\n\n and the RHS is an element of \n\n\n\nB\n\n\n{\\displaystyle B}\n\n, the equality implies that we have found a common element to the two constraint sets. Note that the fixed point \n\n\n\nx\n\n\n{\\displaystyle x}\n\n itself need not belong to either \n\n\n\nA\n\n\n{\\displaystyle A}\n\n or \n\n\n\nB\n\n\n{\\displaystyle B}\n\n. The set of fixed points will typically have much higher dimension than the set of solutions.\nThe progress of the algorithm can be monitored by inspecting the norm of the difference of the two projections:\nWhen this vanishes, a point common to both constraint sets has been found and the algorithm can be terminated.\nIncomplete algorithms, such as stochastic local search, are widely used for finding satisfying truth assignments to boolean formulas. As an example of solving an instance of 2-SAT with the difference-map algorithm, consider the following formula (~ indicates NOT):\nTo each of the eight literals in this formula we assign one real variable in an eight-dimensional Euclidean space. The structure of the 2-SAT formula can be recovered when these variables are arranged in a table:\nRows are the clauses in the 2-SAT formula and literals corresponding to the same boolean variable are arranged in columns, with negation indicated by parentheses. For example, the real variables x11, x21 and x41 correspond to the same boolean variable (q1) or its negation, and are called replicas. It is convenient to associate the values 1 and -1 with TRUE and FALSE rather than the traditional 1 and 0. With this convention, the compatibility between the replicas takes the form of the following linear equations:\nThe linear subspace where these equations are satisfied is one of the constraint spaces, say A, used by the difference map. To project to this constraint we replace each replica by the signed replica average, or its negative:\nThe second difference-map constraint applies to the rows of the table, the clauses. In a satisfying assignment, the two variables in each row must be assigned the values (1, 1), (1, -1), or (-1, 1). The corresponding constraint set, B, is thus a set of 34 = 81 points. In projecting to this constraint the following operation is applied to each row. First, the two real values are rounded to 1 or -1; then, if the outcome is (-1, -1), the larger of the two original values is replaced by 1. Examples:\nIt is a straightforward exercise to check that both of the projection operations described minimize the Euclidean distance between input and output values. Moreover, if the algorithm succeeds in finding a point x that lies in both constraint sets, then we know that (i) the clauses associated with x are all TRUE, and (ii) the assignments to the replicas are consistent with a truth assignment to the original boolean variables.\nTo run the algorithm one first generates an initial point x0, say\nUsing β = 1, the next step is to compute PB(x0) :\nThis is followed by 2PB(x0) - x0,\nand then projected onto the other constraint, PA(2PB(x0) - x0) :\nIncrementing x0 by the difference of the two projections gives the first iteration of the difference map, D(x0) = x1 :\nHere is the second iteration, D(x1) = x2 :\nThis is a fixed point: D(x2) = x2. The iterate is unchanged because the two projections agree. From PB(x2),\nwe can read off the satisfying truth assignment: q1 = TRUE, q2 = FALSE, q3 = TRUE.\nIn the simple 2-SAT example above, the norm of the difference-map increment Δ decreased monotonically to zero in three iterations. This contrasts the behavior of Δ when the difference map is given a hard instance of 3-SAT, where it fluctuates strongly prior to the discovery of the fixed point. As a dynamical system the difference map is believed to be chaotic, and that the space being searched is a strange attractor.\nIn phase retrieval a signal or image is reconstructed from the modulus (absolute value, magnitude) of its discrete Fourier transform. For example, the source of the modulus data may be the Fraunhofer diffraction pattern formed when an object is illuminated with coherent light.\nThe projection to the Fourier modulus constraint, say PA, is accomplished by first computing the discrete Fourier transform of the signal or image, rescaling the moduli to agree with the data, and then inverse transforming the result. This is a projection, in the sense that the Euclidean distance to the constraint is minimized, because (i) the discrete Fourier transform, as a unitary transformation, preserves distance, and (ii) rescaling the modulus (without modifying the phase) is the smallest change that realizes the modulus constraint.\nTo recover the unknown phases of the Fourier transform the difference map relies on the projection to another constraint, PB. This may take several forms, as the object being reconstructed may be known to be positive, have a bounded support, etc. In the reconstruction of the surface image, for example, the effect of the projection PB was to nullify all values outside a rectangular support, and also to nullify all negative values within the support.", 
    "name": "Difference Map Algorithm"
}