{
    "about": "Diffusion maps is a dimensionality reduction or feature extraction algorithm introduced by R. R. Coifman and S. Lafon.[1][2][3][4] It computes a family of embeddings of a data set into Euclidean space (often low-dimensional) whose coordinates can be computed from the eigenvectors and eigenvalues of a diffusion operator on the data. The Euclidean distance between points in the embedded space is equal to the \"diffusion distance\" between probability distributions centered at those points. Different from linear dimensionality reduction methods such as principal component analysis (PCA) and multi-dimensional scaling (MDS), diffusion maps is part of the family of nonlinear dimensionality reduction methods which focus on discovering the underlying manifold that the data has been sampled from. By integrating local similarities at different scales, diffusion maps gives a global description of the data-set. Compared with other methods, the diffusion maps algorithm is robust to noise perturbation and is computationally inexpensive.", 
    "name": "Diffusion Map", 
    "classification": "Machine Learning Algorithms", 
    "full_text": "Diffusion maps is a dimensionality reduction or feature extraction algorithm introduced by R. R. Coifman and S. Lafon.[1][2][3][4] It computes a family of embeddings of a data set into Euclidean space (often low-dimensional) whose coordinates can be computed from the eigenvectors and eigenvalues of a diffusion operator on the data. The Euclidean distance between points in the embedded space is equal to the \"diffusion distance\" between probability distributions centered at those points. Different from linear dimensionality reduction methods such as principal component analysis (PCA) and multi-dimensional scaling (MDS), diffusion maps is part of the family of nonlinear dimensionality reduction methods which focus on discovering the underlying manifold that the data has been sampled from. By integrating local similarities at different scales, diffusion maps gives a global description of the data-set. Compared with other methods, the diffusion maps algorithm is robust to noise perturbation and is computationally inexpensive.\n\n\nFollowing [3] and,[5] diffusion maps can be defined in four steps.\nDiffusion maps exploit the relationship between heat diffusion and random walk Markov chain. The basic observation is that if we take a random walk on the data, walking to a nearby data-point is more likely than walking to another that is far away. Let \n\n\n\n(\nX\n,\n\n\nA\n\n\n,\nμ\n)\n\n\n{\\displaystyle (X,{\\mathcal {A}},\\mu )}\n\n be a measure space, where \n\n\n\nX\n\n\n{\\displaystyle X}\n\n is the data set and \n\n\n\nμ\n\n\n{\\displaystyle \\mu }\n\n represents the distribution on the points on \n\n\n\nX\n\n\n{\\displaystyle X}\n\n.\nBased on this, the connectivity \n\n\n\nk\n\n\n{\\displaystyle k}\n\n between two data points, \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\ny\n\n\n{\\displaystyle y}\n\n, can be defined as the probability of walking from \n\n\n\nx\n\n\n{\\displaystyle x}\n\n to \n\n\n\ny\n\n\n{\\displaystyle y}\n\n in one step of the random walk. Usually, this probability is specified in terms of kernel function on the two points: \n\n\n\nk\n:\nX\n×\nX\n→\n\nR\n\n\n\n{\\displaystyle k:X\\times X\\rightarrow \\mathbb {R} }\n\n. For example, the popular Gaussian kernel:\nMore generally, the kernel function has the following properties\n(\n\n\n\nk\n\n\n{\\displaystyle k}\n\n is symmetric)\n(\n\n\n\nk\n\n\n{\\displaystyle k}\n\n is positivity preserving).\nThe kernel constitutes the prior definition of the local geometry of data-set. Since a given kernel will capture a specific feature of the data set, its choice should be guided by the application that one has in mind. This is a major difference with methods such as principal component analysis, where correlations between all data points are taken into account at once.\nGiven \n\n\n\n(\nX\n,\nk\n)\n\n\n{\\displaystyle (X,k)}\n\n, we can then construct a reversible Markov chain on \n\n\n\nX\n\n\n{\\displaystyle X}\n\n (a process known as the normalized graph Laplacian construction):\nand define:\nAlthough the new normalized kernel does not inherit the symmetric property, it does inherit the positivity-preserving property and gains a conservation property:\nFrom \n\n\n\np\n(\nx\n,\ny\n)\n\n\n{\\displaystyle p(x,y)}\n\n we can construct a transition matrix of a Markov chain (\n\n\n\nM\n\n\n{\\displaystyle M}\n\n) on \n\n\n\nX\n\n\n{\\displaystyle X}\n\n. In other words, \n\n\n\np\n(\nx\n,\ny\n)\n\n\n{\\displaystyle p(x,y)}\n\n represents the one-step transition probability from \n\n\n\nx\n\n\n{\\displaystyle x}\n\n to \n\n\n\ny\n\n\n{\\displaystyle y}\n\n, and \n\n\n\n\nM\n\nt\n\n\n\n\n{\\displaystyle M^{t}}\n\n gives the t-step transition matrix.\nWe define the diffusion matrix \n\n\n\nL\n\n\n{\\displaystyle L}\n\n (it is also a version of graph Laplacian matrix)\nWe then define the new kernel\nor equivalently,\nwhere D is a diagonal matrix and \n\n\n\n\nD\n\ni\n,\ni\n\n\n=\n\n∑\n\nj\n\n\n\nL\n\ni\n,\nj\n\n\n.\n\n\n{\\displaystyle D_{i,i}=\\sum _{j}L_{i,j}.}\n\n\nWe apply the graph Laplacian normalization to this new kernel:\nwhere \n\n\n\n\nD\n\n(\nα\n)\n\n\n\n\n{\\displaystyle D^{(\\alpha )}}\n\n is a diagonal matrix and \n\n\n\n\n\nD\n\n\ni\n,\ni\n\n\n(\nα\n)\n\n\n=\n\n∑\n\nj\n\n\n\nL\n\ni\n,\nj\n\n\n(\nα\n)\n\n\n.\n\n\n{\\displaystyle {D}_{i,i}^{(\\alpha )}=\\sum _{j}L_{i,j}^{(\\alpha )}.}\n\n\nOne of the main ideas of diffusion framework is that running the chain forward in time (taking larger and larger powers of \n\n\n\nM\n\n\n{\\displaystyle M}\n\n) reveals the geometric structure of \n\n\n\nX\n\n\n{\\displaystyle X}\n\n at larger and larger scales (the diffusion process). Specifically, the notion of a cluster in the data set is quantified as a region in which the probability of escaping this region is low (within a certain time t). Therefore, t not only serves as a time parameter, but also has the dual role of scale parameter.\nThe eigendecomposition of the matrix \n\n\n\n\nM\n\nt\n\n\n\n\n{\\displaystyle M^{t}}\n\n yields\nwhere \n\n\n\n{\n\nλ\n\nl\n\n\n}\n\n\n{\\displaystyle \\{\\lambda _{l}\\}}\n\n is the sequence of eigenvalues of \n\n\n\n\nM\n\nt\n\n\n\n\n{\\displaystyle M^{t}}\n\n and \n\n\n\n{\n\nψ\n\nl\n\n\n}\n\n\n{\\displaystyle \\{\\psi _{l}\\}}\n\n and \n\n\n\n{\n\nϕ\n\nl\n\n\n}\n\n\n{\\displaystyle \\{\\phi _{l}\\}}\n\n are the biorthogonal right and left eigenvectors respectively. Due to the spectrum decay of the eigenvalues, only a few terms are necessary to achieve a given relative accuracy in this sum.\nThe reason to introduce the normalization step involving \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n is to tune the influence of the data point density on the infinitesimal transition of the diffusion. In some applications, the sampling of the data is generally not related to the geometry of the manifold we are interested in describing. In this case, we can set \n\n\n\nα\n=\n1\n\n\n{\\displaystyle \\alpha =1}\n\n and the diffusion operator approximates the Laplace–Beltrami operator. We then recover the Riemannian geometry of the data set regardless of the distribution of the points. To describe the long-term behavior of the point distribution of a system of stochastic differential equations, we can use \n\n\n\nα\n=\n0.5\n\n\n{\\displaystyle \\alpha =0.5}\n\n and the resulting Markov chain approximates the Fokker-Planck diffusion. With \n\n\n\nα\n=\n0\n\n\n{\\displaystyle \\alpha =0}\n\n, it reduces to the classical graph Laplacian normalization.\nThe diffusion distance at time \n\n\n\nt\n\n\n{\\displaystyle t}\n\n between two points can be measured as the similarity of two points in the observation space with the connectivity between them. It is given by\nwhere \n\n\n\n\nϕ\n\n0\n\n\n(\ny\n)\n\n\n{\\displaystyle \\phi _{0}(y)}\n\n is the stationary distribution of the Markov chain, given by the first left eigenvector of \n\n\n\nM\n\n\n{\\displaystyle M}\n\n. Explicitly:\nIntuitively, \n\n\n\n\nD\n\nt\n\n\n(\n\nx\n\ni\n\n\n,\n\nx\n\nj\n\n\n)\n\n\n{\\displaystyle D_{t}(x_{i},x_{j})}\n\n is small if there is a large number of short paths connecting \n\n\n\n\nx\n\ni\n\n\n\n\n{\\displaystyle x_{i}}\n\n and \n\n\n\n\nx\n\nj\n\n\n\n\n{\\displaystyle x_{j}}\n\n. There are several interesting features associated with the diffusion distance, based on our previous discussion that \n\n\n\nt\n\n\n{\\displaystyle t}\n\n also serves as a scale parameter:\nThe diffusion distance can be calculated using the eigenvectors by\nSo the eigenvectors can be used as a new set of coordinates for the data. The diffusion map is defined as:\nBecause of the spectrum decay, it is sufficient to use only the first k eigenvectors and eigenvalues. Thus we get the diffusion map from the original data to a k-dimensional space which is embedded in the original space.\nIn,[6] it is proved that\nso the Euclidean distance in the diffusion coordinates approximates the diffusion distance.\nThe basic algorithm framework of diffusion map is as:\nStep 1. Given the similarity matrix L\nStep 2. Normalize the matrix according to parameter \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n: \n\n\n\n\nL\n\n(\nα\n)\n\n\n=\n\nD\n\n−\nα\n\n\nL\n\nD\n\n−\nα\n\n\n\n\n{\\displaystyle L^{(\\alpha )}=D^{-\\alpha }LD^{-\\alpha }}\n\n\nStep 3. Form the normalized matrix \n\n\n\nM\n=\n(\n\n\nD\n\n\n(\nα\n)\n\n\n\n)\n\n−\n1\n\n\n\nL\n\n(\nα\n)\n\n\n\n\n{\\displaystyle M=({D}^{(\\alpha )})^{-1}L^{(\\alpha )}}\n\n\nStep 4. Compute the k largest eigenvalues of \n\n\n\n\nM\n\nt\n\n\n\n\n{\\displaystyle M^{t}}\n\n and the corresponding eigenvectors\nStep 5. Use diffusion map to get the embedding \n\n\n\n\nΨ\n\nt\n\n\n\n\n{\\displaystyle \\Psi _{t}}\n\n\nIn the paper,[6] they showed how to design a kernel that reproduces the diffusion induced by a Fokker-Planck equation. Also, they explained that when the data approximate a manifold, then one can recover the geometry of this manifold by computing an approximation of the Laplace-Beltrami operator. This computation is completely insensitive to the distribution of the points and therefore provides a separation of the statistics and the geometry of the data. Since Diffusion map gives a global description of the data-set, it can measure the distances between pair of sample points in the manifold the data is embedded. Based on diffusion map, there are many applications, such as face recognition,[7] spectral clustering, low dimensional representation of images, image segmentation,[8] 3D model segmentation,[9] speaker verification[10] and identification,[11] sampling on manifolds,anomaly detection,[12] image inpainting,[13] and so on. Through their use of the Fokker–Planck equation in the context of the Meila-Shi algorithm, it is claimed that the method of Coifman and Lafon is related to computational quantum mechanics.[14]", 
    "dbpedia_url": "http://dbpedia.org/resource/Diffusion_map", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Diffusion_map\n"
}