{
    "about": "In mathematics, differential-algebraic equations (DAEs) are a general form of (systems of) differential equations for vector–valued functions x in one independent variable t,", 
    "name": "Differential Algebraic Equation", 
    "classification": "Numerical Analysis", 
    "full_text": "In mathematics, differential-algebraic equations (DAEs) are a general form of (systems of) differential equations for vector–valued functions x in one independent variable t,\nwhere \n\n\n\nx\n:\n[\na\n,\nb\n]\n→\n\n\nR\n\n\nn\n\n\n\n\n{\\displaystyle x:[a,b]\\to \\mathbb {R} ^{n}}\n\n is a vector of dependent variables \n\n\n\nx\n(\nt\n)\n=\n(\n\nx\n\n1\n\n\n(\nt\n)\n,\n…\n,\n\nx\n\nn\n\n\n(\nt\n)\n)\n\n\n{\\displaystyle x(t)=(x_{1}(t),\\dots ,x_{n}(t))}\n\n and the system has as many equations, \n\n\n\nF\n=\n(\n\nF\n\n1\n\n\n,\n…\n,\n\nF\n\nn\n\n\n)\n:\n\n\nR\n\n\n2\nn\n+\n1\n\n\n→\n\n\nR\n\n\nn\n\n\n\n\n{\\displaystyle F=(F_{1},\\dots ,F_{n}):\\mathbb {R} ^{2n+1}\\to \\mathbb {R} ^{n}}\n\n. They are distinct from ordinary differential equation (ODE) in that a DAE is not completely solvable for the derivatives of all components of the function x because these may not all appear (i.e. some equations are algebraic); technically the distinction between an implicit ODE system [that may be rendered explicit] and a DAE system is that the Jacobian matrix \n\n\n\n\n\n\n∂\nF\n(\nu\n,\nv\n,\nt\n)\n\n\n∂\nu\n\n\n\n\n\n{\\displaystyle {\\frac {\\partial F(u,v,t)}{\\partial u}}}\n\n is a singular matrix for a DAE system.[1] This distinction between ODEs and DAEs is made because DAEs have different characteristics and are generally more difficult to solve.[2]\nIn practical terms, the distinction between DAEs and ODEs is often that the solution of a DAE system depends on the derivatives of the input signal and not just the signal itself as in the case of ODEs;[3] this issue is commonly encountered in systems with hysteresis,[4] such as the Schmitt trigger.[5]\nThis difference is more clearly visible if the system may be rewritten so that instead of x we consider a pair \n\n\n\n(\nx\n,\ny\n)\n\n\n{\\displaystyle (x,y)}\n\n of vectors of dependent variables and the DAE has the form\nA DAE system of this form is called semi-explicit.[1] Every solution of the second half g of the equation defines a unique direction for x via the first half f of the equations, while the direction for y is arbitrary. But not every point (x,y,t) is a solution of g. The variables in x and the first half f of the equations get the attribute differential. The components of y and the second half g of the equations are called the algebraic variables or equations of the system. [The term algebraic in the context of DAEs only means free of derivatives and is not related to (abstract) algebra.]\nThe solution of a DAE consists of two parts, first the search for consistent initial values and second the computation of a trajectory. To find consistent initial values it is often necessary to consider the derivatives of some of the component functions of the DAE. The highest order of a derivative that is necessary for this process is called the differentiation index. The equations derived in computing the index and consistent initial values may also be of use in the computation of the trajectory. A semi-explicit DAE system can be converted to an implicit one by decreasing the differentiation index by one, and vice versa.[6]\n\n\nThe distinction of DAEs to ODEs becomes apparent if some of the dependent variables occur without their derivatives. The vector of dependent variables may then be written as pair \n\n\n\n(\nx\n,\ny\n)\n\n\n{\\displaystyle (x,y)}\n\n and the system of differential equations of the DAE appears in the form\nwhere\nAs a whole, the set of DAEs is a function\nInitial conditions must be a solution of the system of equations of the form\nThe pendulum in Cartesian coordinates (x,y) with center in (0,0) and length L has the Euler–Lagrange equations\nwhere \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n is a Lagrange multiplier. The momentum variables u and v should be constrained by the law of conservation of energy and their direction should point along the circle. Neither condition is explicit in those equations. Differentiation of the last equation leads to\nrestricting the direction of motion to the tangent of the circle. The next derivative of this equation implies\nand the derivative of that last identity simplifies to \n\n\n\n\nL\n\n2\n\n\n\n\n\nλ\n˙\n\n\n\n−\n3\ng\nv\n=\n0\n\n\n{\\displaystyle L^{2}{\\dot {\\lambda }}-3gv=0}\n\n which implicitly implies the conservation of energy since after integration the constant \n\n\n\nE\n=\n\n\n\n3\n2\n\n\n\ng\ny\n−\n\n\n\n1\n2\n\n\n\n\nL\n\n2\n\n\nλ\n=\n\n\n1\n2\n\n\n(\n\nu\n\n2\n\n\n+\n\nv\n\n2\n\n\n)\n+\ng\ny\n\n\n{\\displaystyle E={\\tfrac {3}{2}}gy-{\\tfrac {1}{2}}L^{2}\\lambda ={\\frac {1}{2}}(u^{2}+v^{2})+gy}\n\n is the sum of kinetic and potential energy.\nTo obtain unique derivative values for all dependent variables the last equation was three times differentiated. This gives a differentiation index of 3, which is typical for constrained mechanical systems.\nIf initial values \n\n\n\n(\n\nx\n\n0\n\n\n,\n\nu\n\n0\n\n\n)\n\n\n{\\displaystyle (x_{0},u_{0})}\n\n and a sign for y are given, the other variables are determined via \n\n\n\ny\n=\n±\n\n\n\nL\n\n2\n\n\n−\n\nx\n\n2\n\n\n\n\n\n\n{\\displaystyle y=\\pm {\\sqrt {L^{2}-x^{2}}}}\n\n, and if \n\n\n\ny\n≠\n0\n\n\n{\\displaystyle y\\neq 0}\n\n then \n\n\n\nv\n=\n−\nu\nx\n\n/\n\ny\n\n\n{\\displaystyle v=-ux/y}\n\n and \n\n\n\nλ\n=\n(\ng\ny\n−\n\nu\n\n2\n\n\n−\n\nv\n\n2\n\n\n)\n\n/\n\n\nL\n\n2\n\n\n\n\n{\\displaystyle \\lambda =(gy-u^{2}-v^{2})/L^{2}}\n\n. To proceed to the next point it is sufficient to get the derivatives of x and u, that is, the system to solve is now\nThis is a semi-explicit DAE of index 1. Another set of similar equations may be obtained starting from \n\n\n\n(\n\ny\n\n0\n\n\n,\n\nv\n\n0\n\n\n)\n\n\n{\\displaystyle (y_{0},v_{0})}\n\n and a sign for x.\nDAEs also naturally occur in the modelling of circuits with non-linear devices. Modified nodal analysis employing DAEs is used for example in the ubiquitous SPICE family of numeric circuit simulators.[7] Similarly, Fraunhofer's Analog Insydes Mathematica package can be used to derive DAEs from a netlist and then simplify or even solve the equations symbolically in some cases.[8][9] It is worth noting that the index of a DAE (of a circuit) can be made arbitrarily high by cascading/coupling via capacitors operational amplifiers with positive feedback.[4]\nDAE of the form\nare called semi-explicit. The index-1 property requires that g is solvable for y. In other words, the differentiation index is 1 if by differentiation of the algebraic equations for t an implicit ODE system results,\nwhich is solvable for \n\n\n\n(\n\n\n\nx\n˙\n\n\n\n,\n\n\n\n\ny\n˙\n\n\n\n)\n\n\n{\\displaystyle ({\\dot {x}},\\,{\\dot {y}})}\n\n if \n\n\n\ndet\n\n(\n\n∂\n\ny\n\n\ng\n(\nx\n,\ny\n,\nt\n)\n)\n\n≠\n0.\n\n\n{\\displaystyle \\det \\left(\\partial _{y}g(x,y,t)\\right)\\neq 0.}\n\n\nEvery sufficiently smooth DAE is almost everywhere reducible to this semi-explicit index-1 form.\nTwo major problems in the solution of DAEs are index reduction and consistent initial conditions. Most numerical solvers require ordinary differential equations and algebraic equations of the form\nIt is a non-trivial task to convert arbitrary DAE systems into ODEs for solution by pure ODE solvers. Techniques which can be employed include Pantelides algorithm and dummy derivative index reduction method. Alternatively, a direct solution of high-index DAEs with inconsistent initial conditions is also possible. This solution approach involves a transformation of the derivative elements through orthogonal collocation on finite elements or direct transcription into algebraic expressions. This allows DAEs of any index to be solved without rearrangement in the open equation form\nOnce the model has been converted to algebraic equation form, it is solvable by large-scale nonlinear programming solvers (see APMonitor).\nSeveral measures of DAEs tractability in terms of numerical methods have developed, such as differentiation index, perturbation index, tractability index, geometric index, and the Kronecker index.[10][11]\nWe use the \n\n\n\nΣ\n\n\n{\\displaystyle \\Sigma }\n\n-method to analyze a DAE. We construct for the DAE a signature matrix \n\n\n\nΣ\n=\n(\n\nσ\n\ni\n,\nj\n\n\n)\n\n\n{\\displaystyle \\Sigma =(\\sigma _{i,j})}\n\n, where each row corresponds to each equation \n\n\n\n\nf\n\ni\n\n\n\n\n{\\displaystyle f_{i}}\n\n and each column corresponds to each variable \n\n\n\n\nx\n\nj\n\n\n\n\n{\\displaystyle x_{j}}\n\n. The entry in position \n\n\n\n(\ni\n,\nj\n)\n\n\n{\\displaystyle (i,j)}\n\n is \n\n\n\n\nσ\n\ni\n,\nj\n\n\n\n\n{\\displaystyle \\sigma _{i,j}}\n\n, which denotes the highest order of derivative to which \n\n\n\n\nx\n\nj\n\n\n\n\n{\\displaystyle x_{j}}\n\n occurs in \n\n\n\n\nf\n\ni\n\n\n\n\n{\\displaystyle f_{i}}\n\n, or \n\n\n\n−\n∞\n\n\n{\\displaystyle -\\infty }\n\n if \n\n\n\n\nx\n\nj\n\n\n\n\n{\\displaystyle x_{j}}\n\n does not occur in \n\n\n\n\nf\n\ni\n\n\n\n\n{\\displaystyle f_{i}}\n\n.\nFor the pendulum DAE above, the variables are \n\n\n\n(\n\nx\n\n1\n\n\n,\n\nx\n\n2\n\n\n,\n\nx\n\n3\n\n\n,\n\nx\n\n4\n\n\n,\n\nx\n\n5\n\n\n)\n=\n(\nx\n,\ny\n,\nu\n,\nv\n,\nλ\n)\n\n\n{\\displaystyle (x_{1},x_{2},x_{3},x_{4},x_{5})=(x,y,u,v,\\lambda )}\n\n. The corresponding signature matrix is", 
    "dbpedia_url": "http://dbpedia.org/resource/Differential_algebraic_equation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Differential_algebraic_equation\n"
}