{
    "about": "A digital storage oscilloscope (often abbreviated DSO) is an oscilloscope which stores and analyses the signal digitally rather than using analog techniques. It is now the most common type of oscilloscope in use because of the advanced trigger, storage, display and measurement features which it typically provides.[1]", 
    "name": "Digital Storage Oscilloscope", 
    "classification": "Signal Processing", 
    "full_text": "A digital storage oscilloscope (often abbreviated DSO) is an oscilloscope which stores and analyses the signal digitally rather than using analog techniques. It is now the most common type of oscilloscope in use because of the advanced trigger, storage, display and measurement features which it typically provides.[1]\nThe input analogue signal is sampled and then converted into a digital record of the amplitude of the signal at each sample time. The sampling frequency should be not less than the Nyquist rate to avoid aliasing. These digital values are then turned back into an analogue signal for display on a cathode ray tube (CRT), or transformed as needed for the various possible types of output—liquid crystal display, chart recorder, plotter or network interface.[2]\nDigital storage oscilloscope costs vary widely; bench-top self-contained instruments (complete with displays) start at US$300 or even less, with high-performance models selling for tens of thousands of dollars. Small, pocket-size models, limited in function, may retail for as little as US$50.[3]\nThe principal advantage over analog storage is that the stored traces are as bright, as sharply defined, and written as quickly as non-stored traces. Traces can be stored indefinitely or written out to some external data storage device and reloaded. This allows, for example, comparison of an acquired trace from a system under test with a standard trace acquired from a known-good system. Many models can display the waveform prior to the trigger signal.\nDigital oscilloscopes usually analyze waveforms and provide numerical values as well as visual displays. These values typically include averages, maxima and minima, root mean square (RMS) and frequencies. They may be used to capture transient signals when operated in a single sweep mode, without the brightness and writing speed limitations of an analog storage oscilloscope.[4]\nThe displayed trace can be manipulated after acquisition; a portion of the display can be magnified to make fine detail more visible, or a long trace can be examined in a single display to identify areas of interest. Many instruments allow a stored trace to be annotated by the user.\nMany digital oscilloscopes use flat panel displays similar to those made in high volumes for computers and television displays.", 
    "dbpedia_url": "http://dbpedia.org/resource/Digital_storage_oscilloscope", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Digital_storage_oscilloscope\n"
}