{
    "about": "Dijkstra's algorithm is an algorithm for finding the shortest paths between nodes in a graph, which may represent, for example, road networks. It was conceived by computer scientist Edsger W. Dijkstra in 1956 and published three years later.[1][2]", 
    "name": "Dijkstra'S Algorithm", 
    "classification": "Graph Algorithms", 
    "full_text": "Dijkstra's algorithm is an algorithm for finding the shortest paths between nodes in a graph, which may represent, for example, road networks. It was conceived by computer scientist Edsger W. Dijkstra in 1956 and published three years later.[1][2]\nThe algorithm exists in many variants; Dijkstra's original variant found the shortest path between two nodes,[2] but a more common variant fixes a single node as the \"source\" node and finds shortest paths from the source to all other nodes in the graph, producing a shortest-path tree.\nFor a given source node in the graph, the algorithm finds the shortest path between that node and every other.[3]:196–206 It can also be used for finding the shortest paths from a single node to a single destination node by stopping the algorithm once the shortest path to the destination node has been determined. For example, if the nodes of the graph represent cities and edge path costs represent driving distances between pairs of cities connected by a direct road, Dijkstra's algorithm can be used to find the shortest route between one city and all other cities. As a result, the shortest path algorithm is widely used in network routing protocols, most notably IS-IS and Open Shortest Path First (OSPF). It is also employed as a subroutine in other algorithms such as Johnson's.\nDijkstra's original algorithm does not use a min-priority queue and runs in time \n\n\n\nO\n(\n\n|\n\nV\n\n\n|\n\n\n2\n\n\n)\n\n\n{\\displaystyle O(|V|^{2})}\n\n (where \n\n\n\n\n|\n\nV\n\n|\n\n\n\n{\\displaystyle |V|}\n\n is the number of nodes). The idea of this algorithm is also given in Leyzorek et al. 1957. The implementation based on a min-priority queue implemented by a Fibonacci heap and running in \n\n\n\nO\n(\n\n|\n\nE\n\n|\n\n+\n\n|\n\nV\n\n|\n\nlog\n⁡\n\n|\n\nV\n\n|\n\n)\n\n\n{\\displaystyle O(|E|+|V|\\log |V|)}\n\n (where \n\n\n\n\n|\n\nE\n\n|\n\n\n\n{\\displaystyle |E|}\n\n is the number of edges) is due to Fredman & Tarjan 1984. This is asymptotically the fastest known single-source shortest-path algorithm for arbitrary directed graphs with unbounded non-negative weights. However, specialized cases (such as bounded/integer weights, directed acyclic graphs etc.) can indeed be improved further as detailed in § Specialized variants.\nIn some fields, artificial intelligence in particular, Dijkstra's algorithm or a variant of it is known as uniform-cost search and formulated as an instance of the more general idea of best-first search.[4]\n\n\nDijkstra thought about the shortest path problem when working at the Mathematical Center in Amsterdam in 1956 as a programmer to demonstrate capabilities of a new computer called ARMAC. His objective was to choose both a problem as well as an answer (that would be produced by computer) that non-computing people could understand. He designed the shortest path algorithm and later implemented it for ARMAC for a slightly simplified transportation map of 64 cities in the Netherlands (64, so that 6 bits would be sufficient to encode the city number).[1] A year later, he came across another problem from hardware engineers working on the institute's next computer: minimize the amount of wire needed to connect the pins on the back panel of the machine. As a solution, he re-discovered the algorithm known as Prim's minimal spanning tree algorithm (known earlier to Jarník, and also rediscovered by Prim).[5][6] Dijkstra published the algorithm in 1959, two years after Prim and 29 years after Jarník.[7][8]\nLet the node at which we are starting be called the initial node. Let the distance of node Y be the distance from the initial node to Y. Dijkstra's algorithm will assign some initial distance values and will try to improve them step by step.\nSuppose you would like to find the shortest path between two intersections on a city map: a starting point and a destination. Dijkstra's algorithm initially marks the distance (from the starting point) to every other intersection on the map with infinity. This is done not to imply there is an infinite distance, but to note that those intersections have not yet been visited; some variants of this method simply leave the intersections' distances unlabeled. Now, at each iteration, select the current intersection. For the first iteration, the current intersection will be the starting point, and the distance to it (the intersection's label) will be zero. For subsequent iterations (after the first), the current intersection will be the closest unvisited intersection to the starting point (this will be easy to find).\nFrom the current intersection, update the distance to every unvisited intersection that is directly connected to it. This is done by determining the sum of the distance between an unvisited intersection and the value of the current intersection, and relabeling the unvisited intersection with this value (the sum), if it is less than its current value. In effect, the intersection is relabeled if the path to it through the current intersection is shorter than the previously known paths. To facilitate shortest path identification, in pencil, mark the road with an arrow pointing to the relabeled intersection if you label/relabel it, and erase all others pointing to it. After you have updated the distances to each neighboring intersection, mark the current intersection as visited, and select the unvisited intersection with lowest distance (from the starting point) – or the lowest label—as the current intersection. Nodes marked as visited are labeled with the shortest path from the starting point to it and will not be revisited or returned to.\nContinue this process of updating the neighboring intersections with the shortest distances, then marking the current intersection as visited and moving onto the closest unvisited intersection until you have marked the destination as visited. Once you have marked the destination as visited (as is the case with any visited intersection) you have determined the shortest path to it, from the starting point, and can trace your way back, following the arrows in reverse; in the algorithm's implementations, this is usually done (after the algorithm has reached the destination node) by following the nodes' parents from the destination node up to the starting node; that's why we keep also track of each node's parent.\nThis algorithm makes no attempt to direct \"exploration\" towards the destination as one might expect. Rather, the sole consideration in determining the next \"current\" intersection is its distance from the starting point. This algorithm therefore expands outward from the starting point, interactively considering every node that is closer in terms of shortest path distance until it reaches the destination. When understood in this way, it is clear how the algorithm necessarily finds the shortest path. However, it may also reveal one of the algorithm's weaknesses: its relative slowness in some topologies.\nIn the following algorithm, the code u ← vertex in Q with min dist[u], searches for the vertex u in the vertex set Q that has the least dist[u] value. length(u, v) returns the length of the edge joining (i.e. the distance between) the two neighbor-nodes u and v. The variable alt on line 17 is the length of the path from the root node to the neighbor node v if it were to go through u. If this path is shorter than the current shortest path recorded for v, that current path is replaced with this alt path. The prev array is populated with a pointer to the \"next-hop\" node on the source graph to get the shortest route to the source.\nIf we are only interested in a shortest path between vertices source and target, we can terminate the search after line 13 if u = target. Now we can read the shortest path from source to target by reverse iteration:\nNow sequence S is the list of vertices constituting one of the shortest paths from source to target, or the empty sequence if no path exists.\nA more general problem would be to find all the shortest paths between source and target (there might be several different ones of the same length). Then instead of storing only a single node in each entry of prev[] we would store all nodes satisfying the relaxation condition. For example, if both r and source connect to target and both of them lie on different shortest paths through target (because the edge cost is the same in both cases), then we would add both r and source to prev[target]. When the algorithm completes, prev[] data structure will actually describe a graph that is a subset of the original graph with some edges removed. Its key property will be that if the algorithm was run with some starting node, then every path from that node to any other node in the new graph will be the shortest path between those nodes in the original graph, and all paths of that length from the original graph will be present in the new graph. Then to actually find all these shortest paths between two given nodes we would use a path finding algorithm on the new graph, such as depth-first search.\nA min-priority queue is an abstract data type that provides 3 basic operations : add_with_priority(), decrease_priority() and extract_min(). As mentioned earlier, using such a data structure can lead to faster computing times than using a basic queue. Notably, Fibonacci heap (Fredman & Tarjan 1984) or Brodal queue offer optimal implementations for those 3 operations. As the algorithm is slightly different, we mention it here, in pseudo-code as well :\nInstead of filling the priority queue with all nodes in the initialization phase, it is also possible to initialize it to contain only source; then, inside the if alt < dist[v] block, the node must be inserted if not already in the queue (instead of performing a decrease_priority operation).[3]:198\nOther data structures can be used to achieve even faster computing times in practice.[9]\nProof is by induction on the number of visited nodes.\nInvariant hypothesis: For each visited node v, dist[v] is the shortest distance from source to v; and for each unvisited node u, dist[u] is the shortest distance via visited nodes only from source to u (if such a path exists, otherwise infinity; note we do not assume dist[u] is the actual shortest distance for unvisited nodes).\nThe base case is when there is just one visited node, namely the initial node source, and the hypothesis is trivial.\nAssume the hypothesis for n-1 visited nodes. Now we choose an edge vu where u has the least dist[u] of any unvisited node and the edge vu is such that dist[u] = dist[v] + length[v,u]. dist[u] must be the shortest distance from source to u because if there were a shorter path, and if w was the first unvisited node on that path then by hypothesis dist[w] < dist[u] creating a contradiction. Similarly if there was a shorter path to u without using unvisited nodes then dist[u] would have been less than dist[v] + length[v,u].\nAfter processing u it will still be true that for each unvisited node w, dist[w] is the shortest distance from source to w using visited nodes only, since if there were a shorter path which doesn't visit u we would have found it previously, and if there is a shorter path using u we update it when processing u .\nBounds of the running time of Dijkstra's algorithm on a graph with edges \n\n\n\nE\n\n\n{\\displaystyle E}\n\n and vertices \n\n\n\nV\n\n\n{\\displaystyle V}\n\n can be expressed as a function of the number of edges, denoted \n\n\n\n\n|\n\nE\n\n|\n\n\n\n{\\displaystyle |E|}\n\n, and the number of vertices, denoted \n\n\n\n\n|\n\nV\n\n|\n\n\n\n{\\displaystyle |V|}\n\n, using big-O notation. How tight a bound is possible depends on the way the vertex set \n\n\n\nQ\n\n\n{\\displaystyle Q}\n\n is implemented. In the following, upper bounds can be simplified because \n\n\n\n\n|\n\nE\n\n|\n\n=\nO\n(\n\n|\n\nV\n\n\n|\n\n\n2\n\n\n)\n\n\n{\\displaystyle |E|=O(|V|^{2})}\n\n for any graph, but that simplification disregards the fact that in some problems, other upper bounds on \n\n\n\n\n|\n\nE\n\n|\n\n\n\n{\\displaystyle |E|}\n\n may hold.\nFor any implementation of the vertex set \n\n\n\nQ\n\n\n{\\displaystyle Q}\n\n, the running time is in\nwhere \n\n\n\n\nT\n\n\nd\nk\n\n\n\n\n\n{\\displaystyle T_{\\mathrm {dk} }}\n\n and \n\n\n\n\nT\n\n\ne\nm\n\n\n\n\n\n{\\displaystyle T_{\\mathrm {em} }}\n\n are the complexities of the decrease-key and extract-minimum operations in \n\n\n\nQ\n\n\n{\\displaystyle Q}\n\n, respectively. The simplest implementation of Dijkstra's algorithm stores the vertex set \n\n\n\nQ\n\n\n{\\displaystyle Q}\n\n as an ordinary linked list or array, and extract-minimum is simply a linear search through all vertices in \n\n\n\nQ\n\n\n{\\displaystyle Q}\n\n. In this case, the running time is \n\n\n\nO\n(\n\n|\n\nE\n\n|\n\n+\n\n|\n\nV\n\n\n|\n\n\n2\n\n\n)\n=\nO\n(\n\n|\n\nV\n\n\n|\n\n\n2\n\n\n)\n\n\n{\\displaystyle O(|E|+|V|^{2})=O(|V|^{2})}\n\n.\nFor sparse graphs, that is, graphs with far fewer than \n\n\n\n\n|\n\nV\n\n\n|\n\n\n2\n\n\n\n\n{\\displaystyle |V|^{2}}\n\n edges, Dijkstra's algorithm can be implemented more efficiently by storing the graph in the form of adjacency lists and using a self-balancing binary search tree, binary heap, pairing heap, or Fibonacci heap as a priority queue to implement extracting minimum efficiently. To perform decrease-key steps in a binary heap efficiently, it is necessary to use an auxiliary data structure that maps each vertex to its position in the heap, and to keep this structure up to date as the priority queue \n\n\n\nQ\n\n\n{\\displaystyle Q}\n\n changes. With a self-balancing binary search tree or binary heap, the algorithm requires\ntime in the worst case; for connected graphs this time bound can be simplified to \n\n\n\nΘ\n(\n\n|\n\nE\n\n|\n\nlog\n⁡\n\n|\n\nV\n\n|\n\n)\n\n\n{\\displaystyle \\Theta (|E|\\log |V|)}\n\n. The Fibonacci heap improves this to\nWhen using binary heaps, the average case time complexity is lower than the worst-case: assuming edge costs are drawn independently from a common probability distribution, the expected number of decrease-key operations is bounded by \n\n\n\nO\n(\n\n|\n\nV\n\n|\n\nlog\n⁡\n(\n\n|\n\nE\n\n|\n\n\n/\n\n\n|\n\nV\n\n|\n\n)\n)\n\n\n{\\displaystyle O(|V|\\log(|E|/|V|))}\n\n, giving a total running time of[3]:199–200\nIn common presentations of Dijkstra's algorithm, initially all nodes are entered into the priority queue. This is, however, not necessary: the algorithm can start with a priority queue that contains only one item, and insert new items as they are discovered (instead of doing a decrease-key, check whether the key is in the queue; if it is, decrease its key, otherwise insert it).[3]:198 This variant has the same worst-case bounds as the common variant, but maintains a smaller priority queue in practice, speeding up the queue operations.[4]\nMoreover, not inserting all nodes in a graph makes it possible to extend the algorithm to find the shortest path from a single source to the closest of a set of target nodes on infinite graphs or those too large to represent in memory. The resulting algorithm is called uniform-cost search (UCS) in the artificial intelligence literature[4][10][11] and can be expressed in pseudocode as\nThe complexity of this algorithm can be expressed in an alternative way for very large graphs: when C* is the length of the shortest path from the start node to any node satisfying the \"goal\" predicate, each edge has cost at least ε, and the number of neighbors per node is bounded by b, then the algorithm's worst-case time and space complexity are both in O(b1+⌊C*  ⁄ ε⌋).[10]\nFurther optimizations of Dijkstra's algorithm for the single-target case include bidirectional variants, goal-directed variants such as the A* algorithm (see § Related problems and algorithms), graph pruning to determine which nodes are likely to form the middle segment of shortest paths (reach-based routing), and hierarchical decompositions of the input graph that reduce s–t routing to connecting s and t to their respective \"transit nodes\" followed by shortest-path computation between these transit nodes using a \"highway\".[12] Combinations of such techniques may be needed for optimal practical performance on specific problems.[13]\n\nWhen arc weights are small integers (bounded by a parameter C), a monotone priority queue can be used to speed up Dijkstra's algorithm. The first algorithm of this type was Dial's algorithm, which used a bucket queue to obtain a running time \n\n\n\nO\n(\n\n|\n\nE\n\n|\n\n+\ndiam\n⁡\n(\nG\n)\n)\n\n\n{\\displaystyle O(|E|+\\operatorname {diam} (G))}\n\n that depends on the weighted diameter of a graph with integer edge weights (Dial 1969). The use of a Van Emde Boas tree as the priority queue brings the complexity to \n\n\n\nO\n(\n\n|\n\nE\n\n|\n\nlog\n⁡\nlog\n⁡\nC\n)\n\n\n{\\displaystyle O(|E|\\log \\log C)}\n\n (Ahuja et al. 1990). Another interesting implementation based on a combination of a new radix heap and the well-known Fibonacci heap runs in time \n\n\n\nO\n(\n\n|\n\nE\n\n|\n\n+\n\n|\n\nV\n\n|\n\n\n\nlog\n⁡\nC\n\n\n)\n\n\n{\\displaystyle O(|E|+|V|{\\sqrt {\\log C}})}\n\n (Ahuja et al. 1990). Finally, the best algorithms in this special case are as follows. The algorithm given by (Thorup 2000) runs in \n\n\n\nO\n(\n\n|\n\nE\n\n|\n\nlog\n⁡\nlog\n⁡\n\n|\n\nV\n\n|\n\n)\n\n\n{\\displaystyle O(|E|\\log \\log |V|)}\n\n time and the algorithm given by (Raman 1997) runs in \n\n\n\nO\n(\n\n|\n\nE\n\n|\n\n+\n\n|\n\nV\n\n|\n\nmin\n{\n(\nlog\n⁡\n\n|\n\nV\n\n|\n\n\n)\n\n1\n\n/\n\n3\n+\nϵ\n\n\n,\n(\nlog\n⁡\nC\n\n)\n\n1\n\n/\n\n4\n+\nϵ\n\n\n}\n)\n\n\n{\\displaystyle O(|E|+|V|\\min\\{(\\log |V|)^{1/3+\\epsilon },(\\log C)^{1/4+\\epsilon }\\})}\n\n time.\nAlso, for directed acyclic graphs, it is possible to find shortest paths from a given starting vertex in linear \n\n\n\nO\n(\n\n|\n\nE\n\n|\n\n+\n\n|\n\nV\n\n|\n\n)\n\n\n{\\displaystyle O(|E|+|V|)}\n\n time, by processing the vertices in a topological order, and calculating the path length for each vertex to be the minimum length obtained via any of its incoming edges.[14][15]\nIn the special case of integer weights and undirected graphs, Dijkstra's algorithm can be completely countered with a linear \n\n\n\nO\n(\n\n|\n\nV\n\n|\n\n+\n\n|\n\nE\n\n|\n\n)\n\n\n{\\displaystyle O(|V|+|E|)}\n\n complexity algorithm, given by (Thorup 1999).\nThe functionality of Dijkstra's original algorithm can be extended with a variety of modifications. For example, sometimes it is desirable to present solutions which are less than mathematically optimal. To obtain a ranked list of less-than-optimal solutions, the optimal solution is first calculated. A single edge appearing in the optimal solution is removed from the graph, and the optimum solution to this new graph is calculated. Each edge of the original solution is suppressed in turn and a new shortest-path calculated. The secondary solutions are then ranked and presented after the first optimal solution.\nDijkstra's algorithm is usually the working principle behind link-state routing protocols, OSPF and IS-IS being the most common ones.\nUnlike Dijkstra's algorithm, the Bellman–Ford algorithm can be used on graphs with negative edge weights, as long as the graph contains no negative cycle reachable from the source vertex s. The presence of such cycles means there is no shortest path, since the total weight becomes lower each time the cycle is traversed. It is possible to adapt Dijkstra's algorithm to handle negative weight edges by combining it with the Bellman-Ford algorithm (to remove negative edges and detect negative cycles), such an algorithm is called Johnson's algorithm.\nThe A* algorithm is a generalization of Dijkstra's algorithm that cuts down on the size of the subgraph that must be explored, if additional information is available that provides a lower bound on the \"distance\" to the target. This approach can be viewed from the perspective of linear programming: there is a natural linear program for computing shortest paths, and solutions to its dual linear program are feasible if and only if they form a consistent heuristic (speaking roughly, since the sign conventions differ from place to place in the literature). This feasible dual / consistent heuristic defines a non-negative reduced cost and A* is essentially running Dijkstra's algorithm with these reduced costs. If the dual satisfies the weaker condition of admissibility, then A* is instead more akin to the Bellman–Ford algorithm.\nThe process that underlies Dijkstra's algorithm is similar to the greedy process used in Prim's algorithm. Prim's purpose is to find a minimum spanning tree that connects all nodes in the graph; Dijkstra is concerned with only two nodes. Prim's does not evaluate the total weight of the path from the starting node, only the individual path.\nBreadth-first search can be viewed as a special-case of Dijkstra's algorithm on unweighted graphs, where the priority queue degenerates into a FIFO queue.\nFast marching method can be viewed as a continuous version of Dijkstra's algorithm which computes the geodesic distance on a triangle mesh.\nFrom a dynamic programming point of view, Dijkstra's algorithm is a successive approximation scheme that solves the dynamic programming functional equation for the shortest path problem by the Reaching method.[16][17][18]\nIn fact, Dijkstra's explanation of the logic behind the algorithm,[19] namely\nProblem 2. Find the path of minimum total length between two given nodes \n\n\n\nP\n\n\n{\\displaystyle P}\n\n and \n\n\n\nQ\n\n\n{\\displaystyle Q}\n\n.\nWe use the fact that, if \n\n\n\nR\n\n\n{\\displaystyle R}\n\n is a node on the minimal path from \n\n\n\nP\n\n\n{\\displaystyle P}\n\n to \n\n\n\nQ\n\n\n{\\displaystyle Q}\n\n, knowledge of the latter implies the knowledge of the minimal path from \n\n\n\nP\n\n\n{\\displaystyle P}\n\n to \n\n\n\nR\n\n\n{\\displaystyle R}\n\n.\nis a paraphrasing of Bellman's famous Principle of Optimality in the context of the shortest path problem.", 
    "dbpedia_url": "http://dbpedia.org/resource/Dijkstra's_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Dijkstra's_algorithm\n"
}