{
    "about": "In mathematics and specifically in algebraic geometry, the dimension of an algebraic variety may be defined in various equivalent ways.", 
    "name": "Dimension Of An Algebraic Variety", 
    "classification": "Computer Algebra", 
    "full_text": "In mathematics and specifically in algebraic geometry, the dimension of an algebraic variety may be defined in various equivalent ways.\nSome of these definitions are of geometric nature, while some other are purely algebraic and rely on commutative algebra. Some are restricted to algebraic varieties while others apply also to any algebraic set. Some are intrinsic, as independent of any embedding of the variety into an affine or projective space, while other are related to such an embedding.\n\n\nLet K be a field, and L ⊇ K be an algebraically closed extension. An affine algebraic set V is the set of the common zeros in Ln of the elements of an ideal I in a polynomial ring \n\n\n\nR\n=\nK\n[\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nn\n\n\n]\n.\n\n\n{\\displaystyle R=K[x_{1},\\ldots ,x_{n}].}\n\n Let A=R/I be the algebra of the polynomials over V. The dimension of V is any of the following integers. It does not change if K is enlarged, if L is replaced by another algebraically closed extension of K and if I is replaced by another ideal having the same zeros (that is having the same radical). The dimension is also independent of the choice of coordinates; in other words is does not change if the xi are replaced by linearly independent linear combinations of them. The dimension of V is\nThis definition generalizes a property of the dimension of a Euclidean space or a vector space. It is thus probably the definition that gives the easiest intuitive description of the notion.\nThis is the transcription of the preceding definition in the language of commutative algebra, the Krull dimension being the maximal length of the chains \n\n\n\n\np\n\n0\n\n\n⊂\n\np\n\n1\n\n\n⊂\n…\n⊂\n\np\n\nd\n\n\n\n\n{\\displaystyle p_{0}\\subset p_{1}\\subset \\ldots \\subset p_{d}}\n\n of prime ideals of A.\nThis definition shows that the dimension is a local property.\nThis shows that the dimension is constant on a variety\nThis relies the dimension of a variety to that of a differentiable manifold. More precisely, if V if defined over the reals, then the set of its real regular points is a differentiable manifold that has the same dimension as a variety and as a manifold.\nThis is the algebraic analogue to the fact that a connected manifold has a constant dimension.\nThis definition is not intrinsic as it apply only to algebraic sets that are explicitly embedded in an affine or projective space.\nThis the algebraic translation of the preceding definition.\nThis is the algebraic translation of the fact that the intersection of n – d hypersurfaces is, in general, an algebraic set of dimension d.\nThis allows, through a Gröbner basis computation to compute the dimension of the algebraic set defined by a given system of polynomial equations\nThis allows to prove easily that the dimension is invariant under birational equivalence.\nLet V be a projective algebraic set defined as the set of the common zeros of a homogeneous ideal I in a polynomial ring \n\n\n\nR\n=\nK\n[\n\nx\n\n0\n\n\n,\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nn\n\n\n]\n\n\n{\\displaystyle R=K[x_{0},x_{1},\\ldots ,x_{n}]}\n\n over a field K, and let A=R/I be the graded algebra of the polynomials over V.\nAll the definitions of the previous section apply, with the change that, when A or I appear explicitly in the definition, the value of the dimension must be reduced by one. For example, the dimension of V is one less than the Krull dimension of A.\nGiven a system of polynomial equations, it may be difficult to compute the dimension of the algebraic set that it defines.\nWithout further information on the system, there is only one practical method, which consists of computing a Gröbner basis and deducing the degree of the denominator of the Hilbert series of the ideal generated by the equations.\nThe second step, which is usually the fastest, may be accelerated in the following way: Firstly, the Gröbner basis is replaced by the list of its leading monomials (this is already done for the computation of the Hilbert series). Then each monomial like \n\n\n\n\n\n\nx\n\n1\n\n\n\n\n\ne\n\n1\n\n\n\n\n⋯\n\n\n\nx\n\nn\n\n\n\n\n\ne\n\nn\n\n\n\n\n\n\n{\\displaystyle {x_{1}}^{e_{1}}\\cdots {x_{n}}^{e_{n}}}\n\n is replaced by the product of the variables in it: \n\n\n\n\nx\n\n1\n\n\nmin\n(\n\ne\n\n1\n\n\n,\n1\n)\n\n\n⋯\n\nx\n\nn\n\n\nmin\n(\n\ne\n\nn\n\n\n,\n1\n)\n\n\n.\n\n\n{\\displaystyle x_{1}^{\\min(e_{1},1)}\\cdots x_{n}^{\\min(e_{n},1)}.}\n\n Then the dimension is the maximal size of a subset S of the variables, such that none of these products of variables depends only on the variables in S.\nThis algorithm is implemented in several computer algebra systems. For example in Maple, this is the function Groebner[HilbertDimension].\nThe real dimension of a set of real points, typically a semialgebraic set, is the dimension of its Zariski closure. For a semialgebraic set S, the real dimension is one of the following equal integers:[1]\nFor an algebraic set defined over the reals (that is defined by polynomials with real coefficients), it may occur that the real dimension of the set of its real points is smaller than its dimension as a semi algebraic set. For example, the algebraic surface of equation \n\n\n\n\nx\n\n2\n\n\n+\n\ny\n\n2\n\n\n+\n\nz\n\n2\n\n\n=\n0\n\n\n{\\displaystyle x^{2}+y^{2}+z^{2}=0}\n\n is an algebraic variety of dimension two, which has only one real point (0, 0, 0), and thus has the real dimension zero.\nThe real dimension is more difficult to compute than the algebraic dimension. For the case of a real hypersurface (that is the set of real solutions of a single polynomial equation), there exists a probabilistic algorithm to compute its real dimension.[2]\nFor the case of an arbitrary system of polynomial equations and inequalities, computing a triangular decomposition[3] of this system into so-called regular semi-algebraic systems yields the dimension of the solution set of this system. The command RealTriangularize of the RegularChains library implements such decomposition.", 
    "dbpedia_url": "http://dbpedia.org/resource/Dimension_of_an_algebraic_variety", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Dimension_of_an_algebraic_variety\n"
}