{
    "about": "Dinic's algorithm or Dinitz's algorithm is a strongly polynomial algorithm for computing the maximum flow in a flow network, conceived in 1970 by Israeli (formerly Soviet) computer scientist Yefim (Chaim) A. Dinitz.[1] The algorithm runs in \n\n\n\nO\n(\n\nV\n\n2\n\n\nE\n)\n\n\n{\\displaystyle O(V^{2}E)}\n\n time and is similar to the Edmonds–Karp algorithm, which runs in \n\n\n\nO\n(\nV\n\nE\n\n2\n\n\n)\n\n\n{\\displaystyle O(VE^{2})}\n\n time, in that it uses shortest augmenting paths. The introduction of the concepts of the level graph and blocking flow enable Dinic's algorithm to achieve its performance.", 
    "name": "Dinic'S Algorithm", 
    "classification": "Graph Algorithms", 
    "full_text": "Dinic's algorithm or Dinitz's algorithm is a strongly polynomial algorithm for computing the maximum flow in a flow network, conceived in 1970 by Israeli (formerly Soviet) computer scientist Yefim (Chaim) A. Dinitz.[1] The algorithm runs in \n\n\n\nO\n(\n\nV\n\n2\n\n\nE\n)\n\n\n{\\displaystyle O(V^{2}E)}\n\n time and is similar to the Edmonds–Karp algorithm, which runs in \n\n\n\nO\n(\nV\n\nE\n\n2\n\n\n)\n\n\n{\\displaystyle O(VE^{2})}\n\n time, in that it uses shortest augmenting paths. The introduction of the concepts of the level graph and blocking flow enable Dinic's algorithm to achieve its performance.\n\n\nYefim Dinitz invented this algorithm in response to a pre-class exercise in Adel'son-Vel'sky's (co-inventor of AVL trees) Algorithm class. At the time he was not aware of the basic facts regarding Ford-Fulkerson algorithm.[2]\nDinitz mentions inventing his algorithm in January 1969, which was published in 1970 in journal Doklady Akademii nauk SSSR. In 1974, Shimon Even and (his then Ph.D. student) Alon Itai at the Technion in Haifa were very curious and intrigued by the Dinitz's algorithm as well as Alexander Karzanov's idea of blocking flow. However it was hard to decipher these two papers for them, each being limited to four pages to meet the restrictions of journal Doklady Akademii nauk SSSR. However Even did not give up and after three days of effort managed to understand both papers except for the layered network maintenance issue. Over the next couple of years, Even gave lectures on \"Dinic's algorithm\" mispronouncing the name of the author while popularizing it. Even and Itai also contributed to this algorithm by combining BFS and DFS, which is the current version of algorithm[3]\nFor about 10 years of time after Ford–Fulkerson algorithm was invented, it was unknown if it can be made to terminate in polynomial time in the generic case of irrational edge capacities. This caused lack of any known polynomial time algorithm that solved max flow problem in generic case. Dinitz algorithm and the Edmonds–Karp algorithm, which was published in 1972, independently showed that in the Ford–Fulkerson algorithm, if each augmenting path is the shortest one, the length of the augmenting paths is non-decreasing and it always terminated.\nLet \n\n\n\nG\n=\n(\n(\nV\n,\nE\n)\n,\nc\n,\ns\n,\nt\n)\n\n\n{\\displaystyle G=((V,E),c,s,t)}\n\n be a network with \n\n\n\nc\n(\nu\n,\nv\n)\n\n\n{\\displaystyle c(u,v)}\n\n and \n\n\n\nf\n(\nu\n,\nv\n)\n\n\n{\\displaystyle f(u,v)}\n\n the capacity and the flow of the edge \n\n\n\n(\nu\n,\nv\n)\n\n\n{\\displaystyle (u,v)}\n\n respectively.\nDinic's Algorithm\nIt can be shown that the number of layers in each blocking flow increases by at least 1 each time and thus there are at most \n\n\n\nn\n−\n1\n\n\n{\\displaystyle n-1}\n\n blocking flows in the algorithm, where \n\n\n\nn\n\n\n{\\displaystyle n}\n\n is the number of vertices in the network. The level graph \n\n\n\n\nG\n\nL\n\n\n\n\n{\\displaystyle G_{L}}\n\n can be constructed by Breadth-first search in \n\n\n\nO\n(\nE\n)\n\n\n{\\displaystyle O(E)}\n\n time and a blocking flow in each level graph can be found in \n\n\n\nO\n(\nV\nE\n)\n\n\n{\\displaystyle O(VE)}\n\n time. Hence, the running time of Dinic's algorithm is \n\n\n\nO\n(\n\nV\n\n2\n\n\nE\n)\n\n\n{\\displaystyle O(V^{2}E)}\n\n.\nUsing a data structure called dynamic trees, the running time of finding a blocking flow in each phase can be reduced to \n\n\n\nO\n(\nE\nlog\n⁡\nV\n)\n\n\n{\\displaystyle O(E\\log V)}\n\n and therefore the running time of Dinic's algorithm can be improved to \n\n\n\nO\n(\nV\nE\nlog\n⁡\nV\n)\n\n\n{\\displaystyle O(VE\\log V)}\n\n.\nIn networks with unit capacities, a much stronger time bound holds. Each blocking flow can be found in \n\n\n\nO\n(\nE\n)\n\n\n{\\displaystyle O(E)}\n\n time, and it can be shown that the number of phases does not exceed \n\n\n\nO\n(\n\n\nE\n\n\n)\n\n\n{\\displaystyle O({\\sqrt {E}})}\n\n and \n\n\n\nO\n(\n\nV\n\n2\n\n/\n\n3\n\n\n)\n\n\n{\\displaystyle O(V^{2/3})}\n\n. Thus the algorithm runs in \n\n\n\nO\n(\nmin\n{\n\nV\n\n2\n\n/\n\n3\n\n\n,\n\nE\n\n1\n\n/\n\n2\n\n\n}\nE\n)\n\n\n{\\displaystyle O(\\min\\{V^{2/3},E^{1/2}\\}E)}\n\n time.[4]\nIn networks arising during the solution of bipartite matching problem, the number of phases is bounded by \n\n\n\nO\n(\n\n\nV\n\n\n)\n\n\n{\\displaystyle O({\\sqrt {V}})}\n\n, therefore leading to the \n\n\n\nO\n(\n\n\nV\n\n\nE\n)\n\n\n{\\displaystyle O({\\sqrt {V}}E)}\n\n time bound. The resulting algorithm is also known as Hopcroft–Karp algorithm. More generally, this bound holds for any unit network — a network in which each vertex, except for source and sink, either has a single entering edge of capacity one, or a single outgoing edge of capacity one, and all other capacities are arbitrary integers.[5]\nThe following is a simulation of Dinic's algorithm. In the level graph \n\n\n\n\nG\n\nL\n\n\n\n\n{\\displaystyle G_{L}}\n\n, the vertices with labels in red are the values \n\n\n\ndist\n⁡\n(\nv\n)\n\n\n{\\displaystyle \\operatorname {dist} (v)}\n\n. The paths in blue form a blocking flow.\nThe blocking flow consists of\nTherefore, the blocking flow is of 14 units and the value of flow \n\n\n\n\n|\n\nf\n\n|\n\n\n\n{\\displaystyle |f|}\n\n is 14. Note that each augmenting path in the blocking flow has 3 edges.\nThe blocking flow consists of\nTherefore, the blocking flow is of 5 units and the value of flow \n\n\n\n\n|\n\nf\n\n|\n\n\n\n{\\displaystyle |f|}\n\n is 14 + 5 = 19. Note that each augmenting path has 4 edges.\nSince \n\n\n\nt\n\n\n{\\displaystyle t}\n\n cannot be reached in \n\n\n\n\nG\n\nf\n\n\n\n\n{\\displaystyle G_{f}}\n\n, the algorithm terminates and returns a flow with maximum value of 19. Note that in each blocking flow, the number of edges in the augmenting path increases by at least 1.", 
    "dbpedia_url": "http://dbpedia.org/resource/Dinic's_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Dinic's_algorithm\n"
}