{
    "about": "In mathematics, a Dirac comb (also known as an impulse train and sampling function in electrical engineering) is a periodic tempered distribution[1][2] constructed from Dirac delta functions", 
    "name": "Dirac Comb", 
    "classification": "Signal Processing", 
    "full_text": "In mathematics, a Dirac comb (also known as an impulse train and sampling function in electrical engineering) is a periodic tempered distribution[1][2] constructed from Dirac delta functions\nfor some given period T. The symbol \n\n\n\nIII\n⁡\n(\nt\n)\n\n\n{\\displaystyle \\operatorname {III} (t)}\n\n, where the period is omitted, represents a Dirac comb of unit period. Some authors, notably Bracewell as well as some textbook authors in electrical engineering and circuit theory, refer to it as the Shah function (possibly because its graph resembles the shape of the Cyrillic letter sha Ш). Because the Dirac comb function is periodic, it can be represented as a Fourier series:\nThe Dirac comb function allows one to represent both continuous and discrete phenomena, such as sampling and aliasing, in a single framework of continuous Fourier analysis on Schwartz distributions, without any reference to Fourier series. Owing to the Poisson summation formula, in signal processing, the Dirac comb allows modelling sampling via multiplication with it, but it also allows modelling periodization via convolution with it.[3]\n\n\nThe Dirac comb can be constructed in two ways, either by using the comb operator (performing sampling) applied to the function that is constantly \n\n\n\n1\n\n\n{\\displaystyle 1}\n\n, or, alternatively, by using the rep operator (performing periodization) applied to the Dirac delta \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n. Formally, this yields\nwhere\nIn signal processing, this property on one hand allows sampling a function \n\n\n\nf\n(\nt\n)\n\n\n{\\displaystyle f(t)}\n\n via multiplication with \n\n\n\n\nIII\n\nT\n\n\n\n\n{\\displaystyle \\operatorname {III} _{T}}\n\n, and on the other hand it also allows the periodization of \n\n\n\nf\n(\nt\n)\n\n\n{\\displaystyle f(t)}\n\n via convolution with \n\n\n\n\nIII\n\nT\n\n\n\n\n{\\displaystyle \\operatorname {III} _{T}}\n\n (Bracewell 1986).\nThe scaling property of the Dirac comb follows from the properties of the Dirac delta function. Since   \n\n\n\nδ\n(\nt\n)\n=\n\n\n1\na\n\n\n\n\nδ\n\n(\n\n\nt\na\n\n\n)\n\n\n\n{\\displaystyle \\delta (t)={\\frac {1}{a}}\\,\\,\\delta \\left({\\frac {t}{a}}\\right)}\n\n[4] for positive real numbers \n\n\n\na\n\n\n{\\displaystyle a}\n\n, it follows that:\nNote that requiring positive scaling numbers \n\n\n\na\n\n\n{\\displaystyle a}\n\n instead of negative ones is no restriction because the negative sign would only reverse the summation within \n\n\n\n\nIII\n\nT\n\n\n\n\n{\\displaystyle \\operatorname {III} _{T}}\n\n but not the result of the summation.\nIt is clear that \n\n\n\n \n\nIII\n\nT\n\n\n⁡\n(\nt\n)\n\n\n{\\displaystyle \\ \\operatorname {III} _{T}(t)}\n\n is periodic with period \n\n\n\nT\n \n\n\n{\\displaystyle T\\ }\n\n. That is\nfor all t. The complex Fourier series for such a periodic function is\nwhere the Fourier coefficients, cn are\nAll Fourier coefficients are 1/T resulting in\nThe Fourier transform of a Dirac comb is also a Dirac comb. This is evident when one considers that all the Fourier components add constructively whenever \n\n\n\nf\n\n\n{\\displaystyle f}\n\n is an integer multiple of \n\n\n\n\n\n1\nT\n\n\n\n\n{\\displaystyle {\\frac {1}{T}}}\n\n.\nUnitary transform to ordinary frequency domain (Hz):\nNotably, the unit period Dirac comb transforms to itself:\nUnitary transform to angular frequency domain (radian/s):\nMultiplying any function by a Dirac comb transforms it into a train of impulses with integrals equal to the value of the function at the nodes of the comb. This operation is frequently used to represent sampling.\nDue to the self-transforming property of the Dirac comb and the convolution theorem, this corresponds to convolution with the Dirac comb in the frequency domain.\nSince convolution with a delta function \n\n\n\nδ\n(\nt\n−\nk\nT\n)\n\n\n{\\displaystyle \\delta (t-kT)}\n\n is equivalent to shifting the function by \n\n\n\nk\nT\n\n\n{\\displaystyle kT}\n\n, convolution with the Dirac comb corresponds to replication or periodic summation:\nThis leads to a natural formulation of the Nyquist-Shannon sampling theorem. If the spectrum of the function \n\n\n\nx\n\n\n{\\displaystyle x}\n\n contains no frequencies higher than B (i.e., its spectrum is nonzero only in the interval \n\n\n\n(\n−\nB\n,\nB\n)\n\n\n{\\displaystyle (-B,B)}\n\n) then samples of the original function at intervals \n\n\n\n1\n\n/\n\n2\nB\n\n\n{\\displaystyle 1/2B}\n\n are sufficient to reconstruct the original signal. It suffices to multiply the spectrum of the sampled function by a suitable rectangle function, which is equivalent to applying a brick-wall lowpass filter.\nIn the time domain, this multiplication is equivalent to convolving a sinc function with the samples of the signal, leading to the Whittaker–Shannon interpolation formula.\nIn directional statistics, the Dirac comb of period 2π is equivalent to a wrapped Dirac delta function, and is the analog of the Dirac delta function in linear statistics.\nIn linear statistics, the random variable (x) is usually distributed over the real number line, or some subset thereof, and the probability density of x is a function whose domain is the set real numbers, and whose integral from \n\n\n\n−\n∞\n\n\n{\\displaystyle -\\infty }\n\n to \n\n\n\n+\n∞\n\n\n{\\displaystyle +\\infty }\n\n is unity. In directional statistics, the random variable (θ) is distributed over the unit circle and the probability density of θ is a function whose domain is some interval of the real numbers of length 2π and whose integral over that interval is unity. Just as the integral of the product of a Dirac delta function with an arbitrary function over the real number line yields the value of that function at zero, so the integral of the product of a Dirac comb of period 2π with an arbitrary function of period 2π over the unit circle yields the value of that function at zero.\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Dirac_comb", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Dirac_comb\n"
}