{
    "about": "In numerical analysis, computational physics, and simulation, discretization error is the error resulting from the fact that a function of a continuous variable is represented in the computer by a finite number of evaluations, for example, on a lattice. Discretization error can usually be reduced by using a more finely spaced lattice, with an increased computational cost.", 
    "name": "Discretization Error", 
    "classification": "Numerical Analysis", 
    "full_text": "In numerical analysis, computational physics, and simulation, discretization error is the error resulting from the fact that a function of a continuous variable is represented in the computer by a finite number of evaluations, for example, on a lattice. Discretization error can usually be reduced by using a more finely spaced lattice, with an increased computational cost.\n\n\nDiscretization error is the principal source of error in methods of finite differences and the pseudo-spectral method of computational physics.\nWhen we define the derivative of \n\n\n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle \\,\\!f(x)}\n\n as \n\n\n\n\nf\n′\n\n(\nx\n)\n=\n\nlim\n\nh\n→\n0\n\n\n\n\n\nf\n(\nx\n+\nh\n)\n−\nf\n(\nx\n)\n\nh\n\n\n\n\n{\\displaystyle f'(x)=\\lim _{h\\rightarrow 0}{\\frac {f(x+h)-f(x)}{h}}}\n\n or \n\n\n\n\nf\n′\n\n(\nx\n)\n≈\n\n\n\nf\n(\nx\n+\nh\n)\n−\nf\n(\nx\n)\n\nh\n\n\n\n\n{\\displaystyle f'(x)\\approx {\\frac {f(x+h)-f(x)}{h}}}\n\n, where \n\n\n\n\n\nh\n\n\n{\\displaystyle \\,\\!h}\n\n is a finitely small number, the difference between the first formula and this approximation is known as discretization error.\nIn signal processing, the analog of discretization is sampling, and results in no loss if the conditions of the sampling theorem are satisfied, otherwise the resulting error is called aliasing.\nDiscretization error, which arises from finite resolution in the domain, should not be confused with quantization error, which is finite resolution in the range (values), nor in round-off error arising from floating point arithmetic. Discretization error would occur even if it were possible to represent the values exactly and use exact arithmetic – it is the error from representing a function by its values at a discrete set of points, not an error in these values.[1]", 
    "dbpedia_url": "http://dbpedia.org/resource/Discretization_error", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Discretization_error\n"
}