{
    "about": "In mathematics, the discrete Fourier transform (DFT) converts a finite sequence of equally-spaced samples of a function into an equivalent-length sequence of equally-spaced samples of the discrete-time Fourier transform (DTFT), which is a complex-valued function of frequency. The interval at which the DTFT is sampled is the reciprocal of the duration of the input sequence. An inverse DFT is a Fourier series, using the DTFT samples as coefficients of complex sinusoids at the corresponding DTFT frequencies. It has the same sample-values as the original input sequence. The DFT is therefore said to be a frequency domain representation of the original input sequence. If the original sequence spans all the non-zero values of a function, its DTFT is continuous (and periodic), and the DFT provides discrete samples of one cycle. If the original sequence is one cycle of a periodic function, the DFT provides all the non-zero values of one DTFT cycle.", 
    "name": "Discrete Fourier Transform", 
    "classification": "Digital Signal Processing", 
    "full_text": "In mathematics, the discrete Fourier transform (DFT) converts a finite sequence of equally-spaced samples of a function into an equivalent-length sequence of equally-spaced samples of the discrete-time Fourier transform (DTFT), which is a complex-valued function of frequency. The interval at which the DTFT is sampled is the reciprocal of the duration of the input sequence. An inverse DFT is a Fourier series, using the DTFT samples as coefficients of complex sinusoids at the corresponding DTFT frequencies. It has the same sample-values as the original input sequence. The DFT is therefore said to be a frequency domain representation of the original input sequence. If the original sequence spans all the non-zero values of a function, its DTFT is continuous (and periodic), and the DFT provides discrete samples of one cycle. If the original sequence is one cycle of a periodic function, the DFT provides all the non-zero values of one DTFT cycle.\nThe DFT is the most important discrete transform, used to perform Fourier analysis in many practical applications.[1] In digital signal processing, the function is any quantity or signal that varies over time, such as the pressure of a sound wave, a radio signal, or daily temperature readings, sampled over a finite time interval (often defined by a window function[2]). In image processing, the samples can be the values of pixels along a row or column of a raster image. The DFT is also used to efficiently solve partial differential equations, and to perform other operations such as convolutions or multiplying large integers.\nSince it deals with a finite amount of data, it can be implemented in computers by numerical algorithms or even dedicated hardware. These implementations usually employ efficient fast Fourier transform (FFT) algorithms;[3] so much so that the terms \"FFT\" and \"DFT\" are often used interchangeably. Prior to its current usage, the \"FFT\" initialism may have also been used for the ambiguous term \"finite Fourier transform\".\n\n\nThe sequence of N complex numbers \n\n\n\n\nx\n\n0\n\n\n,\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nN\n−\n1\n\n\n\n\n{\\displaystyle x_{0},x_{1},\\ldots ,x_{N-1}}\n\n is transformed into an N-periodic sequence of complex numbers:\n\n\n\n\n\nX\n\nk\n\n\n \n\n\n\n\n=\n\n\ndef\n\n\n\n\n \n\n∑\n\nn\n=\n0\n\n\nN\n−\n1\n\n\n\nx\n\nn\n\n\n⋅\n\ne\n\n−\n2\nπ\ni\nk\nn\n\n/\n\nN\n\n\n,\n\nk\n∈\n\nZ\n\n\n\n\n{\\displaystyle X_{k}\\ {\\stackrel {\\text{def}}{=}}\\ \\sum _{n=0}^{N-1}x_{n}\\cdot e^{-2\\pi ikn/N},\\quad k\\in \\mathbb {Z} \\,}\n\n (integers)   [note 1]\n\n \n \n \n \n(Eq.1)\nBecause of periodicity, the customary domain of k actually computed is [0, N − 1]. That is always the case when the DFT is implemented via the Fast Fourier transform algorithm. But other common domains are  [−N/2, N/2 − 1]  (N even)  and  [−(N − 1)/2, (N − 1)/2]  (N odd), as when the left and right halves of an FFT output sequence are swapped.[4]\nThe transform is sometimes denoted by the symbol \n\n\n\n\n\nF\n\n\n\n\n{\\displaystyle {\\mathcal {F}}}\n\n, as in \n\n\n\n\nX\n\n=\n\n\nF\n\n\n\n{\n\nx\n\n}\n\n\n\n{\\displaystyle \\mathbf {X} ={\\mathcal {F}}\\left\\{\\mathbf {x} \\right\\}}\n\n or \n\n\n\n\n\nF\n\n\n\n(\n\nx\n\n)\n\n\n\n{\\displaystyle {\\mathcal {F}}\\left(\\mathbf {x} \\right)}\n\n or \n\n\n\n\n\nF\n\n\n\nx\n\n\n\n{\\displaystyle {\\mathcal {F}}\\mathbf {x} }\n\n.[note 2]\nEq.1 can be interpreted or derived in various ways, for example:\n\n\n\n\n\nx\n\nn\n\n\n=\n\n\n1\nN\n\n\n\n∑\n\nk\n=\n0\n\n\nN\n−\n1\n\n\n\nX\n\nk\n\n\n⋅\n\ne\n\n2\nπ\ni\nk\nn\n\n/\n\nN\n\n\n,\n\nn\n∈\n\nZ\n\n\n\n\n{\\displaystyle x_{n}={\\frac {1}{N}}\\sum _{k=0}^{N-1}X_{k}\\cdot e^{2\\pi ikn/N},\\quad n\\in \\mathbb {Z} \\,}\n\n\n\n \n \n \n \n(Eq.2)\nThe normalization factor multiplying the DFT and IDFT (here 1 and 1/N) and the signs of the exponents are merely conventions, and differ in some treatments. The only requirements of these conventions are that the DFT and IDFT have opposite-sign exponents and that the product of their normalization factors be 1/N.  A normalization of \n\n\n\n\n\n\n1\n\n/\n\nN\n\n\n\n\n\n{\\displaystyle \\scriptstyle {\\sqrt {1/N}}}\n\n for both the DFT and IDFT, for instance, makes the transforms unitary.\nIn the following discussion the terms \"sequence\" and \"vector\" will be considered interchangeable.\nUsing Euler's formula, the DFT formulae can be converted to the trigonometric forms sometimes used in engineering and computer science:\nFourier Transform:\n\n\n\n\n\nX\n\nk\n\n\n=\n\n∑\n\nn\n=\n0\n\n\nN\n−\n1\n\n\n\nx\n\nn\n\n\n⋅\n(\ncos\n⁡\n(\n−\n2\nπ\nk\n\n\nn\nN\n\n\n)\n+\ni\nsin\n⁡\n(\n−\n2\nπ\nk\n\n\nn\nN\n\n\n)\n)\n,\n\nk\n∈\n\nZ\n\n\n\n\n{\\displaystyle X_{k}=\\sum _{n=0}^{N-1}x_{n}\\cdot (\\cos(-2\\pi k{\\frac {n}{N}})+i\\sin(-2\\pi k{\\frac {n}{N}})),\\quad k\\in \\mathbb {Z} \\,}\n\n\n\n \n \n \n \n(Eq.3)\nInverse Fourier Transform:\n\n\n\n\n\nx\n\nn\n\n\n=\n\n\n1\nN\n\n\n\n∑\n\nk\n=\n0\n\n\nN\n−\n1\n\n\n\nX\n\nk\n\n\n⋅\n(\ncos\n⁡\n(\n2\nπ\nk\n\n\nn\nN\n\n\n)\n+\ni\nsin\n⁡\n(\n2\nπ\nk\n\n\nn\nN\n\n\n)\n)\n,\n\nn\n∈\n\nZ\n\n\n\n\n{\\displaystyle x_{n}={\\frac {1}{N}}\\sum _{k=0}^{N-1}X_{k}\\cdot (\\cos(2\\pi k{\\frac {n}{N}})+i\\sin(2\\pi k{\\frac {n}{N}})),\\quad n\\in \\mathbb {Z} \\,}\n\n\n\n \n \n \n \n(Eq.4)\nThe discrete Fourier transform is an invertible, linear transformation\nwith \n\n\n\n\nC\n\n\n\n{\\displaystyle \\mathbb {C} }\n\n denoting the set of complex numbers. In other words, for any N > 0, an N-dimensional complex vector has a DFT and an IDFT which are in turn N-dimensional complex vectors.\nThe vectors \n\n\n\n\nu\n\nk\n\n\n=\n\n\n[\n\ne\n\n\n\n\n2\nπ\ni\n\nN\n\n\nk\nn\n\n\n\n\n|\n\n\nn\n=\n0\n,\n1\n,\n…\n,\nN\n−\n1\n]\n\n\nT\n\n\n\n\n{\\displaystyle u_{k}=\\left[e^{{\\frac {2\\pi i}{N}}kn}\\;|\\;n=0,1,\\ldots ,N-1\\right]^{T}}\n\n form an orthogonal basis over the set of N-dimensional complex vectors:\nwhere \n\n\n\n \n\nδ\n\nk\n\nk\n′\n\n\n\n\n\n{\\displaystyle ~\\delta _{kk'}}\n\n is the Kronecker delta. (In the last step, the summation is trivial if \n\n\n\nk\n=\n\nk\n′\n\n\n\n{\\displaystyle k=k'}\n\n, where it is 1+1+⋅⋅⋅=N, and otherwise is a geometric series that can be explicitly summed to obtain zero.) This orthogonality condition can be used to derive the formula for the IDFT from the definition of the DFT, and is equivalent to the unitarity property below.\nIf Xk and Yk are the DFTs of xn and yn respectively then the Parseval's theorem states:\nwhere the star denotes complex conjugation. Plancherel theorem is a special case of the Parseval's theorem and states:\nThese theorems are also equivalent to the unitary condition below.\nThe periodicity can be shown directly from the definition:\nSimilarly, it can be shown that the IDFT formula leads to a periodic extension.\nMultiplying \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n by a linear phase \n\n\n\n\ne\n\n\n\n\n2\nπ\ni\n\nN\n\n\nn\nm\n\n\n\n\n{\\displaystyle e^{{\\frac {2\\pi i}{N}}nm}}\n\n for some integer m corresponds to a circular shift of the output \n\n\n\n\nX\n\nk\n\n\n\n\n{\\displaystyle X_{k}}\n\n: \n\n\n\n\nX\n\nk\n\n\n\n\n{\\displaystyle X_{k}}\n\n is replaced by \n\n\n\n\nX\n\nk\n−\nm\n\n\n\n\n{\\displaystyle X_{k-m}}\n\n, where the subscript is interpreted modulo N (i.e., periodically). Similarly, a circular shift of the input \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n corresponds to multiplying the output \n\n\n\n\nX\n\nk\n\n\n\n\n{\\displaystyle X_{k}}\n\n by a linear phase. Mathematically, if \n\n\n\n{\n\nx\n\nn\n\n\n}\n\n\n{\\displaystyle \\{x_{n}\\}}\n\n represents the vector x then\n \nThe convolution theorem for the discrete-time Fourier transform indicates that a convolution of two infinite sequences can be obtained as the inverse transform of the product of the individual transforms. An important simplification occurs when the sequences are of finite length, N. In terms of the DFT and inverse DFT, it can be written as follows:\nwhich is the convolution of the \n\n\n\n\nx\n\n\n\n{\\displaystyle \\mathbf {x} }\n\n sequence with a \n\n\n\n\ny\n\n\n\n{\\displaystyle \\mathbf {y} }\n\n sequence extended by periodic summation:\nSimilarly, the cross-correlation of  \n\n\n\n\nx\n\n\n\n{\\displaystyle \\mathbf {x} }\n\n  and  \n\n\n\n\n\ny\n\nN\n\n\n\n\n\n{\\displaystyle \\mathbf {y_{N}} }\n\n  is given by:\nWhen either sequence contains a string of zeros, of length L,  L+1 of the circular convolution outputs are equivalent to values of  \n\n\n\n\nx\n∗\ny\n\n.\n\n\n{\\displaystyle \\mathbf {x*y} .}\n\n  Methods have also been developed to use this property as part of an efficient process that constructs  \n\n\n\n\nx\n∗\ny\n\n\n\n{\\displaystyle \\mathbf {x*y} }\n\n  with an \n\n\n\n\nx\n\n\n\n{\\displaystyle \\mathbf {x} }\n\n or \n\n\n\n\ny\n\n\n\n{\\displaystyle \\mathbf {y} }\n\n sequence potentially much longer than the practical transform size (N). Two such methods are called overlap-save and overlap-add.[5] The efficiency results from the fact that a direct evaluation of either summation (above) requires \n\n\n\n\nO\n(\n\nN\n\n2\n\n\n)\n\n\n\n{\\displaystyle \\scriptstyle O(N^{2})}\n\n operations for an output sequence of length N.  An indirect method, using transforms, can take advantage of the \n\n\n\n\nO\n(\nN\nlog\n⁡\nN\n)\n\n\n\n{\\displaystyle \\scriptstyle O(N\\log N)}\n\n efficiency of the fast Fourier transform (FFT) to achieve much better performance. Furthermore, convolutions can be used to efficiently compute DFTs via Rader's FFT algorithm and Bluestein's FFT algorithm.\nIt can also be shown that:\nThe trigonometric interpolation polynomial\nwhere the coefficients Xk are given by the DFT of xn above, satisfies the interpolation property \n\n\n\np\n(\nn\n\n/\n\nN\n)\n=\n\nx\n\nn\n\n\n\n\n{\\displaystyle p(n/N)=x_{n}}\n\n for \n\n\n\nn\n=\n0\n,\n…\n,\nN\n−\n1\n\n\n{\\displaystyle n=0,\\ldots ,N-1}\n\n.\nFor even N, notice that the Nyquist component \n\n\n\n\n\n\nX\n\nN\n\n/\n\n2\n\n\nN\n\n\ncos\n⁡\n(\nN\nπ\nt\n)\n\n\n{\\displaystyle {\\frac {X_{N/2}}{N}}\\cos(N\\pi t)}\n\n is handled specially.\nThis interpolation is not unique: aliasing implies that one could add N to any of the complex-sinusoid frequencies (e.g. changing \n\n\n\n\ne\n\n−\ni\nt\n\n\n\n\n{\\displaystyle e^{-it}}\n\n to \n\n\n\n\ne\n\ni\n(\nN\n−\n1\n)\nt\n\n\n\n\n{\\displaystyle e^{i(N-1)t}}\n\n ) without changing the interpolation property, but giving different values in between the \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n points. The choice above, however, is typical because it has two useful properties. First, it consists of sinusoids whose frequencies have the smallest possible magnitudes: the interpolation is bandlimited. Second, if the \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n are real numbers, then \n\n\n\np\n(\nt\n)\n\n\n{\\displaystyle p(t)}\n\n is real as well.\nIn contrast, the most obvious trigonometric interpolation polynomial is the one in which the frequencies range from 0 to \n\n\n\nN\n−\n1\n\n\n{\\displaystyle N-1}\n\n (instead of roughly \n\n\n\n−\nN\n\n/\n\n2\n\n\n{\\displaystyle -N/2}\n\n to \n\n\n\n+\nN\n\n/\n\n2\n\n\n{\\displaystyle +N/2}\n\n as above), similar to the inverse DFT formula. This interpolation does not minimize the slope, and is not generally real-valued for real \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n; its use is a common mistake.\nAnother way of looking at the DFT is to note that in the above discussion, the DFT can be expressed as the DFT matrix, a Vandermonde matrix, introduced by Sylvester in 1867,\nwhere\nis a primitive Nth root of unity.\nThe inverse transform is then given by the inverse of the above matrix,\nWith unitary normalization constants \n\n\n\n1\n\n/\n\n\n\nN\n\n\n\n\n{\\displaystyle 1/{\\sqrt {N}}}\n\n, the DFT becomes a unitary transformation, defined by a unitary matrix:\nwhere det()  is the determinant function. The determinant is the product of the eigenvalues, which are always \n\n\n\n±\n1\n\n\n{\\displaystyle \\pm 1}\n\n or \n\n\n\n±\ni\n\n\n{\\displaystyle \\pm i}\n\n as described below. In a real vector space, a unitary transformation can be thought of as simply a rigid rotation of the coordinate system, and all of the properties of a rigid rotation can be found in the unitary DFT.\nThe orthogonality of the DFT is now expressed as an orthonormality condition (which arises in many areas of mathematics as described in root of unity):\nIf X is defined as the unitary DFT of the vector x, then\nand the Plancherel theorem is expressed as\nIf we view the DFT as just a coordinate transformation which simply specifies the components of a vector in a new coordinate system, then the above is just the statement that the dot product of two vectors is preserved under a unitary DFT transformation. For the special case \n\n\n\n\nx\n\n=\n\ny\n\n\n\n{\\displaystyle \\mathbf {x} =\\mathbf {y} }\n\n, this implies that the length of a vector is preserved as well—this is just Parseval's theorem,\nA consequence of the circular convolution theorem is that the DFT matrix F diagonalizes any circulant matrix.\nA useful property of the DFT is that the inverse DFT can be easily expressed in terms of the (forward) DFT, via several well-known \"tricks\". (For example, in computations, it is often convenient to only implement a fast Fourier transform corresponding to one transform direction and then to get the other transform direction from the first.)\nFirst, we can compute the inverse DFT by reversing all but one of the inputs (Duhamel et al., 1988):\n(As usual, the subscripts are interpreted modulo N; thus, for \n\n\n\nn\n=\n0\n\n\n{\\displaystyle n=0}\n\n, we have \n\n\n\n\nx\n\nN\n−\n0\n\n\n=\n\nx\n\n0\n\n\n\n\n{\\displaystyle x_{N-0}=x_{0}}\n\n.)\nSecond, one can also conjugate the inputs and outputs:\nThird, a variant of this conjugation trick, which is sometimes preferable because it requires no modification of the data values, involves swapping real and imaginary parts (which can be done on a computer simply by modifying pointers). Define swap(\n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n) as \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n with its real and imaginary parts swapped—that is, if \n\n\n\n\nx\n\nn\n\n\n=\na\n+\nb\ni\n\n\n{\\displaystyle x_{n}=a+bi}\n\n then swap(\n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n) is \n\n\n\nb\n+\na\ni\n\n\n{\\displaystyle b+ai}\n\n. Equivalently, swap(\n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n) equals \n\n\n\ni\n\nx\n\nn\n\n\n∗\n\n\n\n\n{\\displaystyle ix_{n}^{*}}\n\n. Then\nThat is, the inverse transform is the same as the forward transform with the real and imaginary parts swapped for both input and output, up to a normalization (Duhamel et al., 1988).\nThe conjugation trick can also be used to define a new transform, closely related to the DFT, that is involutory—that is, which is its own inverse. In particular, \n\n\n\nT\n(\n\nx\n\n)\n=\n\n\nF\n\n\n(\n\n\nx\n\n\n∗\n\n\n)\n\n/\n\n\n\nN\n\n\n\n\n{\\displaystyle T(\\mathbf {x} )={\\mathcal {F}}(\\mathbf {x} ^{*})/{\\sqrt {N}}}\n\n is clearly its own inverse: \n\n\n\nT\n(\nT\n(\n\nx\n\n)\n)\n=\n\nx\n\n\n\n{\\displaystyle T(T(\\mathbf {x} ))=\\mathbf {x} }\n\n. A closely related involutory transformation (by a factor of (1+i) /√2) is \n\n\n\nH\n(\n\nx\n\n)\n=\n\n\nF\n\n\n(\n(\n1\n+\ni\n)\n\n\nx\n\n\n∗\n\n\n)\n\n/\n\n\n\n2\nN\n\n\n\n\n{\\displaystyle H(\\mathbf {x} )={\\mathcal {F}}((1+i)\\mathbf {x} ^{*})/{\\sqrt {2N}}}\n\n, since the \n\n\n\n(\n1\n+\ni\n)\n\n\n{\\displaystyle (1+i)}\n\n factors in \n\n\n\nH\n(\nH\n(\n\nx\n\n)\n)\n\n\n{\\displaystyle H(H(\\mathbf {x} ))}\n\n cancel the 2. For real inputs \n\n\n\n\nx\n\n\n\n{\\displaystyle \\mathbf {x} }\n\n, the real part of \n\n\n\nH\n(\n\nx\n\n)\n\n\n{\\displaystyle H(\\mathbf {x} )}\n\n is none other than the discrete Hartley transform, which is also involutory.\nThe eigenvalues of the DFT matrix are simple and well-known, whereas the eigenvectors are complicated, not unique, and are the subject of ongoing research.\nConsider the unitary form \n\n\n\n\nU\n\n\n\n{\\displaystyle \\mathbf {U} }\n\n defined above for the DFT of length N, where\nThis matrix satisfies the matrix polynomial equation:\nThis can be seen from the inverse properties above: operating \n\n\n\n\nU\n\n\n\n{\\displaystyle \\mathbf {U} }\n\n twice gives the original data in reverse order, so operating \n\n\n\n\nU\n\n\n\n{\\displaystyle \\mathbf {U} }\n\n four times gives back the original data and is thus the identity matrix. This means that the eigenvalues \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n satisfy the equation:\nTherefore, the eigenvalues of \n\n\n\n\nU\n\n\n\n{\\displaystyle \\mathbf {U} }\n\n are the fourth roots of unity: \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n is +1, −1, +i, or −i.\nSince there are only four distinct eigenvalues for this \n\n\n\nN\n×\nN\n\n\n{\\displaystyle N\\times N}\n\n matrix, they have some multiplicity. The multiplicity gives the number of linearly independent eigenvectors corresponding to each eigenvalue. (Note that there are N independent eigenvectors; a unitary matrix is never defective.)\nThe problem of their multiplicity was solved by McClellan and Parks (1972), although it was later shown to have been equivalent to a problem solved by Gauss (Dickinson and Steiglitz, 1982). The multiplicity depends on the value of N modulo 4, and is given by the following table:\nOtherwise stated, the characteristic polynomial of \n\n\n\n\nU\n\n\n\n{\\displaystyle \\mathbf {U} }\n\n is:\nNo simple analytical formula for general eigenvectors is known. Moreover, the eigenvectors are not unique because any linear combination of eigenvectors for the same eigenvalue is also an eigenvector for that eigenvalue. Various researchers have proposed different choices of eigenvectors, selected to satisfy useful properties like orthogonality and to have \"simple\" forms (e.g., McClellan and Parks, 1972; Dickinson and Steiglitz, 1982; Grünbaum, 1982; Atakishiyev and Wolf, 1997; Candan et al., 2000; Hanna et al., 2004; Gurevich and Hadani, 2008).\nA straightforward approach is to discretize an eigenfunction of the continuous Fourier transform, of which the most famous is the Gaussian function. Since periodic summation of the function means discretizing its frequency spectrum and discretization means periodic summation of the spectrum, the discretized and periodically summed Gaussian function yields an eigenvector of the discrete transform:\nTwo other simple closed-form analytical eigenvectors for special DFT period N were found (Kong, 2008):\nFor DFT period N = 2L + 1 = 4K +1, where K is an integer, the following is an eigenvector of DFT:\nFor DFT period N = 2L = 4K, where K is an integer, the following is an eigenvector of DFT:\nThe choice of eigenvectors of the DFT matrix has become important in recent years in order to define a discrete analogue of the fractional Fourier transform—the DFT matrix can be taken to fractional powers by exponentiating the eigenvalues (e.g., Rubio and Santhanam, 2005). For the continuous Fourier transform, the natural orthogonal eigenfunctions are the Hermite functions, so various discrete analogues of these have been employed as the eigenvectors of the DFT, such as the Kravchuk polynomials (Atakishiyev and Wolf, 1997). The \"best\" choice of eigenvectors to define a fractional discrete Fourier transform remains an open question, however.\nIf the random variable Xk is constrained by\nthen\nmay be considered to represent a discrete probability mass function of n, with an associated probability mass function constructed from the transformed variable,\nFor the case of continuous functions \n\n\n\nP\n(\nx\n)\n\n\n{\\displaystyle P(x)}\n\n and \n\n\n\nQ\n(\nk\n)\n\n\n{\\displaystyle Q(k)}\n\n, the Heisenberg uncertainty principle states that\nwhere \n\n\n\n\nD\n\n0\n\n\n(\nX\n)\n\n\n{\\displaystyle D_{0}(X)}\n\n and \n\n\n\n\nD\n\n0\n\n\n(\nx\n)\n\n\n{\\displaystyle D_{0}(x)}\n\n are the variances of \n\n\n\n\n|\n\nX\n\n\n|\n\n\n2\n\n\n\n\n{\\displaystyle |X|^{2}}\n\n and \n\n\n\n\n|\n\nx\n\n\n|\n\n\n2\n\n\n\n\n{\\displaystyle |x|^{2}}\n\n respectively, with the equality attained in the case of a suitably normalized Gaussian distribution. Although the variances may be analogously defined for the DFT, an analogous uncertainty principle is not useful, because the uncertainty will not be shift-invariant. Still, a meaningful uncertainty principle has been introduced by Massar and Spindel.[6]\nHowever, the Hirschman entropic uncertainty will have a useful analog for the case of the DFT.[7] The Hirschman uncertainty principle is expressed in terms of the Shannon entropy of the two probability functions.\nIn the discrete case, the Shannon entropies are defined as\nand\nand the entropic uncertainty principle becomes[7]\nThe equality is obtained for \n\n\n\n\nP\n\nn\n\n\n\n\n{\\displaystyle P_{n}}\n\n equal to translations and modulations of a suitably normalized Kronecker comb of period \n\n\n\nA\n\n\n{\\displaystyle A}\n\n where \n\n\n\nA\n\n\n{\\displaystyle A}\n\n is any exact integer divisor of \n\n\n\nN\n\n\n{\\displaystyle N}\n\n. The probability mass function \n\n\n\n\nQ\n\nm\n\n\n\n\n{\\displaystyle Q_{m}}\n\n will then be proportional to a suitably translated Kronecker comb of period \n\n\n\nB\n=\nN\n\n/\n\nA\n\n\n{\\displaystyle B=N/A}\n\n.[7]\nThere is also a well-known deterministic uncertainty principle that uses signal sparsity (or the number of non-zero coefficients).[8] Let \n\n\n\n∥\nx\n\n∥\n\n0\n\n\n\n\n{\\displaystyle \\|x\\|_{0}}\n\n and \n\n\n\n∥\nX\n\n∥\n\n0\n\n\n\n\n{\\displaystyle \\|X\\|_{0}}\n\n be the number of non-zero elements of the time and frequency sequences \n\n\n\n\nx\n\n0\n\n\n,\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nN\n−\n1\n\n\n\n\n{\\displaystyle x_{0},x_{1},\\ldots ,x_{N-1}}\n\n and \n\n\n\n\nX\n\n0\n\n\n,\n\nX\n\n1\n\n\n,\n…\n,\n\nX\n\nN\n−\n1\n\n\n\n\n{\\displaystyle X_{0},X_{1},\\ldots ,X_{N-1}}\n\n, respectively. Then,\nAs an immediate consequence of the inequality of arithmetic and geometric means, one also has \n\n\n\n2\n\n\nN\n\n\n≤\n∥\nx\n\n∥\n\n0\n\n\n+\n∥\nX\n\n∥\n\n0\n\n\n\n\n{\\displaystyle 2{\\sqrt {N}}\\leq \\|x\\|_{0}+\\|X\\|_{0}}\n\n. Both uncertainty principles were shown to be tight for specifically-chosen \"picket-fence\" sequences (discrete impulse trains), and find practical use for signal recovery applications.[8]\nIf \n\n\n\n\nx\n\n0\n\n\n,\n…\n,\n\nx\n\nN\n−\n1\n\n\n\n\n{\\displaystyle x_{0},\\ldots ,x_{N-1}}\n\n are real numbers, as they often are in practical applications, then the DFT obeys the symmetry:\nIt follows that X0 and XN/2 are real-valued, and the remainder of the DFT is completely specified by just N/2-1 complex numbers.\nIt is possible to shift the transform sampling in time and/or frequency domain by some real shifts a and b, respectively. This is sometimes known as a generalized DFT (or GDFT), also called the shifted DFT or offset DFT, and has analogous properties to the ordinary DFT:\nMost often, shifts of \n\n\n\n1\n\n/\n\n2\n\n\n{\\displaystyle 1/2}\n\n (half a sample) are used. While the ordinary DFT corresponds to a periodic signal in both time and frequency domains, \n\n\n\na\n=\n1\n\n/\n\n2\n\n\n{\\displaystyle a=1/2}\n\n produces a signal that is anti-periodic in frequency domain (\n\n\n\n\nX\n\nk\n+\nN\n\n\n=\n−\n\nX\n\nk\n\n\n\n\n{\\displaystyle X_{k+N}=-X_{k}}\n\n) and vice versa for \n\n\n\nb\n=\n1\n\n/\n\n2\n\n\n{\\displaystyle b=1/2}\n\n. Thus, the specific case of \n\n\n\na\n=\nb\n=\n1\n\n/\n\n2\n\n\n{\\displaystyle a=b=1/2}\n\n is known as an odd-time odd-frequency discrete Fourier transform (or O2 DFT). Such shifted transforms are most often used for symmetric data, to represent different boundary symmetries, and for real-symmetric data they correspond to different forms of the discrete cosine and sine transforms.\nAnother interesting choice is \n\n\n\na\n=\nb\n=\n−\n(\nN\n−\n1\n)\n\n/\n\n2\n\n\n{\\displaystyle a=b=-(N-1)/2}\n\n, which is called the centered DFT (or CDFT). The centered DFT has the useful property that, when N is a multiple of four, all four of its eigenvalues (see above) have equal multiplicities (Rubio and Santhanam, 2005)[9]\nThe term GDFT is also used for the non-linear phase extensions of DFT. Hence, GDFT method provides a generalization for constant amplitude orthogonal block transforms including linear and non-linear phase types. GDFT is a framework to improve time and frequency domain properties of the traditional DFT, e.g. auto/cross-correlations, by the addition of the properly designed phase shaping function (non-linear, in general) to the original linear phase functions (Akansu and Agirman-Tosun, 2010).[10]\nThe discrete Fourier transform can be viewed as a special case of the z-transform, evaluated on the unit circle in the complex plane; more general z-transforms correspond to complex shifts a and b above.\nThe ordinary DFT transforms a one-dimensional sequence or array \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n that is a function of exactly one discrete variable n. The multidimensional DFT of a multidimensional array \n\n\n\n\nx\n\n\nn\n\n1\n\n\n,\n\nn\n\n2\n\n\n,\n…\n,\n\nn\n\nd\n\n\n\n\n\n\n{\\displaystyle x_{n_{1},n_{2},\\dots ,n_{d}}}\n\n that is a function of d discrete variables \n\n\n\n\nn\n\nℓ\n\n\n=\n0\n,\n1\n,\n…\n,\n\nN\n\nℓ\n\n\n−\n1\n\n\n{\\displaystyle n_{\\ell }=0,1,\\dots ,N_{\\ell }-1}\n\n for \n\n\n\nℓ\n\n\n{\\displaystyle \\ell }\n\n in \n\n\n\n1\n,\n2\n,\n…\n,\nd\n\n\n{\\displaystyle 1,2,\\dots ,d}\n\n is defined by:\nwhere \n\n\n\n\nω\n\n\nN\n\nℓ\n\n\n\n\n=\nexp\n⁡\n(\n−\n2\nπ\ni\n\n/\n\n\nN\n\nℓ\n\n\n)\n\n\n{\\displaystyle \\omega _{N_{\\ell }}=\\exp(-2\\pi i/N_{\\ell })}\n\n as above and the d output indices run from \n\n\n\n\nk\n\nℓ\n\n\n=\n0\n,\n1\n,\n…\n,\n\nN\n\nℓ\n\n\n−\n1\n\n\n{\\displaystyle k_{\\ell }=0,1,\\dots ,N_{\\ell }-1}\n\n. This is more compactly expressed in vector notation, where we define \n\n\n\n\nn\n\n=\n(\n\nn\n\n1\n\n\n,\n\nn\n\n2\n\n\n,\n…\n,\n\nn\n\nd\n\n\n)\n\n\n{\\displaystyle \\mathbf {n} =(n_{1},n_{2},\\dots ,n_{d})}\n\n and \n\n\n\n\nk\n\n=\n(\n\nk\n\n1\n\n\n,\n\nk\n\n2\n\n\n,\n…\n,\n\nk\n\nd\n\n\n)\n\n\n{\\displaystyle \\mathbf {k} =(k_{1},k_{2},\\dots ,k_{d})}\n\n as d-dimensional vectors of indices from 0 to \n\n\n\n\nN\n\n−\n1\n\n\n{\\displaystyle \\mathbf {N} -1}\n\n, which we define as \n\n\n\n\nN\n\n−\n1\n=\n(\n\nN\n\n1\n\n\n−\n1\n,\n\nN\n\n2\n\n\n−\n1\n,\n…\n,\n\nN\n\nd\n\n\n−\n1\n)\n\n\n{\\displaystyle \\mathbf {N} -1=(N_{1}-1,N_{2}-1,\\dots ,N_{d}-1)}\n\n:\nwhere the division \n\n\n\n\nn\n\n\n/\n\n\nN\n\n\n\n{\\displaystyle \\mathbf {n} /\\mathbf {N} }\n\n is defined as \n\n\n\n\nn\n\n\n/\n\n\nN\n\n=\n(\n\nn\n\n1\n\n\n\n/\n\n\nN\n\n1\n\n\n,\n…\n,\n\nn\n\nd\n\n\n\n/\n\n\nN\n\nd\n\n\n)\n\n\n{\\displaystyle \\mathbf {n} /\\mathbf {N} =(n_{1}/N_{1},\\dots ,n_{d}/N_{d})}\n\n to be performed element-wise, and the sum denotes the set of nested summations above.\nThe inverse of the multi-dimensional DFT is, analogous to the one-dimensional case, given by:\nAs the one-dimensional DFT expresses the input \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n as a superposition of sinusoids, the multidimensional DFT expresses the input as a superposition of plane waves, or multidimensional sinusoids. The direction of oscillation in space is \n\n\n\n\nk\n\n\n/\n\n\nN\n\n\n\n{\\displaystyle \\mathbf {k} /\\mathbf {N} }\n\n. The amplitudes are \n\n\n\n\nX\n\n\nk\n\n\n\n\n\n{\\displaystyle X_{\\mathbf {k} }}\n\n. This decomposition is of great importance for everything from digital image processing (two-dimensional) to solving partial differential equations. The solution is broken up into plane waves.\nThe multidimensional DFT can be computed by the composition of a sequence of one-dimensional DFTs along each dimension. In the two-dimensional case \n\n\n\n\nx\n\n\nn\n\n1\n\n\n,\n\nn\n\n2\n\n\n\n\n\n\n{\\displaystyle x_{n_{1},n_{2}}}\n\n the \n\n\n\n\nN\n\n1\n\n\n\n\n{\\displaystyle N_{1}}\n\n independent DFTs of the rows (i.e., along \n\n\n\n\nn\n\n2\n\n\n\n\n{\\displaystyle n_{2}}\n\n) are computed first to form a new array \n\n\n\n\ny\n\n\nn\n\n1\n\n\n,\n\nk\n\n2\n\n\n\n\n\n\n{\\displaystyle y_{n_{1},k_{2}}}\n\n. Then the \n\n\n\n\nN\n\n2\n\n\n\n\n{\\displaystyle N_{2}}\n\n independent DFTs of y along the columns (along \n\n\n\n\nn\n\n1\n\n\n\n\n{\\displaystyle n_{1}}\n\n) are computed to form the final result \n\n\n\n\nX\n\n\nk\n\n1\n\n\n,\n\nk\n\n2\n\n\n\n\n\n\n{\\displaystyle X_{k_{1},k_{2}}}\n\n. Alternatively the columns can be computed first and then the rows. The order is immaterial because the nested summations above commute.\nAn algorithm to compute a one-dimensional DFT is thus sufficient to efficiently compute a multidimensional DFT. This approach is known as the row-column algorithm. There are also intrinsically multidimensional FFT algorithms.\nFor input data \n\n\n\n\nx\n\n\nn\n\n1\n\n\n,\n\nn\n\n2\n\n\n,\n…\n,\n\nn\n\nd\n\n\n\n\n\n\n{\\displaystyle x_{n_{1},n_{2},\\dots ,n_{d}}}\n\n consisting of real numbers, the DFT outputs have a conjugate symmetry similar to the one-dimensional case above:\nwhere the star again denotes complex conjugation and the \n\n\n\nℓ\n\n\n{\\displaystyle \\ell }\n\n-th subscript is again interpreted modulo \n\n\n\n\nN\n\nℓ\n\n\n\n\n{\\displaystyle N_{\\ell }}\n\n (for \n\n\n\nℓ\n=\n1\n,\n2\n,\n…\n,\nd\n\n\n{\\displaystyle \\ell =1,2,\\ldots ,d}\n\n).\nThe DFT has seen wide usage across a large number of fields; we only sketch a few examples below (see also the references at the end). All applications of the DFT depend crucially on the availability of a fast algorithm to compute discrete Fourier transforms and their inverses, a fast Fourier transform.\nWhen the DFT is used for signal spectral analysis, the \n\n\n\n{\n\nx\n\nn\n\n\n}\n\n\n\n{\\displaystyle \\{x_{n}\\}\\,}\n\n sequence usually represents a finite set of uniformly spaced time-samples of some signal \n\n\n\nx\n(\nt\n)\n\n\n\n{\\displaystyle x(t)\\,}\n\n, where t represents time. The conversion from continuous time to samples (discrete-time) changes the underlying Fourier transform of x(t) into a discrete-time Fourier transform (DTFT), which generally entails a type of distortion called aliasing. Choice of an appropriate sample-rate (see Nyquist rate) is the key to minimizing that distortion. Similarly, the conversion from a very long (or infinite) sequence to a manageable size entails a type of distortion called leakage, which is manifested as a loss of detail (a.k.a. resolution) in the DTFT. Choice of an appropriate sub-sequence length is the primary key to minimizing that effect. When the available data (and time to process it) is more than the amount needed to attain the desired frequency resolution, a standard technique is to perform multiple DFTs, for example to create a spectrogram. If the desired result is a power spectrum and noise or randomness is present in the data, averaging the magnitude components of the multiple DFTs is a useful procedure to reduce the variance of the spectrum (also called a periodogram in this context); two examples of such techniques are the Welch method and the Bartlett method; the general subject of estimating the power spectrum of a noisy signal is called spectral estimation.\nA final source of distortion (or perhaps illusion) is the DFT itself, because it is just a discrete sampling of the DTFT, which is a function of a continuous frequency domain. That can be mitigated by increasing the resolution of the DFT. That procedure is illustrated at Sampling the DTFT.\nSee FFT filter banks and Sampling the DTFT.\nThe field of digital signal processing relies heavily on operations in the frequency domain (i.e. on the Fourier transform). For example, several lossy image and sound compression methods employ the discrete Fourier transform: the signal is cut into short segments, each is transformed, and then the Fourier coefficients of high frequencies, which are assumed to be unnoticeable, are discarded. The decompressor computes the inverse transform based on this reduced number of Fourier coefficients. (Compression applications often use a specialized form of the DFT, the discrete cosine transform or sometimes the modified discrete cosine transform.) Some relatively recent compression algorithms, however, use wavelet transforms, which give a more uniform compromise between time and frequency domain than obtained by chopping data into segments and transforming each segment. In the case of JPEG2000, this avoids the spurious image features that appear when images are highly compressed with the original JPEG.\nDiscrete Fourier transforms are often used to solve partial differential equations, where again the DFT is used as an approximation for the Fourier series (which is recovered in the limit of infinite N). The advantage of this approach is that it expands the signal in complex exponentials \n\n\n\n\ne\n\ni\nn\nx\n\n\n\n\n{\\displaystyle e^{inx}}\n\n, which are eigenfunctions of differentiation: \n\n\n\n\n\nd\n\n\n\n(\n\n\n\ne\n\ni\nn\nx\n\n\n\n\n)\n\n\n\n\n/\n\n\nd\n\nx\n=\ni\nn\n\ne\n\ni\nn\nx\n\n\n\n\n{\\displaystyle {{\\text{d}}{\\big (}e^{inx}{\\big )}}/{\\text{d}}x=ine^{inx}}\n\n. Thus, in the Fourier representation, differentiation is simple—we just multiply by \n\n\n\ni\nn\n\n\n{\\displaystyle in}\n\n. (Note, however, that the choice of \n\n\n\nn\n\n\n{\\displaystyle n}\n\n is not unique due to aliasing; for the method to be convergent, a choice similar to that in the trigonometric interpolation section above should be used.) A linear differential equation with constant coefficients is transformed into an easily solvable algebraic equation. One then uses the inverse DFT to transform the result back into the ordinary spatial representation. Such an approach is called a spectral method.\nSuppose we wish to compute the polynomial product c(x) = a(x) · b(x). The ordinary product expression for the coefficients of c involves a linear (acyclic) convolution, where indices do not \"wrap around.\" This can be rewritten as a cyclic convolution by taking the coefficient vectors for a(x) and b(x) with constant term first, then appending zeros so that the resultant coefficient vectors a and b have dimension d > deg(a(x)) + deg(b(x)). Then,\nWhere c is the vector of coefficients for c(x), and the convolution operator \n\n\n\n∗\n\n\n\n{\\displaystyle *\\,}\n\n is defined so\nBut convolution becomes multiplication under the DFT:\nHere the vector product is taken elementwise. Thus the coefficients of the product polynomial c(x) are just the terms 0, ..., deg(a(x)) + deg(b(x)) of the coefficient vector\nWith a fast Fourier transform, the resulting algorithm takes O (N log N) arithmetic operations. Due to its simplicity and speed, the Cooley–Tukey FFT algorithm, which is limited to composite sizes, is often chosen for the transform operation. In this case, d should be chosen as the smallest integer greater than the sum of the input polynomial degrees that is factorizable into small prime factors (e.g. 2, 3, and 5, depending upon the FFT implementation).\nThe fastest known algorithms for the multiplication of very large integers use the polynomial multiplication method outlined above. Integers can be treated as the value of a polynomial evaluated specifically at the number base, with the coefficients of the polynomial corresponding to the digits in that base. After polynomial multiplication, a relatively low-complexity carry-propagation step completes the multiplication.\nWhen data is convolved with a function with wide support, such as for downsampling by a large sampling ratio, because of the Convolution theorem and the FFT algorithm, it may be faster to transform it, multiply pointwise by the transform of the filter and then reverse transform it. Alternatively, a good filter is obtained by simply truncating the transformed data and re-transforming the shortened data set.\nThe DFT can be interpreted as the complex-valued representation theory of the finite cyclic group. In other words, a sequence of n complex numbers can be thought of as an element of n-dimensional complex space Cn or equivalently a function f from the finite cyclic group of order n to the complex numbers, Zn → C. So f is a class function on the finite cyclic group, and thus can be expressed as a linear combination of the irreducible characters of this group, which are the roots of unity.\nFrom this point of view, one may generalize the DFT to representation theory generally, or more narrowly to the representation theory of finite groups.\nMore narrowly still, one may generalize the DFT by either changing the target (taking values in a field other than the complex numbers), or the domain (a group other than a finite cyclic group), as detailed in the sequel.\nMany of the properties of the DFT only depend on the fact that \n\n\n\n\ne\n\n−\n\n\n\n2\nπ\ni\n\nN\n\n\n\n\n\n\n{\\displaystyle e^{-{\\frac {2\\pi i}{N}}}}\n\n is a primitive root of unity, sometimes denoted \n\n\n\n\nω\n\nN\n\n\n\n\n{\\displaystyle \\omega _{N}}\n\n or \n\n\n\n\nW\n\nN\n\n\n\n\n{\\displaystyle W_{N}}\n\n (so that \n\n\n\n\nω\n\nN\n\n\nN\n\n\n=\n1\n\n\n{\\displaystyle \\omega _{N}^{N}=1}\n\n). Such properties include the completeness, orthogonality, Plancherel/Parseval, periodicity, shift, convolution, and unitarity properties above, as well as many FFT algorithms. For this reason, the discrete Fourier transform can be defined by using roots of unity in fields other than the complex numbers, and such generalizations are commonly called number-theoretic transforms (NTTs) in the case of finite fields. For more information, see number-theoretic transform and discrete Fourier transform (general).\nThe standard DFT acts on a sequence x0, x1, …, xN−1 of complex numbers, which can be viewed as a function {0, 1, …, N − 1} → C. The multidimensional DFT acts on multidimensional sequences, which can be viewed as functions\nThis suggests the generalization to Fourier transforms on arbitrary finite groups, which act on functions G → C where G is a finite group. In this framework, the standard DFT is seen as the Fourier transform on a cyclic group, while the multidimensional DFT is a Fourier transform on a direct sum of cyclic groups.\nThere are various alternatives to the DFT for various applications, prominent among which are wavelets. The analog of the DFT is the discrete wavelet transform (DWT). From the point of view of time–frequency analysis, a key limitation of the Fourier transform is that it does not include location information, only frequency information, and thus has difficulty in representing transients. As wavelets have location as well as frequency, they are better able to represent location, at the expense of greater difficulty representing frequency. For details, see comparison of the discrete wavelet transform with the discrete Fourier transform.", 
    "dbpedia_url": "http://dbpedia.org/resource/Discrete_Fourier_transform", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Discrete_Fourier_transform\n"
}