{
    "about": "Discontinuous Deformation Analysis (DDA) is a type of discrete element method (DEM) originally proposed by Shi[1] in 1988. DDA is somewhat similar to the finite element method for solving stress-displacement problems, but accounts for the interaction of independent particles (blocks) along discontinuities in fractured and jointed rock masses. DDA is typically formulated as a work-energy method, and can be derived using the principle of Minimum Potential Energy[1] or by using Hamilton's principle. Once the equations of motion are discretized, a step-wise linear time marching scheme in the Newmark family is used for the solution of the equations of motion. The relation between adjacent blocks is governed by equations of contact interpenetration and accounts for friction. DDA adopts a stepwise approach to solve for the large displacements that accompany discontinuous movements between blocks. The blocks are said to be \"simply deformable\". Since the method accounts for the inertial forces of the blocks' mass, it can be used to solve the full dynamic problem of block motion.", 
    "name": "Discontinuous Deformation Analysis", 
    "classification": "Computational Physics", 
    "full_text": "Discontinuous Deformation Analysis (DDA) is a type of discrete element method (DEM) originally proposed by Shi[1] in 1988. DDA is somewhat similar to the finite element method for solving stress-displacement problems, but accounts for the interaction of independent particles (blocks) along discontinuities in fractured and jointed rock masses. DDA is typically formulated as a work-energy method, and can be derived using the principle of Minimum Potential Energy[1] or by using Hamilton's principle. Once the equations of motion are discretized, a step-wise linear time marching scheme in the Newmark family is used for the solution of the equations of motion. The relation between adjacent blocks is governed by equations of contact interpenetration and accounts for friction. DDA adopts a stepwise approach to solve for the large displacements that accompany discontinuous movements between blocks. The blocks are said to be \"simply deformable\". Since the method accounts for the inertial forces of the blocks' mass, it can be used to solve the full dynamic problem of block motion.\n\n\nAlthough DDA and DEM are similar in the sense that they both simulate the behavior of interacting discrete bodies, they are quite different theoretically. While DDA is a displacement method, DEM is a force method. While DDA uses displacement as variables in an implicit formulation with opening-closing iterations within each time step to achieve equilibrium of the blocks under constrains of the contact, DEM employs an explicit, time marching scheme to solve the equations of motion directly (Cundall and Hart[2]). The system of equation in DDA is derived from minimizing the total potential energy of the system being analyzed. This guarantee that equilibrium is satisfied at all times and that energy consumption is natural since it is due to frictional forces. In DEM, unbalanced forces drive the solution process, and damping is used to dissipate energy. If a quasi-static solution is desired in which the intermediate steps are not of interest, the type of damping and the type of relaxation scheme can be selected in DEM to obtain the most efficient solution method (Cundall[3]). The application of damping in DEM for quasi-static problem is somewhat analogues to the setting to zero of the initial velocities of the block in the static analysis of DDA. In dynamic problem, however, the amount and type of damping in DEM, which are very difficult to qualify experimentally, has to be selected very carefully to as not to damp out real vibrations. On the other hand, the energy consumption in DDA is due to the frictional resistance at contact. By passing the velocities of the blocks at the end of a time step to the next time step, DDA gives real dynamic solution with correct energy consumption.[1] By using an energy approach, DDA does not require an artificial damping term to dissipate energy as in DEM, and can easily incorporate other mechanisms for energy loss.\nDDA has several strengths recommending it for use in slope stability problems in jointed rock masses, which are balanced by serious limitations be accounted when DDA is used for larger scale, faster moving problems.\nthe stiffness \n\n\n\nk\n\n\n{\\displaystyle k}\n\n doesn't vary over 1 or 2 orders of magnitude, while the mass \n\n\n\nM\n\n\n{\\displaystyle M}\n\n is a function of the cube of the characteristic length.\nVarious modifications to the original DDA formulation have been reported in the rock mechanics literature. In the original DDA formulation a first order polynomial displacement function was assumed, so the stresses and strains within a block in the model were constant. This approximation precludes the application of this algorithm to problems with significant stress variations within the block. However, in cases where the displacement inside the block is high and cannot be ignored, the blocks can be divided by mesh. An example of this approach is the research by Chang et al.[4] and Jing[5] who resolved this problem by adding finite element meshes in the two-dimensional domain of the blocks so that stress variations within the blocks can be allowed.\nHigher order DDA method for two-dimensional problems has been developed in both theory and computer codes by researchers like Koo and Chern,[6] Ma et al.[7] and Hsiung.[8] Additionally, The DDA contact model which was originally based on penalty method was improved by adopting the Lagrange type approach reported by Lin et al.[9]\nSince a blocky system is a highly non-linear system due to non-linearity within blocks and between blocks, Chang et al.[4] implemented a material non-linearity model to DDA using strain hardening curves. Ma[10] developed a non-linear contact model for analysis of slope progressive failure including strain softening using the stress and strain curve.\nRecent progress in DDA algorithm is reported by Kim et al.[11] and Jing et al.[12] which considers coupling of fluid flow in fractures. The hydro-mechanical coupling across rock fracture surfaces is also taken into account. The program computes water pressure and seepage throughout the rock mass of interest. In its original formulation, a rock bolt was modeled as a line spring connecting two adjacent blocks. Later, Te-Chin Ke[13] suggested an improved bolt model, followed by the rudimentary formulation of lateral constraint of rock bolting.", 
    "dbpedia_url": "http://dbpedia.org/resource/Discontinuous_Deformation_Analysis", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Discontinuous_Deformation_Analysis\n"
}