{
    "about": "A discrete cosine transform (DCT) expresses a finite sequence of data points in terms of a sum of cosine functions oscillating at different frequencies. DCTs are important to numerous applications in science and engineering, from lossy compression of audio (e.g. MP3) and images (e.g. JPEG) (where small high-frequency components can be discarded), to spectral methods for the numerical solution of partial differential equations. The use of cosine rather than sine functions is critical for compression, since it turns out (as described below) that fewer cosine functions are needed to approximate a typical signal, whereas for differential equations the cosines express a particular choice of boundary conditions.", 
    "name": "Discrete Cosine Transform", 
    "classification": "Digital Signal Processing", 
    "full_text": "A discrete cosine transform (DCT) expresses a finite sequence of data points in terms of a sum of cosine functions oscillating at different frequencies. DCTs are important to numerous applications in science and engineering, from lossy compression of audio (e.g. MP3) and images (e.g. JPEG) (where small high-frequency components can be discarded), to spectral methods for the numerical solution of partial differential equations. The use of cosine rather than sine functions is critical for compression, since it turns out (as described below) that fewer cosine functions are needed to approximate a typical signal, whereas for differential equations the cosines express a particular choice of boundary conditions.\nIn particular, a DCT is a Fourier-related transform similar to the discrete Fourier transform (DFT), but using only real numbers. The DCTs are generally related to Fourier Series coefficients of a periodically and symmetrically extended sequence whereas DFTs are related to Fourier Series coefficients of a periodically extended sequence. DCTs are equivalent to DFTs of roughly twice the length, operating on real data with even symmetry (since the Fourier transform of a real and even function is real and even), whereas in some variants the input and/or output data are shifted by half a sample. There are eight standard DCT variants, of which four are common.\nThe most common variant of discrete cosine transform is the type-II DCT, which is often called simply \"the DCT\".[1][2] Its inverse, the type-III DCT, is correspondingly often called simply \"the inverse DCT\" or \"the IDCT\". Two related transforms are the discrete sine transform (DST), which is equivalent to a DFT of real and odd functions, and the modified discrete cosine transform (MDCT), which is based on a DCT of overlapping data. Multidimensional DCTs (MD DCTs) are developed to extend the concept of DCT on MD Signals. There are several algorithms to compute MD DCT. A new variety of fast algorithms are also developed to reduce the computational complexity of implementing DCT.\n\n\nThe DCT, and in particular the DCT-II, is often used in signal and image processing, especially for lossy compression, because it has a strong \"energy compaction\" property:[1][2] in typical applications, most of the signal information tends to be concentrated in a few low-frequency components of the DCT. For strongly correlated Markov processes, the DCT can approach the compaction efficiency of the Karhunen-Loève transform (which is optimal in the decorrelation sense). As explained below, this stems from the boundary conditions implicit in the cosine functions.\nA related transform, the modified discrete cosine transform, or MDCT (based on the DCT-IV), is used in AAC, Vorbis, WMA, and MP3 audio compression.\nDCTs are also widely employed in solving partial differential equations by spectral methods, where the different variants of the DCT correspond to slightly different even/odd boundary conditions at the two ends of the array.\nDCTs are also closely related to Chebyshev polynomials, and fast DCT algorithms (below) are used in Chebyshev approximation of arbitrary functions by series of Chebyshev polynomials, for example in Clenshaw–Curtis quadrature.\nThe DCT is used in JPEG image compression, MJPEG, MPEG, DV, Daala, and Theora video compression. There, the two-dimensional DCT-II of \n\n\n\nN\n×\nN\n\n\n{\\displaystyle N\\times N}\n\n blocks are computed and the results are quantized and entropy coded. In this case, \n\n\n\nN\n\n\n{\\displaystyle N}\n\n is typically 8 and the DCT-II formula is applied to each row and column of the block. The result is an 8 × 8 transform coefficient array in which the \n\n\n\n(\n0\n,\n0\n)\n\n\n{\\displaystyle (0,0)}\n\n element (top-left) is the DC (zero-frequency) component and entries with increasing vertical and horizontal index values represent higher vertical and horizontal spatial frequencies.\nMultidimensional DCTs (MD DCTs) have several applications mainly 3-D DCT-II has several new applications like Hyperspectral Imaging coding systems,[3] variable temporal length 3-D DCT coding,[4] video coding algorithms,[5] adaptive video coding [6] and 3-D Compression.[7] Due to enhancement in the hardware, software and introduction of several fast algorithms, the necessity of using M-D DCTs is rapidly increasing. DCT-IV has gained popularity for its applications in fast implementation of real-valued polyphase filtering banks,[8] lapped orthogonal transform[9][10] and cosine-modulated wavelet bases.[11]\nLike any Fourier-related transform, discrete cosine transforms (DCTs) express a function or a signal in terms of a sum of sinusoids with different frequencies and amplitudes. Like the discrete Fourier transform (DFT), a DCT operates on a function at a finite number of discrete data points. The obvious distinction between a DCT and a DFT is that the former uses only cosine functions, while the latter uses both cosines and sines (in the form of complex exponentials). However, this visible difference is merely a consequence of a deeper distinction: a DCT implies different boundary conditions from the DFT or other related transforms.\nThe Fourier-related transforms that operate on a function over a finite domain, such as the DFT or DCT or a Fourier series, can be thought of as implicitly defining an extension of that function outside the domain. That is, once you write a function \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n as a sum of sinusoids, you can evaluate that sum at any \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, even for \n\n\n\nx\n\n\n{\\displaystyle x}\n\n where the original \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n was not specified. The DFT, like the Fourier series, implies a periodic extension of the original function. A DCT, like a cosine transform, implies an even extension of the original function.\nHowever, because DCTs operate on finite, discrete sequences, two issues arise that do not apply for the continuous cosine transform. First, one has to specify whether the function is even or odd at both the left and right boundaries of the domain (i.e. the min-n and max-n boundaries in the definitions below, respectively). Second, one has to specify around what point the function is even or odd. In particular, consider a sequence abcd of four equally spaced data points, and say that we specify an even left boundary. There are two sensible possibilities: either the data are even about the sample a, in which case the even extension is dcbabcd, or the data are even about the point halfway between a and the previous point, in which case the even extension is dcbaabcd (a is repeated).\nThese choices lead to all the standard variations of DCTs and also discrete sine transforms (DSTs). Each boundary can be either even or odd (2 choices per boundary) and can be symmetric about a data point or the point halfway between two data points (2 choices per boundary), for a total of 2 × 2 × 2 × 2 = 16 possibilities. Half of these possibilities, those where the left boundary is even, correspond to the 8 types of DCT; the other half are the 8 types of DST.\nThese different boundary conditions strongly affect the applications of the transform and lead to uniquely useful properties for the various DCT types. Most directly, when using Fourier-related transforms to solve partial differential equations by spectral methods, the boundary conditions are directly specified as a part of the problem being solved. Or, for the MDCT (based on the type-IV DCT), the boundary conditions are intimately involved in the MDCT's critical property of time-domain aliasing cancellation. In a more subtle fashion, the boundary conditions are responsible for the \"energy compactification\" properties that make DCTs useful for image and audio compression, because the boundaries affect the rate of convergence of any Fourier-like series.\nIn particular, it is well known that any discontinuities in a function reduce the rate of convergence of the Fourier series, so that more sinusoids are needed to represent the function with a given accuracy. The same principle governs the usefulness of the DFT and other transforms for signal compression; the smoother a function is, the fewer terms in its DFT or DCT are required to represent it accurately, and the more it can be compressed. (Here, we think of the DFT or DCT as approximations for the Fourier series or cosine series of a function, respectively, in order to talk about its \"smoothness\".) However, the implicit periodicity of the DFT means that discontinuities usually occur at the boundaries: any random segment of a signal is unlikely to have the same value at both the left and right boundaries. (A similar problem arises for the DST, in which the odd left boundary condition implies a discontinuity for any function that does not happen to be zero at that boundary.) In contrast, a DCT where both boundaries are even always yields a continuous extension at the boundaries (although the slope is generally discontinuous). This is why DCTs, and in particular DCTs of types I, II, V, and VI (the types that have two even boundaries) generally perform better for signal compression than DFTs and DSTs. In practice, a type-II DCT is usually preferred for such applications, in part for reasons of computational convenience.\nFormally, the discrete cosine transform is a linear, invertible function \n\n\n\nf\n:\n\n\nR\n\n\nN\n\n\n→\n\n\nR\n\n\nN\n\n\n\n\n{\\displaystyle f:\\mathbb {R} ^{N}\\to \\mathbb {R} ^{N}}\n\n (where \n\n\n\n\nR\n\n\n\n{\\displaystyle \\mathbb {R} }\n\n denotes the set of real numbers), or equivalently an invertible N × N square matrix. There are several variants of the DCT with slightly modified definitions. The N real numbers x0, ..., xN-1 are transformed into the N real numbers X0, ..., XN-1 according to one of the formulas:\nSome authors further multiply the x0 and xN-1 terms by √2, and correspondingly multiply the X0 and XN-1 terms by 1/√2. This makes the DCT-I matrix orthogonal, if one further multiplies by an overall scale factor of \n\n\n\n\n\n\n\n2\n\nN\n−\n1\n\n\n\n\n\n\n\n{\\displaystyle {\\sqrt {\\tfrac {2}{N-1}}}}\n\n, but breaks the direct correspondence with a real-even DFT.\nThe DCT-I is exactly equivalent (up to an overall scale factor of 2), to a DFT of \n\n\n\n2\nN\n−\n2\n\n\n{\\displaystyle 2N-2}\n\n real numbers with even symmetry. For example, a DCT-I of N=5 real numbers abcde is exactly equivalent to a DFT of eight real numbers abcdedcb (even symmetry), divided by two. (In contrast, DCT types II-IV involve a half-sample shift in the equivalent DFT.)\nNote, however, that the DCT-I is not defined for N less than 2. (All other DCT types are defined for any positive N.)\nThus, the DCT-I corresponds to the boundary conditions: xn is even around n=0 and even around n=N-1; similarly for Xk.\nThe DCT-II is probably the most commonly used form, and is often simply referred to as \"the DCT\".[1][2]\nThis transform is exactly equivalent (up to an overall scale factor of 2) to a DFT of \n\n\n\n4\nN\n\n\n{\\displaystyle 4N}\n\n real inputs of even symmetry where the even-indexed elements are zero. That is, it is half of the DFT of the \n\n\n\n4\nN\n\n\n{\\displaystyle 4N}\n\n inputs \n\n\n\n\ny\n\nn\n\n\n\n\n{\\displaystyle y_{n}}\n\n, where \n\n\n\n\ny\n\n2\nn\n\n\n=\n0\n\n\n{\\displaystyle y_{2n}=0}\n\n, \n\n\n\n\ny\n\n2\nn\n+\n1\n\n\n=\n\nx\n\nn\n\n\n\n\n{\\displaystyle y_{2n+1}=x_{n}}\n\n for \n\n\n\n0\n≤\nn\n<\nN\n\n\n{\\displaystyle 0\\leq n<N}\n\n, \n\n\n\n\ny\n\n2\nN\n\n\n=\n0\n\n\n{\\displaystyle y_{2N}=0}\n\n, and \n\n\n\n\ny\n\n4\nN\n−\nn\n\n\n=\n\ny\n\nn\n\n\n\n\n{\\displaystyle y_{4N-n}=y_{n}}\n\n for \n\n\n\n0\n<\nn\n<\n2\nN\n\n\n{\\displaystyle 0<n<2N}\n\n.\nSome authors further multiply the X0 term by 1/√2 and multiply the resulting matrix by an overall scale factor of \n\n\n\n\n\n\n\n2\nN\n\n\n\n\n\n\n{\\displaystyle {\\sqrt {\\tfrac {2}{N}}}}\n\n (see below for the corresponding change in DCT-III). This makes the DCT-II matrix orthogonal, but breaks the direct correspondence with a real-even DFT of half-shifted input. This is the normalization used by Matlab, for example. In many applications, such as JPEG, the scaling is arbitrary because scale factors can be combined with a subsequent computational step (e.g. the quantization step in JPEG[12]), and a scaling that can be chosen that allows the DCT to be computed with fewer multiplications.[13][14]\nThe DCT-II implies the boundary conditions: xn is even around n=-1/2 and even around n=N-1/2; Xk is even around k=0 and odd around k=N.\nBecause it is the inverse of DCT-II (up to a scale factor, see below), this form is sometimes simply referred to as \"the inverse DCT\" (\"IDCT\").[2]\nSome authors divide the x0 term by √2 instead of by 2 (resulting in an overall x0/√2 term) and multiply the resulting matrix by an overall scale factor of \n\n\n\n\n\n\n\n2\nN\n\n\n\n\n\n\n{\\displaystyle {\\sqrt {\\tfrac {2}{N}}}}\n\n (see above for the corresponding change in DCT-II), so that the DCT-II and DCT-III are transposes of one another. This makes the DCT-III matrix orthogonal, but breaks the direct correspondence with a real-even DFT of half-shifted output.\nThe DCT-III implies the boundary conditions: xn is even around n=0 and odd around n=N; Xk is even around k=-1/2 and odd around k=N-1/2.\nThe DCT-IV matrix becomes orthogonal (and thus, being clearly symmetric, its own inverse) if one further multiplies by an overall scale factor of \n\n\n\n\n\n2\n\n/\n\nN\n\n\n\n\n{\\displaystyle {\\sqrt {2/N}}}\n\n.\nA variant of the DCT-IV, where data from different transforms are overlapped, is called the modified discrete cosine transform (MDCT).[15]\nThe DCT-IV implies the boundary conditions: xn is even around n=-1/2 and odd around n=N-1/2; similarly for Xk.\nDCTs of types I-IV treat both boundaries consistently regarding the point of symmetry: they are even/odd around either a data point for both boundaries or halfway between two data points for both boundaries. By contrast, DCTs of types V-VIII imply boundaries that are even/odd around a data point for one boundary and halfway between two data points for the other boundary.\nIn other words, DCT types I-IV are equivalent to real-even DFTs of even order (regardless of whether N is even or odd), since the corresponding DFT is of length 2(N−1) (for DCT-I) or 4N (for DCT-II/III) or 8N (for DCT-IV). The four additional types of discrete cosine transform[16] correspond essentially to real-even DFTs of logically odd order, which have factors of N±½ in the denominators of the cosine arguments.\nHowever, these variants seem to be rarely used in practice. One reason, perhaps, is that FFT algorithms for odd-length DFTs are generally more complicated than FFT algorithms for even-length DFTs (e.g. the simplest radix-2 algorithms are only for even lengths), and this increased intricacy carries over to the DCTs as described below.\n(The trivial real-even array, a length-one DFT (odd length) of a single number a, corresponds to a DCT-V of length N=1.)\nUsing the normalization conventions above, the inverse of DCT-I is DCT-I multiplied by 2/(N-1). The inverse of DCT-IV is DCT-IV multiplied by 2/N. The inverse of DCT-II is DCT-III multiplied by 2/N and vice versa.[2]\nLike for the DFT, the normalization factor in front of these transform definitions is merely a convention and differs between treatments. For example, some authors multiply the transforms by \n\n\n\n\n\n2\n\n/\n\nN\n\n\n\n\n{\\displaystyle {\\sqrt {2/N}}}\n\n so that the inverse does not require any additional multiplicative factor. Combined with appropriate factors of √2 (see above), this can be used to make the transform matrix orthogonal.\nMultidimensional variants of the various DCT types follow straightforwardly from the one-dimensional definitions: they are simply a separable product (equivalently, a composition) of DCTs along each dimension.\nFor example, a two-dimensional DCT-II of an image or a matrix is simply the one-dimensional DCT-II, from above, performed along the rows and then along the columns (or vice versa). That is, the 2D DCT-II is given by the formula (omitting normalization and other scale factors, as above):\nThe 3-D DCT-II is only the extension of 2-D DCT-II in three dimensional space and mathematically can be calculated by the formula\nThe inverse of 3-D DCT-II is 3-D DCT-III and can be computed from the formula given by\nTechnically, computing a two-, three- (or -multi) dimensional DCT by sequences of one-dimensional DCTs along each dimension is known as a row-column algorithm. As with multidimensional FFT algorithms, however, there exist other methods to compute the same thing while performing the computations in a different order (i.e. interleaving/combining the algorithms for the different dimensions). Owing to the rapid growth in the applications based on the 3-D DCT, several fast algorithms are developed for the computation of 3-D DCT-II. Vector-Radix algorithms are applied for computing M-D DCT to reduce the computational complexity and to increase the computational speed. To compute 3-D DCT-II efficiently, a fast algorithm, Vector-Radix Decimation in Frequency (VR DIF) algorithm was developed.\nIn order to apply the VR DIF algorithm the input data is to be formulated and rearranged as follows.[17][18] The transform sixe N x N x N is assumed to be 2.\nThe figure to the adjacent shows the four stages that are involved in calculating 3-D DCT-II using VR DIF algorithm. The first stage is the 3-D reordering using the index mapping illustrated by the above equations. The second stage is the butterfly calculation. Each butterfly calculates eight points together as shown in the figure just below., where \n\n\n\nc\n(\n\nϕ\n\ni\n\n\n)\n=\ncos\n⁡\n(\n\nϕ\n\ni\n\n\n)\n\n\n{\\displaystyle c(\\phi _{i})=\\cos(\\phi _{i})}\n\n.\nThe original 3-D DCT-II now can be written as\nwhere \n\n\n\n\nϕ\n\ni\n\n\n=\n\n\nπ\n\n2\nN\n\n\n\n(\n4\n\nN\n\ni\n\n\n+\n1\n)\n,\n\n and \n\ni\n=\n1\n,\n2\n,\n3\n\n\n{\\displaystyle \\phi _{i}={\\frac {\\pi }{2N}}(4N_{i}+1),{\\text{ and }}i=1,2,3}\n\n .\nIf the even and the odd parts of \n\n\n\n\nk\n\n1\n\n\n,\n\nk\n\n2\n\n\n\n\n{\\displaystyle k_{1},k_{2}}\n\n and \n\n\n\n\nk\n\n3\n\n\n\n\n{\\displaystyle k_{3}}\n\n and are considered, the general formula for the calculation of the 3-D DCT-II can be expressed as\nwhere\nThe whole 3-D DCT calculation needs \n\n\n\n[\n\nlog\n\n2\n\n\n⁡\nN\n]\n\n\n{\\displaystyle [\\log _{2}N]}\n\n stages, and each stage involves \n\n\n\n\nN\n\n3\n\n\n\n/\n\n8\n\n\n{\\displaystyle N^{3}/8}\n\n butterflies. The whole 3-D DCT requires \n\n\n\n\n[\n(\n\nN\n\n3\n\n\n\n/\n\n8\n)\n\nlog\n\n2\n\n\n⁡\nN\n]\n\n\n\n{\\displaystyle \\left[(N^{3}/8)\\log _{2}N\\right]}\n\n butterflies to be computed. Each butterfly requires seven real multiplications (including trivial multiplications) and 24 real additions (including trivial additions). Therefore, the total number of real multiplications needed for this stage is \n\n\n\n\n[\n(\n7\n\n/\n\n8\n)\n\nN\n\n3\n\n\n\nlog\n\n2\n\n\n⁡\nN\n]\n\n\n\n{\\displaystyle \\left[(7/8)N^{3}\\log _{2}N\\right]}\n\n, and the total number of real additions i.e. including the post-additions (recursive additions) which can be calculated directly after the butterfly stage or after the bit-reverse stage are given by[18] \n\n\n\n\n\n\n\n[\n\n\n3\n2\n\n\n\nN\n\n3\n\n\n\nlog\n\n2\n\n\n⁡\nN\n]\n\n⏟\n\n\n\nReal\n\n\n+\n\n\n\n\n[\n\n\n3\n2\n\n\n\nN\n\n3\n\n\n\nlog\n\n2\n\n\n⁡\nN\n−\n3\n\nN\n\n3\n\n\n+\n3\n\nN\n\n2\n\n\n]\n\n⏟\n\n\n\nRecursive\n\n\n=\n\n[\n\n\n9\n2\n\n\n\nN\n\n3\n\n\n\nlog\n\n2\n\n\n⁡\nN\n−\n3\n\nN\n\n3\n\n\n+\n3\n\nN\n\n2\n\n\n]\n\n\n\n{\\displaystyle \\underbrace {\\left[{\\frac {3}{2}}N^{3}\\log _{2}N\\right]} _{\\text{Real}}+\\underbrace {\\left[{\\frac {3}{2}}N^{3}\\log _{2}N-3N^{3}+3N^{2}\\right]} _{\\text{Recursive}}=\\left[{\\frac {9}{2}}N^{3}\\log _{2}N-3N^{3}+3N^{2}\\right]}\n\n.\nThe conventional method to calculate MD-DCT-II is using a Row-Column-Frame (RCF) approach which is computationally complex and less productive on most advanced recent hardware platforms. The number of multiplications required to compute VR DIF Algorithm when compared to RCF algorithm are quite a few in number. The number of Multiplications and additions involved in RCF approach are given by \n\n\n\n\n[\n\n\n3\n2\n\n\n\nN\n\n3\n\n\n\nlog\n\n2\n\n\n⁡\nN\n]\n\n\n\n{\\displaystyle \\left[{\\frac {3}{2}}N^{3}\\log _{2}N\\right]}\n\n and \n\n\n\n\n[\n\n\n9\n2\n\n\n\nN\n\n3\n\n\n\nlog\n\n2\n\n\n⁡\nN\n−\n3\n\nN\n\n3\n\n\n+\n3\n\nN\n\n2\n\n\n]\n\n\n\n{\\displaystyle \\left[{\\frac {9}{2}}N^{3}\\log _{2}N-3N^{3}+3N^{2}\\right]}\n\n respectively. From Table 1, it can be seen that the total number\nof multiplications associated with the 3-D DCT VR algorithm is less than that associated with the RCF approach by more than 40%. In addition, the RCF approach involves matrix transpose and more indexing and data swapping than the new VR algorithm. This makes the 3-D DCT VR algorithm more efficient and better suited for 3-D applications that involve the 3-D DCT-II such as video compression and other 3-D image processing applications. The main consideration in choosing a fast algorithm is to avoid computational and structural complexities. As the technology of computers and DSPs advances, the execution time of arithmetic operations (multiplications and additions) is becoming very fast, and regular computational structure becomes the most important factor.[19] Therefore, although the above proposed 3-D VR algorithm does not achieve the theoretical lower bound on the number of multiplications,[20] it has a simpler computational structure as compared to other 3-D DCT algorithms. It can be implemented in place using a single butterfly and possesses the properties of the Cooley–Tukey FFT algorithm in 3-D. Hence, the 3-D VR presents a good choice for reducing arithmetic operations in the calculation of the 3-D DCT-II while keeping the simple structure that characterize butterfly style Cooley–Tukey FFT algorithms.\nThe image to the right shows a combination of horizontal and vertical frequencies for an 8 x 8 (\n\n\n\n\nN\n\n1\n\n\n=\n\nN\n\n2\n\n\n=\n8\n\n\n{\\displaystyle N_{1}=N_{2}=8}\n\n) two-dimensional DCT. Each step from left to right and top to bottom is an increase in frequency by 1/2 cycle.\nFor example, moving right one from the top-left square yields a half-cycle increase in the horizontal frequency. Another move to the right yields two half-cycles. A move down yields two half-cycles horizontally and a half-cycle vertically. The source data (8x8) is transformed to a linear combination of these 64 frequency squares.\nThe M-D DCT-IV is just an extension of 1-D DCT-IV on to M dimensional domain. The 2-D DCT-IV of a matirx or an image is given by\nWe can compute the MD DCT-IV using the regular row-column method or we can use the polynomial transform method[21] for the fast and efficient computation. The main idea of this algorithm is to use the Polynomial Transform to convert the multidimensional DCT into a series of 1-D DCTs directly. MD DCT-IV also has several applications in various fiields.\nAlthough the direct application of these formulas would require O(N2) operations, it is possible to compute the same thing with only O(N log N) complexity by factorizing the computation similarly to the fast Fourier transform (FFT). One can also compute DCTs via FFTs combined with O(N) pre- and post-processing steps. In general, O(N log N) methods to compute DCTs are known as fast cosine transform (FCT) algorithms.\nThe most efficient algorithms, in principle, are usually those that are specialized directly for the DCT, as opposed to using an ordinary FFT plus O(N) extra operations (see below for an exception). However, even \"specialized\" DCT algorithms (including all of those that achieve the lowest known arithmetic counts, at least for power-of-two sizes) are typically closely related to FFT algorithms—since DCTs are essentially DFTs of real-even data, one can design a fast DCT algorithm by taking an FFT and eliminating the redundant operations due to this symmetry. This can even be done automatically (Frigo & Johnson, 2005). Algorithms based on the Cooley–Tukey FFT algorithm are most common, but any other FFT algorithm is also applicable. For example, the Winograd FFT algorithm leads to minimal-multiplication algorithms for the DFT, albeit generally at the cost of more additions, and a similar algorithm was proposed by Feig & Winograd (1992) for the DCT. Because the algorithms for DFTs, DCTs, and similar transforms are all so closely related, any improvement in algorithms for one transform will theoretically lead to immediate gains for the other transforms as well (Duhamel & Vetterli 1990).\nWhile DCT algorithms that employ an unmodified FFT often have some theoretical overhead compared to the best specialized DCT algorithms, the former also have a distinct advantage: highly optimized FFT programs are widely available. Thus, in practice, it is often easier to obtain high performance for general lengths N with FFT-based algorithms. (Performance on modern hardware is typically not dominated simply by arithmetic counts, and optimization requires substantial engineering effort.) Specialized DCT algorithms, on the other hand, see widespread use for transforms of small, fixed sizes such as the \n\n\n\n8\n×\n8\n\n\n{\\displaystyle 8\\times 8}\n\n DCT-II used in JPEG compression, or the small DCTs (or MDCTs) typically used in audio compression. (Reduced code size may also be a reason to use a specialized DCT for embedded-device applications.)\nIn fact, even the DCT algorithms using an ordinary FFT are sometimes equivalent to pruning the redundant operations from a larger FFT of real-symmetric data, and they can even be optimal from the perspective of arithmetic counts. For example, a type-II DCT is equivalent to a DFT of size \n\n\n\n4\nN\n\n\n{\\displaystyle 4N}\n\n with real-even symmetry whose even-indexed elements are zero. One of the most common methods for computing this via an FFT (e.g. the method used in FFTPACK and FFTW) was described by Narasimha & Peterson (1978) and Makhoul (1980), and this method in hindsight can be seen as one step of a radix-4 decimation-in-time Cooley–Tukey algorithm applied to the \"logical\" real-even DFT corresponding to the DCT II. (The radix-4 step reduces the size \n\n\n\n4\nN\n\n\n{\\displaystyle 4N}\n\n DFT to four size-\n\n\n\nN\n\n\n{\\displaystyle N}\n\n DFTs of real data, two of which are zero and two of which are equal to one another by the even symmetry, hence giving a single size-\n\n\n\nN\n\n\n{\\displaystyle N}\n\n FFT of real data plus \n\n\n\nO\n(\nN\n)\n\n\n{\\displaystyle O(N)}\n\n butterflies.) Because the even-indexed elements are zero, this radix-4 step is exactly the same as a split-radix step; if the subsequent size-\n\n\n\nN\n\n\n{\\displaystyle N}\n\n real-data FFT is also performed by a real-data split-radix algorithm (as in Sorensen et al. 1987), then the resulting algorithm actually matches what was long the lowest published arithmetic count for the power-of-two DCT-II (\n\n\n\n2\nN\n\nlog\n\n2\n\n\n⁡\nN\n−\nN\n+\n2\n\n\n{\\displaystyle 2N\\log _{2}N-N+2}\n\n real-arithmetic operations[a]). So, there is nothing intrinsically bad about computing the DCT via an FFT from an arithmetic perspective—it is sometimes merely a question of whether the corresponding FFT algorithm is optimal. (As a practical matter, the function-call overhead in invoking a separate FFT routine might be significant for small \n\n\n\nN\n\n\n{\\displaystyle N}\n\n, but this is an implementation rather than an algorithmic question since it can be solved by unrolling/inlining.)\nConsider this 8x8 grayscale image of capital letter A.\nEach basis function is multiplied by its coefficient and then this product is added to the final image.", 
    "dbpedia_url": "http://dbpedia.org/resource/Discrete_cosine_transform", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Discrete_cosine_transform\n"
}