{
    "about": "A drop-out compensator is an error concealment device that was commonly used in the analog video era to hide brief RF signal \"drop-outs\" on videotape playback caused by imperfections in or damage to the tape's magnetic coating. Most compensators worked by repeating earlier video scan-lines over short periods of signal loss; one early such system, \"Mincom\" was developed in the 1960s by the Minnesota Mining and Manufacturing Company, the company now known as 3M. Because of the high cost of the 3M device at the time, BBC R&D engineers developed a simpler, less expensive unit based on a sample-and-hold technique for in-house use.[1]", 
    "classification": "Error Detection And Correction", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Drop-out_compensator\n", 
    "full_text": "A drop-out compensator is an error concealment device that was commonly used in the analog video era to hide brief RF signal \"drop-outs\" on videotape playback caused by imperfections in or damage to the tape's magnetic coating. Most compensators worked by repeating earlier video scan-lines over short periods of signal loss; one early such system, \"Mincom\" was developed in the 1960s by the Minnesota Mining and Manufacturing Company, the company now known as 3M. Because of the high cost of the 3M device at the time, BBC R&D engineers developed a simpler, less expensive unit based on a sample-and-hold technique for in-house use.[1]\nDedicated drop-out compensators were eventually superseded by the incorporation of drop-out compensation functionality into timebase correctors based on analog-to-digital conversion and digital line stores.\nThe advent of compressed digital video systems finally eliminated the need for line-based drop-out compensators. Most low-level media errors, such as those caused by tape damage or imperfections, are now dealt with by forward error correction techniques, and those which overwhelm the FEC layer are typically too severe to remedy using simple line-based error concealment techniques, because damage to the compressed bitstream will often damage large parts of the video image. However, since occasional signal drop-outs can still occur, either through severe tape damage or because of packet loss in packetized video transmission, modern error concealment techniques that are aware of the structure of the compressed video format have been developed to deal with these.", 
    "name": "Drop Out Compensator"
}