{
    "about": "The Droste effect (Dutch pronunciation: [drɔstə])—known as mise en abyme in art—is the effect of a picture appearing within itself, in a place where a similar picture would realistically be expected to appear.[1] The appearance is recursive: the smaller version contains an even smaller version of the picture, and so on. Only in theory could this go on forever; practically, it continues only as long as the resolution of the picture allows, which is relatively short, since each iteration geometrically reduces the picture's size. It is a visual example of a strange loop, a self-referential system of instancing which is the cornerstone of fractal geometry.", 
    "name": "Droste Effect", 
    "classification": "Recursion", 
    "full_text": "The Droste effect (Dutch pronunciation: [drɔstə])—known as mise en abyme in art—is the effect of a picture appearing within itself, in a place where a similar picture would realistically be expected to appear.[1] The appearance is recursive: the smaller version contains an even smaller version of the picture, and so on. Only in theory could this go on forever; practically, it continues only as long as the resolution of the picture allows, which is relatively short, since each iteration geometrically reduces the picture's size. It is a visual example of a strange loop, a self-referential system of instancing which is the cornerstone of fractal geometry.\n\n\nThe effect is named after the image on the tins and boxes of Droste cocoa powder, one of the main Dutch brands, which displayed a nurse carrying a serving tray with a cup of hot chocolate and a box with the same image.[2] This image, introduced in 1904 and maintained for decades with slight variations, became a household notion. Reportedly, poet and columnist Nico Scheepmaker introduced wider usage of the term in the late 1970s.[3]\nThe Droste effect was used by Giotto di Bondone in 1320, in his Stefaneschi Triptych. The polyptych altarpiece portrays in its center panel Cardinal Giacomo Gaetani Stefaneschi offering the triptych itself to St. Peter.[4] There are also several examples from medieval times of books featuring images containing the book itself or window panels in churches depicting miniature copies of the window panel itself.[5]\nThe Droste effect was used in the packaging of Land O'Lakes butter, which features a Native American woman carrying a package of butter with a picture of herself. Morton Salt similarly makes use of the effect.[6] The cover of the 1969 vinyl album Ummagumma by Pink Floyd shows a band member sitting, with a picture on the wall. The picture shows the same scene with a different band member and the effect continues for all four band members, with the picture for the fourth being the cover of their earlier album A Saucerful of Secrets.[7] The logo of The Laughing Cow cheese spread brand pictures a cow with earrings. On closer inspection, these are seen to be images of the circular cheese spread package, each bearing the image of the laughing cow.[8]", 
    "dbpedia_url": "http://dbpedia.org/resource/Droste_effect", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Droste_effect\n"
}