{
    "about": "In graph theory, the Dulmage–Mendelsohn decomposition is a partition of the vertices of a bipartite graph into subsets, with the property that two adjacent vertices belong to the same subset if and only if they are paired with each other in a perfect matching of the graph. It is named after A. L. Dulmage and Nathan Mendelsohn, who published it in 1958.", 
    "name": "Dulmage–Mendelsohn Decomposition", 
    "classification": "Graph Algorithms", 
    "full_text": "In graph theory, the Dulmage–Mendelsohn decomposition is a partition of the vertices of a bipartite graph into subsets, with the property that two adjacent vertices belong to the same subset if and only if they are paired with each other in a perfect matching of the graph. It is named after A. L. Dulmage and Nathan Mendelsohn, who published it in 1958.\n\n\nLet G = (U,V,E) be a bipartite graph, and let D be the set of vertices in G that are not matched in at least one maximum matching of G. Then D is necessarily an independent set, so G can be partitioned into three parts:\nEvery maximum matching in G consists of matchings in the first and second part that match all neighbors of D, together with a perfect matching of the remaining vertices.\nThe third set of vertices in the coarse decomposition (or all vertices in a graph with a perfect matching) may additionally be partitioned into subsets by the following steps:\nTo see that this subdivision into subsets characterizes the edges that belong to perfect matchings, suppose that two vertices u and v in G belong to the same subset of the decomposition, but are not already matched by the initial perfect matching. Then there exists a strongly connected component in H containing edge uv. This edge must belong to a simple cycle in H (by the definition of strong connectivity) which necessarily corresponds to an alternating cycle in G (a cycle whose edges alternate between matched and unmatched edges). This alternating cycle may be used to modify the initial perfect matching to produce a new matching containing edge uv.\nAn edge uv of the graph G belongs to all perfect matchings of G, if and only if u and v are the only members of their set in the decomposition. Such an edge exists if and only if the matching preclusion number of the graph is one.\nAs another component of the Dulmage–Mendelsohn decomposition, Dulmage and Mendelsohn defined the core of a graph to be the union of its maximum matchings.[1] However, this concept should be distinguished from the core in the sense of graph homomorphisms, and from the k-core formed by the removal of low-degree vertices.\nThis decomposition has been used to partition meshes in finite element analysis, and to determine specified, underspecified and overspecified equations in systems of nonlinear equations.", 
    "dbpedia_url": "http://dbpedia.org/resource/Dulmage–Mendelsohn_decomposition", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Dulmage–Mendelsohn_decomposition\n"
}