{
    "about": "In computer telecommunications, echo is the display or return of sent data at or to the sending end of a transmission. Echo can be either local echo, where the sending device itself displays the sent data, or remote echo, where the receiving device returns the sent data that it receives to the sender (which is of course simply no local echo from the point of view of the sending device itself).[1][2] That latter, when used as a form of error detection to determine that data received at the remote end of a communications line are the same as data sent, is also known as echoplex, echo check, or loop check. When two modems are communicating in echoplex mode, for example, the remote modem echoes whatever it receives from the local modem.[3][4][5][6][7]", 
    "name": "Echo (Computing)", 
    "classification": "Error Detection And Correction", 
    "full_text": "In computer telecommunications, echo is the display or return of sent data at or to the sending end of a transmission. Echo can be either local echo, where the sending device itself displays the sent data, or remote echo, where the receiving device returns the sent data that it receives to the sender (which is of course simply no local echo from the point of view of the sending device itself).[1][2] That latter, when used as a form of error detection to determine that data received at the remote end of a communications line are the same as data sent, is also known as echoplex, echo check, or loop check. When two modems are communicating in echoplex mode, for example, the remote modem echoes whatever it receives from the local modem.[3][4][5][6][7]\n\n\nWhilst local echo and remote echo are sometimes referred to as \"half-duplex\" and \"full-duplex\", those latter appellations are strictly incorrect, and are misleading (see duplex for their correct meanings). Whilst local echo is often used with half-duplex transmission, so that bandwidth is not wasted upon remotely echoing data from the remote end of the communications channel, it is not the same as half-duplex transmission. A full-duplex communications channel can still employ local echo, and a half-duplex channel can still (albeit wastefully) employ remote echo, or no echo at all.[8][6]\nIndeed, for example, that is the case for echoplex error checking, which requires full-duplex communication, so that received data can be echoed back as they are being received.[9][10]\nSimilarly, for another example, in the case of the TELNET communications protocol a local echo protocol operates on top of a full-duplex underlying protocol. The TCP connection over which the TELNET protocol is layered provides a full-duplex connection, with no echo, across which data may be sent in either direction simultaneously.[11] Whereas the Network Virtual Terminal that the TELNET protocol itself incorporates is a half-duplex device with (by default) local echo.[12][13]\nTerminals are one of the things that may perform echoing for a connection. Others include modems, some form of intervening communications processor, or even the host system itself.[8] For several common computer operating systems, it is the host system itself that performs the echoing, if appropriate (which it isn't for, say, entry of a user password when a terminal first connects and a user is prompted to log in). On OpenVMS, for example, echoing is performed as necessary by the host system. Similarly, on Unix-like systems, local echo is performed by the operating system kernel's terminal device driver, according to the state of a device control flag, maintained in software and alterable by applications programs via an ioctl() system call.[14][15] The actual terminals and modems connected to such systems should have their local echo facilities switched off (so that they operate in no echo mode), lest passwords be locally echoed at password prompts, and all other input appear echoed twice. This is as true for terminal emulator programs, such as C-Kermit, running on a computer as it is for real terminals.[14][16]\nMost terminal emulator programs have the ability to perform echo locally (which sometimes they misname \"half-duplex\"):[17]\nIn the Hayes command set, the AT command that switches local echo off (in command mode) is E0 and the command to switch it on is E1. For local echo in data mode, the commands are F1 and F0 respectively. (Note the reversal of the numbers. The \"F\" commands are not part of the EIA/TIA-602 standard, but the \"E\" commands are.)[17][22]\nSome host systems perform local echo themselves, in their device drivers and so forth.", 
    "dbpedia_url": "http://dbpedia.org/resource/Echo_(computing)", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Echo_(computing)\n"
}