{
    "about": "In mathematics, an elementary function is a function of one variable which is the composition of a finite number of arithmetic operations (+ – × ÷), exponentials, logarithms, constants, and solutions of algebraic equations (a generalization of nth roots).", 
    "name": "Elementary Function", 
    "classification": "Computer Algebra", 
    "full_text": "In mathematics, an elementary function is a function of one variable which is the composition of a finite number of arithmetic operations (+ – × ÷), exponentials, logarithms, constants, and solutions of algebraic equations (a generalization of nth roots).\nThe elementary functions include the trigonometric and hyperbolic functions and their inverses, as they are expressible with complex exponentials and logarithms.\nIt follows directly from the definition that the set of elementary functions is closed under arithmetic operations and composition. It is also closed under differentiation. It is not closed under limits and infinite sums.\nImportantly, the elementary functions are not closed under integration, as shown by Liouville's theorem, see Nonelementary integral. The Liouvillian functions are defined as the elementary functions and, recursively, the integrals of the Liouvillian functions.\nSome elementary functions, such as roots, logarithms, or inverse trigonometric functions, are not entire functions and may be multivalued.\nElementary functions were introduced by Joseph Liouville in a series of papers from 1833 to 1841.[1][2][3] An algebraic treatment of elementary functions was started by Joseph Fels Ritt in the 1930s.[4]\n\n\nExamples of elementary functions include:\nand\nThe last function is equal to the inverse cosine trigonometric function \n\n\n\narccos\n⁡\n(\nx\n)\n\n\n{\\displaystyle \\arccos(x)}\n\n in the entire complex domain. Hence, \n\n\n\narccos\n⁡\n(\nx\n)\n\n\n{\\displaystyle \\arccos(x)}\n\n is an elementary function.\nAn example of a function that is not elementary is the error function\na fact that may not be immediately obvious, but can be proven using the Risch algorithm.\nThe mathematical definition of an elementary function, or a function in elementary form, is considered in the context of differential algebra. A differential algebra is an algebra with the extra operation of derivation (algebraic version of differentiation). Using the derivation operation new equations can be written and their solutions used in extensions of the algebra. By starting with the field of rational functions, two special types of transcendental extensions (the logarithm and the exponential) can be added to the field building a tower containing elementary functions.\nA differential field F is a field F0 (rational functions over the rationals Q for example) together with a derivation map u → ∂u. (Here ∂u is a new function. Sometimes the notation u′ is used.) The derivation captures the properties of differentiation, so that for any two elements of the base field, the derivation is linear\nand satisfies the Leibniz product rule\nAn element h is a constant if ∂h = 0. If the base field is over the rationals, care must be taken when extending the field to add the needed transcendental constants.\nA function u of a differential extension F[u] of a differential field F is an elementary function over F if the function u\n(this is Liouville's theorem).", 
    "dbpedia_url": "http://dbpedia.org/resource/Elementary_function", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Elementary_function\n"
}