{
    "about": "In commutative algebra and algebraic geometry, elimination theory is the classical name for algorithmic approaches to eliminating some variables between polynomials of several variables.", 
    "name": "Elimination Theory", 
    "classification": "Computer Algebra", 
    "full_text": "In commutative algebra and algebraic geometry, elimination theory is the classical name for algorithmic approaches to eliminating some variables between polynomials of several variables.\n\n\nThe linear case would now routinely be handled by Gaussian elimination, rather than the theoretical solution provided by Cramer's rule. In the same way, computational techniques for elimination can in practice be based on Gröbner basis methods. There is however older literature on types of eliminant, including resultants to find common roots of polynomials, discriminants and so on. In particular the discriminant appears in invariant theory, and is often constructed as the invariant of either a curve or an n-ary k-ic form. Whilst discriminants are always constructed resultants, the variety of constructions and their meaning tends to vary. A modern and systematic version of theory of the discriminant has been developed by Gelfand and coworkers. Some of the systematic methods have a homological basis, that can be made explicit, as in Hilbert's theorem on syzygies. This field is at least as old as Bézout's theorem.\nThe historical development of commutative algebra, which was initially called ideal theory, is closely linked to concepts in elimination theory: ideas of Kronecker, who wrote a major paper on the subject, were adapted by Hilbert and effectively 'linearised' while dropping the explicit constructive content. The process continued over many decades: the work of F.S. Macaulay, who gave his name to Cohen–Macaulay modules, was motivated by elimination.\nThere is also a logical content to elimination theory, as seen in the Boolean satisfiability problem. In the worst case it is presumably hard to eliminate variables computationally. \"Quantifier elimination\" is a term used in mathematical logic to explain that, in some theories, every formula is equivalent with a formula without quantifier. This is the case of the theory of the polynomials over an algebraically closed field, and \"elimination theory\" may be viewed as the theory of the methods making quantifier elimination effective (algorithmic) in this case. Quantifier elimination over the reals is another example, which is fundamental in computational algebraic geometry.", 
    "dbpedia_url": "http://dbpedia.org/resource/Elimination_theory", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Elimination_theory\n"
}