{
    "about": "In signal processing, the energy \n\n\n\n\nE\n\ns\n\n\n\n\n{\\displaystyle E_{s}}\n\n of a continuous-time signal x(t) is defined as", 
    "name": "Energy (Signal Processing)", 
    "classification": "Signal Processing", 
    "full_text": "In signal processing, the energy \n\n\n\n\nE\n\ns\n\n\n\n\n{\\displaystyle E_{s}}\n\n of a continuous-time signal x(t) is defined as\nthe energy \n\n\n\n\nE\n\ns\n\n\n\n\n{\\displaystyle E_{s}}\n\n of a discrete-time signal x(n) is defined as\n\n\nEnergy in this context is not, strictly speaking, the same as the conventional notion of energy in physics and the other sciences. The two concepts are, however, closely related, and it is possible to convert from one to the other:\nFor example, if x(t) represents the potential (in volts) of an electrical signal propagating across a transmission line, then Z would represent the characteristic impedance (in ohms) of the transmission line. The units of measure for the signal energy \n\n\n\n\nE\n\ns\n\n\n\n\n{\\displaystyle E_{s}}\n\n would appear as volt2·seconds, which is not dimensionally correct for energy in the sense of the physical sciences. After dividing \n\n\n\n\nE\n\ns\n\n\n\n\n{\\displaystyle E_{s}}\n\n by Z, however, the dimensions of E would become volt2·seconds per ohm, which is equivalent to joules, the SI unit for energy as defined in the physical sciences.\nSimilarly, the spectral energy density of signal x(t) is\nwhere X(f) is the Fourier transform of x(t).\nFor example, if x(t) represents the magnitude of the electric field component (in volts per meter) of an optical signal propagating through free space, then the dimensions of X(f) would become volt·seconds per meter and \n\n\n\n\nE\n\ns\n\n\n(\nf\n)\n\n\n{\\displaystyle E_{s}(f)}\n\n would represent the signal's spectral energy density (in volts2·second2 per meter2) as a function of frequency f (in hertz). Again, these units of measure are not dimensionally correct in the true sense of energy density as defined in physics. Dividing \n\n\n\n\nE\n\ns\n\n\n(\nf\n)\n\n\n{\\displaystyle E_{s}(f)}\n\n by Zo, the characteristic impedance of free space (in ohms), the dimensions become joule-seconds per meter2 or, equivalently, joules per meter2 per hertz, which is dimensionally correct in SI units for spectral energy density.\nAs a consequence of Parseval's theorem, one can prove that the signal energy is always equal to the summation across all frequency components of the signal's spectral energy density.", 
    "dbpedia_url": "http://dbpedia.org/resource/Energy_(signal_processing)", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Energy_(signal_processing)\n"
}