{
    "about": "The equivalent rectangular bandwidth or ERB is a measure used in psychoacoustics, which gives an approximation to the bandwidths of the filters in human hearing, using the unrealistic but convenient simplification of modeling the filters as rectangular band-pass filters.", 
    "name": "Equivalent Rectangular Bandwidth", 
    "classification": "Signal Processing", 
    "full_text": "The equivalent rectangular bandwidth or ERB is a measure used in psychoacoustics, which gives an approximation to the bandwidths of the filters in human hearing, using the unrealistic but convenient simplification of modeling the filters as rectangular band-pass filters.\n\n\nFor moderate sound levels and young listeners, the bandwidth of human auditory filters can be approximated by the polynomial equation:\n\n\n\n\n\nE\nR\nB\n\n(\nf\n)\n=\n6.23\n⋅\n\nf\n\n2\n\n\n+\n93.39\n⋅\nf\n+\n28.52\n\n\n{\\displaystyle \\mathrm {ERB} (f)=6.23\\cdot f^{2}+93.39\\cdot f+28.52}\n\n [1]\n\n \n \n \n \n(Eq.1)\nwhere f is the center frequency of the filter in kHz and ERB(f) is the bandwidth of the filter in Hz. The approximation is based on the results of a number of published simultaneous masking experiments and is valid from 0.1 to 6.5 kHz.[1]\nThe above approximation was given in 1983 by Moore and Glasberg,[1] who in 1990 published another (linear) approximation:[2]\n\n\n\n\n\nE\nR\nB\n\n(\nf\n)\n=\n24.7\n⋅\n(\n4.37\n⋅\nf\n+\n1\n)\n\n\n{\\displaystyle \\mathrm {ERB} (f)=24.7\\cdot (4.37\\cdot f+1)}\n\n [2]\n\n \n \n \n \n(Eq.2)\nwhere f is in kHz and ERB(f) is in Hz. The approximation is applicable at moderate sound levels and for values of f between 0.1 and 10 kHz.[2]\nThe ERB-rate scale, or simply ERB scale, can be defined as a function ERBS(f) which returns the number of equivalent rectangular bandwidths below the given frequency f. It can be constructed by solving the following differential system of equations:\nThe solution for ERBS(f) is the integral of the reciprocal of ERB(f) with the constant of integration set in such a way that ERBS(0) = 0.[1]\nUsing the second order polynomial approximation (Eq.1) for ERB(f) yields:\nwhere f is in kHz. The VOICEBOX speech processing toolbox for MATLAB implements the conversion and its inverse as:\nwhere f is in Hz.\nUsing the linear approximation (Eq.2) for ERB(f) yields:\nwhere f is in Hz.", 
    "dbpedia_url": "http://dbpedia.org/resource/Equivalent_rectangular_bandwidth", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Equivalent_rectangular_bandwidth\n"
}