{
    "about": "In mathematics, error analysis is the study of kind and quantity of error, or uncertainty, that may be present in the solution to a problem. This issue is particularly prominent in applied areas such as numerical analysis and statistics.", 
    "name": "Error Analysis (Mathematics)", 
    "classification": "Numerical Analysis", 
    "full_text": "In mathematics, error analysis is the study of kind and quantity of error, or uncertainty, that may be present in the solution to a problem. This issue is particularly prominent in applied areas such as numerical analysis and statistics.\n\n\nIn numerical simulation or modeling of real systems, error analysis is concerned with the changes in the output of the model as the parameters to the model vary about a mean.\nFor instance, in a system modeled as a function of two variables \n\n\n\n\nz\n\n=\n\nf\n(\nx\n,\ny\n)\n\n\n\n{\\displaystyle \\scriptstyle z\\,=\\,f(x,y)}\n\n. Error analysis deals with the propagation of the numerical errors in \n\n\n\n\nx\n\n\n\n{\\displaystyle \\scriptstyle x}\n\n and \n\n\n\n\ny\n\n\n\n{\\displaystyle \\scriptstyle y}\n\n (around mean values \n\n\n\n\n\n\n\nx\n¯\n\n\n\n\n\n\n{\\displaystyle \\scriptstyle {\\bar {x}}}\n\n and \n\n\n\n\n\n\n\ny\n¯\n\n\n\n\n\n\n{\\displaystyle \\scriptstyle {\\bar {y}}}\n\n) to error in \n\n\n\n\nz\n\n\n\n{\\displaystyle \\scriptstyle z}\n\n (around a mean \n\n\n\n\n\n\n\nz\n¯\n\n\n\n\n\n\n{\\displaystyle \\scriptstyle {\\bar {z}}}\n\n).[1]\nIn numerical analysis, error analysis comprises both forward error analysis and backward error analysis.\nForward error analysis involves the analysis of a function \n\n\n\n\n\nz\n′\n\n=\n\nf\n′\n\n(\n\na\n\n0\n\n\n,\n\n\na\n\n1\n\n\n,\n\n…\n,\n\n\na\n\nn\n\n\n)\n\n\n\n{\\displaystyle \\scriptstyle z'=f'(a_{0},\\,a_{1},\\,\\dots ,\\,a_{n})}\n\n which is an approximation (usually a finite polynomial) to a function \n\n\n\n\nz\n\n=\n\nf\n(\n\na\n\n0\n\n\n,\n\na\n\n1\n\n\n,\n…\n,\n\na\n\nn\n\n\n)\n\n\n\n{\\displaystyle \\scriptstyle z\\,=\\,f(a_{0},a_{1},\\dots ,a_{n})}\n\n to determine the bounds on the error in the approximation; i.e., to find \n\n\n\n\nϵ\n\n\n\n{\\displaystyle \\scriptstyle \\epsilon }\n\n such that \n\n\n\n\n0\n\n≤\n\n\n|\n\nz\n−\n\nz\n′\n\n\n|\n\n\n≤\n\nϵ\n\n\n\n{\\displaystyle \\scriptstyle 0\\,\\leq \\,|z-z'|\\,\\leq \\,\\epsilon }\n\n.\nBackward error analysis involves the analysis of the approximation function \n\n\n\n\n\nz\n′\n\n\n=\n\n\nf\n′\n\n(\n\na\n\n0\n\n\n,\n\n\na\n\n1\n\n\n,\n\n…\n,\n\n\na\n\nn\n\n\n)\n\n\n\n{\\displaystyle \\scriptstyle z'\\,=\\,f'(a_{0},\\,a_{1},\\,\\dots ,\\,a_{n})}\n\n, to determine the bounds on the parameters \n\n\n\n\n\na\n\ni\n\n\n\n=\n\n\n\n\n\na\n\ni\n\n\n¯\n\n\n\n\n±\n\n\nϵ\n\ni\n\n\n\n\n\n{\\displaystyle \\scriptstyle a_{i}\\,=\\,{\\bar {a_{i}}}\\,\\pm \\,\\epsilon _{i}}\n\n such that the result \n\n\n\n\n\nz\n′\n\n\n=\n\nz\n\n\n\n{\\displaystyle \\scriptstyle z'\\,=\\,z}\n\n.[2]\nBackward error analysis, the theory of which was developed and popularized by James H. Wilkinson, can be used to establish that an algorithm implementing a numerical function is numerically stable.[3] The basic approach is to show that although the calculated result, due to roundoff errors, will not be exactly correct, it is the exact solution to a nearby problem with slightly perturbed input data. If the perturbation required is small, on the order of the uncertainty in the input data, then the results are in some sense as accurate as the data \"deserves\". The algorithm is then defined as backward stable. Stability is a measure of the sensitivity to rounding errors of a given numerical procedure; by contrast, the condition number of a function for a given problem indicates the inherent sensitivity of the function to small perturbations in its input and is independent of the implementation used to solve the problem.[4]\nThe analysis of errors computed using the global positioning system is important for understanding how GPS works, and for knowing what magnitude errors should be expected. The Global Positioning System makes corrections for receiver clock errors and other effects but there are still residual errors which are not corrected. The Global Positioning System (GPS) was created by the United States Department of Defense (DOD) in the 1970s. It has come to be widely used for navigation both by the U.S. military and the general public.\nIn molecular dynamics (MD) simulations, there are errors due to inadequate sampling of the phase space or infrequently occurring events, these lead to the statistical error due to random fluctuation in the measurements.\nFor a series of M measurements of a fluctuating property A, the mean value is:\nWhen these M measurements are independent, the variance of the mean <A> is:\nbut in most MD simulations, there is correlation between quantity A at different time, so the variance of the mean <A> will be underestimated as the effective number of independent measurements is actually less than M. In such situations we rewrite the variance as :\nwhere \n\n\n\n\nϕ\n\nμ\n\n\n\n\n{\\displaystyle \\phi _{\\mu }}\n\n is the autocorrelation function defined by\nWe can then use the auto correlation function to estimate the error bar. Luckily, we have a much simpler method based on block averaging.[5]\nMeasurements generally have a small amount of error, and repeated measurements of the same item will generally result in slight differences in readings. These differences can be analyzed, and follow certain known mathematical and statistical properties. Should a set of data appear to be too faithful to the hypothesis, i.e., the amount of error that would normally be in such measurements does not appear, a conclusion can be drawn that the data may have been forged. Error analysis alone is typically not sufficient to prove that data have been falsified or fabricated, but it may provide the supporting evidence necessary to confirm suspicions of misconduct.", 
    "dbpedia_url": "http://dbpedia.org/resource/Error_analysis_(mathematics)", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Error_analysis_(mathematics)\n"
}