{
    "about": "Error concealment is a technique used in signal processing that aims to minimize the deterioration of signals caused by missing data, called packet loss.[1] A signal is a message sent from a transmitter to a receiver in multiple small packets. Packet loss occurs when these packets are misdirected, delayed, resequenced, or corrupted.[2]", 
    "name": "Error Concealment", 
    "classification": "Error Detection And Correction", 
    "full_text": "Error concealment is a technique used in signal processing that aims to minimize the deterioration of signals caused by missing data, called packet loss.[1] A signal is a message sent from a transmitter to a receiver in multiple small packets. Packet loss occurs when these packets are misdirected, delayed, resequenced, or corrupted.[2]\n\n\nWhen error recovery occurs at the receiving end of the signal, it is receiver-based. These techniques focus on correcting corrupted or missing data.\nPreliminary attempts at receiver-based error concealment involved packet repetition, replacing lost packets with copies of previously received packets. This function is computationally simple and is performed by a device on the receiver end called a \"drop-out compensator\".[3][4]\nWhen this technique is used, if a packet is lost, its entries are replaced with 0s.\nInterpolation involves making educated guesses about the nature of a missing packet. For example, by following speech patterns in audio or faces in video.\nData buffers are used for temporarily storing data while waiting for delayed packets to arrive. They are common in internet browser loading bars and video applications, like YouTube.\nRather than attempting to recover lost packets, other techniques involve anticipating data loss, manipulating the data prior to transmission.[4]\nThe simplest transmitter-based technique is retransmission, sending the message multiple times. Although this idea is simple, because of the extra time required to send multiple signals, this technique is incapable of supporting real-time applications.[2]\nPacket repetition, also called forward error correction (FEC), adds redundant data, which the receiver can use to recover lost packets. This minimizes loss, but increases the size of the packet.[5][6]\nInterleaving involves scrambling the data before transmission. When a packet is lost, rather than losing an entire set of data, small portions of several sets will be gone. At the receiving end, the message is then deinterleaved to reveal the original message with minimal loss.\nTransmission without interleaving:\nThe term \"AnExample\" ends up mostly unintelligible and difficult to correct.\nWith interleaving:\nNo word is completely lost and the missing letters can be recovered with minimal guesswork.[7]\nDepending on the method of transmission (analog or digital), there are a variety of ways for errors to propagate in the message.\nSince its invention in the 1950s, the magnetic coating used in analog video tape has experienced radio frequency (RF) signal drop-outs. Some of the techniques that were used for resolving these issues are analogous to those used for concealing errors in modern compressed video signals.\nThe process of click removal in audio restoration is another example of error concealment. A closely analogous example in the domain of image processing is the use of digital dust and scratch removal processing in film restoration.\nError concealment has many digital applications, including web browsing, video conferencing, Skype, and YouTube[2][8]", 
    "dbpedia_url": "http://dbpedia.org/resource/Error_concealment", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Error_concealment\n"
}