{
    "about": "Estimation theory is a branch of statistics that deals with estimating the values of parameters based on measured empirical data that has a random component. The parameters describe an underlying physical setting in such a way that their value affects the distribution of the measured data. An estimator attempts to approximate the unknown parameters using the measurements.", 
    "name": "Estimation Theory", 
    "classification": "Signal Processing", 
    "full_text": "Estimation theory is a branch of statistics that deals with estimating the values of parameters based on measured empirical data that has a random component. The parameters describe an underlying physical setting in such a way that their value affects the distribution of the measured data. An estimator attempts to approximate the unknown parameters using the measurements.\nFor example, it is desired to estimate the proportion of a population of voters who will vote for a particular candidate. That proportion is the parameter sought; the estimate is based on a small random sample of voters.\nOr, for example, in radar the goal is to estimate the range of objects (airplanes, boats, etc.) by analyzing the two-way transit timing of received echoes of transmitted pulses. Since the reflected pulses are unavoidably embedded in electrical noise, their measured values are randomly distributed, so that the transit time must be estimated.\nIn estimation theory, two approaches are generally considered. [1]\nFor example, in electrical communication theory, the measurements which contain information regarding the parameters of interest are often associated with a noisy signal. Without randomness, or noise, the problem would be deterministic and estimation would not be needed.\n\n\nTo build a model, several statistical \"ingredients\" need to be known. These are needed to ensure the estimator has some mathematical tractability.\nThe first is a set of statistical samples taken from a random vector (RV) of size N. Put into a vector,\nSecondly, there are the corresponding M parameters\nwhich need to be established with their continuous probability density function (pdf) or its discrete counterpart, the probability mass function (pmf)\nIt is also possible for the parameters themselves to have a probability distribution (e.g., Bayesian statistics). It is then necessary to define the Bayesian probability\nAfter the model is formed, the goal is to estimate the parameters, commonly denoted \n\n\n\n\n\n\n\nθ\n\n^\n\n\n\n\n\n{\\displaystyle {\\hat {\\mathbf {\\theta } }}}\n\n, where the \"hat\" indicates the estimate.\nOne common estimator is the minimum mean squared error estimator, which utilizes the error between the estimated parameters and the actual value of the parameters\nas the basis for optimality. This error term is then squared and minimized for the MMSE estimator.\nCommonly used estimators and estimation methods, and topics related to them:\nConsider a received discrete signal, \n\n\n\nx\n[\nn\n]\n\n\n{\\displaystyle x[n]}\n\n, of \n\n\n\nN\n\n\n{\\displaystyle N}\n\n independent samples that consists of an unknown constant \n\n\n\nA\n\n\n{\\displaystyle A}\n\n with additive white Gaussian noise (AWGN) \n\n\n\nw\n[\nn\n]\n\n\n{\\displaystyle w[n]}\n\n with known variance \n\n\n\n\nσ\n\n2\n\n\n\n\n{\\displaystyle \\sigma ^{2}}\n\n (i.e., \n\n\n\n\n\nN\n\n\n(\n0\n,\n\nσ\n\n2\n\n\n)\n\n\n{\\displaystyle {\\mathcal {N}}(0,\\sigma ^{2})}\n\n). Since the variance is known then the only unknown parameter is \n\n\n\nA\n\n\n{\\displaystyle A}\n\n.\nThe model for the signal is then\nTwo possible (of many) estimators for the parameter \n\n\n\nA\n\n\n{\\displaystyle A}\n\n are:\nBoth of these estimators have a mean of \n\n\n\nA\n\n\n{\\displaystyle A}\n\n, which can be shown through taking the expected value of each estimator\nand\nAt this point, these two estimators would appear to perform the same. However, the difference between them becomes apparent when comparing the variances.\nand\nIt would seem that the sample mean is a better estimator since its variance is lower for every N > 1.\nContinuing the example using the maximum likelihood estimator, the probability density function (pdf) of the noise for one sample \n\n\n\nw\n[\nn\n]\n\n\n{\\displaystyle w[n]}\n\n is\nand the probability of \n\n\n\nx\n[\nn\n]\n\n\n{\\displaystyle x[n]}\n\n becomes (\n\n\n\nx\n[\nn\n]\n\n\n{\\displaystyle x[n]}\n\n can be thought of a \n\n\n\n\n\nN\n\n\n(\nA\n,\n\nσ\n\n2\n\n\n)\n\n\n{\\displaystyle {\\mathcal {N}}(A,\\sigma ^{2})}\n\n)\nBy independence, the probability of \n\n\n\n\nx\n\n\n\n{\\displaystyle \\mathbf {x} }\n\n becomes\nTaking the natural logarithm of the pdf\nand the maximum likelihood estimator is\nTaking the first derivative of the log-likelihood function\nand setting it to zero\nThis results in the maximum likelihood estimator\nwhich is simply the sample mean. From this example, it was found that the sample mean is the maximum likelihood estimator for \n\n\n\nN\n\n\n{\\displaystyle N}\n\n samples of a fixed, unknown parameter corrupted by AWGN.\nTo find the Cramér–Rao lower bound (CRLB) of the sample mean estimator, it is first necessary to find the Fisher information number\nand copying from above\nTaking the second derivative\nand finding the negative expected value is trivial since it is now a deterministic constant \n\n\n\n−\n\nE\n\n\n[\n\n\n\n∂\n\n2\n\n\n\n∂\n\nA\n\n2\n\n\n\n\n\nln\n⁡\np\n(\n\nx\n\n;\nA\n)\n]\n\n=\n\n\nN\n\nσ\n\n2\n\n\n\n\n\n\n{\\displaystyle -\\mathrm {E} \\left[{\\frac {\\partial ^{2}}{\\partial A^{2}}}\\ln p(\\mathbf {x} ;A)\\right]={\\frac {N}{\\sigma ^{2}}}}\n\n\nFinally, putting the Fisher information into\nresults in\nComparing this to the variance of the sample mean (determined previously) shows that the sample mean is equal to the Cramér–Rao lower bound for all values of \n\n\n\nN\n\n\n{\\displaystyle N}\n\n and \n\n\n\nA\n\n\n{\\displaystyle A}\n\n. In other words, the sample mean is the (necessarily unique) efficient estimator, and thus also the minimum variance unbiased estimator (MVUE), in addition to being the maximum likelihood estimator.\nOne of the simplest non-trivial examples of estimation is the estimation of the maximum of a uniform distribution. It is used as a hands-on classroom exercise and to illustrate basic principles of estimation theory. Further, in the case of estimation based on a single sample, it demonstrates philosophical issues and possible misunderstandings in the use of maximum likelihood estimators and likelihood functions.\nGiven a discrete uniform distribution \n\n\n\n1\n,\n2\n,\n…\n,\nN\n\n\n{\\displaystyle 1,2,\\dots ,N}\n\n with unknown maximum, the UMVU estimator for the maximum is given by\nwhere m is the sample maximum and k is the sample size, sampling without replacement.[2][3] This problem is commonly known as the German tank problem, due to application of maximum estimation to estimates of German tank production during World War II.\nThe formula may be understood intuitively as:\nthe gap being added to compensate for the negative bias of the sample maximum as an estimator for the population maximum.[note 1]\nThis has a variance of[2]\nso a standard deviation of approximately \n\n\n\nN\n\n/\n\nk\n\n\n{\\displaystyle N/k}\n\n, the (population) average size of a gap between samples; compare \n\n\n\n\n\nm\nk\n\n\n\n\n{\\displaystyle {\\frac {m}{k}}}\n\n above. This can be seen as a very simple case of maximum spacing estimation.\nThe sample maximum is the maximum likelihood estimator for the population maximum, but, as discussed above, it is biased.\nNumerous fields require the use of estimation theory. Some of these fields include (but are by no means limited to):\nMeasured data are likely to be subject to noise or uncertainty and it is through statistical probability that optimal solutions are sought to extract as much information from the data as possible.", 
    "dbpedia_url": "http://dbpedia.org/resource/Estimation_theory", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Estimation_theory\n"
}