{
    "about": "Evolutionary music is the audio counterpart to evolutionary art, whereby algorithmic music is created using an evolutionary algorithm. The process begins with a population of individuals which by some means or other produce audio (e.g. a piece, melody, or loop), which is either initialized randomly or based on human-generated music. Then through the repeated application of computational steps analogous to biological selection, recombination and mutation the aim is for the produced audio to become more musical. Evolutionary sound synthesis is a related technique for generating sounds or synthesizer instruments. Evolutionary music is typically generated using an interactive evolutionary algorithm where the fitness function is the user or audience, as it is difficult to capture the aesthetic qualities of music computationally. However, research into automated measures of musical quality is also active. Evolutionary computation techniques have also been applied to harmonization and accompaniment tasks. The most commonly used evolutionary computation techniques are genetic algorithms and genetic programming.", 
    "name": "Evolutionary Music", 
    "classification": "Evolutionary Algorithms", 
    "full_text": "Evolutionary music is the audio counterpart to evolutionary art, whereby algorithmic music is created using an evolutionary algorithm. The process begins with a population of individuals which by some means or other produce audio (e.g. a piece, melody, or loop), which is either initialized randomly or based on human-generated music. Then through the repeated application of computational steps analogous to biological selection, recombination and mutation the aim is for the produced audio to become more musical. Evolutionary sound synthesis is a related technique for generating sounds or synthesizer instruments. Evolutionary music is typically generated using an interactive evolutionary algorithm where the fitness function is the user or audience, as it is difficult to capture the aesthetic qualities of music computationally. However, research into automated measures of musical quality is also active. Evolutionary computation techniques have also been applied to harmonization and accompaniment tasks. The most commonly used evolutionary computation techniques are genetic algorithms and genetic programming.\n\n\nNEUROGEN (Gibson & Byrne, 1991) employed a genetic algorithm to produce and combine musical fragments and a neural network (trained on examples of \"real\" music) to evaluate their fitness. A genetic algorithm is also a key part of the improvisation and accompaniment system GenJam which has been developed since 1993 by Al Biles. Biles and GenJam are together known as the Al Biles Virtual Quintet and have performed many times to human audiences. Genetic programming has been used to produce music since the work of Lee Spector and Alpern Alpern on evolved bebop musicians in 1994[1] and 1995,[2] and in 1997 Brad Johanson and Riccardo Poli developed the GP-Music System which used genetic programming to breed melodies according to both human and automated ratings. Since 1996 Rodney Waschka II has been using genetic algorithms for music composition including works such as Saint Ambrose[3] and his string quartets.[4] Several systems for drum loop evolution have been produced (including one commercial program called MuSing).\nThe EvoMUSART Conference[5] from 2012 (previously a workshop from 2003) was part of the Evo*[6] event annually from 2003. This event on evolutionary music and art is one of the main outlets for work on evolutionary music.\nAn annual Workshop in Evolutionary Music[7] has been held at GECCO (Genetic and Evolutionary Computation Conference[8]) since 2011.\nThe EuroGP Song Contest (a pun on Eurovision Song Contest) was held at EuroGP 2004. In this experiment several tens of users were first tested for their ability to recognise musical differences, and then a short piano-based melody was evolved.\nAl Biles gave a tutorial on evolutionary music at GECCO 2005 and co-edited a book on the subject with contributions from many researchers in the field.\nEvolutune is a small Windows application from 2005 for evolving simple loops of \"beeps and boops\". It has a graphical interface where the user can select parents manually.\nThe GeneticDrummer is a Genetic Algorithm based system for generating human-competitive rhythm accompaniment.\nThe easy Song Builder is an evolutionary composition program. The user decides which version of the song will be the germ for the next generation.\nMelomics, an artificial intelligence group based in Málaga, Spain, has used evolutionary algorithms to compose full pieces of music in specific genres, creating the first album composed by a computer and performed by human musicians in 2012.[9] The music is then exported into mp3, MIDI, XML, and PDF for application by the user.\nThe DarwinTunes project has been running since 2009 (and before that as \"Evolectronica\") - recently a multiplayer game version of DarwinTunes was demonstrated at science festivals[10][11] and is now available on the web.", 
    "dbpedia_url": "http://dbpedia.org/resource/Evolutionary_music", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Evolutionary_music\n"
}