{
    "about": "The algebraic stress model arises in computational fluid dynamics. Two main approaches can be undertaken. In the first, the transport of the turbulent stresses is assumed proportional to the turbulent kinetic energy; while in the second, convective and diffusive effects are assumed to be negligible. Algebraic stress models can only be used where convective and diffusive fluxes are negligible, i.e. source dominated flows. In order to simplify the existing EASM and to achieve an efficient numerical implementation the underlying tensor basis plays an important role. The five-term tensor basis that is introduced here tries to combine an optimum of accuracy of the complete basis with the advantages of a pure 2d concept. Therefore a suitable five-term basis is identified. Based on that the new model is designed and validated in combination with different eddy-viscosity type background models.", 
    "name": "Explicit Algebraic Stress Model", 
    "classification": "Numerical Analysis", 
    "full_text": "The algebraic stress model arises in computational fluid dynamics. Two main approaches can be undertaken. In the first, the transport of the turbulent stresses is assumed proportional to the turbulent kinetic energy; while in the second, convective and diffusive effects are assumed to be negligible. Algebraic stress models can only be used where convective and diffusive fluxes are negligible, i.e. source dominated flows. In order to simplify the existing EASM and to achieve an efficient numerical implementation the underlying tensor basis plays an important role. The five-term tensor basis that is introduced here tries to combine an optimum of accuracy of the complete basis with the advantages of a pure 2d concept. Therefore a suitable five-term basis is identified. Based on that the new model is designed and validated in combination with different eddy-viscosity type background models.\n\n\nIn the frame work of single-point closures (Reynolds-stress transport models = RSTM) still provide the best representation of flow physics. Due to numeric requirements an explicit formulation based on a low number of tensors is desirable and was already introduced originally most explicit algebraic stress models are formulated using a 10-term basis:\nThe reduction of the tensor basis however requires an enormous mathematical effort, to transform the algebraic stress formulation for a given linear algebraic RSTM into a given tensor basis by keeping all important properties of the underlying model. This transformation can be applied to an arbitrary tensor basis. In the present investigations an optimum set of basis tensors and the corresponding coefficients is to be found.\nThe projection method was introduced to enable an approximate solution of the algebraic transport equation of the Reynolds-stresses. In contrast to the approach of the tensor basis is not inserted in the algebraic equation, instead the algebraic equation is projected. Therefore, the chosen basis tensors does not need to form a complete integrity basis. However, the projection will fail if the basis tensor are linear dependent. In the case of a complete basis the projection leads to the same solution as the direct insertion, otherwise an approximate solution in the sense is obtained.\nIn order to prove, that the projection method will lead to the same solution as the direct insertion, the EASM for two-dimensional flows is derived. In two-dimensional flows only the tensors are independent.\nThe projection leads then to the same coefficients. This two-dimensional EASM is used as starting point for an optimized EASM which includes three-dimensional effects. For example the shear stress variation in a rotating pipe cannot be predicted with quadratic tensors. Hence, the EASM was extended with a cubic tensor. In order to do not affect the performance in 2D flows, a tensor was chosen that vanish in 2d flows. This offers the concentration of the coefficient determination in 3d flows. A cubic tensor, which vanishes in 3d flow is:\nThe projection with tensors T(1), T(2), T(3) and T(5) yields then the coefficients of the EASM.\nA direct result of the EASM derivation is a variable formulation of Cμ.As the generators of the extended EASM where chosen to preserve the existing 2D formulation the expression of Cμ remains unchanged:\nAi are the constants of the underlying pressure-strain model. Since η1 is always positive it might be possible that Cμ becomes singular. Therefore in the first EASM derivation of a regularization was introduced, which prevent a singular by cutting the range of η1. However, Wallin et al. pointed out that the regularization detoriated the performance of the EASM. In their model the methodology was refined to account for the coefficient.\nThis leads to a weak non-linear conditional equation for the EASM coefficients and an additional equation for g must be solved. In 3D the equation of g is of 6th order, wherefore a closed solution is only possible in 2D flows, where the equation reduces to 3rd order. In order to circumvent the root finding of a polynomial equation quasi self-consistent approach. He showed that by using a Cμ expression of a realizable linear model instead of the EASM-Cμ expression in the equation of g the same properties of g follows. For a wide range of and the quasi self-consistent approach is almost identical to the fully self-consistent solution. Thus the quality of the EASM is not affected with the advantage of no additional non-linear equation. Since in the projections to determine the EASM coefficients the complexity is reduced by neglecting higher order invariants.", 
    "dbpedia_url": "http://dbpedia.org/resource/Explicit_algebraic_stress_model", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Explicit_algebraic_stress_model\n"
}