{
    "about": "In mathematics and computer programming, exponentiating by squaring is a general method for fast computation of large positive integer powers of a number, or more generally of an element of a semigroup, like a polynomial or a square matrix. Some variants are commonly referred to as square-and-multiply algorithms or binary exponentiation. These can be of quite general use, for example in modular arithmetic or powering of matrices. For semigroups for which additive notation is commonly used, like elliptic curves used in cryptography, this method is also referred to as double-and-add.", 
    "name": "Exponentiation By Squaring", 
    "classification": "Computer Arithmetic Algorithms", 
    "full_text": "In mathematics and computer programming, exponentiating by squaring is a general method for fast computation of large positive integer powers of a number, or more generally of an element of a semigroup, like a polynomial or a square matrix. Some variants are commonly referred to as square-and-multiply algorithms or binary exponentiation. These can be of quite general use, for example in modular arithmetic or powering of matrices. For semigroups for which additive notation is commonly used, like elliptic curves used in cryptography, this method is also referred to as double-and-add.\n\n\nThe method is based on the observation that, for a positive integer n, we have\nThis may be easily implemented as the following recursive algorithm:\nAlthough not tail-recursive, this algorithm may be rewritten into a tail recursive algorithm by introducing an auxiliary function:\nThe iterative version of the algorithm also uses a bounded auxiliary space, and is given by\nA brief analysis shows that such an algorithm uses \n\n\n\n⌊\n\nlog\n\n2\n\n\n⁡\nn\n⌋\n\n\n{\\displaystyle \\lfloor \\log _{2}n\\rfloor }\n\n squarings and at most \n\n\n\n⌊\n\nlog\n\n2\n\n\n⁡\nn\n⌋\n\n\n{\\displaystyle \\lfloor \\log _{2}n\\rfloor }\n\n multiplications, where \n\n\n\n⌊\n\n⌋\n\n\n{\\displaystyle \\lfloor \\;\\rfloor }\n\n denotes the floor function. More precisely, the number of multiplications is one less than the number of ones present in the binary expansion of n. For n greater than about 4 this is computationally more efficient than naively multiplying the base with itself repeatedly.\nEach squaring results in approximately double the number of digits of the previous, and so, if multiplication of two d digit numbers is implemented in O(dk) operations for some fixed k then the complexity of computing xn is given by:\nThis algorithm calculates the value of xn after expanding the exponent in base 2k. It was first proposed by Brauer in 1939. In the algorithm below we make use of the following function f(0) = (k,0) and f(m) = (s,u) where m = u·2s with u odd.\nAlgorithm:\nFor optimal efficiency, k should be the smallest integer satisfying [1]\nThis method is an efficient variant of the 2k-ary method. For example, to calculate the exponent 398 which has binary expansion (110 001 110)2, we take a window of length 3 using the 2k-ary method algorithm we calculate 1,x3,x6,x12,x24,x48,x49,x98,x99,x198,x199,x398. But, we can also compute 1,x3,x6,x12,x24,x48,x96,x192,x199, x398 which saves one multiplication and amounts to evaluating (110 001 110)n2\nHere is the general algorithm:\nAlgorithm:\nAlgorithm:\nMany algorithms for exponentiation do not provide defence against side-channel attacks. Namely, an attacker observing the sequence of squarings and multiplications can (partially) recover the exponent involved in the computation. This is a problem if the exponent should remain secret, as with many public-key cryptosystems. A technique called Montgomery's Ladder[2] addresses this concern.\nGiven the binary expansion of a positive, non-zero integer n=(nk-1...n0)2 with nk-1=1 we can compute xn as follows:\nThe algorithm performs a fixed sequence of operations (up to log n): a multiplication and squaring takes place for each bit in the exponent, regardless of the bit's specific value.\nThis specific implementation of Montgomery's ladder is not yet protected against cache timing attacks: memory access latencies might still be observable to an attacker as you access different variables depending on the value of bits of the secret exponent.\nThere are several methods which can be employed to calculate xn when the base is fixed and the exponent varies. As one can see, precomputations play a key role in these algorithms.\nYao's method is orthogonal to the 2k-ary method where the exponent is expanded in radix b=2k and the computation is as performed in the algorithm above. Let \"n\", \"ni\", \"b\", and \"bi\" be integers.\nLet the exponent \"n\" be written as\nLet xi = xbi. Then the algorithm uses the equality\nGiven the element 'x' of G, and the exponent 'n' written in the above form, along with the precomputed values xb0....xbw-1 the element xn is calculated using the algorithm below.\nIf we set h=2k and bi = hi then the ni's are simply the digits of n in base h. Yao's method collects in u first those xi which appear to the highest power \n\n\n\nh\n−\n1\n\n\n{\\displaystyle h-1}\n\n; in the next round those with power \n\n\n\nh\n−\n2\n\n\n{\\displaystyle h-2}\n\n are collected in u as well etc. The variable y is multiplied \n\n\n\nh\n−\n1\n\n\n{\\displaystyle h-1}\n\n times with the initial u, \n\n\n\nh\n−\n2\n\n\n{\\displaystyle h-2}\n\n times with the next highest powers etc. The algorithm uses \n\n\n\nw\n+\nh\n−\n2\n\n\n{\\displaystyle w+h-2}\n\n multiplications and \n\n\n\nw\n+\n1\n\n\n{\\displaystyle w+1}\n\n elements must be stored to compute xn.[1]\nThe Euclidean method was first introduced in Efficient exponentiation using precomputation and vector addition chains by P.D Rooij.\nThis method for computing \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x^{n}}\n\n in group G, where n is a natural integer, whose algorithm is given below, is using the following equality recursively:\nGiven the base element x in group G, and the exponent \n\n\n\nn\n\n\n{\\displaystyle n}\n\n written as in Yao's method, the element \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x^{n}}\n\n is calculated using \n\n\n\nl\n\n\n{\\displaystyle l}\n\n precomputed values \n\n\n\n\nx\n\n\nb\n\n0\n\n\n\n\n,\n.\n.\n.\n,\n\nx\n\n\nb\n\n\nl\n\ni\n\n\n\n\n\n\n\n\n{\\displaystyle x^{b_{0}},...,x^{b_{l_{i}}}}\n\n and then the algorithm below.\nThe algorithm first finds the largest value amongst the ni and then the supremum within the set of { ni \\ i ≠ M }. Then it raises xM to the power q, multiplies this value with xN, and then assigns xN the result of this computation and nM the value nM modulo nN.\nThe same idea allows fast computation of large exponents modulo a number. Especially in cryptography, it is useful to compute powers in a ring of integers modulo q. It can also be used to compute integer powers in a group, using the rule\nThe method works in every semigroup and is often used to compute powers of matrices.\nFor example, the evaluation of\nwould take a very long time and lots of storage space if the naïve method were used: compute 13789722341 then take the remainder when divided by 2345. Even using a more effective method will take a long time: square 13789, take the remainder when divided by 2345, multiply the result by 13789, and so on. This will take less than \n\n\n\n2\n\nlog\n\n2\n\n\n⁡\n(\n722340\n)\n≤\n40\n\n\n{\\displaystyle 2\\log _{2}(722340)\\leq 40}\n\n modular multiplications.\nApplying above exp-by-squaring algorithm, with \"*\" interpreted as x*y = xy mod 2345 (that is a multiplication followed by a division with remainder) leads to only 27 multiplications and divisions of integers which may all be stored in a single machine word.\nThis is a non-recursive implementation of the above algorithm in Ruby.\nIn most statically typed languages, result=1 must be replaced with code assigning an identity matrix of the same size as x to result to get a matrix exponentiating algorithm. In Ruby, thanks to coercion, result is automatically upgraded to the appropriate type, so this function works with matrices as well as with integers and floats. Note that n=n-1 is redundant when n=n/2 implicitly rounds towards zero, as lower level languages would do. n[0] is the rightmost bit of the binary representation of n, so if it is 1, the number is odd, if it is zero, the number is even.\nJavaScript-Demonstration: http://home.mnet-online.de/wzwz.de/temp/ebs/en.htm\nExponentiation by squaring may also be used to calculate the product of 2 or more powers. If the underlying group or semigroup is commutative then it is often possible to reduce the number of multiplications by computing the product simultaneously.\nThe formula a7×b5 may be calculated within 3 steps:\nso one gets eight multiplications in total.\nA faster solution is to calculate both powers simultaneously:\nwhich needs only 6 multiplications in total. Note that a×b is calculated twice, the result could be stored after the first calculation which reduces the count of multiplication to 5.\nExample with numbers:\nCalculating the powers simultaneously instead of calculating them separately always reduces the count of multiplications if at least two of the exponents are greater than 1.\nThe example above a7×b5 may also be calculated with only 5 multiplications if the expression is transformed before calculation:\na7×b5 = a2×(ab)5 with ab := a×b\nGeneralization of transformation shows the following scheme:\nFor calculating aA×bB×...×mM×nN\n1st: define ab := a×b, abc = ab×c, ...\n2nd: calculate the transformed expression aA−B×abB−C×...×abc..mM−N×abc..mnN\nTransformation before calculation often reduces the count of multiplications but in some cases it also increases the count (see the last one of the examples below), so it may be a good idea to check the count of multiplications before using the transformed expression for calculation.\nFor the following expressions the count of multiplications is shown for calculating each power separately, calculating them simultaneously without transformation and calculating them simultaneously after transformation.\nIn certain computations it may be more efficient to allow negative coefficients and hence use the inverse of the base, provided inversion in G is 'fast' or has been precomputed. For example, when computing x2k−1 the binary method requires k−1 multiplications and k−1 squarings. However one could perform k squarings to get x2k and then multiply by x−1 to obtain x2k−1.\nTo this end we define the signed-digit representation of an integer n in radix b as\nSigned binary representation corresponds to the particular choice b=2 and \n\n\n\n\nn\n\ni\n\n\n∈\n{\n−\n1\n,\n0\n,\n1\n}\n\n\n{\\displaystyle n_{i}\\in \\{-1,0,1\\}}\n\n. It is denoted by \n\n\n\n(\n\nn\n\nl\n−\n1\n\n\n…\n\nn\n\n0\n\n\n\n)\n\ns\n\n\n\n\n{\\displaystyle (n_{l-1}\\dots n_{0})_{s}}\n\n. There are several methods for computing this representation. The representation is not unique, for example take n=478. Two distinct signed-binary representations are given by \n\n\n\n(\n10\n\n\n\n1\n¯\n\n\n\n1100\n\n\n\n1\n¯\n\n\n\n10\n\n)\n\ns\n\n\n\n\n{\\displaystyle (10{\\bar {1}}1100{\\bar {1}}10)_{s}}\n\n and \n\n\n\n(\n100\n\n\n\n1\n¯\n\n\n\n1000\n\n\n\n1\n¯\n\n\n\n0\n\n)\n\ns\n\n\n\n\n{\\displaystyle (100{\\bar {1}}1000{\\bar {1}}0)_{s}}\n\n, where \n\n\n\n\n\n\n1\n¯\n\n\n\n\n\n{\\displaystyle {\\bar {1}}}\n\n is used to denote -1. Since the binary method computes a multiplication for every non-zero entry in the base 2 representation of n, we are interested in finding the signed-binary representation with the smallest number of non-zero entries, that is, the one with minimal Hamming weight. One method of doing this is to compute the representation in non-adjacent form, or NAF for short, which is one that satisfies \n\n\n\n\nn\n\ni\n\n\n\nn\n\ni\n+\n1\n\n\n=\n0\n\n for all \n\ni\n⩾\n0\n\n\n{\\displaystyle n_{i}n_{i+1}=0{\\text{ for all }}i\\geqslant 0}\n\n and denoted by \n\n\n\n(\n\nn\n\nl\n−\n1\n\n\n…\n\nn\n\n0\n\n\n\n)\n\nNAF\n\n\n\n\n{\\displaystyle (n_{l-1}\\dots n_{0})_{\\text{NAF}}}\n\n. For example the NAF representation of 478 is equal to \n\n\n\n(\n1000\n\n\n\n1\n¯\n\n\n\n000\n\n\n\n1\n¯\n\n\n\n0\n\n)\n\nNAF\n\n\n\n\n{\\displaystyle (1000{\\bar {1}}000{\\bar {1}}0)_{\\text{NAF}}}\n\n. This representation always has minimal Hamming weight. A simple algorithm to compute the NAF representation of a given integer \n\n\n\nn\n=\n(\n\nn\n\nl\n\n\n\nn\n\nl\n−\n1\n\n\n…\n\nn\n\n0\n\n\n\n)\n\n2\n\n\n\n\n{\\displaystyle n=(n_{l}n_{l-1}\\dots n_{0})_{2}}\n\n with \n\n\n\n\nn\n\nl\n\n\n=\n\nn\n\nl\n−\n1\n\n\n=\n0\n\n\n{\\displaystyle n_{l}=n_{l-1}=0}\n\n is the following:\nAnother algorithm by Koyama and Tsuruoka does not require the condition that \n\n\n\n\nn\n\ni\n\n\n=\n\nn\n\ni\n+\n1\n\n\n=\n0\n\n\n{\\displaystyle n_{i}=n_{i+1}=0}\n\n; it still minimizes the Hamming weight.\nExponentiation by squaring can be viewed as a suboptimal addition-chain exponentiation algorithm: it computes the exponent via an addition chain consisting of repeated exponent doublings (squarings) and/or incrementing exponents by one (multiplying by x) only. More generally, if one allows any previously computed exponents to be summed (by multiplying those powers of x), one can sometimes perform the exponentiation using fewer multiplications (but typically using more memory). The smallest power where this occurs is for n=15:\nIn general, finding the optimal addition chain for a given exponent is a hard problem, for which no efficient algorithms are known, so optimal chains are typically only used for small exponents (e.g. in compilers where the chains for small powers have been pre-tabulated). However, there are a number of heuristic algorithms that, while not being optimal, have fewer multiplications than exponentiation by squaring at the cost of additional bookkeeping work and memory usage. Regardless, the number of multiplications never grows more slowly than Θ(log n), so these algorithms only improve asymptotically upon exponentiation by squaring by a constant factor at best.", 
    "dbpedia_url": "http://dbpedia.org/resource/Exponentiation_by_squaring", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Exponentiation_by_squaring\n"
}