{
    "about": "In mathematics and computer algebra, factorization of polynomials or polynomial factorization is the process of expressing a polynomial with coefficients in a given field or in the integers as the product of irreducible factors with coefficients in the same domain. Polynomial factorization is one of the fundamental tools of the computer algebra systems.", 
    "name": "Factorization Of Polynomials", 
    "classification": "Computer Algebra", 
    "full_text": "In mathematics and computer algebra, factorization of polynomials or polynomial factorization is the process of expressing a polynomial with coefficients in a given field or in the integers as the product of irreducible factors with coefficients in the same domain. Polynomial factorization is one of the fundamental tools of the computer algebra systems.\nThe history of polynomial factorization starts with Hermann Schubert who in 1793 described the first polynomial factorization algorithm,[citation needed] and Leopold Kronecker, who rediscovered Schubert's algorithm in 1882 and extended it to multivariate polynomials and coefficients in an algebraic extension. But most of the knowledge on this topic is not older than circa 1965 and the first computer algebra systems. In a survey of the subject, Erich Kaltofen wrote in 1982 (see the bibliography, below):\nWhen the long-known finite step algorithms were first put on computers, they turned out to be highly inefficient. The fact that almost any uni- or multivariate polynomial of degree up to 100 and with coefficients of a moderate size (up to 100 bits) can be factored by modern algorithms in a few minutes of computer time indicates how successfully this problem has been attacked during the past fifteen years.\nNowadays, modern algorithms and computers can quickly factor univariate polynomials of degree more than 1000 having coefficients with thousands of digits.[1]\n\n\nPolynomial rings over the integers or over a field are unique factorization domains. This means that every element of these rings is a product of a constant and a product of irreducible polynomials (those that are not the product of two non-constant polynomials). Moreover, this decomposition is unique up to multiplication of the factors by invertible constants.\nFactorization depends on the base field. For example, the fundamental theorem of algebra, which states that every polynomial with complex coefficients has complex roots, implies that a polynomial with integer coefficients can be factored (with root-finding algorithms) into linear factors over the complex field C. Similarly, over the field of reals, the irreducible factors have degree at most two, while there are polynomials of any degree that are irreducible over the field of rationals Q.\nThe question of polynomial factorization makes sense only for coefficients in a computable field whose every element may be represented in a computer and for which there are algorithms for the arithmetic operations. Fröhlich and Shepherson have provided examples of such fields for which no factorization algorithm can exist.\nThe fields of coefficients for which factorization algorithms are known include prime fields (i.e. the field of rationals and prime modular arithmetic) and their finitely generated field extensions. Integer coefficients are also tractable. Kronecker's classical method is interesting only from a historical point of view; modern algorithms proceed by a succession of:\nand reductions:\nIn this section, we show that factoring over Q (the rational numbers) and over Z (the integers) is essentially the same problem.\nThe content of a polynomial p ∈ Z[X], denoted \"cont(p)\", is, up to its sign, the greatest common divisor of its coefficients. The primitive part of p is primpart(p)=p/cont(p), which is a primitive polynomial with integer coefficients. This defines a factorization of p into the product of an integer and a primitive polynomial. This factorization is unique up to the sign of the content. It is a usual convention to choose the sign of the content such that the leading coefficient of the primitive part is positive.\nFor example,\nis a factorization into content and primitive part.\nEvery polynomial q with rational coefficients may be written\nwhere p ∈ Z[X] and c ∈ Z: it suffices to take for c a multiple of all denominators of the coefficients of q (for example their product) and p = cq. The content of q is defined as:\nand the primitive part of q is that of p. As for the polynomials with integer coefficients, this defines a factorization into a rational number and a primitive polynomial with integer coefficients. This factorization is also unique up to the choice of a sign.\nFor example,\nis a factorization into content and primitive part.\nGauss proved that the product of two primitive polynomials is also primitive (Gauss's lemma). This implies that a primitive polynomial is irreducible over the rationals if and only if it is irreducible over the integers. This implies also that the factorization over the rationals of a polynomial with rational coefficients is the same as the factorization over the integers of its primitive part. On the other hand, the factorization over the integers of a polynomial with integer coefficients is the product of the factorization of its primitive part by the factorization of its content.\nIn other words, integer GCD computation allows to reduce the factorization of a polynomial over the rationals to the factorization of a primitive polynomial with integer coefficients, and to reduce the factorization over the integers to the factorization of an integer and a primitive polynomial.\nEverything that precedes remains true if Z is replaced by a polynomial ring over a field F and Q is replaced by a field of rational functions over F in the same variables, with the only difference that \"up to a sign\" must be replaced by \"up to the multiplication by an invertible constant in F\". This allows to reduce the factorization over a purely transcendental field extension of F to the factorization of multivariate polynomials over F.\nIf two or more factors of a polynomial are identical to each other, then the polynomial is a multiple of the square of this factor. In the case of univariate polynomials, this results in multiple roots. In this case, then the multiple factor is also a factor of the polynomial's derivative (with respect to any of the variables, if several). In the case of univariate polynomials over the rationals (or more generally over a field of characteristic zero), Yun's algorithm exploits this to factorize efficiently the polynomial into factors that are not multiple of a square and are therefore called square-free. To factorize the initial polynomial, it suffices to factorize each square-free factor. Square-free factorization is therefore the first step in most polynomial factorization algorithms.\nYun's algorithm extends to the multivariate case by considering a multivariate polynomial as an univariate polynomial over a polynomial ring.\nIn the case of a polynomial over a finite field, Yun's algorithm applies only if the degree is smaller than the characteristic, because, otherwise, the derivative of a non zero polynomial may be zero (over the field with p elements, the derivative of a polynomial in xp is always zero). Nevertheless, a succession of GCD computations, starting from the polynomial and its derivative, allows one to compute the square-free decomposition; see Polynomial factorization over finite fields#Square-free factorization.\nThis section describes textbook methods that can be convenient when computing by hand. These methods are not used for computer computations because they use integer factorization, which at the moment has a much higher complexity than polynomial factorization.\nAll linear factors with rational coefficients can be found using the rational root test. If the polynomial to be factored is \n\n\n\n\na\n\nn\n\n\n\nx\n\nn\n\n\n+\n\na\n\nn\n−\n1\n\n\n\nx\n\nn\n−\n1\n\n\n+\n⋯\n+\n\na\n\n1\n\n\nx\n+\n\na\n\n0\n\n\n\n\n{\\displaystyle a_{n}x^{n}+a_{n-1}x^{n-1}+\\cdots +a_{1}x+a_{0}}\n\n, then all possible linear factors are of the form \n\n\n\n\nb\n\n1\n\n\nx\n−\n\nb\n\n0\n\n\n\n\n{\\displaystyle b_{1}x-b_{0}}\n\n, where \n\n\n\n\nb\n\n1\n\n\n\n\n{\\displaystyle b_{1}}\n\n is an integer factor of \n\n\n\n\na\n\nn\n\n\n\n\n{\\displaystyle a_{n}}\n\n and \n\n\n\n\nb\n\n0\n\n\n\n\n{\\displaystyle b_{0}}\n\n is an integer factor of \n\n\n\n\na\n\n0\n\n\n\n\n{\\displaystyle a_{0}}\n\n. All possible combinations of integer factors can be tested for validity, and each valid one can be factored out using polynomial long division. If the original polynomial is the product of factors, at least two of which are of degree 2 or higher, this technique only provides a partial factorization; otherwise the factorization is complete. In particular, if there is exactly one non-linear factor, it will be the polynomial left after all linear factors have been factorized out. Note that in the case of a cubic polynomial, if the cubic is factorisable at all, the rational root test gives a complete factorization, either into a linear factor and an irreducible quadratic factor, or into three linear factors.\nSince integer polynomials must factor into integer polynomial factors, and evaluating integer polynomials at integer values must produce integers, the integer values of a polynomial can be factored in only a finite number of ways, and produce only a finite number of possible polynomial factors.\nFor example, consider\nIf this polynomial factors over Z, then at least one of its factors must be of degree two or less. We need three values to uniquely fit a second degree polynomial. We'll use \n\n\n\nf\n(\n0\n)\n=\n2\n\n\n{\\displaystyle f(0)=2}\n\n, \n\n\n\nf\n(\n1\n)\n=\n6\n\n\n{\\displaystyle f(1)=6}\n\n and \n\n\n\nf\n(\n−\n1\n)\n=\n2\n\n\n{\\displaystyle f(-1)=2}\n\n. Note that if one of those values were 0 then you already found a root (and so a factor). If none is 0, then each one has a finite number of divisors. Now, 2 can only factor as\nTherefore, if a second degree integer polynomial factor exists, it must take one of the values\nat \n\n\n\nx\n=\n0\n\n\n{\\displaystyle x=0}\n\n, and likewise at \n\n\n\nx\n=\n−\n1\n\n\n{\\displaystyle x=-1}\n\n. There are eight different ways to factor 6 (one for each divisor of 6), so there are\npossible combinations, of which half can be discarded as the negatives of the other half, corresponding to 64 possible second degree integer polynomials that must be checked. These are the only possible integer polynomial factors of \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n. Testing them exhaustively reveals that\nconstructed from \n\n\n\np\n(\n0\n)\n=\n1\n\n\n{\\displaystyle p(0)=1}\n\n, \n\n\n\np\n(\n1\n)\n=\n3\n\n\n{\\displaystyle p(1)=3}\n\n and \n\n\n\np\n(\n−\n1\n)\n=\n1\n\n\n{\\displaystyle p(-1)=1}\n\n, factors \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n.\nDividing \n\n\n\nf\n\n\n{\\displaystyle f}\n\n by \n\n\n\np\n\n\n{\\displaystyle p}\n\n gives the other factor \n\n\n\nq\n(\nx\n)\n=\n\nx\n\n3\n\n\n−\nx\n+\n2\n\n\n{\\displaystyle q(x)=x^{3}-x+2}\n\n, so that \n\n\n\nf\n=\np\nq\n\n\n{\\displaystyle f=pq}\n\n. Now one can test recursively to find factors of \n\n\n\np\n\n\n{\\displaystyle p}\n\n and \n\n\n\nq\n\n\n{\\displaystyle q}\n\n. It turns out they both are irreducible over the integers, so that the irreducible factorization of \n\n\n\nf\n\n\n{\\displaystyle f}\n\n is\n(Van der Waerden, Sections 5.4 and 5.6)\nIf \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n is a univariate polynomial over the integers, assumed to be content-free and square-free, one starts by computing a bound \n\n\n\nB\n\n\n{\\displaystyle B}\n\n such that any factor \n\n\n\ng\n(\nx\n)\n\n\n{\\displaystyle g(x)}\n\n will have coefficients of absolute value bounded by \n\n\n\nB\n\n\n{\\displaystyle B}\n\n. This way, if \n\n\n\nm\n\n\n{\\displaystyle m}\n\n is an integer larger than \n\n\n\n2\nB\n\n\n{\\displaystyle 2B}\n\n, and if \n\n\n\ng\n(\nx\n)\n\n\n{\\displaystyle g(x)}\n\n is known modulo \n\n\n\nm\n\n\n{\\displaystyle m}\n\n, then \n\n\n\ng\n(\nx\n)\n\n\n{\\displaystyle g(x)}\n\n can be reconstructed from its image mod \n\n\n\nm\n\n\n{\\displaystyle m}\n\n.\nThe Zassenhaus algorithm proceeds as follows. First, choose a prime number \n\n\n\np\n\n\n{\\displaystyle p}\n\n such that the image of \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n mod \n\n\n\np\n\n\n{\\displaystyle p}\n\n remains square-free, and of the same degree as \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n. Then factor \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n mod \n\n\n\np\n\n\n{\\displaystyle p}\n\n. This produces integer polynomials \n\n\n\n\nf\n\n1\n\n\n(\nx\n)\n,\n.\n.\n.\n,\n\nf\n\nr\n\n\n(\nx\n)\n\n\n{\\displaystyle f_{1}(x),...,f_{r}(x)}\n\n whose product matches \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n mod \n\n\n\np\n\n\n{\\displaystyle p}\n\n. Next, apply Hensel lifting, this updates the \n\n\n\n\nf\n\ni\n\n\n(\nx\n)\n\n\n{\\displaystyle f_{i}(x)}\n\n in such a way that now their product matches \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n mod \n\n\n\n\np\n\na\n\n\n\n\n{\\displaystyle p^{a}}\n\n, where \n\n\n\na\n\n\n{\\displaystyle a}\n\n is chosen in such a way that \n\n\n\n\np\n\na\n\n\n\n\n{\\displaystyle p^{a}}\n\n is larger than \n\n\n\n2\nB\n\n\n{\\displaystyle 2B}\n\n. Modulo \n\n\n\n\np\n\na\n\n\n\n\n{\\displaystyle p^{a}}\n\n, the polynomial \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n has (up to units) \n\n\n\n\n2\n\nr\n\n\n\n\n{\\displaystyle 2^{r}}\n\n factors: for each subset of \n\n\n\n\n\nf\n\n1\n\n\n(\nx\n)\n,\n.\n.\n.\n,\n\nf\n\nr\n\n\n(\nx\n)\n\n\n\n{\\displaystyle {f_{1}(x),...,f_{r}(x)}}\n\n, the product is a factor of \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n mod \n\n\n\n\np\n\na\n\n\n\n\n{\\displaystyle p^{a}}\n\n. However, a factor modulo \n\n\n\n\np\n\na\n\n\n\n\n{\\displaystyle p^{a}}\n\n need not correspond to a so-called \"true factor\": a factor of \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n in \n\n\n\nZ\n[\nx\n]\n\n\n{\\displaystyle Z[x]}\n\n. For each factor mod \n\n\n\n\np\n\na\n\n\n\n\n{\\displaystyle p^{a}}\n\n, we can test if it corresponds to a \"true\" factor, and if so, find that \"true\" factor, provided that \n\n\n\n\np\n\na\n\n\n\n\n{\\displaystyle p^{a}}\n\n exceeds \n\n\n\n2\nB\n\n\n{\\displaystyle 2B}\n\n. This way, all irreducible \"true\" factors can be found by checking at most \n\n\n\n\n2\n\nr\n\n\n\n\n{\\displaystyle 2^{r}}\n\n cases. This is reduced to \n\n\n\n\n2\n\nr\n−\n1\n\n\n\n\n{\\displaystyle 2^{r-1}}\n\n cases by skipping complements. If \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n is reducible, the number of cases is reduced further by removing those \n\n\n\n\nf\n\ni\n\n\n(\nx\n)\n\n\n{\\displaystyle f_{i}(x)}\n\n that appear in an already found \"true\" factor. Zassenhaus algorithm processes each case (each subset) quickly, however, in the worst case, it considers an exponential number of cases.\nThe first polynomial time algorithm for factoring rational polynomials has been discovered by Lenstra, Lenstra and Lovász and is an application of Lenstra–Lenstra–Lovász lattice basis reduction algorithm, usually called \"LLL algorithm\". (Lenstra, Lenstra & Lovász 1982) A simplified version of the LLL factorization algorithm is as follows: calculate a complex (or p-adic) root α of the polynomial \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n to high precision, then use the Lenstra–Lenstra–Lovász lattice basis reduction algorithm to find an approximate linear relation between 1, α, α2, α3, ... with integer coefficients, which might be an exact linear relation and a polynomial factor of \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n. One can determine a bound for the precision that guarantees that this method produces either a factor, or an irreducibility proof. Although this method is polynomial time, it was not used in practice because the lattice has high dimension and huge entries, which makes the computation slow.\nThe exponential complexity in the algorithm of Zassenhaus comes from a combinatorial problem: how to select the right subsets of \n\n\n\n\nf\n\n1\n\n\n(\nx\n)\n,\n.\n.\n.\n,\n\nf\n\nr\n\n\n(\nx\n)\n\n\n{\\displaystyle f_{1}(x),...,f_{r}(x)}\n\n. State of the art factoring implementations work in a manner similar to Zassenhaus, except that the combinatorial problem is translated to a lattice problem that is then solved by LLL.[2] In this approach, LLL is not used to compute coefficients of factors, instead, it is used to compute vectors with \n\n\n\nr\n\n\n{\\displaystyle r}\n\n entries in {0,1} that encode the subsets of \n\n\n\n\nf\n\n1\n\n\n(\nx\n)\n,\n.\n.\n.\n,\n\nf\n\nr\n\n\n(\nx\n)\n\n\n{\\displaystyle f_{1}(x),...,f_{r}(x)}\n\n that correspond to the irreducible \"true\" factors.\nWe can factor a polynomial \n\n\n\np\n(\nx\n)\n∈\nK\n[\nx\n]\n\n\n{\\displaystyle p(x)\\in K[x]}\n\n, where the field \n\n\n\nK\n\n\n{\\displaystyle K}\n\n is a finite extension of \n\n\n\n\nQ\n\n\n\n{\\displaystyle \\mathbb {Q} }\n\n. First, using square-free factorization, we may suppose that the polynomial is square-free. Next we write \n\n\n\nL\n=\nK\n[\nx\n]\n\n/\n\np\n(\nx\n)\n\n\n{\\displaystyle L=K[x]/p(x)}\n\n explicitly as an algebra over \n\n\n\n\nQ\n\n\n\n{\\displaystyle \\mathbb {Q} }\n\n. We next pick a random element \n\n\n\nα\n∈\nL\n\n\n{\\displaystyle \\alpha \\in L}\n\n. By the primitive element theorem, \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n generates \n\n\n\nL\n\n\n{\\displaystyle L}\n\n over \n\n\n\n\nQ\n\n\n\n{\\displaystyle \\mathbb {Q} }\n\n with high probability. If this is the case, we can compute the minimal polynomial, \n\n\n\nq\n(\ny\n)\n∈\n\nQ\n\n[\ny\n]\n\n\n{\\displaystyle q(y)\\in \\mathbb {Q} [y]}\n\n of \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n over \n\n\n\n\nQ\n\n\n\n{\\displaystyle \\mathbb {Q} }\n\n. Factoring\nover \n\n\n\n\nQ\n\n[\ny\n]\n\n\n{\\displaystyle \\mathbb {Q} [y]}\n\n, we determine that\n(notice that \n\n\n\nL\n\n\n{\\displaystyle L}\n\n is a reduced ring since \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n is square-free), where \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n corresponds to the element \n\n\n\n(\ny\n,\ny\n,\n…\n,\ny\n)\n\n\n{\\displaystyle (y,y,\\ldots ,y)}\n\n. Note that this is the unique decomposition of \n\n\n\nL\n\n\n{\\displaystyle L}\n\n as a product of fields. Hence this decomposition is the same as\nwhere\nis the factorization of \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n over \n\n\n\nK\n[\nx\n]\n\n\n{\\displaystyle K[x]}\n\n. By writing \n\n\n\nx\n∈\nL\n\n\n{\\displaystyle x\\in L}\n\n and generators of \n\n\n\nK\n\n\n{\\displaystyle K}\n\n as a polynomials in \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n, we can determine the embeddings of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\nK\n\n\n{\\displaystyle K}\n\n into the components \n\n\n\n\nQ\n\n[\ny\n]\n\n/\n\n\nq\n\ni\n\n\n(\ny\n)\n=\nK\n[\nx\n]\n\n/\n\n\np\n\ni\n\n\n(\nx\n)\n\n\n{\\displaystyle \\mathbb {Q} [y]/q_{i}(y)=K[x]/p_{i}(x)}\n\n. By finding the minimal polynomial of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n in this ring, we have computed \n\n\n\n\np\n\ni\n\n\n(\nx\n)\n\n\n{\\displaystyle p_{i}(x)}\n\n, and thus factored \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n over \n\n\n\nK\n.\n\n\n{\\displaystyle K.}\n\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Factorization_of_polynomials", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Factorization_of_polynomials\n"
}