{
    "about": "False precision (also called overprecision, fake precision, misplaced precision and spurious accuracy) occurs when numerical data are presented in a manner that implies better precision than is actually the case; since precision is a limit to accuracy, this often leads to overconfidence in the accuracy as well.[1]", 
    "name": "False Precision", 
    "classification": "Numerical Analysis", 
    "full_text": "False precision (also called overprecision, fake precision, misplaced precision and spurious accuracy) occurs when numerical data are presented in a manner that implies better precision than is actually the case; since precision is a limit to accuracy, this often leads to overconfidence in the accuracy as well.[1]\n\n\nMadsen Pirie defines the term \"false precision\" in a more general way: when exact numbers are used for notions that cannot be expressed in exact terms. For example, \"I am 90% sure he is wrong\". Often false precision is abused to produce an unwarranted confidence in the claim: \"our mouthwash is twice as good as our competitor's\". [2]\nIn science and engineering, convention dictates that unless a margin of error is explicitly stated, the number of significant figures used in the presentation of data should be limited to what is warranted by the precision of those data. For example, if an instrument can be read to tenths of a unit of measurement, results of calculations using data obtained from that instrument can only be confidently stated to the tenths place, regardless of what the raw calculation returns or whether other data used in the calculation are more accurate. Even outside these disciplines, there is a tendency to assume that all the non-zero digits of a number are meaningful; thus, providing excessive figures may lead the viewer to expect better precision than actually exists.\nHowever, in contrast, it is good practice to retain more significant figures than this in the intermediate stages of a calculation, in order to avoid accumulated rounding errors.\nFalse precision commonly arises when high-precision and low-precision data are combined, and in conversion of units.\nFalse precision is the gist of numerous variations of a joke which can be summarized as follows: A tour guide at a museum says a dinosaur skeleton is 100,000,005 years old, because an expert told him that it was 100 million years old when he started working there 5 years ago.\nMeasures that rely on statistical sampling, such as IQ tests, are often reported with false precision.[3]", 
    "dbpedia_url": "http://dbpedia.org/resource/False_precision", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/False_precision\n"
}