{
    "about": "The fast multipole method (FMM) is a numerical technique that was developed to speed up the calculation of long-ranged forces in the n-body problem. It does this by expanding the system Green's function using a multipole expansion, which allows one to group sources that lie close together and treat them as if they are a single source.[1]", 
    "name": "Fast Multipole Method", 
    "classification": "Numerical Analysis", 
    "full_text": "The fast multipole method (FMM) is a numerical technique that was developed to speed up the calculation of long-ranged forces in the n-body problem. It does this by expanding the system Green's function using a multipole expansion, which allows one to group sources that lie close together and treat them as if they are a single source.[1]\nThe FMM has also been applied in accelerating the iterative solver in the method of moments (MOM) as applied to computational electromagnetics problems.[2] The FMM was first introduced in this manner by Greengard and Rokhlin[3] and is based on the multipole expansion of the vector Helmholtz equation. By treating the interactions between far-away basis functions using the FMM, the corresponding matrix elements do not need to be explicitly stored, resulting in a significant reduction in required memory. If the FMM is then applied in a hierarchical manner, it can improve the complexity of matrix-vector products in an iterative solver from \n\n\n\n\n\nO\n\n\n(\n\nN\n\n2\n\n\n)\n\n\n{\\displaystyle {\\mathcal {O}}(N^{2})}\n\n to \n\n\n\n\n\nO\n\n\n(\nN\n)\n\n\n{\\displaystyle {\\mathcal {O}}(N)}\n\n in finite arithmetic, i.e., given a tolerance \n\n\n\nϵ\n\n\n{\\displaystyle \\epsilon }\n\n, the matrix-vector product is guaranteed to be within a tolerance \n\n\n\nϵ\n\n\n{\\displaystyle \\epsilon }\n\n. The dependence of the complexity on the tolerance \n\n\n\nϵ\n\n\n{\\displaystyle \\epsilon }\n\n is \n\n\n\n\n\nO\n\n\n(\nlog\n⁡\n(\n1\n\n/\n\nϵ\n)\n)\n\n\n{\\displaystyle {\\mathcal {O}}(\\log(1/\\epsilon ))}\n\n, i.e., the complexity of FMM is \n\n\n\n\n\nO\n\n\n(\nlog\n⁡\n(\n1\n\n/\n\nϵ\n)\nN\n)\n\n\n{\\displaystyle {\\mathcal {O}}(\\log(1/\\epsilon )N)}\n\n. This has expanded the area of applicability of the MOM to far greater problems than were previously possible.\nThe FMM, introduced by Rokhlin and Greengard, has been said to be one of the top ten algorithms of the 20th century.[4] The FMM algorithm reduces the complexity of matrix-vector multiplication involving a certain type of dense matrix which can arise out of many physical systems.\nThe FMM has also been applied for efficiently treating the Coulomb interaction in Hartree–Fock and density functional theory calculations in quantum chemistry.", 
    "dbpedia_url": "http://dbpedia.org/resource/Fast_multipole_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Fast_multipole_method\n"
}