{
    "about": "Frequency difference of arrival (FDOA), also frequently called differential Doppler (DD), is a technique analogous to TDOA for estimating the location of a radio emitter based on observations from other points. (It can also be used for estimating one's own position based on observations of multiple emitters). TDOA and FDOA are sometimes used together to improve location accuracy and the resulting estimates are somewhat independent. By combining TDOA and FDOA measurements, instantaneous geolocation can be performed in two dimensions.", 
    "name": "Fdoa", 
    "classification": "Digital Signal Processing", 
    "full_text": "Frequency difference of arrival (FDOA), also frequently called differential Doppler (DD), is a technique analogous to TDOA for estimating the location of a radio emitter based on observations from other points. (It can also be used for estimating one's own position based on observations of multiple emitters). TDOA and FDOA are sometimes used together to improve location accuracy and the resulting estimates are somewhat independent. By combining TDOA and FDOA measurements, instantaneous geolocation can be performed in two dimensions.\nIt differs from TDOA in that the FDOA observation points must be in relative motion with respect to each other and the emitter. This relative motion results in different doppler shifts observations of the emitter at each location in general. The relative motion can be achieved by using airborne observations in aircraft, for example. The emitter location can then be estimated with knowledge of the observation points' location and vector velocities and the observed relative doppler shifts between pairs of locations.\nA disadvantage of FDOA is that large amounts of data must be moved between observation points or to a central location to do the cross-correlation that is necessary to estimate the doppler shift.\nThe accuracy of the location estimate is related to the bandwidth of the emitter's signal, the signal-to-noise ratio at each observation point, and the geometry and vector velocities of the emitter and the observation points.\n", 
    "dbpedia_url": "http://dbpedia.org/resource/FDOA", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/FDOA\n"
}