{
    "about": "In physics, the Fermi–Pasta–Ulam problem or FPU problem was the apparent paradox in chaos theory that many complicated enough physical systems exhibited almost exactly periodic behavior – called Fermi–Pasta–Ulam recurrence – instead of ergodic behavior. One of the resolutions of the paradox includes the insight that many non-linear equations are exactly integrable. Another may be that ergodic behavior may depend on the initial energy of the system.", 
    "name": "Fermi–Pasta–Ulam Problem", 
    "classification": "Computational Physics", 
    "full_text": "In physics, the Fermi–Pasta–Ulam problem or FPU problem was the apparent paradox in chaos theory that many complicated enough physical systems exhibited almost exactly periodic behavior – called Fermi–Pasta–Ulam recurrence – instead of ergodic behavior. One of the resolutions of the paradox includes the insight that many non-linear equations are exactly integrable. Another may be that ergodic behavior may depend on the initial energy of the system.\n\n\nIn the summer of 1953 Enrico Fermi, John Pasta, Stanislaw Ulam, and Mary Tsingou conducted numerical experiments (i.e. computer simulations) of a vibrating string that included a non-linear term (quadratic in one test, cubic in another, and a piecewise linear approximation to a cubic in a third). They found that the behavior of the system was quite different from what intuition would have led them to expect. Fermi thought that after many iterations, the system would exhibit thermalization, an ergodic behavior in which the influence of the initial modes of vibration fade and the system becomes more or less random with all modes excited more or less equally. Instead, the system exhibited a very complicated quasi-periodic behavior. They published their results in a Los Alamos technical report in 1955. (Enrico Fermi died in 1954 and so this technical report was published after Fermi's death.)\nThe FPU experiment was important both in showing the complexity of nonlinear system behavior and the value of computer simulation in analyzing systems.\nIn January 2008, Physics Today published additional information regarding the development of FPU.[1]\nFermi, Pasta and Ulam (FPU) simulated the vibrating string by solving the following discrete system of nearest-neighbor coupled oscillators. We follow the explanation as given in Palais's article. Let there be N oscillators representing a string of length l with equilibrium positions \n\n\n\n\np\n\nj\n\n\n=\nj\nh\n,\nj\n=\n0\n,\n…\n,\nN\n−\n1\n\n\n{\\displaystyle p_{j}=jh,j=0,\\dots ,N-1}\n\n where \n\n\n\nh\n=\nl\n\n/\n\n(\nN\n−\n1\n)\n\n\n{\\displaystyle h=l/(N-1)}\n\n is the lattice spacing. Then the position of the jth oscillator as a function of time is \n\n\n\n\nX\n\nj\n\n\n(\nt\n)\n=\n\np\n\nj\n\n\n+\n\nx\n\nj\n\n\n(\nt\n)\n\n\n{\\displaystyle X_{j}(t)=p_{j}+x_{j}(t)}\n\n so that \n\n\n\n\nx\n\nj\n\n\n(\nt\n)\n\n\n{\\displaystyle x_{j}(t)}\n\n gives the displacement from equilibrium. FPU used the following equations of motion:\n(Note: this equation is not equivalent to the classical one given in the French version of the article)\nThis is just Newton's second law for the jth particle. The first factor \n\n\n\nk\n(\n\nx\n\nj\n+\n1\n\n\n+\n\nx\n\nj\n−\n1\n\n\n−\n2\n\nx\n\nj\n\n\n)\n\n\n{\\displaystyle k(x_{j+1}+x_{j-1}-2x_{j})}\n\n is just the usual Hooke's law form for the force. The factor with \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n is the nonlinear force. We can rewrite this in terms of continuum quantities by defining \n\n\n\nc\n=\n\n\nκ\n\n/\n\nρ\n\n\n\n\n{\\displaystyle c={\\sqrt {\\kappa /\\rho }}}\n\n to be the wave speed, where \n\n\n\nκ\n=\nk\n\n/\n\nh\n\n\n{\\displaystyle \\kappa =k/h}\n\n is the Young's modulus for the string and \n\n\n\nρ\n=\nm\n\n/\n\n\nh\n\n3\n\n\n\n\n{\\displaystyle \\rho =m/h^{3}}\n\n is the density:\nThe continuum limit of the governing equations for the string (with the quadratic force term) is the Korteweg–de Vries equation (KdV equation.) The discovery of this relationship and of the soliton solutions of the KdV equation by Kruskal and Zabusky in 1965 was an important step forward in nonlinear system research. We reproduce below a derivation of this limit, which is rather tricky, as found in Palais's article. Beginning from the \"continuum form\" of the lattice equations above, we first define u(x,t) to be the displacement of the string at position x and time t. We'll then want a correspondence so that \n\n\n\nu\n(\n\np\n\nj\n\n\n,\nt\n)\n\n\n{\\displaystyle u(p_{j},t)}\n\n is \n\n\n\n\nx\n\nj\n\n\n(\nt\n)\n\n\n{\\displaystyle x_{j}(t)}\n\n.\nWe can use Taylor's theorem to rewrite the second factor for small \n\n\n\nh\n\n\n{\\displaystyle h}\n\n, (subscripts of u denote partial derivatives):\nSimilarly, the second term in the third factor is:\nThus, the FPU system is:\nIf one were to keep terms up to O(h) only and assume that \n\n\n\n2\nα\nh\n\n\n{\\displaystyle 2\\alpha h}\n\n approaches a limit, the resulting equation is one which develops shocks, which is not observed. Thus one keeps the O(h2) term as well:\nWe now make the following substitutions, motivated by the decomposition of traveling wave solutions (of the ordinary wave equation, to which this reduces when \n\n\n\nα\n,\nh\n\n\n{\\displaystyle \\alpha ,h}\n\n vanish) into left- and right-moving waves, so that we only consider a right-moving wave. Let \n\n\n\nξ\n=\nx\n−\nc\nt\n,\nτ\n=\n(\nα\nh\n)\nc\nt\n,\ny\n(\nξ\n,\nτ\n)\n=\nu\n(\nx\n,\nt\n)\n\n\n{\\displaystyle \\xi =x-ct,\\tau =(\\alpha h)ct,y(\\xi ,\\tau )=u(x,t)}\n\n. Under this change of coordinates, the equation becomes:\nTo take the continuum limit, assume that \n\n\n\nα\n\n/\n\nh\n\n\n{\\displaystyle \\alpha /h}\n\n tends to a constant and \n\n\n\nα\n,\nh\n\n\n{\\displaystyle \\alpha ,h}\n\n tend to zero. If we take \n\n\n\nδ\n=\n\nlim\n\nh\n→\n0\n\n\n\n\nh\n\n/\n\n(\n24\nα\n)\n\n\n\n\n{\\displaystyle \\delta =\\lim _{h\\rightarrow 0}{\\sqrt {h/(24\\alpha )}}}\n\n, then:\nTaking \n\n\n\nv\n=\n\ny\n\nξ\n\n\n\n\n{\\displaystyle v=y_{\\xi }}\n\n results in the KdV equation:\nZabusky and Kruskal argued that it was the fact that soliton solutions of the KdV equation can pass through one another without affecting the asymptotic shapes that explained the quasi-periodicity of the waves in the FPU experiment. In short, thermalization could not occur because of a certain \"soliton symmetry\" in the system which broke ergodicity.", 
    "dbpedia_url": "http://dbpedia.org/resource/Fermi–Pasta–Ulam_problem", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Fermi–Pasta–Ulam_problem\n"
}