{
    "about": "In signal processing, a filter is a device or process that removes some unwanted components or features from a signal. Filtering is a class of signal processing, the defining feature of filters being the complete or partial suppression of some aspect of the signal[clarification needed]. Most often, this means removing some frequencies and not others in order to suppress interfering signals and reduce background noise. However, filters do not exclusively act in the frequency domain; especially in the field of image processing many other targets for filtering exist. Correlations can be removed for certain frequency components and not for others without having to act in the frequency domain.", 
    "name": "Filter (Signal Processing)", 
    "classification": "Signal Processing", 
    "full_text": "In signal processing, a filter is a device or process that removes some unwanted components or features from a signal. Filtering is a class of signal processing, the defining feature of filters being the complete or partial suppression of some aspect of the signal[clarification needed]. Most often, this means removing some frequencies and not others in order to suppress interfering signals and reduce background noise. However, filters do not exclusively act in the frequency domain; especially in the field of image processing many other targets for filtering exist. Correlations can be removed for certain frequency components and not for others without having to act in the frequency domain.\nThere are many different bases of classifying filters and these overlap in many different ways; there is no simple hierarchical classification. Filters may be:\n\n\nLinear continuous-time circuit is perhaps the most common meaning for filter in the signal processing world, and simply \"filter\" is often taken to be synonymous. These circuits are generally designed to remove certain frequencies and allow others to pass. Circuits that perform this function are generally linear in their response, or at least approximately so. Any nonlinearity would potentially result in the output signal containing frequency components not present in the input signal.\nThe modern design methodology for linear continuous-time filters is called network synthesis. Some important filter families designed in this way are:\nThe difference between these filter families is that they all use a different polynomial function to approximate to the ideal filter response. This results in each having a different transfer function.\nAnother older, less-used methodology is the image parameter method. Filters designed by this methodology are archaically called \"wave filters\". Some important filters designed by this method are:\nSome terms used to describe and classify linear filters:\nOne important application of filters is in telecommunication. Many telecommunication systems use frequency-division multiplexing, where the system designers divide a wide frequency band into many narrower frequency bands called \"slots\" or \"channels\", and each stream of information is allocated one of those channels. The people who design the filters at each transmitter and each receiver try to balance passing the desired signal through as accurately as possible, keeping interference to and from other cooperating transmitters and noise sources outside the system as low as possible, at reasonable cost.\nMultilevel and multiphase digital modulation systems require filters that have flat phase delay—are linear phase in the passband—to preserve pulse integrity in the time domain,[1] giving less intersymbol interference than other kinds of filters.\nOn the other hand, analog audio systems using analog transmission can tolerate much larger ripples in phase delay, and so designers of such systems often deliberately sacrifice linear phase to get filters that are better in other ways—better stop-band rejection, lower passband amplitude ripple, lower cost, etc.\nFilters can be built in a number of different technologies. The same transfer function can be realised in several different ways, that is the mathematical properties of the filter are the same but the physical properties are quite different. Often the components in different technologies are directly analogous to each other and fulfill the same role in their respective filters. For instance, the resistors, inductors and capacitors of electronics correspond respectively to dampers, masses and springs in mechanics. Likewise, there are corresponding components in distributed element filters.\nThe transfer function of a filter is most often defined in the domain of the complex frequencies. The back and forth passage to/from this domain is operated by the Laplace transform and its inverse (therefore, here below, the term \"input signal\" shall be understood as \"the Laplace transform of\" (the time representation of) the input signal, and so on).\nThe transfer function \n\n\n\n \nH\n(\ns\n)\n\n\n{\\displaystyle \\ H(s)}\n\n of a filter is the ratio of the output signal \n\n\n\n \nY\n(\ns\n)\n\n\n{\\displaystyle \\ Y(s)}\n\n to that of the input signal \n\n\n\n \nX\n(\ns\n)\n\n\n{\\displaystyle \\ X(s)}\n\n as a function of the complex frequency \n\n\n\n \ns\n\n\n{\\displaystyle \\ s}\n\n:\nwith \n\n\n\n \ns\n=\nσ\n+\nj\nω\n\n\n{\\displaystyle \\ s=\\sigma +j\\omega }\n\n.\nThe transfer function of all linear time-invariant filters generally share certain characteristics:\nDistributed element filters do not, in general, produce rational functions but can often approximate to them.\nThe proper construction of a transfer function involves the Laplace transform, and therefore it is needed to assume null initial conditions, because\nAnd when f(0)=0 we can get rid of the constants and use the usual expression\nAn alternative to transfer functions is to give the behavior of the filter as a convolution. The convolution theorem, which holds for Laplace transforms, guarantees equivalence with transfer functions.\nFilters may be specified by family and bandform. A filter's family is specified by the approximating polynomial used and each leads to certain characteristics of the transfer function of the filter. Some common filter families and their particular characteristics are:\nEach family of filters can be specified to a particular order. The higher the order, the more the filter will approach the \"ideal\" filter; but also the longer the impulse response is and the longer the latency will be. An ideal filter has full transmission in the pass band, complete attenuation in the stop band, and an abrupt transition between the two bands, but this filter has infinite order (i.e., the response cannot be expressed as a linear differential equation with a finite sum) and infinite latency (i.e., its compact support in the Fourier transform forces its time response to be ever lasting).\nHere is an image comparing Butterworth, Chebyshev, and elliptic filters. The filters in this illustration are all fifth-order low-pass filters. The particular implementation – analog or digital, passive or active – makes no difference; their output would be the same.\nAs is clear from the image, elliptic filters are sharper than all the others, but they show ripples on the whole bandwidth.\nAny family can be used to implement a particular bandform of which frequencies are transmitted, and which, outside the passband, are more or less attenuated. The transfer function completely specifies the behavior of a linear filter, but not the particular technology used to implement it. In other words, there are a number of different ways of achieving a particular transfer function when designing a circuit. A particular bandform of filter can be obtained by transformation of a prototype filter of that family.\nImpedance matching structures invariably take on the form of a filter, that is, a network of non-dissipative elements. For instance, in a passive electronics implementation, it would likely take the form of a ladder topology of inductors and capacitors. The design of matching networks shares much in common with filters and the design invariably will have a filtering action as an incidental consequence. Although the prime purpose of a matching network is not to filter, it is often the case that both functions are combined in the same circuit. The need for impedance matching does not arise while signals are in the digital domain.\nSimilar comments can be made regarding power dividers and directional couplers. When implemented in a distributed element format, these devices can take the form of a distributed element filter. There are four ports to be matched and widening the bandwidth requires filter-like structures to achieve this. The inverse is also true: distributed element filters can take the form of coupled lines.", 
    "dbpedia_url": "http://dbpedia.org/resource/Filter_(signal_processing)", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Filter_(signal_processing)\n"
}