{
    "about": "Filter design is the process of designing a signal processing filter that satisfies a set of requirements, some of which are contradictory. The purpose is to find a realization of the filter that meets each of the requirements to a sufficient degree to make it useful.", 
    "name": "Filter Design", 
    "classification": "Digital Signal Processing", 
    "full_text": "Filter design is the process of designing a signal processing filter that satisfies a set of requirements, some of which are contradictory. The purpose is to find a realization of the filter that meets each of the requirements to a sufficient degree to make it useful.\nThe filter design process can be described as an optimization problem where each requirement contributes to an error function which should be minimized. Certain parts of the design process can be automated, but normally an experienced electrical engineer is needed to get a good result.\n\n\nTypical requirements which are considered in the design process are:\nAn important parameter is the required frequency response. In particular, the steepness and complexity of the response curve is a deciding factor for the filter order and feasibility.\nA first-order recursive filter will only have a single frequency-dependent component. This means that the slope of the frequency response is limited to 6 dB per octave. For many purposes, this is not sufficient. To achieve steeper slopes, higher-order filters are required.\nIn relation to the desired frequency function, there may also be an accompanying weighting function, which describes, for each frequency, how important it is that the resulting frequency function approximates the desired one. The larger weight, the more important is a close approximation.\nTypical examples of frequency function are:\nThere is a direct correspondence between the filter's frequency function and its impulse response: the former is the Fourier transform of the latter. That means that any requirement on the frequency function is a requirement on the impulse response, and vice versa.\nHowever, in certain applications it may be the filter's impulse response that is explicit and the design process then aims at producing as close an approximation as possible to the requested impulse response given all other requirements.\nIn some cases it may even be relevant to consider a frequency function and impulse response of the filter which are chosen independently from each other. For example, we may want both a specific frequency function of the filter and that the resulting filter have a small effective width in the signal domain as possible. The latter condition can be realized by considering a very narrow function as the wanted impulse response of the filter even though this function has no relation to the desired frequency function. The goal of the design process is then to realize a filter which tries to meet both these contradicting design goals as much as possible.\nIn order to be implementable, any time-dependent filter (operating in real time) must be causal: the filter response only depends on the current and past inputs. A standard approach is to leave this requirement until the final step. If the resulting filter is not causal, it can be made causal by introducing an appropriate time-shift (or delay). If the filter is a part of a larger system (which it normally is) these types of delays have to be introduced with care since they affect the operation of the entire system.\nFilters that do not operate in real time (e.g. for image processing) can be non-causal. This e.g. allows the design of zero delay recursive filters, where the group delay of a causal filter is canceled by its Hermitian non-causal filter.\nA stable filter assures that every limited input signal produces a limited filter response. A filter which does not meet this requirement may in some situations prove useless or even harmful. Certain design approaches can guarantee stability, for example by using only feed-forward circuits such as an FIR filter. On the other hand, filters based on feedback circuits have other advantages and may therefore be preferred, even if this class of filters includes unstable filters. In this case, the filters must be carefully designed in order to avoid instability.\nIn certain applications we have to deal with signals which contain components which can be described as local phenomena, for example pulses or steps, which have certain time duration. A consequence of applying a filter to a signal is, in intuitive terms, that the duration of the local phenomena is extended by the width of the filter. This implies that it is sometimes important to keep the width of the filter's impulse response function as short as possible.\nAccording to the uncertainty relation of the Fourier transform, the product of the width of the filter's impulse response function and the width of its frequency function must exceed a certain constant. This means that any requirement on the filter's locality also implies a bound on its frequency function's width. Consequently, it may not be possible to simultaneously meet requirements on the locality of the filter's impulse response function as well as on its frequency function. This is a typical example of contradicting requirements.\nA general desire in any design is that the number of operations (additions and multiplications) needed to compute the filter response is as low as possible. In certain applications, this desire is a strict requirement, for example due to limited computational resources, limited power resources, or limited time. The last limitation is typical in real-time applications.\nThere are several ways in which a filter can have different computational complexity. For example, the order of a filter is more or less proportional to the number of operations. This means that by choosing a low order filter, the computation time can be reduced.\nFor discrete filters the computational complexity is more or less proportional to the number of filter coefficients. If the filter has many coefficients, for example in the case of multidimensional signals such as tomography data, it may be relevant to reduce the number of coefficients by removing those which are sufficiently close to zero. In multirate filters, the number of coefficients by taking advantage of its bandwidth limits, where the input signal is downsampled (e.g. to its critical frequency), and upsampled after filtering.\nAnother issue related to computational complexity is separability, that is, if and how a filter can be written as a convolution of two or more simpler filters. In particular, this issue is of importance for multidimensional filters, e.g., 2D filter which are used in image processing. In this case, a significant reduction in computational complexity can be obtained if the filter can be separated as the convolution of one 1D filter in the horizontal direction and one 1D filter in the vertical direction. A result of the filter design process may, e.g., be to approximate some desired filter as a separable filter or as a sum of separable filters.\nIt must also be decided how the filter is going to be implemented:\nThe design of linear analog filters is for the most part covered in the linear filter section.\nDigital filters are classified into one of two basic forms, according to how they respond to a unit impulse:\nUnless the sample rate is fixed by some outside constraint, selecting a suitable sample rate is an important design decision. A high rate will require more in terms of computational resources, but less in terms of anti-aliasing filters. Interference and beating with other signals in the system may also be an issue.\nFor any digital filter design, it is crucial to analyze and avoid aliasing effects. Often, this is done by adding analog anti-aliasing filters at the input and output, thus avoiding any frequency component above the Nyquist frequency. The complexity (i.e., steepness) of such filters depends on the required signal to noise ratio and the ratio between the sampling rate and the highest frequency of the signal.\nParts of the design problem relate to the fact that certain requirements are described in the frequency domain while others are expressed in the signal domain and that these may contradict. For example, it is not possible to obtain a filter which has both an arbitrary impulse response and arbitrary frequency function. Other effects which refer to relations between the signal and frequency domain are\nAs stated in the uncertainty principle, the product of the width of the frequency function and the width of the impulse response cannot be smaller than a specific constant. This implies that if a specific frequency function is requested, corresponding to a specific frequency width, the minimum width of the filter in the signal domain is set. Vice versa, if the maximum width of the response is given, this determines the smallest possible width in the frequency. This is a typical example of contradictory requirements where the filter design process may try to find a useful compromise.\nLet \n\n\n\n\nσ\n\ns\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{s}^{2}}\n\n be the variance of the input signal and let \n\n\n\n\nσ\n\nf\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{f}^{2}}\n\n be the variance of the filter. The variance of the filter response, \n\n\n\n\nσ\n\nr\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{r}^{2}}\n\n, is then given by\nThis means that \n\n\n\n\nσ\n\nr\n\n\n>\n\nσ\n\nf\n\n\n\n\n{\\displaystyle \\sigma _{r}>\\sigma _{f}}\n\n and implies that the localization of various features such as pulses or steps in the filter response is limited by the filter width in the signal domain. If a precise localization is requested, we need a filter of small width in the signal domain and, via the uncertainty principle, its width in the frequency domain cannot be arbitrary small.\nLet f(t) be a function and let \n\n\n\nF\n(\nω\n)\n\n\n{\\displaystyle F(\\omega )}\n\n be its Fourier transform. There is a theorem which states that if the first derivative of F which is discontinuous has order \n\n\n\nn\n≥\n0\n\n\n{\\displaystyle n\\geq 0}\n\n, then f has an asymptotic decay like \n\n\n\n\nt\n\n−\nn\n−\n1\n\n\n\n\n{\\displaystyle t^{-n-1}}\n\n.\nA consequence of this theorem is that the frequency function of a filter should be as smooth as possible to allow its impulse response to have a fast decay, and thereby a short width.\nOne common method for designing FIR filters is the Parks-McClellan filter design algorithm, based on the Remez exchange algorithm. Here the user specifies a desired frequency response, a weighting function for errors from this response, and a filter order N. The algorithm then finds the set of N coefficients that minimize the maximum deviation from the ideal. Intuitively, this finds the filter that is as close as you can get to the desired response given that you can use only N coefficients. This method is particularly easy in practice and at least one text[1] includes a program that takes the desired filter and N and returns the optimum coefficients. One possible drawback to filters designed this way is that they contain many small ripples in the passband(s), since such a filter minimizes the peak error.\nAnother method to finding a discrete FIR filter is filter optimization described in Knutsson et al., which minimizes the integral of the square of the error, instead of its maximum value. In its basic form this approach requires that an ideal frequency function of the filter \n\n\n\n\nF\n\nI\n\n\n(\nω\n)\n\n\n{\\displaystyle F_{I}(\\omega )}\n\n is specified together with a frequency weighting function \n\n\n\nW\n(\nω\n)\n\n\n{\\displaystyle W(\\omega )}\n\n and set of coordinates \n\n\n\n\nx\n\nk\n\n\n\n\n{\\displaystyle x_{k}}\n\n in the signal domain where the filter coefficients are located.\nAn error function \n\n\n\nε\n\n\n{\\displaystyle \\varepsilon }\n\n is defined as\nwhere \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n is the discrete filter and \n\n\n\n\n\nF\n\n\n\n\n{\\displaystyle {\\mathcal {F}}}\n\n is the discrete-time Fourier transform defined on the specified set of coordinates. The norm used here is, formally, the usual norm on \n\n\n\n\nL\n\n2\n\n\n\n\n{\\displaystyle L^{2}}\n\n spaces. This means that \n\n\n\nε\n\n\n{\\displaystyle \\varepsilon }\n\n measures the deviation between the requested frequency function of the filter, \n\n\n\n\nF\n\nI\n\n\n\n\n{\\displaystyle F_{I}}\n\n, and the actual frequency function of the realized filter, \n\n\n\n\n\nF\n\n\n{\nf\n}\n\n\n{\\displaystyle {\\mathcal {F}}\\{f\\}}\n\n. However, the deviation is also subject to the weighting function \n\n\n\nW\n\n\n{\\displaystyle W}\n\n before the error function is computed.\nOnce the error function is established, the optimal filter is given by the coefficients \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n which minimize \n\n\n\nε\n\n\n{\\displaystyle \\varepsilon }\n\n. This can be done by solving the corresponding least squares problem. In practice, the \n\n\n\n\nL\n\n2\n\n\n\n\n{\\displaystyle L^{2}}\n\n norm has to be approximated by means of a suitable sum over discrete points in the frequency domain. In general, however, these points should be significantly more than the number of coefficients in the signal domain to obtain a useful approximation.\nThe previous method can be extended to include an additional error term related to a desired filter impulse response in the signal domain, with a corresponding weighting function. The ideal impulse response can be chosen independently of the ideal frequency function and is in practice used to limit the effective width and to remove ringing effects of the resulting filter in the signal domain. This is done by choosing a narrow ideal filter impulse response function, e.g., an impulse, and a weighting function which grows fast with the distance from the origin, e.g., the distance squared. The optimal filter can still be calculated by solving a simple least squares problem and the resulting filter is then a \"compromise\" which has a total optimal fit to the ideal functions in both domains. An important parameter is the relative strength of the two weighting functions which determines in which domain it is more important to have a good fit relative to the ideal function.", 
    "dbpedia_url": "http://dbpedia.org/resource/Filter_design", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Filter_design\n"
}