{
    "about": "In signal processing, a filter bank is an array of band-pass filters that separates the input signal into multiple components, each one carrying a single frequency sub-band of the original signal. One application of a filter bank is a graphic equalizer, which can attenuate the components differently and recombine them into a modified version of the original signal. The process of decomposition performed by the filter bank is called analysis (meaning analysis of the signal in terms of its components in each sub-band); the output of analysis is referred to as a subband signal with as many subbands as there are filters in the filter bank. The reconstruction process is called synthesis, meaning reconstitution of a complete signal resulting from the filtering process.", 
    "name": "Filter Bank", 
    "classification": "Digital Signal Processing", 
    "full_text": "In signal processing, a filter bank is an array of band-pass filters that separates the input signal into multiple components, each one carrying a single frequency sub-band of the original signal. One application of a filter bank is a graphic equalizer, which can attenuate the components differently and recombine them into a modified version of the original signal. The process of decomposition performed by the filter bank is called analysis (meaning analysis of the signal in terms of its components in each sub-band); the output of analysis is referred to as a subband signal with as many subbands as there are filters in the filter bank. The reconstruction process is called synthesis, meaning reconstitution of a complete signal resulting from the filtering process.\nIn digital signal processing, the term filter bank is also commonly applied to a bank of receivers. The difference is that receivers also down-convert the subbands to a low center frequency that can be re-sampled at a reduced rate. The same result can sometimes be achieved by undersampling the bandpass subbands.\nAnother application of filter banks is signal compression, when some frequencies are more important than others. After decomposition, the important frequencies can be coded with a fine resolution. Small differences at these frequencies are significant and a coding scheme that preserves these differences must be used. On the other hand, less important frequencies do not have to be exact. A coarser coding scheme can be used, even though some of the finer (but less important) details will be lost in the coding.\nThe vocoder uses a filter bank to determine the amplitude information of the subbands of a modulator signal (such as a voice) and uses them to control the amplitude of the subbands of a carrier signal (such as the output of a guitar or synthesizer), thus imposing the dynamic characteristics of the modulator on the carrier.\n\n\nA bank of receivers can be created by performing a sequence of FFTs on overlapping segments of the input data stream. A weighting function (aka window function) is applied to each segment to control the shape of the frequency responses of the filters. The wider the shape, the more points the FFT will have to generate in order to satisfy the Nyquist sampling criteria.[note 1] For a fixed segment length, the amount of overlap determines how often the FFTs are done (and vice versa). Also, the wider the shape of the filters, the fewer filters that are needed to span the input bandwidth. Eliminating unnecessary filters (i.e. decimation in frequency) is efficiently done by treating each weighted segment as a sequence of smaller blocks, and the FFT is performed on only the sum of the blocks. This has been referred to as multi-block windowing and weighted pre-sum FFT (see Sampling the DTFT).\nA special case occurs when, by design, the length of the blocks is an integer multiple of the interval between FFTs. Then the FFT filter bank can be described in terms of one or more polyphase filter structures where the phases are recombined by an FFT instead of a simple summation. The number of blocks per segment is the impulse response length (or depth) of each filter. The computational efficiencies of the FFT and polyphase structures, on a general purpose processor, are identical.\nSynthesis (i.e. recombining the outputs of multiple receivers) is basically a matter of upsampling each one at a rate commensurate with the total bandwidth to be created, translating each channel to its new center frequency, and summing the streams of samples. In that context, the interpolation filter associated with upsampling is called synthesis filter. The net frequency response of each channel is the product of the synthesis filter with the frequency response of the filter bank (analysis filter). Ideally, the frequency responses of adjacent channels sum to a constant value at every frequency between the channel centers. That condition is known as perfect reconstruction.\nIn time-frequency signal processing, a filter bank is a special quadratic time-frequency distribution (TFD) that represents the signal in a joint time-frequency domain. It is related to the Wigner-Ville distribution by a two-dimensional filtering that defines the class of quadratic (or bilinear) time-frequency distributions.[1] The filter bank and the spectrogram are the two simplest ways of producing a quadratic TFD; they are in essence similar as one (the spectrogram) is obtained by dividing the time-domain in slices and then taking a Fourier transform, while the other (the filter bank) is obtained by dividing the frequency domain in slices forming bandpass filters that are excited by the signal under analysis.\nMultirate filter bank divides a signal into a number of subbands, which can be analysed at different rates corresponding to the bandwidth of the frequency bands.\nOne important fact in multirate filtering is that the signal should be filtered before decimation, otherwise aliasing and frequency folding would occur.\nMultirate filter design makes use of properties of decimation and interpolation (or expansion) in the design implementation of the filter. Decimation or downsampling by a factor of \n\n\n\nM\n\n\n{\\displaystyle M}\n\n essentially means keeping every \n\n\n\n\nM\n\nt\nh\n\n\n\n\n{\\displaystyle M^{th}}\n\n sample of a given sequence.\nGenerally speaking, using decimation is very common in multirate filter designs. In the second step, after using decimation, interpolation will be used to restore the sampling rate. The advantage of using decimators and interpolator is that they can reduce the computational power necessary for each channel at the lower sampling rate.\nDecimation by a factor of \n\n\n\nM\n\n\n{\\displaystyle M}\n\n can be mathematically defined as:[2] \n\n\n\n\n\nx\n(\nn\n)\n\n\n↓\n\n\nM\n\n\n=\nx\n(\nM\n.\nn\n)\n\n\n{\\displaystyle {x(n)}_{\\downarrow {}M}=x(M.n)}\n\n or equivalently, \n\n\n\nX\n(\nz\n\n)\n\n↓\nM\n\n\n=\n\n\n1\nM\n\n\n\n∑\n\nm\n=\n0\n\n\nM\n−\n1\n\n\nX\n(\n\nz\n\n\n1\nM\n\n\n\n)\n\n\n{\\displaystyle X(z)_{\\downarrow M}={\\frac {1}{M}}\\sum _{m=0}^{M-1}X(z^{\\frac {1}{M}})}\n\n.\nExpansion or upsampling by a factor of M means that we insert M-1 zeros between each sample of a given signal or a sequence. The expansion by a factor of M can be mathematically explained as: \n\n\n\nx\n(\nn\n\n)\n\n↑\nM\n\n\n=\n\n\n{\n\n\n\n\n\n\n\nx\n(\n\n\nn\nM\n\n\n)\n\n\n\n\n0\n\n\n\n\n\n\n\n\n\n\n\n\nn\nM\n\n\n\n\n\n\no\nt\nh\ne\nr\nw\ni\ns\ne\n\n\n\n\n\n\n\n\n\n\n\n\n{\\displaystyle x(n)_{\\uparrow M}={\\begin{cases}{\\begin{array}{c}x({\\frac {n}{M}})\\\\0\\end{array}}&{\\begin{array}{c}{\\frac {n}{M}}\\\\otherwise\\end{array}}\\end{cases}}}\n\n\nor equivalently, \n\n\n\n\n\nX\n(\nz\n)\n\n\n↑\n\n\nM\n\n\n=\nX\n(\n\nz\n\nM\n\n\n)\n\n\n{\\displaystyle {X(z)}_{\\uparrow {}M}=X(z^{M})}\n\n.\nModulation is needed for different kinds of filter designs. For instance, in many communication applications we need to modulate the signal to baseband. After using lowpass filtering for the baseband signal, we use modulation and change the baseband signal to the center frequency of the bandpass filter. Here we provide two examples of designing multirate narrow lowpass and narrow bandpass filters.\nWe can define a narrow lowpass filter as a lowpass filter with a narrow passband. In order to create a multirate narrow lowpass FIR filter, we need to replace the time invariant FIR filter with a lowpass antialiasing filter and use a decimator along with an interpolator and lowpass anti-imaging filter\nIn this the resulting way multirate system would be a time varying linear phase filter via the decimator and interpolator. This process explained in block diagram form where Figure 2 (a) is replaced by Figure 2(b).\nThe lowpass filter consists of two polyphase filters, one for the decimator and one for the interpolator.[3]\nA filter bank divides the input signal \n\n\n\nx\n\n(\nn\n)\n\n\n\n{\\displaystyle x\\left(n\\right)}\n\n into a set of signals \n\n\n\n\nx\n\n1\n\n\n(\nn\n)\n,\n\nx\n\n2\n\n\n(\nn\n)\n,\n\nx\n\n3\n\n\n(\nn\n)\n,\n.\n.\n.\n\n\n{\\displaystyle x_{1}(n),x_{2}(n),x_{3}(n),...}\n\n. In this way each of the generated signals corresponds to a different region in the spectrum of \n\n\n\nx\n\n(\nn\n)\n\n\n\n{\\displaystyle x\\left(n\\right)}\n\n. In this process it can be possible for the regions overlap (or not, based on application). Figure 4 shows an example of a three-band filter bank. The generated signals \n\n\n\n\nx\n\n1\n\n\n(\nn\n)\n,\n\nx\n\n2\n\n\n(\nn\n)\n,\n\nx\n\n3\n\n\n(\nn\n)\n,\n.\n.\n.\n\n\n{\\displaystyle x_{1}(n),x_{2}(n),x_{3}(n),...}\n\n can be generated via a collection of set of bandpass filters with bandwidths \n\n\n\nB\n\nW\n\n1\n\n\n,\nB\n\nW\n\n2\n\n\n,\nB\n\nW\n\n3\n\n\n,\n.\n.\n.\n\n\n{\\displaystyle BW_{1},BW_{2},BW_{3},...}\n\n and center frequencies \n\n\n\n\nf\n\nc\n1\n\n\n,\n\nf\n\nc\n2\n\n\n,\n\nf\n\nc\n3\n\n\n,\n.\n.\n.\n\n\n{\\displaystyle f_{c1},f_{c2},f_{c3},...}\n\n(respectively).\nA multirate filter bank use a single input signal and then produces multiple outputs of the signal by filtering and subsampling. In order to split the input signal into two or more signals (see Figure 5) an analysis-synthesis system can be used . In figure 5, only 4 sub-signals are used.\nThe signal would split with the help of four filters \n\n\n\n\nH\n\nk\n\n\n(\nz\n)\n\n\n{\\displaystyle H_{k}(z)}\n\n for k =0,1,2,3 into 4 bands of the same bandwidths (In the analysis bank) and then each sub-signal is decimated by a factor of 4. In each band by dividing the signal in each band, we would have different signal characteristics.\nIn synthesis section the filter will reconstruct the original signal: First, upsampling the 4 sub-signals at the output of the processing unit by a factor of 4 and then filtere by 4 synthesis filters \n\n\n\n\nF\n\nk\n\n\n(\nz\n)\n\n\n{\\displaystyle F_{k}(z)}\n\n for k = 0,1,2,3. Finally, the outputs of these four filters are added.\nMultidimensional Filtering, downsampling, and upsampling are the main parts of multirate systems and filter banks.\nA complete filter bank consist of the analysis and synthesis side. The analysis filter bank divides an input signal to different subbands with different frequency spectrums. The synthesis part reassembles the different subband signals and generates a reconstruction signal. Two of the basic building blocks are the decimator and expander. For example, in Figure 6, the input divides into four directional sub bands that each of them covers one of the wedge-shaped frequency regions. In 1D systems, M-fold decimators keep only those samples that are multiples of M and discard the rest. while in multi-dimensional systems the decimators are D X D nonsingular integer matrix. it considers only those samples that are on the lattice generated by the decimator. Commonly used decimator is the quincunx decimator whose lattice is generated from the Quincunx matrix which is defined by \n\n\n\n\n\n[\n\n\n\n1\n\n\n1\n\n\n\n\n−\n1\n\n\n1\n\n\n\n]\n\n\n\n\n{\\displaystyle {\\begin{bmatrix}1&1\\\\-1&1\\end{bmatrix}}}\n\n\nThe quincunx lattice generated by Quincunx matrix is as shown. Synthesis part is dual to the analysis part.\nIt is important to analyze filter banks from a frequency domain perspective in terms of subband decomposition and reconstruction. However, equally important is hilbert space interpretation of filter banks, which plays a key role in geometrical signal representations. For generic K-channel filter bank, with analysis filters \n\n\n\n\n\n{\n\nh\n\nk\n\n\n[\nn\n]\n}\n\n\nk\n=\n1\n\n\nK\n\n\n\n\n{\\displaystyle \\left\\{h_{k}[n]\\right\\}_{k=1}^{K}}\n\n, synthesis filters \n\n\n\n\n\n{\n\ng\n\nk\n\n\n[\nn\n]\n}\n\n\nk\n=\n1\n\n\nK\n\n\n\n\n{\\displaystyle \\left\\{g_{k}[n]\\right\\}_{k=1}^{K}}\n\n, and sampling matrices \n\n\n\n\n\n{\n\nM\n\nk\n\n\n[\nn\n]\n}\n\n\nk\n=\n1\n\n\nK\n\n\n\n\n{\\displaystyle \\left\\{M_{k}[n]\\right\\}_{k=1}^{K}}\n\n. In the analysis side, we can define vectors in \n\n\n\n\nl\n\n2\n\n\n(\n\nZ\n\nd\n\n\n)\n\n\n{\\displaystyle l^{2}(Z^{d})}\n\n as\n\n\n\n\n\nφ\n\nk\n,\nm\n\n\n[\nn\n]\n\n\n\n\n=\n\n\nd\ne\nf\n\n\n\n\n\nh\n\nk\n\n\n∗\n\n\n[\n\nM\n\nk\n\n\nm\n−\nn\n]\n\n\n{\\displaystyle \\varphi _{k,m}[n]{\\stackrel {def}{=}}h_{k}^{*}[M_{k}m-n]}\n\n, each index by two parameters: \n\n\n\n1\n≤\nk\n≤\nK\n\n\n{\\displaystyle 1\\leq k\\leq K}\n\n and \n\n\n\nm\n∈\n\nZ\n\n2\n\n\n\n\n{\\displaystyle m\\in Z^{2}}\n\n.\nSimilarly, for the synthesis filters \n\n\n\n\ng\n\nk\n\n\n[\nn\n]\n\n\n{\\displaystyle g_{k}[n]}\n\n we can define \n\n\n\n\nψ\n\nk\n,\nm\n\n\n[\nn\n]\n\n\n\n\n=\n\n\nd\ne\nf\n\n\n\n\n\nh\n\nk\n\n\n∗\n\n\n[\n\nM\n\nk\n\n\nm\n−\nn\n]\n\n\n{\\displaystyle \\psi _{k,m}[n]{\\stackrel {def}{=}}h_{k}^{*}[M_{k}m-n]}\n\n.\nConsidering the definition of analysis/synthesis sides we can verify that [4] \n\n\n\n\nc\n\nk\n\n\n[\nm\n]\n=<\nx\n[\nn\n]\n,\n\nφ\n\nk\n,\nm\n\n\n[\nn\n]\n>\n\n\n{\\displaystyle c_{k}[m]=<x[n],\\varphi _{k,m}[n]>}\n\n\nand for reconstruction part \n\n\n\n\n\n\nx\n^\n\n\n\n[\nn\n]\n=\n\n∑\n\n1\n≤\nk\n≤\nK\n,\nm\n∈\n\nZ\n\n2\n\n\n\n\n\nc\n\nk\n\n\n[\nm\n]\n\nψ\n\nk\n,\nm\n\n\n[\nn\n]\n\n\n{\\displaystyle {\\hat {x}}[n]=\\sum _{1\\leq k\\leq K,m\\in Z^{2}}c_{k}[m]\\psi _{k,m}[n]}\n\n.\nIn other words, the analysis filter bank calculate the inner product of the input signal and the vector from analysis set. Moreover, the reconstructed signal in the combination of the vectors from the synthesis set, and the combination coefficients of the computed inner products, meaning that \n\n\n\n\n\n\nx\n^\n\n\n\n[\nn\n]\n=\n\n∑\n\n1\n≤\nk\n≤\nK\n,\nm\n∈\n\nZ\n\n2\n\n\n\n\n<\nx\n[\nn\n]\n,\n\nφ\n\nk\n,\nm\n\n\n[\nn\n]\n>\n\nψ\n\nk\n,\nm\n\n\n[\nn\n]\n\n\n{\\displaystyle {\\hat {x}}[n]=\\sum _{1\\leq k\\leq K,m\\in Z^{2}}<x[n],\\varphi _{k,m}[n]>\\psi _{k,m}[n]}\n\n\nIf there is no loss in the decomposition and the subsequent reconstruction, the filter bank is called perfect reconstruction. (in that case we would have \n\n\n\nx\n[\nn\n]\n=\n\n\n\n\nx\n[\nn\n]\n\n^\n\n\n\n\n\n{\\displaystyle x[n]={\\hat {x[n]}}}\n\n.[5]\nFigure shows a general multidimensional filter bank with N channels and a common sampling matrix M.\nThe analysis part transforms the input signal \n\n\n\nx\n[\nn\n]\n\n\n{\\displaystyle x[n]}\n\n into N filtered and downsampled outputs \n\n\n\n\ny\n\nj\n\n\n[\nn\n]\n,\n\n\n{\\displaystyle y_{j}[n],}\n\n \n\n\n\nj\n=\n0\n,\n1\n,\n.\n.\n.\n,\nN\n−\n1\n\n\n{\\displaystyle j=0,1,...,N-1}\n\n. The synthesis part recovers the original signal from \n\n\n\n\ny\n\nj\n\n\n[\nn\n]\n\n\n{\\displaystyle y_{j}[n]}\n\n by upsampling and filtering. This kind of set up is used in many applications such as subband coding, multichannel acquisition, and discrete wavelet transforms.\nWe can use polyphase representation, so input signal \n\n\n\nx\n[\nn\n]\n\n\n{\\displaystyle x[n]}\n\n can be represented by a vector of its polyphase components \n\n\n\nx\n(\nz\n)\n\n\n\n\n=\n\n\nd\ne\nf\n\n\n\n\n(\n\nX\n\n0\n\n\n(\nz\n)\n,\n.\n.\n.\n,\n\nX\n\n\n|\n\nM\n\n|\n\n−\n1\n\n\n(\nz\n)\n\n)\n\nT\n\n\n\n\n{\\displaystyle x(z){\\stackrel {def}{=}}(X_{0}(z),...,X_{|M|-1}(z))^{T}}\n\n. Denote \n\n\n\ny\n(\nz\n)\n\n\n\n\n=\n\n\nd\ne\nf\n\n\n\n\n(\n\nY\n\n0\n\n\n(\nz\n)\n,\n.\n.\n.\n,\n\nY\n\n\n|\n\nN\n\n|\n\n−\n1\n\n\n(\nz\n)\n\n)\n\nT\n\n\n.\n\n\n{\\displaystyle y(z){\\stackrel {def}{=}}(Y_{0}(z),...,Y_{|N|-1}(z))^{T}.}\n\n\nSo we would have \n\n\n\ny\n(\nz\n)\n=\nH\n(\nz\n)\nx\n(\nz\n)\n\n\n{\\displaystyle y(z)=H(z)x(z)}\n\n, where \n\n\n\n\nH\n\ni\n,\nj\n\n\n(\nz\n)\n\n\n{\\displaystyle H_{i,j}(z)}\n\n denotes the jth polyphase component of the filter \n\n\n\n\nH\n\ni\n\n\n(\nz\n)\n\n\n{\\displaystyle H_{i}(z)}\n\n.\nSimilarly, for the output signal we would have \n\n\n\n\n\n\nx\n^\n\n\n\n(\nz\n)\n=\nG\n(\nz\n)\ny\n(\nz\n)\n\n\n{\\displaystyle {\\hat {x}}(z)=G(z)y(z)}\n\n, where \n\n\n\n\n\n\nx\n^\n\n\n\n(\nz\n)\n\n\n\n\n=\n\n\nd\ne\nf\n\n\n\n\n(\n\n\n\n\nX\n^\n\n\n\n\n0\n\n\n(\nz\n)\n,\n.\n.\n.\n,\n\n\n\n\nX\n^\n\n\n\n\n\n|\n\nM\n\n|\n\n−\n1\n\n\n(\nz\n)\n\n)\n\nT\n\n\n\n\n{\\displaystyle {\\hat {x}}(z){\\stackrel {def}{=}}({\\hat {X}}_{0}(z),...,{\\hat {X}}_{|M|-1}(z))^{T}}\n\n. Also G is a matrix where \n\n\n\n\nG\n\ni\n,\nj\n\n\n(\nz\n)\n\n\n{\\displaystyle G_{i,j}(z)}\n\n denotes ith polyphase component of the jth synthesis filter Gj(z).\nThe filter bank has perfect reconstruction if \n\n\n\nx\n(\nz\n)\n=\n\n\n\nx\n^\n\n\n\n(\nz\n)\n\n\n{\\displaystyle x(z)={\\hat {x}}(z)}\n\n for any input, or equivalently \n\n\n\n\nI\n\n\n|\n\nM\n\n|\n\n\n\n=\nG\n(\nz\n)\nH\n(\nz\n)\n\n\n{\\displaystyle I_{|M|}=G(z)H(z)}\n\n which means that G(z) is a left inverse of H(z).\n1-D filter banks have been well developed until today. However, many signals, such as image, video, 3D sound, radar, sonar, are multidimensional, and require the design of multidimensional filter banks.\nWith the fast development of communication technology, signal processing system needs more room to store data during the processing, transmission and reception. In order to reduce the data to be processed, save storage and lower the complexity, multirate sampling techniques were introduced to achieve these goals. Filter banks can be used in various areas, such as image coding, voice coding, radar and so on.\nMany 1D filter issues were well studied and researchers proposed many 1D filter bank design approaches. But there are still many multidimensional filter bank design problems that need to be solved.[6] Some methods may not well reconstruct the signal, some methods are complex and hard to implement.\nThe simplest approach to design a multi-dimensional filter banks is to cascade 1D filter banks in the form of a tree structure where the decimation matrix is diagonal and data is processed in each dimension separately. Such systems are referred to as separable systems. However the region of support for the filter banks might not be separable. In that case designing of filter bank gets complex . In most cases we deal with non-separable systems.\nA filter bank consists of an analysis stage and a synthesis stage. Each stage consists of a set of filters in parallel. The filter bank design is the design of the filters in the analysis and synthesis stages. The analysis filters divide the signal into overlapping or non-overlapping subbands depending on the application requirements. The synthesis filters should be designed to reconstruct the input signal back from the subbands when the outputs of these filters are combined together. Processing is typically performed after the analysis stage. These filter banks can be designed as Infinite impulse response (IIR) or Finite impulse response (FIR). In order to reduce the data rate, downsampling and upsampling are performed in the analysis and synthesis stages, respectively.\nBelow are several approaches on the design of multidimensional filter banks. For more details, please check the ORIGINAL references.\nIn real life, we always want to reconstruct the divided signal back to the original one, which makes PR filter banks very important. Let H(z) be the transfer function of a filter. The size of the filter is defined as the order of corresponding polynomial in every dimension. The symmetry or anti-symmetry of a polynomial determines the linear phase property of the corresponding filter and is related to its size. Like the 1D case, the aliasing term A(z) and transfer function T(z) for a 2 channel filter bank are:[7]\nA(z)=1/2(H0(-z) F0 (z)+H1 (-z) F1 (z)); T(z)=1/2(H0 (z) F0 (z)+H1 (z) F1 (z)), where H0 and H1 are decomposition filters, and F0 and F1 are reconstruction filters.\nThe input signal can be perfectly reconstructed if the alias term is cancelled and T(z) equal to a monomial. So the necessary condition is that T'(z) is generally symmetric and of an odd-by-odd size. Linear phase PR filters are very useful for image processing. This 2-Channel filter bank is relatively easy to implement. But 2 channels sometimes are not enough for use. 2-channel filter banks can be cascaded to generate multi-channel filter banks.\nM-dimensional directional filter banks (MDFB) are a family of filter banks that can achieve the directional decomposition of arbitrary M-dimensional signals with a simple and efficient tree-structured construction. It has many distinctive properties like: directional decomposition, efficient tree construction, angular resolution and perfect reconstruction. In the general M-dimensional case, the ideal frequency supports of the MDFB are hypercube-based hyperpyramids. The first level of decomposition for MDFB is achieved by an N-channel undecimated filter bank, whose component filters are M-D \"hourglass\"-shaped filter aligned with the w1,...,wM respectively axes. After that, the input signal is further decomposed by a series of 2-D iteratively resampled checkerboard filter banks IRCli(Li)(i=2,3,...,M), where IRCli(Li)operates on 2-D slices of the input signal represented by the dimension pair (n1,ni) and superscript (Li) means the levels of decomposition for the ith level filter bank. Note that, starting from the second level, we attach an IRC filter bank to each output channel from the previous level, and hence the entire filter has a total of 2(L1+...+LN) output channels.[8]\nOversampled filter banks are multirate filter banks where the number of output samples at the analysis stage is larger than the number of input samples. It is proposed for robust applications. One particular class of oversampled filter banks is nonsubsampled filter banks without downsampling or upsampling. The perfect reconstruction condition for an oversampled filter bank can be stated as a matrix inverse problem in the polyphase domain.[9]\nFor IIR oversampled filter bank, perfect reconstruction have been studied in Wolovich[10] and Kailath.[11] in the context of control theory. While for FIR oversampled filter bank we have to use different strategy for 1-D and M-D. FIR filter are more popular since it is easier to implement. For 1-D oversampled FIR filter banks, the Euclidean algorithm plays a key role in the matrix inverse problem.[12] However, the Euclidean algorithm fails for multidimensional (MD) filters. For MD filter, we can convert the FIR representation into a polynomial representation.[13] And then use Algebraic geometry and Gröbner bases to get the framework and the reconstruction condition of the multidimensional oversampled filter banks.[9]\nNonsubsampled filter banks are particular oversampled filter banks without downsampling or upsampling. The perfect reconstruction condition for nonsubsampled FIR filter banks leads to a vector inverse problem: the analysis filters \n\n\n\n{\n\nH\n\n1\n\n\n,\n.\n.\n.\n,\n\nH\n\nN\n\n\n}\n\n\n{\\displaystyle \\{H_{1},...,H_{N}\\}}\n\n are given and FIR, and the goal is to find a set of FIR synthesis filters \n\n\n\n{\n\nG\n\n1\n\n\n,\n.\n.\n.\n,\n\nG\n\nN\n\n\n}\n\n\n{\\displaystyle \\{G_{1},...,G_{N}\\}}\n\n satisfying.[9]\nAs multidimensional filter banks can be represented by multivariate rational matrices, this method is a very effective tool that can be used to deal with the multidimensional filter banks.[13]\nIn Charo,[13] a multivariate polynomial matrix-factorization algorithm is introduced and discussed. The most common problem is the multidimensional filter banks for perfect reconstruction. This paper talks about the method to achieve this goal that satisfies the constrained condition of linear phase.\nAccording to the description of the paper, some new results in factorization are discussed and being applied to issues of multidimensional linear phase perfect reconstruction finite-impulse response filter banks. The basic concept of Gröbner Bases is given in Adams.[14]\nThis approach based on multivariate matrix factorization can be used in different areas. The algorithmic theory of polynomial ideals and modules can be modified to address problems in processing, compression, transmission, and decoding of multidimensional signals.\nThe general multidimensional filter bank (Figure 7) can be represented by a pair of analysis and synthesis polyphase matrices \n\n\n\nH\n(\nz\n)\n\n\n{\\displaystyle H(z)}\n\n and \n\n\n\nG\n(\nz\n)\n\n\n{\\displaystyle G(z)}\n\n of size \n\n\n\nN\n×\nM\n\n\n{\\displaystyle N\\times M}\n\n and \n\n\n\nM\n×\nN\n\n\n{\\displaystyle M\\times N}\n\n, where N is the number of channels and \n\n\n\nM\n\n\n\n\n=\n\n\nd\ne\nf\n\n\n\n\n\n|\n\nM\n\n|\n\n\n\n{\\displaystyle M{\\stackrel {def}{=}}|M|}\n\n is the absolute value of the determinant of the sampling matrix. Also \n\n\n\nH\n(\nz\n)\n\n\n{\\displaystyle H(z)}\n\n and \n\n\n\nG\n(\nz\n)\n\n\n{\\displaystyle G(z)}\n\n are the z-transform of the polyphase components of the analysis and synthesis filters. Therefore, they are multivariate Laurent polynomials, which have the general form:\n\n\n\n\nF\n(\nz\n)\n=\n\n∑\n\nk\n∈\n\nZ\n\nd\n\n\n\n\nf\n[\nk\n]\n\nz\n\nk\n\n\n=\n\n∑\n\nk\n∈\n\nZ\n\nd\n\n\n\n\nf\n[\n\nk\n\n1\n\n\n,\n.\n.\n.\n,\n\nk\n\nd\n\n\n]\n\nz\n\n1\n\n\n\nk\n\n1\n\n\n\n\n.\n.\n.\n\nz\n\nd\n\n\n\nk\n\nd\n\n\n\n\n\n\n{\\displaystyle F(z)=\\sum _{k\\in Z^{d}}f[k]z^{k}=\\sum _{k\\in Z^{d}}f[k_{1},...,k_{d}]z_{1}^{k_{1}}...z_{d}^{k_{d}}}\n\n. Laurent polynomial matrix equation need to be solve to design perfect reconstruction filter banks: \n\n\n\nG\n(\nz\n)\nH\n(\nz\n)\n=\n\nI\n\n\n|\n\nM\n\n|\n\n\n\n\n\n{\\displaystyle G(z)H(z)=I_{|M|}}\n\n.\nIn the multidimentonal case with multivariate polynomials we need to use the theory and algorithms of Grobner bases.[15]\n\"Grobner bases\" can be used to characterizing perfect reconstruction multidimensional filter banks, but it first need to extend from polynomial matrices to Laurent polynomial matrices.[16][17]\nThe Grobner basis computation can be considered equivalently as Gaussian elimination for solving the polynomial matrix equation \n\n\n\nG\n(\nz\n)\nH\n(\nz\n)\n=\n\nI\n\n\n|\n\nM\n\n|\n\n\n\n\n\n{\\displaystyle G(z)H(z)=I_{|M|}}\n\n. If we have set of polynomial vectors \n\n\n\nM\no\nd\nu\nl\ne\n\n{\n\nh\n\n1\n\n\n(\nz\n)\n,\n.\n.\n.\n,\n\nh\n\nN\n\n\n(\nz\n)\n}\n\n\n\n\n\n=\n\n\nd\ne\nf\n\n\n\n\n{\n\nc\n\n1\n\n\n(\nz\n)\n\nh\n\n1\n\n\n(\nz\n)\n+\n.\n.\n.\n+\n\nc\n\nN\n\n\n(\nz\n)\n\nh\n\nN\n\n\n(\nz\n)\n}\n\n\n{\\displaystyle Module\\left\\{h_{1}(z),...,h_{N}(z)\\right\\}{\\stackrel {def}{=}}\\{c_{1}(z)h_{1}(z)+...+c_{N}(z)h_{N}(z)\\}}\n\n where \n\n\n\n:\n\nc\n\n1\n\n\n(\nz\n)\n,\n.\n.\n.\n,\n\nc\n\nN\n\n\n(\nz\n)\n\n\n{\\displaystyle :c_{1}(z),...,c_{N}(z)}\n\n are polynomials.\nThe Module is analogous to the span of a set of vectors in linear algebra. The theory of Grobner bases implies that the Module has a unique reduced Grobner basis for a given order of power products in polynomials.\nIf we define the Grobner basis as \n\n\n\n\n{\n\nb\n\n1\n\n\n(\nz\n)\n,\n.\n.\n.\n,\n\nb\n\nN\n\n\n(\nz\n)\n}\n\n\n\n{\\displaystyle \\left\\{b_{1}(z),...,b_{N}(z)\\right\\}}\n\n, it can be obtained from \n\n\n\n\n{\n\nh\n\n1\n\n\n(\nz\n)\n,\n.\n.\n.\n,\n\nh\n\nN\n\n\n(\nz\n)\n}\n\n\n\n{\\displaystyle \\left\\{h_{1}(z),...,h_{N}(z)\\right\\}}\n\n by a finite sequence of reduction (division) steps.\nUsing reverse engineering, we can compute the basis vectors \n\n\n\n\nb\n\ni\n\n\n(\nz\n)\n\n\n{\\displaystyle b_{i}(z)}\n\n in terms of the original vectors \n\n\n\n\nh\n\nj\n\n\n(\nz\n)\n\n\n{\\displaystyle h_{j}(z)}\n\n through a \n\n\n\nK\n×\nN\n\n\n{\\displaystyle K\\times N}\n\n transformation matrix \n\n\n\n\nW\n\ni\nj\n\n\n(\nz\n)\n\n\n{\\displaystyle W_{ij}(z)}\n\n as\n\n\n\n\n\nb\n\ni\n\n\n(\nz\n)\n=\n\n∑\n\nj\n=\n1\n\n\nN\n\n\n\nW\n\ni\nj\n\n\n(\nz\n)\n\nh\n\nj\n\n\n(\nz\n)\n,\ni\n=\n1\n,\n.\n.\n.\n,\nK\n\n\n{\\displaystyle b_{i}(z)=\\sum _{j=1}^{N}W_{ij}(z)h_{j}(z),i=1,...,K}\n\n\nDesigning filters with good frequency responses is challenging via Grobner bases approach.\nMapping based design in popularly used to design nonseparable multidimensional filter banks with good frequency responses.[18][19]\nThe mapping approaches have certain restrictions on the kind of filters; However, It brings many important advantages, such as efficient implementation via lifting/ladder structures. Here we provide an example of two-channel filter banks in 2D with sampling matrix\n\n\n\n\n\nD\n\n1\n\n\n=\n\n[\n\n\n\n\n2\n\n\n0\n\n\n\n\n0\n\n\n1\n\n\n\n\n]\n\n\n\n{\\displaystyle D_{1}=\\left[{\\begin{array}{cc}2&0\\\\0&1\\end{array}}\\right]}\n\n We would have several possible choices of ideal frequency responses of the channel filter \n\n\n\n\nH\n\n0\n\n\n(\nξ\n)\n\n\n{\\displaystyle H_{0}(\\xi )}\n\n and \n\n\n\n\nG\n\n0\n\n\n(\nξ\n)\n\n\n{\\displaystyle G_{0}(\\xi )}\n\n. (Note that the other two filters \n\n\n\n\nH\n\n1\n\n\n(\nξ\n)\n\n\n{\\displaystyle H_{1}(\\xi )}\n\n and \n\n\n\n\nG\n\n1\n\n\n(\nξ\n)\n\n\n{\\displaystyle G_{1}(\\xi )}\n\n are supported on complementary regions.)\nAll the frequency regions in Figure can be critically sampled by the rectangular lattice spanned by \n\n\n\n\nD\n\n1\n\n\n\n\n{\\displaystyle D_{1}}\n\n.\n\nSo imagine the filter bank achieves perfect reconstruction with FIR filters. Then from the polyphase domain characterization it follows that the filters H1(z) and G1(z) are completely specified by H0(z) and G0(z), respectively. Therefore, we need to design H0(x) and G0(z) which have desired frequency responses and satisfy the polyphase-domain conditions. \n\n\n\n\nH\n\n0\n\n\n(\n\nz\n\n1\n\n\n,\n\nz\n\n2\n\n\n)\n\nG\n\n0\n\n\n(\n\nz\n\n1\n\n\n,\n\nz\n\n2\n\n\n)\n+\n\nH\n\n0\n\n\n(\n−\n\nz\n\n1\n\n\n,\n\nz\n\n2\n\n\n)\n\nG\n\n0\n\n\n(\n−\n\nz\n\n1\n\n\n,\n\nz\n\n2\n\n\n)\n=\n2\n\n\n{\\displaystyle H_{0}(z_{1},z_{2})G_{0}(z_{1},z_{2})+H_{0}(-z_{1},z_{2})G_{0}(-z_{1},z_{2})=2}\n\n\nThere are different mapping technique that can be used to get above result.[20]\nIf we do not want perfect reconstruction filter banks using FIR filters, the design problem can be simplified by working in frequency domain instead of using FIR filters.[21][22]\nNote that the frequency domain method is not limited to the design of nonsubsampled filter banks (read [23]).\nMany of the existing methods for designing 2-channel filter banks are based on transformation of variable technique. For example, McClellan transform can be used to design 1-D 2-channel filter banks. Though the 2-D filter banks have many similar properties with the 1-D prototype, but it is difficult to extend to more than 2-channel cases.[24]\nIn Nguyen,[24] the authors talk about the design of multidimensional filter banks by direct optimization in the frequency domain. The method proposed here is mainly focused on the M-channel 2D filter banks design. The method is flexible towards frequency support configurations. 2D filter banks designed by optimization in the frequency domain has been used in Wei[25] and Lu.[26] In Nguyen's paper,[24] the proposed method is not limited to two-channel 2D filter banks design; the approach is generalized to M-channel filter banks with any critical subsampling matrix. According to the implementation in the paper, it can be used to achieve up to 8-channel 2D filter banks design.\n(6)Reverse Jacket Matrix[27]\nIn Lee's 1999 paper,[27] the authors talk about the multidimensional filter bank design using Reverse Jacket matrix. According to Wiki article, let H be a Hadamard matrix of order n, the transpose of H is closely related to its inverse. The correct formula is: \n\n\n\nH\n\nH\n\nT\n\n\n=\n\nI\n\nn\n\n\n\n\n{\\displaystyle HH^{T}=I_{n}}\n\n, where In is the n×n identity matrix and HT is the transpose of H. In the 1999 paper,[27] the authors generalize the Reverse Jacket matrix [RJ]N using Hadamard matrices and Weighted Hadamard matrices.[28][29]\nIn this paper, the authors proposed that the FIR filter with 128 tap is used as a basic filter and decimation factor is computed for RJ matrices. They did simulations based on different parameters and achieve a good quality performances in low decimation factor.\nBamberger and Smith proposed a 2D directional filter bank (DFB).[30]\nThe DFB is efficiently implemented via an l-level tree-structured decomposition that leads to \n\n\n\n\n2\n\nl\n\n\n\n\n{\\displaystyle 2^{l}}\n\n subbands with wedge-shaped frequency partition (see Figure ).\nThe original construction of the DFB involves modulating the input signal and using diamond-shaped filters. Moreover, in order to obtain the desired frequency partition, a complicated tree expanding rule has to be followed.[31] As a result, the frequency regions for the resulting subbands do not follow a simple ordering as shown in Figure 9 based on the channel indices.\nThe first advantage of DFB is that not only it is not a redundant transform but also it offers perfect reconstruction. Another advantage of DFB is its directional-selectivity and efficient structure. This advantage makes DFB an appropriate approach for many signal and image processing usage. (e.g., Laplacian pyramid, constructed the contourlets,[32] sparse image representation, medical imageing[33] etc.).\nDirectional Filter Banks can be develop to higher dimensions. It can be use in 3-D to achieve the frequency sectioning.\nFilter banks play important roles in signal processing. They are used in many areas, such as signal and image compression, and processing. The main use of filter banks is to divide a signal or system in to several separate frequency domains. Different filter designs can be used depending on the purpose. g on our purpose we can choose different methods to design the filters. In this page we provide information regarding filter banks, multidimensional filter banks and different methods to design multidimensional filters. Also we talked about NDFB, which is built upon an efficient tree-structured construction, which leads to a low redundancy ratio and refinable angular resolution. By combining the NDFB with a new multiscale pyramid, we can constructed the surfacelet transform, which has potentials in efficiently capturing and representing surface-like singularities in multidimensional signals. AS mentioned above NDFB and surfacelet transform have applications in various areas that involve the processing of multidimensional volumetric data, including video processing, seismic image processing, and medical image analysis. Some other advantages of NDFB can be addressed as follow: Directional decomposition, Construction, Angular resolution, Perfect reconstruction, and Small redundancy.", 
    "dbpedia_url": "http://dbpedia.org/resource/Filter_bank", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Filter_bank\n"
}