{
    "about": "In mathematical optimization, the firefly algorithm is a metaheuristic proposed by Xin-She Yang and inspired by the flashing behaviour of fireflies.[1]", 
    "name": "Firefly Algorithm", 
    "classification": "Evolutionary Algorithms", 
    "full_text": "In mathematical optimization, the firefly algorithm is a metaheuristic proposed by Xin-She Yang and inspired by the flashing behaviour of fireflies.[1]\n\n\nThe primary purpose for a firefly's flash is to act as a signal system to attract other fireflies. Xin-She Yang formulated this firefly algorithm by assuming:\nThe brightness should be associated with the objective function.\nIn pseudocode the algorithm can be stated as:\nThe main update formula for any pair of two fireflies \n\n\n\n\n\nx\n\n\ni\n\n\n\n\n{\\displaystyle \\mathbf {x} _{i}}\n\n and \n\n\n\n\n\nx\n\n\nj\n\n\n\n\n{\\displaystyle \\mathbf {x} _{j}}\n\n is\nwhere \n\n\n\n\nα\n\nt\n\n\n\n\n{\\displaystyle \\alpha _{t}}\n\n is a parameter controlling the step size, while \n\n\n\n\n\nϵ\n\n\nt\n\n\n\n\n{\\displaystyle {\\boldsymbol {\\epsilon }}_{t}}\n\n is a vector drawn from a Gaussian or other distribution.\nIt can be shown that the limiting case \n\n\n\nγ\n→\n0\n\n\n{\\displaystyle \\gamma \\rightarrow 0}\n\n corresponds to the standard Particle Swarm Optimization (PSO). In fact, if the inner loop (for j) is removed and the brightness \n\n\n\n\nI\n\nj\n\n\n\n\n{\\displaystyle I_{j}}\n\n is replaced by the current global best \n\n\n\n\ng\n\n∗\n\n\n\n\n{\\displaystyle g^{*}}\n\n, then FA essentially becomes the standard PSO.\nNature-inspired metaheuristics in general have attracted criticism in the research community for hiding their lack of novelty behind an elaborate metaphor. The firefly algorithm has been criticized as differing from the well-established particle swarm optimization only in a negligible way.[2][3]", 
    "dbpedia_url": "http://dbpedia.org/resource/Firefly_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Firefly_algorithm\n"
}