{
    "about": "In probability theory, the first-order second-moment (FOSM) method, also referenced as mean value first-order second-moment (MVFOSM) method, is a probabilistic method to determine the stochastic moments of a function with random input variables. The name is based on the derivation, which uses a first-order Taylor series and the first and second moments of the input variables.[1]", 
    "classification": "Stochastic Algorithms", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/First-order_second-moment_method\n", 
    "full_text": "In probability theory, the first-order second-moment (FOSM) method, also referenced as mean value first-order second-moment (MVFOSM) method, is a probabilistic method to determine the stochastic moments of a function with random input variables. The name is based on the derivation, which uses a first-order Taylor series and the first and second moments of the input variables.[1]\n\n\nConsider the objective function \n\n\n\ng\n(\nx\n)\n\n\n{\\displaystyle g(x)}\n\n, where the input vector \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is a realization of the random vector \n\n\n\nX\n\n\n{\\displaystyle X}\n\n with probability density function \n\n\n\n\nf\n\nX\n\n\n(\nx\n)\n\n\n{\\displaystyle f_{X}(x)}\n\n. As \n\n\n\nX\n\n\n{\\displaystyle X}\n\n is randomly distributed, also \n\n\n\ng\n\n\n{\\displaystyle g}\n\n is randomly distributed. Following the FOSM method, the mean value of \n\n\n\ng\n\n\n{\\displaystyle g}\n\n is approximated by\nThe variance of \n\n\n\ng\n\n\n{\\displaystyle g}\n\n is approximated by\nwhere \n\n\n\nn\n\n\n{\\displaystyle n}\n\n is the length/dimension of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\n\n\n\n∂\ng\n(\nμ\n)\n\n\n∂\n\nx\n\ni\n\n\n\n\n\n\n\n{\\displaystyle {\\frac {\\partial g(\\mu )}{\\partial x_{i}}}}\n\n is the partial derivative of \n\n\n\ng\n\n\n{\\displaystyle g}\n\n at the mean vector \n\n\n\nμ\n\n\n{\\displaystyle \\mu }\n\n with respect to the i-th entry of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n.\nThe objective function is approximated by a Taylor series at the mean vector \n\n\n\nμ\n\n\n{\\displaystyle \\mu }\n\n.\nThe mean value of \n\n\n\ng\n\n\n{\\displaystyle g}\n\n is given by the integral\nInserting the first-order Taylor series yields\nThe variance of \n\n\n\ng\n\n\n{\\displaystyle g}\n\n is given by the integral\nAccording to the computational formula for the variance, this can be written as\nInserting the Taylor series yields\nThe following abbreviations are introduced.\nIn the following, the entries of the random vector \n\n\n\nX\n\n\n{\\displaystyle X}\n\n are assumed to be independent. Considering also the second-order terms of the Taylor expansion, the approximation of the mean value is given by\nThe second-order approximation of the variance is given by\nThe skewness of \n\n\n\ng\n\n\n{\\displaystyle g}\n\n can be determined from the third central moment \n\n\n\n\nμ\n\ng\n,\n3\n\n\n\n\n{\\displaystyle \\mu _{g,3}}\n\n. When considering only linear terms of the Taylor series, but higher-order moments, the third central moment is approximated by\nFor the second-order approximations of the third central moment as well as for the derivation of all higher-order approximations see Appendix D of Ref.[2] Taking into account the quadratic terms of the Taylor series and the third moments of the input variables is referred to as second-order third-moment method.[3] However, the full second-order approach of the variance (given above) also includes fourth-order moments of input parameters, and the full second-order approach of the skewness 6th-order moments [2]\nThere are several examples in the literature where the FOSM method is employed to estimate the stochastic distribution of the buckling load of axially compressed structures (see e.g. Ref.[4][5][6][7]). For structures which are very sensitive to deviations from the ideal structure (like cylindrical shells) it has been proposed to use the FOSM method as a design approach. Often the applicability is checked by comparison with a Monte Carlo simulation. In engineering practice, the objective function often is not given as analytic expression, but for instance as a result of a finite-element simulation. Then the derivatives of the objective function need to be estimated by the central differences method. The number of evaluations of the objective function equals \n\n\n\n2\nn\n+\n1\n\n\n{\\displaystyle 2n+1}\n\n. Depending on the number of random variables this still can mean a significantly smaller number of evaluations than performing a Monte Carlo simulation. However, when using the FOSM method as a design procedure, a lower bound shall be estimated, which is actually not given by the FOSM approach. Therefore, a type of distribution needs to be assumed for the distribution of the objective function, taking into account the approximated mean value and standard deviation.", 
    "name": "First Order Second Moment Method"
}