{
    "about": "Flashsort is a distribution sorting algorithm showing linear computational complexity \n\n\n\nO\n(\nn\n)\n\n\n{\\displaystyle O(n)}\n\n for uniformly distributed data sets and relatively little additional memory requirement. The original work was published in 1998 by Karl-Dietrich Neubert.[1]", 
    "name": "Flashsort", 
    "classification": "Sorting Algorithms", 
    "full_text": "Flashsort is a distribution sorting algorithm showing linear computational complexity \n\n\n\nO\n(\nn\n)\n\n\n{\\displaystyle O(n)}\n\n for uniformly distributed data sets and relatively little additional memory requirement. The original work was published in 1998 by Karl-Dietrich Neubert.[1]\n\n\nThe basic idea behind flashsort is that in a data set with a known distribution, it is easy to immediately estimate where an element should be placed after sorting when the range of the set is known. For example, if given a uniform data set where the minimum is 1 and the maximum is 100 and 50 is an element of the set, it’s reasonable to guess that 50 would be near the middle of the set after it is sorted. This approximate location is called a class. If numbered 1 to \n\n\n\nm\n\n\n{\\displaystyle m}\n\n, the class of an item \n\n\n\n\nA\n\ni\n\n\n\n\n{\\displaystyle A_{i}}\n\n is the quantile, computed as:\n  \n\n\n\nK\n(\n\nA\n\ni\n\n\n)\n=\n1\n+\n\n\nINT\n\n\n\n(\n(\nm\n−\n1\n)\n\n\n\n\nA\n\ni\n\n\n−\n\nA\n\n\nmin\n\n\n\n\n\n\nA\n\n\nmax\n\n\n\n−\n\nA\n\n\nmin\n\n\n\n\n\n\n)\n\n\n\n{\\displaystyle K(A_{i})=1+{\\textrm {INT}}\\left((m-1){\\frac {A_{i}-A_{\\textrm {min}}}{A_{\\textrm {max}}-A_{\\textrm {min}}}}\\right)}\n\n\nwhere \n\n\n\nA\n\n\n{\\displaystyle A}\n\n is the input set. The range covered by every class is equal, except the last class which includes only the maximum(s). The classification ensures that every element in a class is greater than any element in a lower class. This partially orders the data and reduces the number of inversions. Insertion sort is then applied to the classified set. As long as the data is uniformly distributed, class sizes will be consistent and insertion sort will be computationally efficient.[1]\nTo execute flashsort with its low memory benefits, the algorithm does not use additional data structures to store the classes. Instead it stores the upper bounds of each class on the input array \n\n\n\nA\n\n\n{\\displaystyle A}\n\n in an auxiliary vector \n\n\n\nL\n\n\n{\\displaystyle L}\n\n. These upper bounds are obtained by counting the number of elements in each class, and the upper bound of a class is the number of elements in that class and every class before it. These bounds serve as pointers into the classes.\nClassification is implemented through a series of cycles, where a cycle-leader is taken from the input array \n\n\n\nA\n\n\n{\\displaystyle A}\n\n and its class is calculated. The pointers in vector \n\n\n\nL\n\n\n{\\displaystyle L}\n\n are used to insert the cycle-leader into the correct class, and the class’s pointer in \n\n\n\nL\n\n\n{\\displaystyle L}\n\n is decremented after each insertion. Inserting the cycle-leader will evict another element from array \n\n\n\nA\n\n\n{\\displaystyle A}\n\n, which will be classified and inserted into another location and so on. The cycle terminates when an element is inserted into the cycle-leader’s starting location.\nAn element is a valid cycle-leader if it has not yet been classified. As the algorithm iterates on array \n\n\n\nA\n\n\n{\\displaystyle A}\n\n, previously classified elements are skipped and unclassified elements are used to initiate new cycles. It is possible to discern whether an element has been classified or not without using additional tags: An element has been classified if and only if its index is greater than the class’s pointer value in \n\n\n\nL\n\n\n{\\displaystyle L}\n\n. To prove this, consider the current index of array \n\n\n\nA\n\n\n{\\displaystyle A}\n\n the algorithm is processing. Let this index be \n\n\n\ni\n\n\n{\\displaystyle i}\n\n. Elements \n\n\n\n\nA\n\n0\n\n\n\n\n{\\displaystyle A_{0}}\n\n through \n\n\n\n\nA\n\n\ni-1\n\n\n\n\n\n{\\displaystyle A_{\\textrm {i-1}}}\n\n have already been classified and inserted into the correct class. Suppose that \n\n\n\ni\n\n\n{\\displaystyle i}\n\n is greater than the current pointer to \n\n\n\n\nA\n\ni\n\n\n\n\n{\\displaystyle A_{i}}\n\n’s class. Now suppose that the \n\n\n\n\nA\n\ni\n\n\n\n\n{\\displaystyle A_{i}}\n\n is unclassified and could be legally inserted into the index indicated by its class pointer, which would replace a classified element in another class. This is impossible since the initial pointers of each class are their upper bounds, which ensures that the exact needed amount of space is allocated for each class on the array \n\n\n\nA\n\n\n{\\displaystyle A}\n\n. Therefore, every element in \n\n\n\n\nA\n\ni\n\n\n\n\n{\\displaystyle A_{i}}\n\n’s class, including \n\n\n\n\nA\n\ni\n\n\n\n\n{\\displaystyle A_{i}}\n\n itself, has already been classified. Also, if an element has already been classified, the class’s pointer would have been decremented below the element’s new index.[1][2]\nThe only extra memory requirements are the auxiliary vector \n\n\n\nL\n\n\n{\\displaystyle L}\n\n for storing class bounds and the constant number of other variables used.\nIn the ideal case of a balanced data set, each class will be approximately the same size, and sorting an individual class by itself has complexity \n\n\n\nO\n(\n1\n)\n\n\n{\\displaystyle O(1)}\n\n. If the number \n\n\n\nm\n\n\n{\\displaystyle m}\n\n of classes is proportional to the input set size \n\n\n\nn\n\n\n{\\displaystyle n}\n\n, the running time of the final insertion sort is \n\n\n\nm\n⋅\nO\n(\n1\n)\n=\nO\n(\nm\n)\n=\nO\n(\nn\n)\n\n\n{\\displaystyle m\\cdot O(1)=O(m)=O(n)}\n\n. In the worst-case scenarios where almost all the elements are in a few or one class, the complexity of the algorithm as a whole is limited by the performance of the final-step sorting method. For insertion sort, this is \n\n\n\nO\n(\n\nn\n\n2\n\n\n)\n\n\n{\\displaystyle O(n^{2})}\n\n. Variations of the algorithm improve worst-case performance by using better-performing sorts such as quicksort or recursive flashsort on classes that exceed a certain size limit.[2][3]\nChoosing a value for \n\n\n\nm\n\n\n{\\displaystyle m}\n\n, the number of classes, trades off time spent classifying elements (high \n\n\n\nm\n\n\n{\\displaystyle m}\n\n) and time spent in the final insertion sort step (low \n\n\n\nm\n\n\n{\\displaystyle m}\n\n). Based on his research, Neubert found \n\n\n\nm\n=\n0.42\nn\n\n\n{\\displaystyle m=0.42n}\n\n to be optimal.\nMemory-wise, flashsort avoids the overhead needed to store classes in the very similar bucketsort. For \n\n\n\nm\n=\n0.1\nn\n\n\n{\\displaystyle m=0.1n}\n\n with uniform random data, flashsort is faster than heapsort for all \n\n\n\nn\n\n\n{\\displaystyle n}\n\n and faster than quicksort for \n\n\n\nn\n>\n80\n\n\n{\\displaystyle n>80}\n\n. It becomes about as twice as fast as quicksort at \n\n\n\nn\n=\n10000\n\n\n{\\displaystyle n=10000}\n\n.[1]\nDue to the in situ permutation that flashsort performs in its classification process, flashsort is not stable. If stability is required, it is possible to use a second, temporary, array so elements can be classified sequentially. However, in this case, the algorithm will require \n\n\n\nO\n(\nn\n)\n\n\n{\\displaystyle O(n)}\n\n space.", 
    "dbpedia_url": "http://dbpedia.org/resource/Flashsort", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Flashsort\n"
}