{
    "about": "Flooding is a simple computer network routing algorithm in which every incoming packet is sent through every outgoing link except the one it arrived on.[1]", 
    "name": "Flooding (Computer Networking)", 
    "classification": "Routing Algorithms", 
    "full_text": "Flooding is a simple computer network routing algorithm in which every incoming packet is sent through every outgoing link except the one it arrived on.[1]\nFlooding is used in bridging and in systems such as Usenet and peer-to-peer file sharing and as part of some routing protocols, including OSPF, DVMRP, and those used in ad-hoc wireless networks.[2]\n\n\nThere are generally two types of flooding available, Uncontrolled Flooding and Controlled Flooding.\nUncontrolled Flooding is the fatal law of flooding. All nodes have neighbors and route packets indefinitely. More than two neighbours creates a broadcast storm.\nControlled Flooding has its own two algorithms to make it reliable, SNCF (Sequence Number Controlled Flooding) and RPF (Reverse Path Flooding). In SNCF, the node attaches its own address and sequence number to the packet, since every node has a memory of addresses and sequence numbers. If it receives a packet in memory, it drops it immediately while in RPF, the node will only send the packet forward. If it is received from the next node, it sends it back to the sender.\nThere are several variants of flooding algorithms. Most work roughly as follows:\nThis results in every message eventually being delivered to all reachable parts of the network.\nAlgorithms may need to be more complex than this, since, in some case, precautions have to be taken to avoid wasted duplicate deliveries and infinite loops, and to allow messages to eventually expire from the system. A variant of flooding called selective flooding partially addresses these issues by only sending packets to routers in the same direction. In selective flooding the routers don't send every incoming packet on every line but only on those lines which are going approximately in the right direction.\nOpen Shortest Path First - Used for transferring updates to the topology (LSAs)", 
    "dbpedia_url": "http://dbpedia.org/resource/Flooding_(computer_networking)", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Flooding_(computer_networking)\n"
}