{
    "about": "A flow graph is a form of digraph associated with a set of linear algebraic or differential equations:[1][2]", 
    "name": "Flow Graph (Mathematics)", 
    "classification": "Signal Processing", 
    "full_text": "A flow graph is a form of digraph associated with a set of linear algebraic or differential equations:[1][2]\nAlthough this definition uses the terms \"signal flow graph\" and \"flow graph\" interchangeably, the term \"signal flow graph\" is most often used to designate the Mason signal-flow graph, Mason being the originator of this terminology in his work on electrical networks.[3][4] Likewise, some authors use the term \"flow graph\" to refer strictly to the Coates flow graph.[5][6] According to Henley & Williams:[7]\nA designation \"flow graph\" that includes both the Mason graph and the Coates graph, and a variety of other forms of such graphs[8] appears useful, and agrees with Abrahams and Coverley's and with Henley and Williams' approach.[1][2]\nA directed network is a particular type of flow graph. A network is a graph with real numbers associated with each of its edges, and if the graph is a digraph, the result is a directed network.[9] A flow graph is more general in that the edges may be associated with gains, branch gains or transmittances, or even functions of the Laplace operator s, in which case they are called transfer functions.[2]\nThere is a close relationship between graphs and matrices and between digraphs and matrices.[10] \"The algebraic theory of matrices can be brought to bear on graph theory to obtain results elegantly\", and conversely, graph-theoretic approaches based upon flow graphs are used for the solution of linear algebraic equations.[11]\n\n\nAn example of a flow graph connected to some starting equations is presented.\nThe set of equations should be consistent and linearly independent. An example of such a set is:[7]\nConsistency and independence of the equations in the set is established because the determinant of coefficients is non-zero, so a solution can be found using Cramer's rule.\nUsing the examples from the subsection Elements of signal flow graphs, we construct the graph In the figure, a signal-flow graph in this case. To check that the graph does represent the equations given, go to node x1. Look at the arrows incoming to this node (colored green for emphasis) and the weights attached to them. The equation for x1 is satisfied by equating it to the sum of the nodes attached to the incoming arrows multiplied by the weights attached to these arrows. Likewise, the red arrows and their weights provide the equation for x2, and the blue arrows for x3.\nAnother example is the general case of three simultaneous equations with unspecified coefficients:[12]\nTo set up the flow graph, the equations are recast so each identifies a single variable by adding it to each side. For example:\nUsing the diagram and summing the incident branches into x1 this equation is seen to be satisfied.\nAs all three variables enter these recast equations in a symmetrical fashion, the symmetry is retained in the graph by placing each variable at the corner of an equilateral triangle. Rotating the figure 120° simply permutes the indices. This construction can be extended to more variables by placing the node for each variable at the vertex of a regular polygon with as many vertices as there are variables.\nOf course, to be meaningful the coefficients are restricted to values such that the equations are independent and consistent.", 
    "dbpedia_url": "http://dbpedia.org/resource/Flow_graph_(mathematics)", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Flow_graph_(mathematics)\n"
}