{
    "about": "In graph theory, a flow network (also known as a transportation network) is a directed graph where each edge has a capacity and each edge receives a flow. The amount of flow on an edge cannot exceed the capacity of the edge. Often in operations research, a directed graph is called a network, the vertices are called nodes and the edges are called arcs. A flow must satisfy the restriction that the amount of flow into a node equals the amount of flow out of it, unless it is a source, which has only outgoing flow, or sink, which has only incoming flow. A network can be used to model traffic in a road system, circulation with demands, fluids in pipes, currents in an electrical circuit, or anything similar in which something travels through a network of nodes.", 
    "name": "Flow Network", 
    "classification": "Graph Algorithms", 
    "full_text": "In graph theory, a flow network (also known as a transportation network) is a directed graph where each edge has a capacity and each edge receives a flow. The amount of flow on an edge cannot exceed the capacity of the edge. Often in operations research, a directed graph is called a network, the vertices are called nodes and the edges are called arcs. A flow must satisfy the restriction that the amount of flow into a node equals the amount of flow out of it, unless it is a source, which has only outgoing flow, or sink, which has only incoming flow. A network can be used to model traffic in a road system, circulation with demands, fluids in pipes, currents in an electrical circuit, or anything similar in which something travels through a network of nodes.\n\n\nA network is a graph G = (V, E), together with a non-negative function c: V × V → ℝ∞, called the capacity function. Without loss of generality, it is assumed that if (u, v) ∈ E then (v, u) is also a member of E, since if (v, u) ∉ E then (v, u) may be added to E and then setting c(v, u) = 0.\nIf two nodes in G are distinguished, a source s and a sink t, then (G, c, s, t) is called a flow network.[1]\nThere are various notions of a flow function that can be defined in a flow graph. Flow functions model the net flow of units between pairs of nodes, and are useful when asking questions such as what is the maximum number of units that can be transferred from the source node s to the sink node t? The simplest example of a flow function is known as a pseudo-flow.\n\nGiven a pseudo-flow f in a flow network, it is often useful to consider the net flow entering a given node v, that is, the sum of the flows entering v. The excess function xf : V → ℝ is defined by xf (u) = ∑v ∈ V f (v, u). A node u is said to be active if xf (u) > 0, deficient if xf (u) < 0 or conserving if xf (u) = 0.\nThese final definitions lead to two strengthenings of the definition of a pseudo-flow:\n\nThe value of a feasible flow f, denoted | f |, is the net flow into the sink t of the flow network. That is, | f | = xf (t).\nIn the context of flow analysis, there is only an interest in considering how units are transferred between nodes in a holistic sense. Put another way, it is not necessary to distinguish multiple arcs between a pair of nodes:\nFor this reason, the capacity function c: V × V → ℝ∞, which does not allow for multiple arcs starting and ending at the same nodes, is sufficient for flow analysis. Similarly, it is enough to impose the skew symmetry constraint on flow functions to ensure that flow between two vertices is encoded by a single number (to indicate magnitude), and a sign (to indicate direction) — by knowing the flow between u and v you implicitly, via skew symmetry, know the flow between v and u. These simplifications of the model aren't always immediately intuitive, but they are convenient when it comes time to analysing flows.\nThe capacity constraint simply ensures that a flow on any one arc within the network cannot exceed the capacity of that arc.\nThe residual capacity of an arc with respect to a pseudo-flow f, denoted cf, is the difference between the arc's capacity and its flow. That is, cf (e) = c(e) - f(e). From this we can construct a residual network, denoted Gf (V, Ef), which models the amount of available capacity on the set of arcs in G = (V, E). More formally, given a flow network G, the residual network Gf  has the node set V, arc set Ef = {e ∈ E : cf (e) > 0} and capacity function cf.\nThis concept is used in Ford–Fulkerson algorithm which computes the maximum flow in a flow network.\nNote that there can be a path from u to v in the residual network, even though there is no path from u to v in the original network. Since flows in opposite directions cancel out, decreasing the flow from v to u is the same as increasing the flow from u to v.\nAn augmenting path is a path (u1, u2, ..., uk) in the residual network, where u1 = s, uk = t, and cf (ui, ui + 1) > 0. A network is at maximum flow if and only if there is no augmenting path in the residual network Gf.\nSometimes one needs to model a network with more than one source, a supersource is introduced to the graph.[2] This consists of a vertex connected to each of the sources with edges of infinite capacity, so as to act as a global source. A similar construct for sinks is called a supersink.[3]\nTo the left you see a flow network with source labeled s, sink t, and four additional nodes. The flow and capacity is denoted \n\n\n\nf\n\n/\n\nc\n\n\n{\\displaystyle f/c}\n\n. Notice how the network upholds skew symmetry, capacity constraints and flow conservation. The total amount of flow from s to t is 5, which can be easily seen from the fact that the total outgoing flow from s is 5, which is also the incoming flow to t. We know that no flow appears or disappears in any of the other nodes.\nBelow you see the residual network for the given flow. Notice how there is positive residual capacity on some edges where the original capacity is zero, for example for the edge \n\n\n\n(\nd\n,\nc\n)\n\n\n{\\displaystyle (d,c)}\n\n. This flow is not a maximum flow. There is available capacity along the paths \n\n\n\n(\ns\n,\na\n,\nc\n,\nt\n)\n\n\n{\\displaystyle (s,a,c,t)}\n\n, \n\n\n\n(\ns\n,\na\n,\nb\n,\nd\n,\nt\n)\n\n\n{\\displaystyle (s,a,b,d,t)}\n\n and \n\n\n\n(\ns\n,\na\n,\nb\n,\nd\n,\nc\n,\nt\n)\n\n\n{\\displaystyle (s,a,b,d,c,t)}\n\n, which are then the augmenting paths. The residual capacity of the first path is \n\n\n\nmin\n(\nc\n(\ns\n,\na\n)\n−\nf\n(\ns\n,\na\n)\n,\nc\n(\na\n,\nc\n)\n−\nf\n(\na\n,\nc\n)\n,\nc\n(\nc\n,\nt\n)\n−\nf\n(\nc\n,\nt\n)\n)\n\n\n{\\displaystyle \\min(c(s,a)-f(s,a),c(a,c)-f(a,c),c(c,t)-f(c,t))}\n\n \n\n\n\n=\nmin\n(\n5\n−\n3\n,\n3\n−\n2\n,\n2\n−\n1\n)\n=\nmin\n(\n2\n,\n1\n,\n1\n)\n=\n1\n\n\n{\\displaystyle =\\min(5-3,3-2,2-1)=\\min(2,1,1)=1}\n\n.[citation needed] Notice that as long as there exists some path with a positive residual capacity, the flow will not be maximum. The residual capacity for some path is the minimum residual capacity of all edges in that path.\nPicture a series of water pipes, fitting into a network. Each pipe is of a certain diameter, so it can only maintain a flow of a certain amount of water. Anywhere that pipes meet, the total amount of water coming into that junction must be equal to the amount going out, otherwise we would quickly run out of water, or we would have a buildup of water. We have a water inlet, which is the source, and an outlet, the sink. A flow would then be one possible way for water to get from source to sink so that the total amount of water coming out of the outlet is consistent. Intuitively, the total flow of a network is the rate at which water comes out of the outlet.\nFlows can pertain to people or material over transportation networks, or to electricity over electrical distribution systems. For any such physical network, the flow coming into any intermediate node needs to equal the flow going out of that node. This conservation constraint is equivalent to Kirchhoff's current law.\nFlow networks also find applications in ecology: flow networks arise naturally when considering the flow of nutrients and energy between different organizations in a food web. The mathematical problems associated with such networks are quite different from those that arise in networks of fluid or traffic flow. The field of ecosystem network analysis, developed by Robert Ulanowicz and others, involves using concepts from information theory and thermodynamics to study the evolution of these networks over time.\nThe simplest and most common problem using flow networks is to find what is called the maximum flow, which provides the largest possible total flow from the source to the sink in a given graph. There are many other problems which can be solved using max flow algorithms, if they are appropriately modeled as flow networks, such as bipartite matching, the assignment problem and the transportation problem. Maximum flow problems can be solved efficiently with the relabel-to-front algorithm. The max-flow min-cut theorem states that finding a maximal network flow is equivalent to finding a cut of minimum capacity that separates the source and the sink. Where a cut is the division of vertices such that the source is in one division and the sink is in another.\nIn a multi-commodity flow problem, you have multiple sources and sinks, and various \"commodities\" which are to flow from a given source to a given sink. This could be for example various goods that are produced at various factories, and are to be delivered to various given customers through the same transportation network.\nIn a minimum cost flow problem, each edge \n\n\n\nu\n,\nv\n\n\n{\\displaystyle u,v}\n\n has a given cost \n\n\n\nk\n(\nu\n,\nv\n)\n\n\n{\\displaystyle k(u,v)}\n\n, and the cost of sending the flow \n\n\n\nf\n(\nu\n,\nv\n)\n\n\n{\\displaystyle f(u,v)}\n\n across the edge is \n\n\n\nf\n(\nu\n,\nv\n)\n⋅\nk\n(\nu\n,\nv\n)\n\n\n{\\displaystyle f(u,v)\\cdot k(u,v)}\n\n. The objective is to send a given amount of flow from the source to the sink, at the lowest possible price.\nIn a circulation problem, you have a lower bound \n\n\n\nl\n(\nu\n,\nv\n)\n\n\n{\\displaystyle l(u,v)}\n\n on the edges, in addition to the upper bound \n\n\n\nc\n(\nu\n,\nv\n)\n\n\n{\\displaystyle c(u,v)}\n\n. Each edge also has a cost. Often, flow conservation holds for all nodes in a circulation problem, and there is a connection from the sink back to the source. In this way, you can dictate the total flow with \n\n\n\nl\n(\nt\n,\ns\n)\n\n\n{\\displaystyle l(t,s)}\n\n and \n\n\n\nc\n(\nt\n,\ns\n)\n\n\n{\\displaystyle c(t,s)}\n\n. The flow circulates through the network, hence the name of the problem.\nIn a network with gains or generalized network each edge has a gain, a real number (not zero) such that, if the edge has gain g, and an amount x flows into the edge at its tail, then an amount gx flows out at the head.\nIn a source localization problem, an algorithm tries to identify the most likely source node of information diffusion through a partially observed network. This can be done in linear time for trees and cubic time for arbitrary networks and has applications ranging from tracking mobile phone users to identifying the originating village of disease outbreaks.[5]", 
    "dbpedia_url": "http://dbpedia.org/resource/Flow_network", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Flow_network\n"
}