{
    "about": "In coding theory, the Forney algorithm (or Forney's algorithm) calculates the error values at known error locations. It is used as one of the steps in decoding BCH codes and Reed–Solomon codes (a subclass of BCH codes). George David Forney, Jr. developed the algorithm.[1]", 
    "name": "Forney Algorithm", 
    "classification": "Error Detection And Correction", 
    "full_text": "In coding theory, the Forney algorithm (or Forney's algorithm) calculates the error values at known error locations. It is used as one of the steps in decoding BCH codes and Reed–Solomon codes (a subclass of BCH codes). George David Forney, Jr. developed the algorithm.[1]\n\n\nCode words look like polynomials. By design, the generator polynomial has consecutive roots αc, αc+1, ..., αc+d−2.\nSyndromes\nError location polynomial[2]\nThe zeros of Λ(x) are X1−1, ..., Xν−1. The zeros are the reciprocals of the error locations \n\n\n\n\nX\n\nj\n\n\n=\n\nα\n\n\ni\n\nj\n\n\n\n\n\n\n{\\displaystyle X_{j}=\\alpha ^{i_{j}}}\n\n.\nOnce the error locations are known, the next step is to determine the error values at those locations. The error values are then used to correct the received values at those locations to recover the original codeword.\nIn the more general case, the error weights ej can be determined by solving the linear system\nHowever, there is a more efficient method known as the Forney algorithm, which is based on Lagrange interpolation. First calculate the error evaluator polynomial[3]\nWhere S(x) is the partial syndrome polynomial:[4]\nThen evaluate the error values:[3]\nThe value c is often called the \"first consecutive root\" or \"fcr\". Some codes select c = 1, so the expression simplifies to:\nΛ'(x) is the formal derivative of the error locator polynomial Λ(x):[3]\nIn the above expression, note that i is an integer, and λi would be an element of the finite field. The operator · represents ordinary multiplication (repeated addition in the finite field) and not the finite field's multiplication operator.\n\nLagrange interpolation\nGill (n.d., pp. 52–54) gives a derivation of the Forney algorithm.\nDefine the erasure locator polynomial\nWhere the erasure locations are given by ji. Apply the procedure described above, substituting Γ for Λ.\nIf both errors and erasures are present, use the error-and-erasure locator polynomial", 
    "dbpedia_url": "http://dbpedia.org/resource/Forney_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Forney_algorithm\n"
}