{
    "about": "The forward–backward algorithm is an inference algorithm for hidden Markov models which computes the posterior marginals of all hidden state variables given a sequence of observations/emissions \n\n\n\n\no\n\n1\n:\nt\n\n\n:=\n\no\n\n1\n\n\n,\n…\n,\n\no\n\nt\n\n\n\n\n{\\displaystyle o_{1:t}:=o_{1},\\dots ,o_{t}}\n\n, i.e. it computes, for all hidden state variables \n\n\n\n\nX\n\nk\n\n\n∈\n{\n\nX\n\n1\n\n\n,\n…\n,\n\nX\n\nt\n\n\n}\n\n\n{\\displaystyle X_{k}\\in \\{X_{1},\\dots ,X_{t}\\}}\n\n, the distribution \n\n\n\nP\n(\n\nX\n\nk\n\n\n \n\n|\n\n \n\no\n\n1\n:\nt\n\n\n)\n\n\n{\\displaystyle P(X_{k}\\ |\\ o_{1:t})}\n\n. This inference task is usually called smoothing. The algorithm makes use of the principle of dynamic programming to compute efficiently the values that are required to obtain the posterior marginal distributions in two passes. The first pass goes forward in time while the second goes backward in time; hence the name forward–backward algorithm.", 
    "name": "Forward–Backward Algorithm", 
    "classification": "Error Detection And Correction", 
    "full_text": "The forward–backward algorithm is an inference algorithm for hidden Markov models which computes the posterior marginals of all hidden state variables given a sequence of observations/emissions \n\n\n\n\no\n\n1\n:\nt\n\n\n:=\n\no\n\n1\n\n\n,\n…\n,\n\no\n\nt\n\n\n\n\n{\\displaystyle o_{1:t}:=o_{1},\\dots ,o_{t}}\n\n, i.e. it computes, for all hidden state variables \n\n\n\n\nX\n\nk\n\n\n∈\n{\n\nX\n\n1\n\n\n,\n…\n,\n\nX\n\nt\n\n\n}\n\n\n{\\displaystyle X_{k}\\in \\{X_{1},\\dots ,X_{t}\\}}\n\n, the distribution \n\n\n\nP\n(\n\nX\n\nk\n\n\n \n\n|\n\n \n\no\n\n1\n:\nt\n\n\n)\n\n\n{\\displaystyle P(X_{k}\\ |\\ o_{1:t})}\n\n. This inference task is usually called smoothing. The algorithm makes use of the principle of dynamic programming to compute efficiently the values that are required to obtain the posterior marginal distributions in two passes. The first pass goes forward in time while the second goes backward in time; hence the name forward–backward algorithm.\nThe term forward–backward algorithm is also used to refer to any algorithm belonging to the general class of algorithms that operate on sequence models in a forward–backward manner. In this sense, the descriptions in the remainder of this article refer but to one specific instance of this class.\n\n\nIn the first pass, the forward–backward algorithm computes a set of forward probabilities which provide, for all \n\n\n\nk\n∈\n{\n1\n,\n…\n,\nt\n}\n\n\n{\\displaystyle k\\in \\{1,\\dots ,t\\}}\n\n, the probability of ending up in any particular state given the first \n\n\n\nk\n\n\n{\\displaystyle k}\n\n observations in the sequence, i.e. \n\n\n\nP\n(\n\nX\n\nk\n\n\n \n\n|\n\n \n\no\n\n1\n:\nk\n\n\n)\n\n\n{\\displaystyle P(X_{k}\\ |\\ o_{1:k})}\n\n. In the second pass, the algorithm computes a set of backward probabilities which provide the probability of observing the remaining observations given any starting point \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, i.e. \n\n\n\nP\n(\n\no\n\nk\n+\n1\n:\nt\n\n\n \n\n|\n\n \n\nX\n\nk\n\n\n)\n\n\n{\\displaystyle P(o_{k+1:t}\\ |\\ X_{k})}\n\n. These two sets of probability distributions can then be combined to obtain the distribution over states at any specific point in time given the entire observation sequence:\nThe last step follows from an application of the Bayes' rule and the conditional independence of \n\n\n\n\no\n\nk\n+\n1\n:\nt\n\n\n\n\n{\\displaystyle o_{k+1:t}}\n\n and \n\n\n\n\no\n\n1\n:\nk\n\n\n\n\n{\\displaystyle o_{1:k}}\n\n given \n\n\n\n\nX\n\nk\n\n\n\n\n{\\displaystyle X_{k}}\n\n.\nAs outlined above, the algorithm involves three steps:\nThe forward and backward steps may also be called \"forward message pass\" and \"backward message pass\" - these terms are due to the message-passing used in general belief propagation approaches. At each single observation in the sequence, probabilities to be used for calculations at the next observation are computed. The smoothing step can be calculated simultaneously during the backward pass. This step allows the algorithm to take into account any past observations of output for computing more accurate results.\nThe forward–backward algorithm can be used to find the most likely state for any point in time. It cannot, however, be used to find the most likely sequence of states (see Viterbi algorithm).\nThe following description will use matrices of probability values rather than probability distributions, although in general the forward-backward algorithm can be applied to continuous as well as discrete probability models.\nWe transform the probability distributions related to a given hidden Markov model into matrix notation as follows. The transition probabilities \n\n\n\n\nP\n\n(\n\nX\n\nt\n\n\n∣\n\nX\n\nt\n−\n1\n\n\n)\n\n\n{\\displaystyle \\mathbf {P} (X_{t}\\mid X_{t-1})}\n\n of a given random variable \n\n\n\n\nX\n\nt\n\n\n\n\n{\\displaystyle X_{t}}\n\n representing all possible states in the hidden Markov model will be represented by the matrix \n\n\n\n\nT\n\n\n\n{\\displaystyle \\mathbf {T} }\n\n where the column index \n\n\n\ni\n\n\n{\\displaystyle i}\n\n will represent the target state and the row index \n\n\n\nj\n\n\n{\\displaystyle j}\n\n represents the start state. A transition from row-vector state \n\n\n\n\n\nπ\n\nt\n\n\n\n\n\n{\\displaystyle \\mathbf {\\pi _{t}} }\n\n to the incremental row-vector state \n\n\n\n\n\nπ\n\nt\n+\n1\n\n\n\n\n\n{\\displaystyle \\mathbf {\\pi _{t+1}} }\n\n is written as \n\n\n\n\n\nπ\n\nt\n+\n1\n\n\n\n=\n\n\nπ\n\nt\n\n\n\n\nT\n\n\n\n{\\displaystyle \\mathbf {\\pi _{t+1}} =\\mathbf {\\pi _{t}} \\mathbf {T} }\n\n. The example below represents a system where the probability of staying in the same state after each step is 70% and the probability of transitioning to the other state is 30%. The transition matrix is then:\nIn a typical Markov model we would multiply a state vector by this matrix to obtain the probabilities for the subsequent state. In a hidden Markov model the state is unknown, and we instead observe events associated with the possible states. An event matrix of the form:\nprovides the probabilities for observing events given a particular state. In the above example, event 1 will be observed 90% of the time if we are in state 1 while event 2 has a 10% probability of occurring in this state. In contrast, event 1 will only be observed 20% of the time if we are in state 2 and event 2 has an 80% chance of occurring. Given an arbitrary row-vector describing the state of the system (\n\n\n\n\nπ\n\n\n\n{\\displaystyle \\mathbf {\\pi } }\n\n), the probability of observing event j is then:\nThis can be represented in matrix form by multiplying the state row-vector (\n\n\n\n\nπ\n\n\n\n{\\displaystyle \\mathbf {\\pi } }\n\n) by an observation matrix (\n\n\n\n\n\nO\n\nj\n\n\n\n=\n\nd\ni\na\ng\n\n(\n\nb\n\n∗\n,\n\no\n\nj\n\n\n\n\n)\n\n\n{\\displaystyle \\mathbf {O_{j}} =\\mathrm {diag} (b_{*,o_{j}})}\n\n) containing only diagonal entries. Each entry is the probability of the observed event given each state. Continuing the above example, an observation of event 1 would be:\nThis allows us to calculate the new unnormalized probabilities state vector \n\n\n\n\n\nπ\n′\n\n\n\n\n{\\displaystyle \\mathbf {\\pi '} }\n\n through Bayes rule, weighting by the likelihood that each element of \n\n\n\n\nπ\n\n\n\n{\\displaystyle \\mathbf {\\pi } }\n\n generated event 1 as:\nWe can now make this general procedure specific to our series of observations. Assuming an initial state vector \n\n\n\n\n\nπ\n\n0\n\n\n\n\n\n{\\displaystyle \\mathbf {\\pi _{0}} }\n\n, (which can be optimized as a parameter through repetitions of the forward-back procedure), we begin with:\nThis process can be carried forward with additional observations using:\nThis value is the forward unnormalized probability vector. The i'th entry of this vector provides:\nTypically, we will normalize the probability vector at each step so that its entries sum to 1. A scaling factor is thus introduced at each step such that:\nwhere \n\n\n\n\n\n\n\n\nf\n^\n\n\n\n\n0\n:\nt\n−\n1\n\n\n\n\n\n{\\displaystyle \\mathbf {{\\hat {f}}_{0:t-1}} }\n\n represents the scaled vector from the previous step and \n\n\n\n\nc\n\nt\n\n\n\n\n{\\displaystyle c_{t}}\n\n represents the scaling factor that causes the resulting vector's entries to sum to 1. The product of the scaling factors is the total probability for observing the given events irrespective of the final states:\nThis allows us to interpret the scaled probability vector as:\nWe thus find that the product of the scaling factors provides us with the total probability for observing the given sequence up to time t and that the scaled probability vector provides us with the probability of being in each state at this time.\nA similar procedure can be constructed to find backward probabilities. These intend to provide the probabilities:\nThat is, we now want to assume that we start in a particular state (\n\n\n\n\nX\n\nt\n\n\n=\n\nx\n\ni\n\n\n\n\n{\\displaystyle X_{t}=x_{i}}\n\n), and we are now interested in the probability of observing all future events from this state. Since the initial state is assumed as given (i.e. the prior probability of this state = 100%), we begin with:\nNotice that we are now using a column vector while the forward probabilities used row vectors. We can then work backwards using:\nWhile we could normalize this vector as well so that its entries sum to one, this is not usually done. Noting that each entry contains the probability of the future event sequence given a particular initial state, normalizing this vector would be equivalent to applying Bayes' theorem to find the likelihood of each initial state given the future events (assuming uniform priors for the final state vector). However, it is more common to scale this vector using the same \n\n\n\n\nc\n\nt\n\n\n\n\n{\\displaystyle c_{t}}\n\n constants used in the forward probability calculations. \n\n\n\n\n\nb\n\nT\n:\nT\n\n\n\n\n\n{\\displaystyle \\mathbf {b_{T:T}} }\n\n is not scaled, but subsequent operations use:\nwhere \n\n\n\n\n\n\n\n\nb\n^\n\n\n\n\nt\n:\nT\n\n\n\n\n\n{\\displaystyle \\mathbf {{\\hat {b}}_{t:T}} }\n\n represents the previous, scaled vector. This result is that the scaled probability vector is related to the backward probabilities by:\nThis is useful because it allows us to find the total probability of being in each state at a given time, t, by multiplying these values:\nTo understand this, we note that \n\n\n\n\n\nf\n\n0\n:\nt\n\n\n\n(\ni\n)\n⋅\n\n\nb\n\nt\n:\nT\n\n\n\n(\ni\n)\n\n\n{\\displaystyle \\mathbf {f_{0:t}} (i)\\cdot \\mathbf {b_{t:T}} (i)}\n\n provides the probability for observing the given events in a way that passes through state \n\n\n\n\nx\n\ni\n\n\n\n\n{\\displaystyle x_{i}}\n\n at time t. This probability includes the forward probabilities covering all events up to time t as well as the backward probabilities which include all future events. This is the numerator we are looking for in our equation, and we divide by the total probability of the observation sequence to normalize this value and extract only the probability that \n\n\n\n\nX\n\nt\n\n\n=\n\nx\n\ni\n\n\n\n\n{\\displaystyle X_{t}=x_{i}}\n\n. These values are sometimes called the \"smoothed values\" as they combine the forward and backward probabilities to compute a final probability.\nThe values \n\n\n\n\n\nγ\n\nt\n\n\n\n(\ni\n)\n\n\n{\\displaystyle \\mathbf {\\gamma _{t}} (i)}\n\n thus provide the probability of being in each state at time t. As such, they are useful for determining the most probable state at any time. It should be noted, however, that the term \"most probable state\" is somewhat ambiguous. While the most probable state is the most likely to be correct at a given point, the sequence of individually probable states is not likely to be the most probable sequence. This is because the probabilities for each point are calculated independently of each other. They do not take into account the transition probabilities between states, and it is thus possible to get states at two moments (t and t+1) that are both most probable at those time points but which have very little probability of occurring together, i.e. \n\n\n\n\nP\n\n(\n\nX\n\nt\n\n\n=\n\nx\n\ni\n\n\n,\n\nX\n\nt\n+\n1\n\n\n=\n\nx\n\nj\n\n\n)\n≠\n\nP\n\n(\n\nX\n\nt\n\n\n=\n\nx\n\ni\n\n\n)\n\nP\n\n(\n\nX\n\nt\n+\n1\n\n\n=\n\nx\n\nj\n\n\n)\n\n\n{\\displaystyle \\mathbf {P} (X_{t}=x_{i},X_{t+1}=x_{j})\\neq \\mathbf {P} (X_{t}=x_{i})\\mathbf {P} (X_{t+1}=x_{j})}\n\n. The most probable sequence of states that produced an observation sequence can be found using the Viterbi algorithm.\nThis example takes as its basis the umbrella world in Russell & Norvig 2010 Chapter 15 pp. 566 in which we would like to infer the weather given observation of a man either carrying or not carrying an umbrella. We assume two possible states for the weather: state 1 = rain, state 2 = no rain. We assume that the weather has a 70% chance of staying the same each day and a 30% chance of changing. The transition probabilities are then:\nWe also assume each state generates 2 events: event 1 = umbrella, event 2 = no umbrella. The conditional probabilities for these occurring in each state are given by the probability matrix:\nWe then observe the following sequence of events: {umbrella, umbrella, no umbrella, umbrella, umbrella} which we will represent in our calculations as:\nNote that \n\n\n\n\n\nO\n\n3\n\n\n\n\n\n{\\displaystyle \\mathbf {O_{3}} }\n\n differs from the others because of the \"no umbrella\" observation.\nIn computing the forward probabilities we begin with:\nwhich is our prior state vector indicating that we don't know which state the weather is in before our observations. While a state vector should be given as a row vector, we will use the transpose of the matrix so that the calculations below are easier to read. Our calculations are then written in the form:\ninstead of:\nNotice that the transformation matrix is also transposed, but in our example the transpose is equal to the original matrix. Performing these calculations and normalizing the results provides:\nFor the backward probabilities we start with:\nWe are then able to compute (using the observations in reverse order and normalizing with different constants):\nFinally, we will compute the smoothed probability values. These result also must be scaled so that its entries sum to 1 because we did not scale the backward probabilities with the \n\n\n\n\nc\n\nt\n\n\n\n\n{\\displaystyle c_{t}}\n\n's found earlier. The backward probability vectors above thus actually represent the likelihood of each state at time t given the future observations. Because these vectors are proportional to the actual backward probabilities, the result has to be scaled an additional time.\nNotice that the value of \n\n\n\n\n\nγ\n\n0\n\n\n\n\n\n{\\displaystyle \\mathbf {\\gamma _{0}} }\n\n is equal to \n\n\n\n\n\n\n\n\nb\n^\n\n\n\n\n0\n:\n5\n\n\n\n\n\n{\\displaystyle \\mathbf {{\\hat {b}}_{0:5}} }\n\n and that \n\n\n\n\n\nγ\n\n5\n\n\n\n\n\n{\\displaystyle \\mathbf {\\gamma _{5}} }\n\n is equal to \n\n\n\n\n\n\n\n\nf\n^\n\n\n\n\n0\n:\n5\n\n\n\n\n\n{\\displaystyle \\mathbf {{\\hat {f}}_{0:5}} }\n\n. This follows naturally because both \n\n\n\n\n\n\n\n\nf\n^\n\n\n\n\n0\n:\n5\n\n\n\n\n\n{\\displaystyle \\mathbf {{\\hat {f}}_{0:5}} }\n\n and \n\n\n\n\n\n\n\n\nb\n^\n\n\n\n\n0\n:\n5\n\n\n\n\n\n{\\displaystyle \\mathbf {{\\hat {b}}_{0:5}} }\n\n begin with uniform priors over the initial and final state vectors (respectively) and take into account all of the observations. However, \n\n\n\n\n\nγ\n\n0\n\n\n\n\n\n{\\displaystyle \\mathbf {\\gamma _{0}} }\n\n will only be equal to \n\n\n\n\n\n\n\n\nb\n^\n\n\n\n\n0\n:\n5\n\n\n\n\n\n{\\displaystyle \\mathbf {{\\hat {b}}_{0:5}} }\n\n when our initial state vector represents a uniform prior (i.e. all entries are equal). When this is not the case \n\n\n\n\n\n\n\n\nb\n^\n\n\n\n\n0\n:\n5\n\n\n\n\n\n{\\displaystyle \\mathbf {{\\hat {b}}_{0:5}} }\n\n needs to be combined with the initial state vector to find the most likely initial state. We thus find that the forward probabilities by themselves are sufficient to calculate the most likely final state. Similarly, the backward probabilities can be combined with the initial state vector to provide the most probable initial state given the observations. The forward and backward probabilities need only be combined to infer the most probable states between the initial and final points.\nThe calculations above reveal that the most probable weather state on every day except for the third one was \"rain.\" They tell us more than this, however, as they now provide a way to quantify the probabilities of each state at different times. Perhaps most importantly, our value at \n\n\n\n\n\nγ\n\n5\n\n\n\n\n\n{\\displaystyle \\mathbf {\\gamma _{5}} }\n\n quantifies our knowledge of the state vector at the end of the observation sequence. We can then use this to predict the probability of the various weather states tomorrow as well as the probability of observing an umbrella.\nThe brute-force procedure for the solution of this problem is the generation of all possible \n\n\n\n\nN\n\nT\n\n\n\n\n{\\displaystyle N^{T}}\n\n state sequences and calculating the joint probability of each state sequence with the observed series of events. This approach has time complexity \n\n\n\nO\n(\nT\n⋅\n\nN\n\nT\n\n\n)\n\n\n{\\displaystyle O(T\\cdot N^{T})}\n\n, where \n\n\n\nT\n\n\n{\\displaystyle T}\n\n is the length of sequences and \n\n\n\nN\n\n\n{\\displaystyle N}\n\n is the number of symbols in the state alphabet. This is intractable for realistic problems, as the number of possible hidden node sequences typically is extremely high. However, the forward–backward algorithm has time complexity \n\n\n\nO\n(\n\nN\n\n2\n\n\nT\n)\n\n\n\n{\\displaystyle O(N^{2}T)\\,}\n\n.\nAn enhancement to the general forward-backward algorithm, called the Island algorithm, trades smaller memory usage for longer running time, taking \n\n\n\nO\n(\n\nN\n\n2\n\n\nT\nlog\n⁡\nT\n)\n\n\n\n{\\displaystyle O(N^{2}T\\log T)\\,}\n\n time and \n\n\n\nO\n(\n\nN\n\n2\n\n\nlog\n⁡\nT\n)\n\n\n\n{\\displaystyle O(N^{2}\\log T)\\,}\n\n memory. On a computer with an unlimited number of processors, this can be reduced to \n\n\n\nO\n(\n\nN\n\n2\n\n\nT\n)\n\n\n\n{\\displaystyle O(N^{2}T)\\,}\n\n total time, while still taking only \n\n\n\nO\n(\n\nN\n\n2\n\n\nlog\n⁡\nT\n)\n\n\n\n{\\displaystyle O(N^{2}\\log T)\\,}\n\n memory.[1]\nIn addition, algorithms have been developed to compute \n\n\n\n\n\nf\n\n0\n:\nt\n+\n1\n\n\n\n\n\n{\\displaystyle \\mathbf {f_{0:t+1}} }\n\n efficiently through online smoothing such as the fixed-lag smoothing (FLS) algorithm Russell & Norvig 2010 Figure 15.6 pp. 580.\nGiven HMM (just like in Viterbi algorithm) represented in the Python programming language:\nWe can write implementation like this:\nThe function fwd_bkw takes the following arguments: x is the sequence of observations, e.g. ['normal', 'cold', 'dizzy']; states is the set of hidden states; a_0 is the start probability; a are the transition probabilities; and e are the emission probabilities.\nFor simplicity of code, we assume that the observation sequence x is non-empty and that a[i][j] and e[i][j] is defined for all states i,j.\nIn the running example, the forward-backward algorithm is used as follows:\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Forward–backward_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Forward–backward_algorithm\n"
}