{
    "about": "Gain compression is a reduction in \"differential\" or \"slope\" gain caused by nonlinearity of the transfer function of the amplifying device. This nonlinearity may be caused by heat due to power dissipation or by overdriving the active device beyond its linear region. It is a large-signal phenomenon of circuits.", 
    "name": "Gain Compression", 
    "classification": "Signal Processing", 
    "full_text": "Gain compression is a reduction in \"differential\" or \"slope\" gain caused by nonlinearity of the transfer function of the amplifying device. This nonlinearity may be caused by heat due to power dissipation or by overdriving the active device beyond its linear region. It is a large-signal phenomenon of circuits.\n\n\nGain compression is relevant in any system with a wide dynamic range, such as audio or RF. It is more common in tube circuits than transistor circuits, due to topology differences, possibly causing the differences in audio performance called \"valve sound\". The front-end RF amps of radio receivers are particularly susceptible to this phenomenon when overloaded by a strong unwanted signal.\nA tube radio or tube amplifier will increase in volume to a point, and then as the input signal extends beyond the linear range of the device, the effective gain is reduced, altering the shape of the waveform. The effect is also present in transistor circuits. The extent of the effect depends on the topology of the amplifier.\nClipping, as a form of signal compression, differs from the operation of the typical studio audio level compressor, in which gain compression is not instantaneous (delayed in time via attack and release settings).\nClipping destroys any audio information which is over a certain threshold. Compression and limiting change the shape of the entire waveform, not just the shape of the waveform above the threshold. This is why it is possible to limit and compress with very high ratios without causing distortion.\nGain is a linear operation. \"Gain compression\" is not linear and, as such, its effect is one of distortion, due to the nonlinearity of the transfer characteristic which also causes a loss of 'slope' or 'differential' gain. So the output is less than expected using the small signal gain of the amplifier.\nIn clipping, the signal is abruptly limited to a certain amplitude and is thereby distorted in keeping under that level. This creates extra harmonics that are not present in the original signal.\n\"Soft\" clipping or limiting means there isn't a sharp \"knee point\" in the transfer characteristic. A sine wave that has been softly clipped will become more like a square wave, with more rounded edges, but will still have many extra harmonics.\nCompression of gain is caused by non-linear characteristics of the device when run at large amplitudes. With any signal, as the input level is increased beyond the linear range of the amplifier, gain compression will occur.\nA transistor's operating point may move with temperature, so higher power output may lead to compression due to collector dissipation. But it's not a change in gain; it's non-linear distortion. The output level stays relatively the same as the input level goes higher. Once the non-linear portion of the transfer characteristic of any amplifier is reached, any increase in input will not be matched by a proportional increase in output. Thus there is compression of gain. Also, at this time because the transfer function is no longer linear, harmonic distortion will result.\nIn intentional compression (sometimes called automatic gain control or audio level compression) as used in devices called 'dynamic range compressors', the overall gain of the circuit is actively changed in response to the level of the input over time, so the transfer function remains linear over a short period of time. A sine wave into such a system will still look like a sine wave at the output, but the overall gain is varied, depending on the level of that sine wave. Above a certain input level, the output sine wave will always be the same amplitude.\n\"Gain compression\" in RF amplifiers is similar to soft clipping. However, in narrowband systems, the effect \"looks\" more like gain compression simply because the harmonics are filtered out after amplification. Many data sheets for RF amplifiers list gain compression rather than distortion figures because it's easier to measure and is more important than distortion figures in nonlinear RF amplifiers.\nIn wideband and low-frequency systems, the nonlinear effects are readily visible, e.g. the output is clipped. To see the same thing at 1 GHz, an oscilloscope with a bandwidth of at least 10 GHz is needed. Observing with a spectrum analyzer, the fundamental compressed and the harmonics picking up.\nA low-noise RF amplifier, if fed by a directional antenna to a consumer 900 MHz receiver, should improve the transmission range. It works, but the receiver may also pick up a couple of UHF stations around 700 MHz.\nFor example, if channel 54 is transmitting 6 MW of AM, FM, and PM, the RF front end, expecting −80 dBm, would be grossly overloaded and generate mixing products. This is a typical effect of gain compression.\nA form of gain compression also takes place in loudspeaker voice coils when they heat up and increase their resistance. This causes less power to be drawn from the amplifier and a reduction in sound pressure level.", 
    "dbpedia_url": "http://dbpedia.org/resource/Gain_compression", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Gain_compression\n"
}