{
    "about": "Gal's accurate tables is a method devised by Shmuel Gal to provide accurate values of special functions using a lookup table and interpolation. It is a fast and efficient method for generating values of functions like the exponential or the trigonometric functions to within last-bit accuracy for almost all argument values without using extended precision arithmetic.", 
    "name": "Gal'S Accurate Tables", 
    "classification": "Numerical Analysis", 
    "full_text": "Gal's accurate tables is a method devised by Shmuel Gal to provide accurate values of special functions using a lookup table and interpolation. It is a fast and efficient method for generating values of functions like the exponential or the trigonometric functions to within last-bit accuracy for almost all argument values without using extended precision arithmetic.\nThe main idea in Gal's accurate tables is a different tabulation for the special function being computed. Commonly, the range is divided into several subranges, each with precomputed values and correction formulae. To compute the function, look up the closest point and compute a correction as a function of the distance.\nGal's idea is to not precompute equally spaced values, but rather to perturb the points x so that both x and f(x) are very nearly exactly representable in the chosen numeric format. By searching approximately 1000 values on either side of the desired value x, a value can be found such that f(x) can be represented with less than ±1/2000 bit of rounding error. If the correction is also computed to ±1/2000 bit of accuracy (which does not require extra floating-point precision as long as the correction is less than 1/2000 the magnitude of the stored value f(x), and the computed correction is more than ±1/1000 of a bit away from exactly half a bit (the difficult rounding case), then it is known whether the exact function value should be rounded up or down.\nThe technique provides an efficient way to compute the function value to within ±1/1000 least-significant bit, i.e. 10 extra bits of precision. If this approximation is more than ±1/1000 of a bit away from exactly midway between two representable values (which happens all but 2/1000 of the time, i.e. 99.8% of the time), then the correctly rounded result is clear.\nCombined with an extended-precision fallback algorithm, this can compute the correctly rounded result in very reasonable average time.\n2/1000 (0.2%) of the time, a higher-precision function evaluation is required to resolve the rounding uncertainty, but this is infrequent enough that it has little effect on the average calculation time.\nThe problem of generating function values which are accurate to the last bit is known as the table-maker's dilemma.\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Gal's_accurate_tables", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Gal's_accurate_tables\n"
}