{
    "about": "In mathematics, in the area of numerical analysis, Galerkin methods are a class of methods for converting a continuous operator problem (such as a differential equation) to a discrete problem. In principle, it is the equivalent of applying the method of variation of parameters to a function space, by converting the equation to a weak formulation. Typically one then applies some constraints on the function space to characterize the space with a finite set of basis functions. Galerkin's method provides powerful numerical solution to differential equations and modal analysis [1].", 
    "name": "Galerkin Method", 
    "classification": "Numerical Analysis", 
    "full_text": "In mathematics, in the area of numerical analysis, Galerkin methods are a class of methods for converting a continuous operator problem (such as a differential equation) to a discrete problem. In principle, it is the equivalent of applying the method of variation of parameters to a function space, by converting the equation to a weak formulation. Typically one then applies some constraints on the function space to characterize the space with a finite set of basis functions. Galerkin's method provides powerful numerical solution to differential equations and modal analysis [1].\nThe approach is usually credited to the Russian mathematician Boris Galerkin but the method was discovered by the Swiss mathematician Walther Ritz,[2] to whom Galerkin refers. Often when referring to a Galerkin method, one also gives the name along with typical approximation methods used, such as Bubnov–Galerkin method (after Ivan Bubnov), Petrov–Galerkin method (after Georgii I. Petrov[3][4]) or Ritz–Galerkin method[5] (after Walther Ritz).\nExamples of Galerkin methods are:\n\n\nLet us introduce Galerkin's method with an abstract problem posed as a weak formulation on a Hilbert space \n\n\n\nV\n\n\n{\\displaystyle V}\n\n, namely,\nHere, \n\n\n\na\n(\n⋅\n,\n⋅\n)\n\n\n{\\displaystyle a(\\cdot ,\\cdot )}\n\n is a bilinear form (the exact requirements on \n\n\n\na\n(\n⋅\n,\n⋅\n)\n\n\n{\\displaystyle a(\\cdot ,\\cdot )}\n\n will be specified later) and \n\n\n\nf\n\n\n{\\displaystyle f}\n\n is a bounded linear functional on \n\n\n\nV\n\n\n{\\displaystyle V}\n\n.\nChoose a subspace \n\n\n\n\nV\n\nn\n\n\n⊂\nV\n\n\n{\\displaystyle V_{n}\\subset V}\n\n of dimension n and solve the projected problem:\nWe call this the Galerkin equation. Notice that the equation has remained unchanged and only the spaces have changed. Reducing the problem to a finite-dimensional vector subspace allows us to numerically compute \n\n\n\n\nu\n\nn\n\n\n\n\n{\\displaystyle u_{n}}\n\n as a finite linear combination of the basis vectors in \n\n\n\n\nV\n\nn\n\n\n\n\n{\\displaystyle V_{n}}\n\n.\nThe key property of the Galerkin approach is that the error is orthogonal to the chosen subspaces. Since \n\n\n\n\nV\n\nn\n\n\n⊂\nV\n\n\n{\\displaystyle V_{n}\\subset V}\n\n, we can use \n\n\n\n\nv\n\nn\n\n\n\n\n{\\displaystyle v_{n}}\n\n as a test vector in the original equation. Subtracting the two, we get the Galerkin orthogonality relation for the error, \n\n\n\n\nϵ\n\nn\n\n\n=\nu\n−\n\nu\n\nn\n\n\n\n\n{\\displaystyle \\epsilon _{n}=u-u_{n}}\n\n which is the error between the solution of the original problem, \n\n\n\nu\n\n\n{\\displaystyle u}\n\n, and the solution of the Galerkin equation, \n\n\n\n\nu\n\nn\n\n\n\n\n{\\displaystyle u_{n}}\n\n\nSince the aim of Galerkin's method is the production of a linear system of equations, we build its matrix form, which can be used to compute the solution by a computer program.\nLet \n\n\n\n\ne\n\n1\n\n\n,\n\ne\n\n2\n\n\n,\n…\n,\n\ne\n\nn\n\n\n\n\n{\\displaystyle e_{1},e_{2},\\ldots ,e_{n}}\n\n be a basis for \n\n\n\n\nV\n\nn\n\n\n\n\n{\\displaystyle V_{n}}\n\n. Then, it is sufficient to use these in turn for testing the Galerkin equation, i.e.: find \n\n\n\n\nu\n\nn\n\n\n∈\n\nV\n\nn\n\n\n\n\n{\\displaystyle u_{n}\\in V_{n}}\n\n such that\nWe expand \n\n\n\n\nu\n\nn\n\n\n\n\n{\\displaystyle u_{n}}\n\n with respect to this basis, \n\n\n\n\nu\n\nn\n\n\n=\n\n∑\n\nj\n=\n1\n\n\nn\n\n\n\nu\n\nj\n\n\n\ne\n\nj\n\n\n\n\n{\\displaystyle u_{n}=\\sum _{j=1}^{n}u_{j}e_{j}}\n\n and insert it into the equation above, to obtain\nThis previous equation is actually a linear system of equations \n\n\n\nA\nu\n=\nf\n\n\n{\\displaystyle Au=f}\n\n, where\nDue to the definition of the matrix entries, the matrix of the Galerkin equation is symmetric if and only if the bilinear form \n\n\n\na\n(\n⋅\n,\n⋅\n)\n\n\n{\\displaystyle a(\\cdot ,\\cdot )}\n\n is symmetric.\nHere, we will restrict ourselves to symmetric bilinear forms, that is\nWhile this is not really a restriction of Galerkin methods, the application of the standard theory becomes much simpler. Furthermore, a Petrov–Galerkin method may be required in the nonsymmetric case.\nThe analysis of these methods proceeds in two steps. First, we will show that the Galerkin equation is a well-posed problem in the sense of Hadamard and therefore admits a unique solution. In the second step, we study the quality of approximation of the Galerkin solution \n\n\n\n\nu\n\nn\n\n\n\n\n{\\displaystyle u_{n}}\n\n.\nThe analysis will mostly rest on two properties of the bilinear form, namely\nBy the Lax-Milgram theorem (see weak formulation), these two conditions imply well-posedness of the original problem in weak formulation. All norms in the following sections will be norms for which the above inequalities hold (these norms are often called an energy norm).\nSince \n\n\n\n\nV\n\nn\n\n\n⊂\nV\n\n\n{\\displaystyle V_{n}\\subset V}\n\n, boundedness and ellipticity of the bilinear form apply to \n\n\n\n\nV\n\nn\n\n\n\n\n{\\displaystyle V_{n}}\n\n. Therefore, the well-posedness of the Galerkin problem is actually inherited from the well-posedness of the original problem.\nThe error \n\n\n\nu\n−\n\nu\n\nn\n\n\n\n\n{\\displaystyle u-u_{n}}\n\n between the original and the Galerkin solution admits the estimate\nThis means, that up to the constant \n\n\n\nC\n\n/\n\nc\n\n\n{\\displaystyle C/c}\n\n, the Galerkin solution \n\n\n\n\nu\n\nn\n\n\n\n\n{\\displaystyle u_{n}}\n\n is as close to the original solution \n\n\n\nu\n\n\n{\\displaystyle u}\n\n as any other vector in \n\n\n\n\nV\n\nn\n\n\n\n\n{\\displaystyle V_{n}}\n\n. In particular, it will be sufficient to study approximation by spaces \n\n\n\n\nV\n\nn\n\n\n\n\n{\\displaystyle V_{n}}\n\n, completely forgetting about the equation being solved.\nSince the proof is very simple and the basic principle behind all Galerkin methods, we include it here: by ellipticity and boundedness of the bilinear form (inequalities) and Galerkin orthogonality (equals sign in the middle), we have for arbitrary \n\n\n\n\nv\n\nn\n\n\n∈\n\nV\n\nn\n\n\n\n\n{\\displaystyle v_{n}\\in V_{n}}\n\n:\nDividing by \n\n\n\nc\n∥\nu\n−\n\nu\n\nn\n\n\n∥\n\n\n{\\displaystyle c\\|u-u_{n}\\|}\n\n and taking the infimum over all possible \n\n\n\n\nv\n\nn\n\n\n\n\n{\\displaystyle v_{n}}\n\n yields the lemma.", 
    "dbpedia_url": "http://dbpedia.org/resource/Galerkin_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Galerkin_method\n"
}