{
    "about": "Graphical methods provide a means of determining or approximating the roots of a polynomial—the values that make the polynomial equal to zero.[1] Practical tools for performing these include graph paper, graphical calculators and computer graphics.[2]", 
    "name": "Geometry Of Roots Of Real Polynomials", 
    "classification": "Root-Finding Algorithms", 
    "full_text": "Graphical methods provide a means of determining or approximating the roots of a polynomial—the values that make the polynomial equal to zero.[1] Practical tools for performing these include graph paper, graphical calculators and computer graphics.[2]\nThe fundamental theorem of algebra states that a nth-degree polynomial with complex coefficients (including real coefficients) has n complex roots (not necessarily real even if the coefficients are real), although its roots may not all be different from each other. If the polynomial has real coefficients, its roots are either real, or else occur as complex conjugates. Suppose a polynomial P(x) is graphed as y = P(x). At a real root, the graph of the polynomial crosses the x-axis. Thus, the real roots of a polynomial can be demonstrated graphically.[3]\nFor some kinds of polynomials, all the roots, including the complex roots, can be found graphically. Polynomial equations up to the fifth degree may be solved graphically.[4][5][6]\nThe geometrical methods of ruler and compass may be used to solve any linear or quadratic equation. Descartes showed that the constructions of Euclid were equivalent to the algebraic solution of quadratics.[7]\nCubic equations may be solved by solid geometry. Archimedes' work On the Sphere and the Cylinder provided solutions of some cubics and Omar Khayyam systematised this to provide geometrical solutions of all quadratics and cubics.[8]\n\n\nFor polynomials with real coefficients, a local minimum point above the x-axis or a local maximum point below the x-axis indicates the existence of two non-real complex roots, which are each other's complex conjugates.[9] The converse, however, is not true; for example, the cubic polynomial x3 + x has two complex roots, but its graph has no local minima or maxima.\nThe simplest such case involves parabolas.\nIf a parabola has a global minimum point above the x-axis, or a global maximum point below the x-axis, then its x intercepts are not real. For\nif a and k are positive, then the roots are non-real complex numbers. The number k is then the height of the vertex above the x-axis. In the example in the illustration, we have k = 9. Suppose one goes k units in the opposite direction from the vertex, i.e. away from the x-axis, then horizontally as far as it takes to reach the curve (in the example, that distance is 3. The horizontal distance from that point to the curve is the absolute value of the imaginary part of the root.[10] The x-coordinate of the vertex is the real part.[10] Thus, in the example, the roots are[10]\nThis method is specific to quadratics and does not generalise to higher-degree polynomial equations.\nCubic function#Geometric interpretation of the roots", 
    "dbpedia_url": "http://dbpedia.org/resource/Geometry_of_roots_of_real_polynomials", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Geometry_of_roots_of_real_polynomials\n"
}