{
    "about": "Gradient pattern analysis (GPA)[1] is a geometric computing method for characterizing geometrical bilateral symmetry breaking of an ensemble of symmetric vectors regularly distributed in a square lattice. Usually, the lattice of vectors represent the first-order gradient of a scalar field, here an M x M square amplitude matrix. An important property of the gradient representation is the following: A given M x M matrix where all amplitudes are different results in an M x M gradient lattice containing \n\n\n\n\nN\n\nV\n\n\n=\n\nM\n\n2\n\n\n\n\n{\\displaystyle N_{V}=M^{2}}\n\n asymmetric vectors. As each vector can be characterized by its norm and phase, variations in the \n\n\n\n\nM\n\n2\n\n\n\n\n{\\displaystyle M^{2}}\n\n amplitudes can modify the respective \n\n\n\n\nM\n\n2\n\n\n\n\n{\\displaystyle M^{2}}\n\n gradient pattern.", 
    "name": "Gradient Pattern Analysis", 
    "classification": "Signal Processing", 
    "full_text": "Gradient pattern analysis (GPA)[1] is a geometric computing method for characterizing geometrical bilateral symmetry breaking of an ensemble of symmetric vectors regularly distributed in a square lattice. Usually, the lattice of vectors represent the first-order gradient of a scalar field, here an M x M square amplitude matrix. An important property of the gradient representation is the following: A given M x M matrix where all amplitudes are different results in an M x M gradient lattice containing \n\n\n\n\nN\n\nV\n\n\n=\n\nM\n\n2\n\n\n\n\n{\\displaystyle N_{V}=M^{2}}\n\n asymmetric vectors. As each vector can be characterized by its norm and phase, variations in the \n\n\n\n\nM\n\n2\n\n\n\n\n{\\displaystyle M^{2}}\n\n amplitudes can modify the respective \n\n\n\n\nM\n\n2\n\n\n\n\n{\\displaystyle M^{2}}\n\n gradient pattern.\nThe original concept of GPA was introduced by Rosa, Sharma and Valdivia in 1999.[2] Usually GPA is applied for spatio-temporal pattern analysis in physics and environmental sciences operating on time-series and digital images.\nBy connecting all vectors using a Delaunay triangulation criterion it is possible to characterize gradient asymmetries computing the so-called gradient asymmetry coefficient, that has been defined as: \n\n\n\n\nG\n\nA\n\n\n=\n\n\n\n\nN\n\nC\n\n\n−\n\nN\n\nV\n\n\n\n\nN\n\nV\n\n\n\n\n\n\n{\\displaystyle G_{A}={\\frac {N_{C}-N_{V}}{N_{V}}}}\n\n, where \n\n\n\n\nN\n\nV\n\n\n>\n0\n\n\n{\\displaystyle N_{V}>0}\n\n is the total number of asymmetric vectors, \n\n\n\n\nN\n\nC\n\n\n\n\n{\\displaystyle N_{C}}\n\n is the number of Delaunay connections among them and the property \n\n\n\n\nN\n\nC\n\n\n>\n\nN\n\nV\n\n\n\n\n{\\displaystyle N_{C}>N_{V}}\n\n is valid for any gradient square lattice.\nAs the asymmetry coefficient is very sensitive to small changes in the phase and modulus of each gradient vector, it can distinguish complex variability patterns (bilateral asymmetry) even when they are very similar but consist of a very fine structural difference. Note that, unlike most of the statistical tools, the GPA does not rely on the statistical properties of the data but depends solely on the local symmetry properties of the correspondent gradient pattern.\nFor a complex extended pattern (matrix of amplitudes of a spatio-temporal pattern) composed by locally asymmetric fluctuations, \n\n\n\n\nG\n\nA\n\n\n\n\n{\\displaystyle G_{A}}\n\n is nonzero, defining different classes of irregular fluctuation patterns (1/f noise, chaotic, reactive-diffusive, etc.).\nBesides \n\n\n\n\nG\n\nA\n\n\n\n\n{\\displaystyle G_{A}}\n\n other measurements (called gradient moments) can be calculated from the gradient lattice.[3] Considering the sets of local norms and phases as discrete compact groups, spatially distributed in a square lattice, the gradient moments have the basic property of being globally invariant (for rotation and modulation).\nThe primary research on gradient lattices applied to characterize weak wave turbulence from X-ray images of solar active regions was developed in the Department of Astronomy at University of Maryland, College Park, USA. A key line of research on GPA's algorithms and applications has been developed at Lab for Computing and Applied Mathematics (LAC) at National Institute for Space Research (INPE) in Brazil.\nWhen GPA is conjugated with wavelet analysis, then the method is called Gradient spectral analysis (GSA), usually applied to short time series analysis.[4]", 
    "dbpedia_url": "http://dbpedia.org/resource/Gradient_pattern_analysis", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Gradient_pattern_analysis\n"
}