{
    "about": "In signal processing, group delay is the time delay of the amplitude envelopes of the various sinusoidal components of a signal through a device under test, and is a function of frequency for each component. Phase delay, in contrast, is the time delay of the phase as opposed to the time delay of the amplitude envelope.", 
    "name": "Group Delay And Phase Delay", 
    "classification": "Signal Processing", 
    "full_text": "In signal processing, group delay is the time delay of the amplitude envelopes of the various sinusoidal components of a signal through a device under test, and is a function of frequency for each component. Phase delay, in contrast, is the time delay of the phase as opposed to the time delay of the amplitude envelope.\nAll frequency components of a signal are delayed when passed through a device such as an amplifier, a loudspeaker, or propagating through space or a medium, such as air. This signal delay will be different for the various frequencies unless the device has the property of being linear phase. (Linear phase and minimum phase are often confused. They are quite different.) The delay variation means that signals consisting of multiple frequency components will suffer distortion because these components are not delayed by the same amount of time at the output of the device. This changes the shape of the signal in addition to any constant delay or scale change. A sufficiently large delay variation can cause problems such as poor fidelity in audio or intersymbol interference (ISI) in the demodulation of digital information from an analog carrier signal. High speed modems use adaptive equalizers to compensate for non-constant group delay.\n\n\nGroup delay is a useful measure of time distortion, and is calculated by differentiating, with respect to frequency, the phase response of the device under test (DUT): the group delay is a measure of the slope of the phase response at any given frequency. Variations in group delay cause signal distortion, just as deviations from linear phase cause distortion.\nIn linear time-invariant (LTI) system theory, control theory, and in digital or analog signal processing, the relationship between the input signal, \n\n\n\n\nx\n(\nt\n)\n\n\n\n{\\displaystyle \\displaystyle x(t)}\n\n, to output signal, \n\n\n\n\ny\n(\nt\n)\n\n\n\n{\\displaystyle \\displaystyle y(t)}\n\n, of an LTI system is governed by a convolution operation:\nOr, in the frequency domain,\nwhere\nand\nHere \n\n\n\n\nh\n(\nt\n)\n\n\n\n{\\displaystyle \\displaystyle h(t)}\n\n is the time-domain impulse response of the LTI system and \n\n\n\n\nX\n(\ns\n)\n\n\n\n{\\displaystyle \\displaystyle X(s)}\n\n, \n\n\n\n\nY\n(\ns\n)\n\n\n\n{\\displaystyle \\displaystyle Y(s)}\n\n, \n\n\n\n\nH\n(\ns\n)\n\n\n\n{\\displaystyle \\displaystyle H(s)}\n\n, are the Laplace transforms of the input \n\n\n\n\nx\n(\nt\n)\n\n\n\n{\\displaystyle \\displaystyle x(t)}\n\n, output \n\n\n\n\ny\n(\nt\n)\n\n\n\n{\\displaystyle \\displaystyle y(t)}\n\n, and impulse response \n\n\n\n\nh\n(\nt\n)\n\n\n\n{\\displaystyle \\displaystyle h(t)}\n\n, respectively. \n\n\n\n\nH\n(\ns\n)\n\n\n\n{\\displaystyle \\displaystyle H(s)}\n\n is called the transfer function of the LTI system and, like the impulse response \n\n\n\n\nh\n(\nt\n)\n\n\n\n{\\displaystyle \\displaystyle h(t)}\n\n, fully defines the input-output characteristics of the LTI system.\nSuppose that such a system is driven by a quasi-sinusoidal signal, that is, a sinusoid whose amplitude envelope \n\n\n\n\na\n(\nt\n)\n\n\n\n{\\displaystyle \\displaystyle a(t)}\n\n is slowly-changing relative to the frequency \n\n\n\n\nω\n\n\n\n{\\displaystyle \\displaystyle \\omega }\n\n of the sinusoid. Mathematically, this means that the driving signal has the form\nsubject to the assumption\nThen the output of such an LTI system is very well approximated as\nHere \n\n\n\n\n\nτ\n\ng\n\n\n\n\n\n{\\displaystyle \\displaystyle \\tau _{g}}\n\n and \n\n\n\n\n\nτ\n\nϕ\n\n\n\n\n\n{\\displaystyle \\displaystyle \\tau _{\\phi }}\n\n, the group delay and phase delay respectively, are given by the expressions below (and potentially are functions of the angular frequency \n\n\n\n\nω\n\n\n\n{\\displaystyle \\displaystyle \\omega }\n\n).\nIn a linear phase system (with non-inverting gain), both \n\n\n\n\n\nτ\n\ng\n\n\n\n\n\n{\\displaystyle \\displaystyle \\tau _{g}}\n\n and \n\n\n\n\n\nτ\n\nϕ\n\n\n\n\n\n{\\displaystyle \\displaystyle \\tau _{\\phi }}\n\n are constant (i.e. independent of \n\n\n\n\nω\n\n\n\n{\\displaystyle \\displaystyle \\omega }\n\n) and equal, and their common value equals the overall delay of the system; and the unwrapped phase shift of the system (namely \n\n\n\n\n−\nω\n\nτ\n\nϕ\n\n\n\n\n\n{\\displaystyle \\displaystyle -\\omega \\tau _{\\phi }}\n\n) is negative, with magnitude increasing linearly with frequency \n\n\n\n\nω\n\n\n\n{\\displaystyle \\displaystyle \\omega }\n\n.\nMore generally, it can be shown that for an LTI system with transfer function \n\n\n\n\nH\n(\ns\n)\n\n\n\n{\\displaystyle \\displaystyle H(s)}\n\n driven by a complex sinusoid of unit amplitude,\nthe output is\nwhere the phase shift \n\n\n\n\nϕ\n\n\n\n{\\displaystyle \\displaystyle \\phi }\n\n is\nAdditionally, it can be shown that the group delay, \n\n\n\n\n\nτ\n\ng\n\n\n\n\n\n{\\displaystyle \\displaystyle \\tau _{g}}\n\n, and phase delay, \n\n\n\n\n\nτ\n\nϕ\n\n\n\n\n\n{\\displaystyle \\displaystyle \\tau _{\\phi }}\n\n, are frequency-dependent, and they can be computed from the phase shift \n\n\n\n\nϕ\n\n\n\n{\\displaystyle \\displaystyle \\phi }\n\n by\nIn physics, and in particular in optics, the term group delay has the following meanings:\nIt is often desirable for the group delay to be constant across all frequencies; otherwise there is temporal smearing of the signal. Because group delay is \n\n\n\n\nτ\n\ng\n\n\n(\nω\n)\n=\n−\n\n\n\nd\nϕ\n\n\nd\nω\n\n\n\n\n\n{\\displaystyle \\tau _{g}(\\omega )=-{\\frac {d\\phi }{d\\omega }}}\n\n, as defined in (1), it therefore follows that a constant group delay can be achieved if the transfer function of the device or medium has a linear phase response (i.e., \n\n\n\nϕ\n(\nω\n)\n=\nϕ\n(\n0\n)\n−\n\nτ\n\ng\n\n\nω\n \n\n\n{\\displaystyle \\phi (\\omega )=\\phi (0)-\\tau _{g}\\omega \\ }\n\n where the group delay \n\n\n\n\nτ\n\ng\n\n\n \n\n\n{\\displaystyle \\tau _{g}\\ }\n\n is a constant). The degree of nonlinearity of the phase indicates the deviation of the group delay from a constant.\nGroup delay has some importance in the audio field and especially in the sound reproduction field. Many components of an audio reproduction chain, notably loudspeakers and multiway loudspeaker crossover networks, introduce group delay in the audio signal. It is therefore important to know the threshold of audibility of group delay with respect to frequency, especially if the audio chain is supposed to provide high fidelity reproduction. The best thresholds of audibility table has been provided by Blauert & Laws (1978).\nFlanagan, Moore and Stone conclude that at 1, 2 and 4 kHz, a group delay of about 1.6 ms is audible with headphones in a non-reverberant condition.[1]\n This article incorporates public domain material from the General Services Administration document \"Federal Standard 1037C\".", 
    "dbpedia_url": "http://dbpedia.org/resource/Group_delay_and_phase_delay", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Group_delay_and_phase_delay\n"
}