{
    "about": "The Hadamard code is an error-correcting code that is used for error detection and correction when transmitting messages over very noisy or unreliable channels. In 1971, the code was used to transmit photos of Mars back to Earth from the NASA space probe Mariner 9.[1] Because of its unique mathematical properties, the Hadamard code is not only used by engineers, but also intensely studied in coding theory, mathematics, and theoretical computer science. The Hadamard code is named after the French mathematician Jacques Hadamard. It is also known under the names Walsh code, Walsh family,[2] and Walsh–Hadamard code[3] in recognition of the American mathematician Joseph Leonard Walsh.", 
    "name": "Hadamard Code", 
    "classification": "Error Detection And Correction", 
    "full_text": "The Hadamard code is an error-correcting code that is used for error detection and correction when transmitting messages over very noisy or unreliable channels. In 1971, the code was used to transmit photos of Mars back to Earth from the NASA space probe Mariner 9.[1] Because of its unique mathematical properties, the Hadamard code is not only used by engineers, but also intensely studied in coding theory, mathematics, and theoretical computer science. The Hadamard code is named after the French mathematician Jacques Hadamard. It is also known under the names Walsh code, Walsh family,[2] and Walsh–Hadamard code[3] in recognition of the American mathematician Joseph Leonard Walsh.\nThe Hadamard code is an example of a linear code over a binary alphabet that maps messages of length \n\n\n\nk\n\n\n{\\displaystyle k}\n\n to codewords of length \n\n\n\n\n2\n\nk\n\n\n\n\n{\\displaystyle 2^{k}}\n\n. It is unique in that each non-zero codeword has a Hamming weight of exactly \n\n\n\n\n2\n\nk\n−\n1\n\n\n\n\n{\\displaystyle 2^{k-1}}\n\n, which implies that the distance of the code is also \n\n\n\n\n2\n\nk\n−\n1\n\n\n\n\n{\\displaystyle 2^{k-1}}\n\n. In standard coding theory notation for block codes, the Hadamard code is a \n\n\n\n[\n\n2\n\nk\n\n\n,\nk\n,\n\n2\n\nk\n−\n1\n\n\n\n]\n\n2\n\n\n\n\n{\\displaystyle [2^{k},k,2^{k-1}]_{2}}\n\n-code, that is, it is a linear code over a binary alphabet, has block length \n\n\n\n\n2\n\nk\n\n\n\n\n{\\displaystyle 2^{k}}\n\n, message length (or dimension) \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, and minimum distance \n\n\n\n\n2\n\nk\n\n\n\n/\n\n2\n\n\n{\\displaystyle 2^{k}/2}\n\n. The block length is very large compared to the message length, but on the other hand, errors can be corrected even in extremely noisy conditions. The punctured Hadamard code is a slightly improved version of the Hadamard code; it is a \n\n\n\n[\n\n2\n\nk\n\n\n,\nk\n+\n1\n,\n\n2\n\nk\n−\n1\n\n\n\n]\n\n2\n\n\n\n\n{\\displaystyle [2^{k},k+1,2^{k-1}]_{2}}\n\n-code and thus has a slightly better rate while maintaining the relative distance of \n\n\n\n1\n\n/\n\n2\n\n\n{\\displaystyle 1/2}\n\n, and is thus preferred in practical applications. The punctured Hadamard code is the same as the first order Reed–Muller code over the binary alphabet.[4]\nNormally, Hadamard codes are based on Sylvester's construction of Hadamard matrices, but the term “Hadamard code” is also used to refer to codes constructed from arbitrary Hadamard matrices, which are not necessarily of Sylvester type. In general, such a code is not linear. Such codes were first constructed by R. C. Bose and S. S. Shrikhande in 1959.[5] If n is the size of the Hadamard matrix, the code has parameters \n\n\n\n(\nn\n,\n2\nn\n,\nn\n\n/\n\n2\n\n)\n\n2\n\n\n\n\n{\\displaystyle (n,2n,n/2)_{2}}\n\n, meaning it is a not-necessarily-linear binary code with 2n codewords of block length n and minimal distance n/2. The construction and decoding scheme described below apply for general n, but the property of linearity and the identification with Reed–Muller codes require that n be a power of 2 and that the Hadamard matrix be equivalent to the matrix constructed by Sylvester's method.\nThe Hadamard code is a locally decodable code, which provides a way to recover parts of the original message with high probability, while only looking at a small fraction of the received word. This gives rise to applications in computational complexity theory and particularly in the design of probabilistically checkable proofs. Since the relative distance of the Hadamard code is 1/2, normally one can only hope to recover from at most a 1/4 fraction of error. Using list decoding, however, it is possible to compute a short list of possible candidate messages as long as fewer than \n\n\n\n\n\n1\n2\n\n\n−\nϵ\n\n\n{\\displaystyle {\\frac {1}{2}}-\\epsilon }\n\n of the bits in the received word have been corrupted.\nIn code division multiple access (CDMA) communication, the Hadamard code is referred to as Walsh Code, and is used to define individual communication channels. It is usual in the CDMA literature to refer to codewords as “codes”. Each user will use a different codeword, or “code”, to modulate their signal. Because Walsh codewords are mathematically orthogonal, a Walsh-encoded signal appears as random noise to a CDMA capable mobile terminal, unless that terminal uses the same codeword as the one used to encode the incoming signal.[6]\n\n\nHadamard code is the name that is most commonly used for this code in the literature. However, in modern use these error correcting codes are referred to as Walsh–Hadamard codes.\nThere is a reason for this:\nJacques Hadamard did not invent the code himself, but he defined Hadamard matrices around 1893, long before the first error-correcting code, the Hamming code, was developed in the 1940s.\nThe Hadamard code is based on Hadamard matrices, and while there are many different Hadamard matrices that could be used here, normally only Sylvester's construction of Hadamard matrices is used to obtain the codewords of the Hadamard code.\nJames Joseph Sylvester developed his construction of Hadamard matrices in 1867, which actually predates Hadamard's work on Hadamard matrices. Hence the name Hadamard code is not undisputed and sometimes the code is called Walsh code, honoring the American mathematician Joseph Leonard Walsh.\nA Hadamard code was used during the 1971 Mariner 9 mission to correct for picture transmission errors. The data words used during this mission were 6 bits long, which represented 64 grayscale values.\nBecause of limitations of the quality of the alignment of the transmitter at the time (due to Doppler Tracking Loop issues) the maximum useful data length was about 30 bits. Instead of using a repetition code, a [32, 6, 16] Hadamard code was used.\nErrors of up to 7 bits per word could be corrected using this scheme. Compared to a 5-repetition code, the error correcting properties of this Hadamard code are much better, yet its rate is comparable. The efficient decoding algorithm was an important factor in the decision to use this code.\nThe circuitry used was called the \"Green Machine\". It employed the fast Fourier transform which can increase the decoding speed by a factor of three. Since the 1990s use of this code by space programs has more or less ceased, and the Deep Space Network does not support this error correction scheme for its dishes that are greater than 26 m.\nWhile all Hadamard codes are based on Hadamard matrices, the constructions differ in subtle ways for different scientific fields, authors, and uses. Engineers, who use the codes for data transmission, and coding theorists, who analyse extremal properties of codes, typically want the rate of the code to be as high as possible, even if this means that the construction becomes mathematically slightly less elegant.\nOn the other hand, for many applications of Hadamard codes in theoretical computer science it is not so important to achieve the optimal rate, and hence simpler constructions of Hadamard codes are preferred since they can be analyzed more elegantly.\nWhen given a binary message \n\n\n\nx\n∈\n{\n0\n,\n1\n\n}\n\nk\n\n\n\n\n{\\displaystyle x\\in \\{0,1\\}^{k}}\n\n of length \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, the Hadamard code encodes the message into a codeword \n\n\n\n\nHad\n\n(\nx\n)\n\n\n{\\displaystyle {\\text{Had}}(x)}\n\n using an encoding function \n\n\n\n\nHad\n\n:\n{\n0\n,\n1\n\n}\n\nk\n\n\n→\n{\n0\n,\n1\n\n}\n\n\n2\n\nk\n\n\n\n\n\n\n{\\displaystyle {\\text{Had}}:\\{0,1\\}^{k}\\to \\{0,1\\}^{2^{k}}}\n\n. This function makes use of the inner product \n\n\n\n⟨\nx\n,\ny\n⟩\n\n\n{\\displaystyle \\langle x,y\\rangle }\n\n of two vectors \n\n\n\nx\n,\ny\n∈\n{\n0\n,\n1\n\n}\n\nk\n\n\n\n\n{\\displaystyle x,y\\in \\{0,1\\}^{k}}\n\n, which is defined as follows:\nThen the Hadamard encoding of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is defined as the sequence of all inner products with \n\n\n\nx\n\n\n{\\displaystyle x}\n\n:\nAs mentioned above, the punctured Hadamard code is used in practice since the Hadamard code itself is somewhat wasteful. This is because, if the first bit of \n\n\n\ny\n\n\n{\\displaystyle y}\n\n is zero, \n\n\n\n\ny\n\n1\n\n\n=\n0\n\n\n{\\displaystyle y_{1}=0}\n\n, then the inner product contains no information whatsoever about \n\n\n\n\nx\n\n1\n\n\n\n\n{\\displaystyle x_{1}}\n\n, and hence, it is impossible to fully decode \n\n\n\nx\n\n\n{\\displaystyle x}\n\n from those positions of the codeword alone. On the other hand, when the codeword is restricted to the positions where \n\n\n\n\ny\n\n1\n\n\n=\n1\n\n\n{\\displaystyle y_{1}=1}\n\n, it is still possible to fully decode \n\n\n\nx\n\n\n{\\displaystyle x}\n\n. Hence it makes sense to restrict the Hadamard code to these positions, which gives rise to the punctured Hadamard encoding of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n; that is, \n\n\n\n\npHad\n\n(\nx\n)\n=\n\n\n(\n\n\n⟨\nx\n,\ny\n⟩\n\n\n\n)\n\n\n\ny\n∈\n{\n1\n}\n×\n{\n0\n,\n1\n\n}\n\nk\n−\n1\n\n\n\n\n\n\n{\\displaystyle {\\text{pHad}}(x)={\\Big (}\\langle x,y\\rangle {\\Big )}_{y\\in \\{1\\}\\times \\{0,1\\}^{k-1}}}\n\n.\nThe Hadamard code is a linear code, and all linear codes can be generated by a generator matrix \n\n\n\nG\n\n\n{\\displaystyle G}\n\n. This is a matrix such that \n\n\n\n\nHad\n\n(\nx\n)\n=\nx\n⋅\nG\n\n\n{\\displaystyle {\\text{Had}}(x)=x\\cdot G}\n\n holds for all \n\n\n\nx\n∈\n{\n0\n,\n1\n\n}\n\nk\n\n\n\n\n{\\displaystyle x\\in \\{0,1\\}^{k}}\n\n, where the message \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is viewed as a row vector and the vector-matrix product is understood in the vector space over the finite field \n\n\n\n\n\nF\n\n\n2\n\n\n\n\n{\\displaystyle \\mathbb {F} _{2}}\n\n. In particular, an equivalent way to write the inner product definition for the Hadamard code arises by using the generator matrix whose columns consist of all strings \n\n\n\ny\n\n\n{\\displaystyle y}\n\n of length \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, that is,\nwhere \n\n\n\n\ny\n\ni\n\n\n∈\n{\n0\n,\n1\n\n}\n\nk\n\n\n\n\n{\\displaystyle y_{i}\\in \\{0,1\\}^{k}}\n\n is the \n\n\n\ni\n\n\n{\\displaystyle i}\n\n-th binary vector in lexicographical order. For example, the generator matrix for the Hadamard code of dimension \n\n\n\nk\n=\n3\n\n\n{\\displaystyle k=3}\n\n is:\nThe matrix \n\n\n\nG\n\n\n{\\displaystyle G}\n\n is a \n\n\n\n(\nk\n×\n\n2\n\nk\n\n\n)\n\n\n{\\displaystyle (k\\times 2^{k})}\n\n-matrix and gives rise to the linear operator \n\n\n\n\nHad\n\n:\n{\n0\n,\n1\n\n}\n\nk\n\n\n→\n{\n0\n,\n1\n\n}\n\n\n2\n\nk\n\n\n\n\n\n\n{\\displaystyle {\\text{Had}}:\\{0,1\\}^{k}\\to \\{0,1\\}^{2^{k}}}\n\n.\nThe generator matrix of the punctured Hadamard code is obtained by restricting the matrix \n\n\n\nG\n\n\n{\\displaystyle G}\n\n to the columns whose first entry is one. For example, the generator matrix for the punctured Hadamard code of dimension \n\n\n\nk\n=\n3\n\n\n{\\displaystyle k=3}\n\n is:\nThen \n\n\n\n\npHad\n\n:\n{\n0\n,\n1\n\n}\n\nk\n\n\n→\n{\n0\n,\n1\n\n}\n\n\n2\n\nk\n−\n1\n\n\n\n\n\n\n{\\displaystyle {\\text{pHad}}:\\{0,1\\}^{k}\\to \\{0,1\\}^{2^{k-1}}}\n\n is a linear mapping with \n\n\n\n\npHad\n\n(\nx\n)\n=\nx\n⋅\n\nG\n′\n\n\n\n{\\displaystyle {\\text{pHad}}(x)=x\\cdot G'}\n\n.\nFor general \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, the generator matrix of the punctured Hadamard code is a parity-check matrix for the extended Hamming code of length \n\n\n\n\n2\n\nk\n−\n1\n\n\n\n\n{\\displaystyle 2^{k-1}}\n\n and dimension \n\n\n\n\n2\n\nk\n−\n1\n\n\n−\nk\n\n\n{\\displaystyle 2^{k-1}-k}\n\n, which makes the punctured Hadamard code the dual code of the extended Hamming code. Hence an alternative way to define the Hadamard code is in terms of its parity-check matrix: the parity-check matrix of the Hadamard code is equal to the generator matrix of the Hamming code.\nGeneralized Hadamard codes are obtained from an n-by-n Hadamard matrix H. In particular, the 2n codewords of the code are the rows of H and the rows of −H. To obtain a code over the alphabet {0,1}, the mapping −1 ↦ 1, 1 ↦ 0, or, equivalently, x ↦ (1 − x)/2, is applied to the matrix elements. That the minimum distance of the code is n/2 follows from the defining property of Hadamard matrices, namely that their rows are mutually orthogonal. This implies that two distinct rows of a Hadamard matrix differ in exactly n/2 positions, and, since negation of a row does not affect orthogonality, that any row of H differs from any row of −H in n/2 positions as well, except when the rows correspond, in which case they differ in n positions.\nTo get the punctured Hadamard code above with \n\n\n\nn\n=\n\n2\n\nk\n−\n1\n\n\n\n\n{\\displaystyle n=2^{k-1}}\n\n, the chosen Hadamard matrix H has to be of Sylvester type, which gives rise to a message length of \n\n\n\n\nlog\n\n2\n\n\n⁡\n(\n2\nn\n)\n=\nk\n\n\n{\\displaystyle \\log _{2}(2n)=k}\n\n.\nThe distance of a code is the minimum Hamming distance between any two distinct codewords, i.e., the minimum number of positions at which two distinct codewords differ. Since the Walsh–Hadamard code is a linear code, the distance is equal to the minimum Hamming weight among all of its non-zero codewords. All non-zero codewords of the Walsh–Hadamard code have a Hamming weight of exactly \n\n\n\n\n2\n\nk\n−\n1\n\n\n\n\n{\\displaystyle 2^{k-1}}\n\n by the following argument.\nLet \n\n\n\nx\n∈\n{\n0\n,\n1\n\n}\n\nk\n\n\n\n\n{\\displaystyle x\\in \\{0,1\\}^{k}}\n\n be a non-zero message. Then the following value is exactly equal to the fraction of positions in the codeword that are equal to one:\nThe fact that the latter value is exactly \n\n\n\n1\n\n/\n\n2\n\n\n{\\displaystyle 1/2}\n\n is called the random subsum principle. To see that it is true, assume without loss of generality that \n\n\n\n\nx\n\n1\n\n\n=\n1\n\n\n{\\displaystyle x_{1}=1}\n\n. Then, when conditioned on the values of \n\n\n\n\ny\n\n2\n\n\n,\n…\n,\n\ny\n\nk\n\n\n\n\n{\\displaystyle y_{2},\\dots ,y_{k}}\n\n, the event is equivalent to \n\n\n\n\ny\n\n1\n\n\n⋅\n\nx\n\n1\n\n\n=\nb\n\n\n{\\displaystyle y_{1}\\cdot x_{1}=b}\n\n for some \n\n\n\nb\n∈\n{\n0\n,\n1\n}\n\n\n{\\displaystyle b\\in \\{0,1\\}}\n\n depending on \n\n\n\n\nx\n\n2\n\n\n,\n…\n,\n\nx\n\nk\n\n\n\n\n{\\displaystyle x_{2},\\dots ,x_{k}}\n\n and \n\n\n\n\ny\n\n2\n\n\n,\n…\n,\n\ny\n\nk\n\n\n\n\n{\\displaystyle y_{2},\\dots ,y_{k}}\n\n. The probability that \n\n\n\n\ny\n\n1\n\n\n=\nb\n\n\n{\\displaystyle y_{1}=b}\n\n happens is exactly \n\n\n\n1\n\n/\n\n2\n\n\n{\\displaystyle 1/2}\n\n. Thus, in fact, all non-zero codewords of the Hadamard code have relative Hamming weight \n\n\n\n1\n\n/\n\n2\n\n\n{\\displaystyle 1/2}\n\n, and thus, its relative distance is \n\n\n\n1\n\n/\n\n2\n\n\n{\\displaystyle 1/2}\n\n.\nThe relative distance of the punctured Hadamard code is \n\n\n\n1\n\n/\n\n2\n\n\n{\\displaystyle 1/2}\n\n as well, but it no longer has the property that every non-zero codeword has weight exactly \n\n\n\n1\n\n/\n\n2\n\n\n{\\displaystyle 1/2}\n\n since the all \n\n\n\n1\n\n\n{\\displaystyle 1}\n\ns vector \n\n\n\n\n1\n\n\n2\n\nk\n−\n1\n\n\n\n\n\n\n{\\displaystyle 1^{2^{k-1}}}\n\n is a codeword of the punctured Hadamard code. This is because the vector \n\n\n\nx\n=\n\n10\n\nk\n−\n1\n\n\n\n\n{\\displaystyle x=10^{k-1}}\n\n encodes to \n\n\n\n\npHad\n\n(\n\n10\n\nk\n−\n1\n\n\n)\n=\n\n1\n\n\n2\n\nk\n−\n1\n\n\n\n\n\n\n{\\displaystyle {\\text{pHad}}(10^{k-1})=1^{2^{k-1}}}\n\n. Furthermore, whenever \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is non-zero and not the vector \n\n\n\n\n10\n\nk\n−\n1\n\n\n\n\n{\\displaystyle 10^{k-1}}\n\n, the random subsum principle applies again, and the relative weight of \n\n\n\n\nHad\n\n(\nx\n)\n\n\n{\\displaystyle {\\text{Had}}(x)}\n\n is exactly \n\n\n\n1\n\n/\n\n2\n\n\n{\\displaystyle 1/2}\n\n.\nA locally decodable code is a code that allows a single bit of the original message to be recovered with high probability by only looking at a small portion of the received word.\nA code is \n\n\n\nq\n\n\n{\\displaystyle q}\n\n-query locally decodable if a message bit, \n\n\n\n\nx\n\ni\n\n\n\n\n{\\displaystyle x_{i}}\n\n, can be recovered by checking \n\n\n\nq\n\n\n{\\displaystyle q}\n\n bits of the received word. More formally, a code, \n\n\n\nC\n:\n{\n0\n,\n1\n\n}\n\nk\n\n\n→\n{\n0\n,\n1\n\n}\n\nn\n\n\n\n\n{\\displaystyle C:\\{0,1\\}^{k}\\rightarrow \\{0,1\\}^{n}}\n\n, is \n\n\n\n(\nq\n,\nδ\n≥\n0\n,\nϵ\n≥\n0\n)\n\n\n{\\displaystyle (q,\\delta \\geq 0,\\epsilon \\geq 0)}\n\n-locally decodable, if there exists a probabilistic decoder, \n\n\n\nD\n:\n{\n0\n,\n1\n\n}\n\nn\n\n\n→\n{\n0\n,\n1\n\n}\n\nk\n\n\n\n\n{\\displaystyle D:\\{0,1\\}^{n}\\rightarrow \\{0,1\\}^{k}}\n\n, such that (Note: \n\n\n\nΔ\n(\nx\n,\ny\n)\n\n\n{\\displaystyle \\Delta (x,y)}\n\n represents the Hamming distance between vectors \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\ny\n\n\n{\\displaystyle y}\n\n):\n\n\n\n\n∀\nx\n∈\n{\n0\n,\n1\n\n}\n\nk\n\n\n,\n∀\ny\n∈\n{\n0\n,\n1\n\n}\n\nn\n\n\n\n\n{\\displaystyle \\forall x\\in \\{0,1\\}^{k},\\forall y\\in \\{0,1\\}^{n}}\n\n, \n\n\n\nΔ\n(\ny\n,\nC\n(\nx\n)\n)\n≤\nδ\nn\n\n\n{\\displaystyle \\Delta (y,C(x))\\leq \\delta n}\n\n implies that \n\n\n\nP\nr\n[\nD\n(\ny\n\n)\n\ni\n\n\n=\n\nx\n\ni\n\n\n]\n≥\n\n\n1\n2\n\n\n+\nϵ\n,\n∀\ni\n∈\n[\nk\n]\n\n\n{\\displaystyle Pr[D(y)_{i}=x_{i}]\\geq {\\frac {1}{2}}+\\epsilon ,\\forall i\\in [k]}\n\n\nTheorem 1: The Walsh–Hadamard code is \n\n\n\n(\n2\n,\nδ\n,\n\n\n1\n2\n\n\n−\n2\nδ\n)\n\n\n{\\displaystyle (2,\\delta ,{\\frac {1}{2}}-2\\delta )}\n\n-locally decodable for \n\n\n\n0\n≤\nδ\n≤\n\n\n1\n4\n\n\n\n\n{\\displaystyle 0\\leq \\delta \\leq {\\frac {1}{4}}}\n\n.\nLemma 1: For all codewords, \n\n\n\nc\n\n\n{\\displaystyle c}\n\n in a Walsh–Hadamard code, \n\n\n\nC\n\n\n{\\displaystyle C}\n\n, \n\n\n\n\nc\n\ni\n\n\n+\n\nc\n\nj\n\n\n=\n\nc\n\ni\n+\nj\n\n\n\n\n{\\displaystyle c_{i}+c_{j}=c_{i+j}}\n\n, where \n\n\n\n\nc\n\ni\n\n\n,\n\nc\n\nj\n\n\n\n\n{\\displaystyle c_{i},c_{j}}\n\n represent the bits in \n\n\n\nc\n\n\n{\\displaystyle c}\n\n in positions \n\n\n\ni\n\n\n{\\displaystyle i}\n\n and \n\n\n\nj\n\n\n{\\displaystyle j}\n\n respectively, and \n\n\n\n\nc\n\ni\n+\nj\n\n\n\n\n{\\displaystyle c_{i+j}}\n\n represents the bit at position \n\n\n\n(\ni\n+\nj\n)\n\n\n{\\displaystyle (i+j)}\n\n.\nLet \n\n\n\nC\n(\nx\n)\n=\nc\n=\n(\n\nc\n\n0\n\n\n,\n…\n,\n\nc\n\n\n2\n\nn\n\n\n−\n1\n\n\n)\n\n\n{\\displaystyle C(x)=c=(c_{0},\\dots ,c_{2^{n}-1})}\n\n be the codeword in \n\n\n\nC\n\n\n{\\displaystyle C}\n\n corresponding to message \n\n\n\nx\n\n\n{\\displaystyle x}\n\n.\nLet \n\n\n\nG\n=\n\n\n(\n\n\n\n↑\n\n\n↑\n\n\n\n↑\n\n\n\n\n\ng\n\n0\n\n\n\n\n\ng\n\n1\n\n\n\n\n…\n\n\n\ng\n\n\n2\n\nn\n\n\n−\n1\n\n\n\n\n\n\n↓\n\n\n↓\n\n\n\n↓\n\n\n\n)\n\n\n\n\n{\\displaystyle G={\\begin{pmatrix}\\uparrow &\\uparrow &&\\uparrow \\\\g_{0}&g_{1}&\\dots &g_{2^{n}-1}\\\\\\downarrow &\\downarrow &&\\downarrow \\end{pmatrix}}}\n\n be the generator matrix of \n\n\n\nC\n\n\n{\\displaystyle C}\n\n.\nBy definition, \n\n\n\n\nc\n\ni\n\n\n=\nx\n⋅\n\ng\n\ni\n\n\n\n\n{\\displaystyle c_{i}=x\\cdot g_{i}}\n\n. From this, \n\n\n\n\nc\n\ni\n\n\n+\n\nc\n\nj\n\n\n=\nx\n⋅\n\ng\n\ni\n\n\n+\nx\n⋅\n\ng\n\nj\n\n\n=\nx\n⋅\n(\n\ng\n\ni\n\n\n+\n\ng\n\nj\n\n\n)\n\n\n{\\displaystyle c_{i}+c_{j}=x\\cdot g_{i}+x\\cdot g_{j}=x\\cdot (g_{i}+g_{j})}\n\n. By the construction of \n\n\n\nG\n\n\n{\\displaystyle G}\n\n, \n\n\n\n\ng\n\ni\n\n\n+\n\ng\n\nj\n\n\n=\n\ng\n\ni\n+\nj\n\n\n\n\n{\\displaystyle g_{i}+g_{j}=g_{i+j}}\n\n. Therefore, by substitution, \n\n\n\n\nc\n\ni\n\n\n+\n\nc\n\nj\n\n\n=\nx\n⋅\n\ng\n\ni\n+\nj\n\n\n=\n\nc\n\ni\n+\nj\n\n\n\n\n{\\displaystyle c_{i}+c_{j}=x\\cdot g_{i+j}=c_{i+j}}\n\n.\nTo prove theorem 1 we will construct a decoding algorithm and prove its correctness.\nInput: Received word \n\n\n\ny\n=\n(\n\ny\n\n0\n\n\n,\n…\n,\n\ny\n\n\n2\n\nn\n\n\n−\n1\n\n\n)\n\n\n{\\displaystyle y=(y_{0},\\dots ,y_{2^{n}-1})}\n\n\nFor each \n\n\n\ni\n∈\n{\n1\n,\n…\n,\nn\n}\n\n\n{\\displaystyle i\\in \\{1,\\dots ,n\\}}\n\n:\nOutput: Message \n\n\n\nx\n=\n(\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nn\n\n\n)\n\n\n{\\displaystyle x=(x_{1},\\dots ,x_{n})}\n\n\nFor any message, \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, and received word \n\n\n\ny\n\n\n{\\displaystyle y}\n\n such that \n\n\n\ny\n\n\n{\\displaystyle y}\n\n differs from \n\n\n\nc\n=\nC\n(\nx\n)\n\n\n{\\displaystyle c=C(x)}\n\n on at most \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n fraction of bits, \n\n\n\n\nx\n\ni\n\n\n\n\n{\\displaystyle x_{i}}\n\n can be decoded with probability at least \n\n\n\n\n\n1\n2\n\n\n+\n(\n1\n−\n2\nδ\n)\n\n\n{\\displaystyle {\\frac {1}{2}}+(1-2\\delta )}\n\n.\nBy lemma 1, \n\n\n\n\nc\n\nj\n\n\n+\n\nc\n\nk\n\n\n=\n\nc\n\nj\n+\nk\n\n\n=\nx\n⋅\n\ng\n\nj\n+\nk\n\n\n=\nx\n⋅\n\ne\n\ni\n\n\n=\n\nx\n\ni\n\n\n\n\n{\\displaystyle c_{j}+c_{k}=c_{j+k}=x\\cdot g_{j+k}=x\\cdot e_{i}=x_{i}}\n\n. Since \n\n\n\nj\n\n\n{\\displaystyle j}\n\n and \n\n\n\nk\n\n\n{\\displaystyle k}\n\n are picked uniformly, the probability that \n\n\n\n\ny\n\nj\n\n\n≠\n\nc\n\nj\n\n\n\n\n{\\displaystyle y_{j}\\not =c_{j}}\n\n is at most \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n. Similarly, the probability that \n\n\n\n\ny\n\nk\n\n\n≠\n\nc\n\nk\n\n\n\n\n{\\displaystyle y_{k}\\not =c_{k}}\n\n is at most \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n. By the union bound, the probability that either \n\n\n\n\ny\n\nj\n\n\n\n\n{\\displaystyle y_{j}}\n\n or \n\n\n\n\ny\n\nk\n\n\n\n\n{\\displaystyle y_{k}}\n\n do not match the corresponding bits in \n\n\n\nc\n\n\n{\\displaystyle c}\n\n is at most \n\n\n\n2\nδ\n\n\n{\\displaystyle 2\\delta }\n\n. If both \n\n\n\n\ny\n\nj\n\n\n\n\n{\\displaystyle y_{j}}\n\n and \n\n\n\n\ny\n\nk\n\n\n\n\n{\\displaystyle y_{k}}\n\n correspond to \n\n\n\nc\n\n\n{\\displaystyle c}\n\n, then lemma 1 will apply, and therefore, the proper value of \n\n\n\n\nx\n\ni\n\n\n\n\n{\\displaystyle x_{i}}\n\n will be computed. Therefore, the probability \n\n\n\n\nx\n\ni\n\n\n\n\n{\\displaystyle x_{i}}\n\n is decoded properly is at least \n\n\n\n1\n−\n2\nδ\n\n\n{\\displaystyle 1-2\\delta }\n\n. Therefore, \n\n\n\nϵ\n=\n\n\n1\n2\n\n\n−\n2\nδ\n\n\n{\\displaystyle \\epsilon ={\\frac {1}{2}}-2\\delta }\n\n and for \n\n\n\nϵ\n\n\n{\\displaystyle \\epsilon }\n\n to be positive, \n\n\n\n0\n≤\nδ\n≤\n\n\n1\n4\n\n\n\n\n{\\displaystyle 0\\leq \\delta \\leq {\\frac {1}{4}}}\n\n.\nTherefore, the Walsh–Hadamard code is \n\n\n\n(\n2\n,\nδ\n,\n\n\n1\n2\n\n\n−\n2\nδ\n)\n\n\n{\\displaystyle (2,\\delta ,{\\frac {1}{2}}-2\\delta )}\n\n locally decodable for \n\n\n\n0\n≤\nδ\n≤\n\n\n1\n4\n\n\n\n\n{\\displaystyle 0\\leq \\delta \\leq {\\frac {1}{4}}}\n\n\nFor k ≤ 7 the linear Hadamard codes have been proven optimal in the sense of minimum distance.[7]", 
    "dbpedia_url": "http://dbpedia.org/resource/Hadamard_code", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Hadamard_code\n"
}