{
    "about": "In numerical analysis, Halley’s method is a root-finding algorithm used for functions of one real variable with a continuous second derivative, i.e., C2 functions. It is named after its inventor Edmond Halley.", 
    "name": "Halley'S Method", 
    "classification": "Root-Finding Algorithms", 
    "full_text": "In numerical analysis, Halley’s method is a root-finding algorithm used for functions of one real variable with a continuous second derivative, i.e., C2 functions. It is named after its inventor Edmond Halley.\nThe algorithm is second in the class of Householder's methods, right after Newton's method. Like the latter, it produces iteratively a sequence of approximations to the root; their rate of convergence to the root is cubic. Multidimensional versions of this method exist.\nHalley's method can be viewed as exactly finding the roots of a linear-over-linear Padé approximation to the function, in contrast to Newton's method/Secant method (approximates/interpolates the function linearly) or Cauchy's method/Muller's method (approximates/interpolates the function quadratically).[1]\n\n\nHalley’s method is a numerical algorithm for solving the nonlinear equation f(x) = 0. In this case, the function f has to be a function of one real variable. The method consists of a sequence of iterations:\nbeginning with an initial guess x0.\nIf f is a three times continuously differentiable function and a is a zero of f but not of its derivative, then, in a neighborhood of a, the iterates xn satisfy:\nThis means that the iterates converge to the zero if the initial guess is sufficiently close, and that the convergence is cubic.\nThe following alternative formulation shows the similarity between Halley’s method and Newton’s method. The expression \n\n\n\nf\n(\n\nx\n\nn\n\n\n)\n\n/\n\n\nf\n′\n\n(\n\nx\n\nn\n\n\n)\n\n\n{\\displaystyle f(x_{n})/f'(x_{n})}\n\n is computed only once, and it is particularly useful when \n\n\n\n\nf\n″\n\n(\n\nx\n\nn\n\n\n)\n\n/\n\n\nf\n′\n\n(\n\nx\n\nn\n\n\n)\n\n\n{\\displaystyle f''(x_{n})/f'(x_{n})}\n\n can be simplified.\nA further alternative is as below, in which case the technique is sometimes referred to as Bailey’s method.[2]\nUsing any variation, when the second derivative is very close to zero, the iteration is almost the same as under Newton’s method.\nConsider the function\nAny root of f which is not a root of its derivative is a root of g; and any root r of g must be a root of f provided the derivative of f at r is not infinite. Applying Newton's method to g gives\nwith\nand the result follows. Notice that if f′(c) = 0, then one cannot apply this at c because g(c) would be undefined.\nSuppose a is a root of f but not of its derivative. And suppose that the third derivative of f exists and is continuous in a neighborhood of a and xn is in that neighborhood. Then Taylor's theorem implies:\nand also\nwhere ξ and η are numbers lying between a and xn. Multiply the first equation by \n\n\n\n2\n\nf\n′\n\n(\n\nx\n\nn\n\n\n)\n\n\n{\\displaystyle 2f'(x_{n})}\n\n and subtract from it the second equation times \n\n\n\n\nf\n″\n\n(\n\nx\n\nn\n\n\n)\n(\na\n−\n\nx\n\nn\n\n\n)\n\n\n{\\displaystyle f''(x_{n})(a-x_{n})}\n\n to give:\nCanceling \n\n\n\n\nf\n′\n\n(\n\nx\n\nn\n\n\n)\n\nf\n″\n\n(\n\nx\n\nn\n\n\n)\n(\na\n−\n\nx\n\nn\n\n\n\n)\n\n2\n\n\n\n\n{\\displaystyle f'(x_{n})f''(x_{n})(a-x_{n})^{2}}\n\n and re-organizing terms yields:\nPut the second term on the left side and divide through by\nto get:\nThus:\nThe limit of the coefficient on the right side as xn → a is:\nIf we take K to be a little larger than the absolute value of this, we can take absolute values of both sides of the formula and replace the absolute value of coefficient by its upper bound near a to get:\nwhich is what was to be proved.\nTo summarize,\nPetko D. Proinov, Stoil I. Ivanov, On the convergence of Halley’s method for simultaneous computation of polynomial zeros, J. Numer. Math. 2015; 23 (4):379–394", 
    "dbpedia_url": "http://dbpedia.org/resource/Halley's_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Halley's_method\n"
}