{
    "about": "A hash chain is the successive application of a cryptographic hash function to a piece of data. In computer security, a hash chain is a method to produce many one-time keys from a single key or password. For non-repudiation a hash function can be applied successively to additional pieces of data in order to record the chronology of data's existence.", 
    "name": "Hash Chain", 
    "classification": "Cryptographic Algorithms", 
    "full_text": "A hash chain is the successive application of a cryptographic hash function to a piece of data. In computer security, a hash chain is a method to produce many one-time keys from a single key or password. For non-repudiation a hash function can be applied successively to additional pieces of data in order to record the chronology of data's existence.\n\n\nA hash chain is a successive application of a cryptographic hash function \n\n\n\nh\n(\nx\n)\n\n\n{\\displaystyle h(x)}\n\n to a string \n\n\n\nx\n\n\n{\\displaystyle x}\n\n.\nFor example,\n\n\n\n\nh\n(\nh\n(\nh\n(\nh\n(\nx\n)\n)\n)\n)\n\n\n{\\displaystyle h(h(h(h(x))))}\n\n gives a hash chain of length 4, often denoted \n\n\n\n\nh\n\n4\n\n\n(\nx\n)\n\n\n{\\displaystyle h^{4}(x)}\n\n\nLamport[1] suggested the use of hash chains as a password protection scheme in an insecure environment. A server which needs to provide authentication may store a hash chain rather than a plain text password and prevent theft of the password in transmission or theft from the server. For example, a server begins by storing \n\n\n\n\nh\n\n1000\n\n\n(\np\na\ns\ns\nw\no\nr\nd\n)\n\n\n{\\displaystyle h^{1000}(password)}\n\n which is provided by the user. When the user wishes to authenticate, he supplies \n\n\n\n\nh\n\n999\n\n\n(\np\na\ns\ns\nw\no\nr\nd\n)\n\n\n{\\displaystyle h^{999}(password)}\n\n to the server. The server computes \n\n\n\nh\n(\n\nh\n\n999\n\n\n(\np\na\ns\ns\nw\no\nr\nd\n)\n)\n=\n\nh\n\n1000\n\n\n(\np\na\ns\ns\nw\no\nr\nd\n)\n\n\n{\\displaystyle h(h^{999}(password))=h^{1000}(password)}\n\n and verifies this matches the hash chain it has stored. It then stores \n\n\n\n\nh\n\n999\n\n\n(\np\na\ns\ns\nw\no\nr\nd\n)\n\n\n{\\displaystyle h^{999}(password)}\n\n for the next time the user wishes to authenticate.\nAn eavesdropper seeing \n\n\n\n\nh\n\n999\n\n\n(\np\na\ns\ns\nw\no\nr\nd\n)\n\n\n{\\displaystyle h^{999}(password)}\n\n communicated to the server will be unable to re-transmit the same hash chain to the server for authentication since the server now expects \n\n\n\n\nh\n\n998\n\n\n(\np\na\ns\ns\nw\no\nr\nd\n)\n\n\n{\\displaystyle h^{998}(password)}\n\n. Due to the one-way property of cryptographically secure hash functions, it is infeasible for the eavesdropper to reverse the hash function and obtain an earlier piece of the hash chain. In this example, the user could authenticate 1000 times before the hash chain is exhausted. Each time the hash value is different, and thus cannot be duplicated by an attacker.\nBinary hash chains are commonly used in association with a hash tree. A Binary hash chain takes two hash values as inputs, concatenates them and applies a hash function to the result, thereby producing a third hash value.\n\nThe above diagram shows a hash tree consisting of eight leaf nodes and the hash chain for the third leaf node. In addition to the hash values themselves the order of concatenation (right or left 1,0) or “order bits” are necessary to complete the hash chain.\nOne dimensional hash chains serve as a basis for blockchain. Blockchains are constructed so that blocks of transactional hash chains are placed into a global time server hash chain.[2] Usually blocks transactional hash chains are linked by Public Key Cryptography. But this is not always necessary. For example Hash chains use only a particular link by hashes.\nHasq hash chain is a linked list of records.[3] Hash values serve as password digested keys and the link method. Hasq hash chains are part of a distributed database that allows to control anonymously digital tokens with. The picture below represents a particular linkage between the records in the database.\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Hash_chain", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Hash_chain\n"
}