{
    "about": "Heterodyning is a radio signal processing technique invented in 1901 by Canadian inventor-engineer Reginald Fessenden that creates new frequencies by combining or mixing two frequencies.[1][2][3] Heterodyning is used to shift one frequency range into another, new one, and is also involved in the processes of modulation and demodulation.[2][4] The two frequencies are combined in a nonlinear signal-processing device such as a vacuum tube, transistor, or diode, usually called a mixer.[2] In the most common application, two signals at frequencies f1 and f2 are mixed, creating two new signals, one at the sum f1 + f2 of the two frequencies, and the other at the difference f1 − f2.[3] These new frequencies are called heterodynes. Typically only one of the new frequencies is desired, and the other signal is filtered out of the output of the mixer. Heterodynes are related to the phenomenon of \"beats\" in acoustics.", 
    "name": "Heterodyne", 
    "classification": "Signal Processing", 
    "full_text": "Heterodyning is a radio signal processing technique invented in 1901 by Canadian inventor-engineer Reginald Fessenden that creates new frequencies by combining or mixing two frequencies.[1][2][3] Heterodyning is used to shift one frequency range into another, new one, and is also involved in the processes of modulation and demodulation.[2][4] The two frequencies are combined in a nonlinear signal-processing device such as a vacuum tube, transistor, or diode, usually called a mixer.[2] In the most common application, two signals at frequencies f1 and f2 are mixed, creating two new signals, one at the sum f1 + f2 of the two frequencies, and the other at the difference f1 − f2.[3] These new frequencies are called heterodynes. Typically only one of the new frequencies is desired, and the other signal is filtered out of the output of the mixer. Heterodynes are related to the phenomenon of \"beats\" in acoustics.\nA major application of the heterodyne process is in the superheterodyne radio receiver circuit, which is used in virtually all modern radio receivers.\n\n\nIn 1901, Reginald Fessenden demonstrated a direct-conversion heterodyne receiver or beat receiver as a method of making continuous wave radiotelegraphy signals audible. Fessenden's receiver did not see much application because of its local oscillator's stability problem. While complex isochronous electromechanical oscillators existed, a stable yet inexpensive local oscillator was not available until Lee de Forest invented the triode vacuum tube oscillator.[5] In a 1905 patent, Fessenden stated that the frequency stability of his local oscillator was one part per thousand.[6]\nIn radio telegraphy, the characters of text messages are translated into the short duration dots and long duration dashes of Morse code that are broadcast as radio signals. Radio telegraphy was much like ordinary telegraphy. One of the problems was building high power transmitters with the technology of the day. Early transmitters were spark gap transmitters: a mechanical device would make sparks at a fixed but audible rate; the sparks would put energy into a resonant circuit that would then ring at the desired transmission frequency (which might be 100 kHz); this ringing would quickly decay, so the output of the transmitter would be a succession of damped waves. When these damped waves were received by a simple detector, the operator would hear an audible buzzing sound that he could transcribe back into alpha-numeric characters.\nWith the development of the arc converter radio transmitter in 1904, continuous wave (CW) modulation began to be used for radiotelegraphy. CW Morse code signals are not amplitude modulated, but rather consist of bursts of sinusoidal carrier frequency. When CW signals are received by an AM receiver, the operator does not hear a sound. The direct-conversion (heterodyne) detector was invented to make continuous wave radio-frequency signals audible.[7]\nThe \"heterodyne\" or \"beat\" receiver has a local beat frequency oscillator (BFO) that produces a radio signal adjusted to be close in frequency to the incoming signal being received. When the two signals are mixed, a \"beat\" frequency equal to the difference between the two frequencies is created. By adjusting the local oscillator frequency correctly, the beat frequency is in the audio range, and can be heard as a tone in the receiver's earphones whenever the transmitter signal is present. Thus the Morse code \"dots\" and \"dashes\" are audible as beeping sounds. This technique is still used in radio telegraphy, the local oscillator now being called the beat frequency oscillator or BFO. Fessenden coined the word heterodyne from the Greek roots hetero- \"different\", and dyn- \"power\" (cf. δύναμις or dunamis).[8]\nAn important and widely used application of the heterodyne technique is in the superheterodyne receiver (superhet), which was invented by U.S. engineer Edwin Howard Armstrong in 1918. In the typical superhet, the incoming radio frequency signal from the antenna is mixed (heterodyned) with a signal from a local oscillator (LO) to produce a lower fixed frequency signal called the intermediate frequency (IF) signal. The IF signal is amplified and filtered and then applied to a detector that extracts the audio signal; the audio is ultimately sent to the receiver's loudspeaker.\nThe superheterodyne receiver has several advantages over previous receiver designs. One advantage is easier tuning; only the RF and LO are tuned by the operator; the fixed-frequency IF is tuned (\"aligned\") at the factory and is not adjusted. In older designs such as the tuned radio frequency receiver (TRF), all of the receiver stages had to be simultaneously tuned. In addition, since the IF filters are fixed-tuned, the receiver's selectivity is the same across the receiver's entire frequency band. Another advantage is that the IF signal can be at a much lower frequency than the incoming radio signal, and that allows each stage of the IF amplifier to provide more gain. To first order, an amplifying device has a fixed gain-bandwidth product. If the device has a gain-bandwidth product of 60 MHz, then it can provide a voltage gain of 3 at an RF of 20 MHz or a voltage gain of 30 at an IF of 2 MHz. At a lower IF, it would take fewer gain devices to achieve the same gain. The regenerative radio receiver obtained more gain out of one gain device by using positive feedback, but it required careful adjustment by the operator; that adjustment also changed the selectivity of the regenerative receiver. The superheterodyne provides a large, stable, gain and constant selectivity without troublesome adjustment.\nThe superior superheterodyne system replaced the earlier TRF and regenerative receiver designs, and since the 1930s most commercial radio receivers have been superheterodynes.\nHeterodyning, also called frequency conversion, is used very widely in communications engineering to generate new frequencies and move information from one frequency channel to another. Besides its use in the superheterodyne circuit found in almost all radio and television receivers, it is used in radio transmitters, modems, satellite communications and set-top boxes, radar, radio telescopes, telemetry systems, cell phones, cable television converter boxes and headends, microwave relays, metal detectors, atomic clocks, and military electronic countermeasures (jamming) systems.\nIn large scale telecommunication networks such as telephone network trunks, microwave relay networks, cable television systems, and communication satellite links, large bandwidth capacity links are shared by many individual communication channels by using heterodyning to move the frequency of the individual signals up to different frequencies, which share the channel. This is called frequency division multiplexing (FDM).\nFor example, a coaxial cable used by a cable television system can carry 500 television channels at the same time because each one is given a different frequency, so they don't interfere with one another. At the cable source or headend, electronic upconverters convert each incoming television channel to a new, higher frequency. They do this by mixing the television signal frequency, fCH with a local oscillator at a much higher frequency fLO, creating a heterodyne at the sum fCH + fLO, which is added to the cable. At the consumer's home, the cable set top box has a downconverter that mixes the incoming signal at frequency fCH + fLO with the same local oscillator frequency fLO creating the difference heterodyne, converting the television channel back to its original frequency: (fCH + fLO) − fLO = fCH. Each channel is moved to a different higher frequency. The original lower basic frequency of the signal is called the baseband, while the higher channel it is moved to is called the passband.\nMany analog videotape systems rely on a downconverted color subcarrier to record color information in their limited bandwidth. These systems are referred to as \"heterodyne systems\" or \"color-under systems\". For instance, for NTSC video systems, the VHS (and S-VHS) recording system converts the color subcarrier from the NTSC standard 3.58 MHz to ~629 kHz.[9] PAL VHS color subcarrier is similarly downconverted (but from 4.43 MHz). The now-obsolete 3/4\" U-matic systems use a heterodyned ~688 kHz subcarrier for NTSC recordings (as does Sony's Betamax, which is at its basis a 1/2″ consumer version of U-matic), while PAL U-matic decks came in two mutually incompatible varieties, with different subcarrier frequencies, known as Hi-Band and Low-Band. Other videotape formats with heterodyne color systems include Video-8 and Hi8.[10]\nThe heterodyne system in these cases is used to convert quadrature phase-encoded and amplitude modulated sine waves from the broadcast frequencies to frequencies recordable in less than 1 MHz bandwidth. On playback, the recorded color information is heterodyned back to the standard subcarrier frequencies for display on televisions and for interchange with other standard video equipment.\nSome U-matic (3/4″) decks feature 7-pin mini-DIN connectors to allow dubbing of tapes without a heterodyne up-conversion and down-conversion, as do some industrial VHS, S-VHS, and Hi8 recorders.\nThe theremin, an electronic musical instrument, traditionally uses the heterodyne principle to produce a variable audio frequency in response to the movement of the musician's hands in the vicinity of one or more antennas, which act as capacitor plates. The output of a fixed radio frequency oscillator is mixed with that of an oscillator whose frequency is affected by the variable capacitance between the antenna and the thereminist as that person moves her or his hand near the pitch control antenna. The difference between the two oscillator frequencies produces a tone in the audio range.\nThe ring modulator is a type of heterodyne incorporated into some synthesizers or used as a stand-alone audio effect.\nOptical heterodyne detection (an area of active research) is an extension of the heterodyning technique to higher (visible) frequencies. This technique could greatly improve optical modulators, increasing the density of information carried by optical fibers. It is also being applied in the creation of more accurate atomic clocks based on directly measuring the frequency of a laser beam. See NIST subtopic 9.07.9-4.R for a description of research on one system to do this.[11][12]\nSince optical frequencies are far beyond the manipulation capacity of any feasible electronic circuit, all photon detectors are inherently energy detectors not oscillating electric field detectors. However, since energy detection is inherently \"square-law\" detection, it intrinsically mixes any optical frequencies present on the detector. Thus, sensitive detection of specific optical frequencies necessitates optical heterodyne detection, in which two different (close-by) wavelengths of light illuminate the detector so that the oscillating electrical output corresponds to the difference between their frequencies. This allows extremely narrow band detection (much narrower than any possible color filter can achieve) as well as precision measurements of phase and frequency of a light signal relative to a reference light source, as in a laser Doppler vibrometer.\nThis phase sensitive detection has been applied for Doppler measurements of wind speed, and imaging through dense media. The high sensitivity against background light is especially useful for lidar.\nIn optical Kerr effect (OKE) spectroscopy, optical heterodyning of the OKE signal and a small part of the probe signal produces a mixed signal consisting of probe, heterodyne OKE-probe and homodyne OKE signal. The probe and homodyne OKE signals can be filtered out, leaving the heterodyne signal for detection.\nHeterodyning is based on the trigonometric identity:\nThe product on the left hand side represents the multiplication (\"mixing\") of a sine wave with another sine wave. The right hand side shows that the resulting signal is the difference of two sinusoidal terms, one at the sum of the two original frequencies, and one at the difference, which can be considered to be separate signals.\nUsing this trigonometric identity, the result of multiplying two sine wave signals, \n\n\n\nsin\n⁡\n(\n2\nπ\n\nf\n\n1\n\n\nt\n)\n\n\n\n{\\displaystyle \\sin(2\\pi f_{1}t)\\,}\n\n and \n\n\n\nsin\n⁡\n(\n2\nπ\n\nf\n\n2\n\n\nt\n)\n\n\n\n{\\displaystyle \\sin(2\\pi f_{2}t)\\,}\n\n can be calculated:\nThe result is the sum of two sinusoidal signals, one at the sum f1 + f2 and one at the difference f1 − f2 of the original frequencies\nThe two signals combine in a device called a mixer. As seen in the previous section, an ideal mixer would be a device that multiplies the two signals. Some widely used mixer circuits, such as the Gilbert cell, operate in this way, but they are limited to lower frequencies. However, any nonlinear electronic component also multiplies signals applied to it, producing heterodyne frequencies in its output—so a variety of nonlinear components serve as mixers. A nonlinear component is one in which the output current or voltage is a nonlinear function of its input. Most circuit elements in communications circuits are designed to be linear. This means they obey the superposition principle; if F(v) is the output of a linear element with an input of v:\nSo if two sine wave signals at frequencies f1 and f2 are applied to a linear device, the output is simply the sum of the outputs when the two signals are applied separately with no product terms. Thus, the function F must be nonlinear to create heterodynes (mixer products). A perfect multiplier only produces mixer products at the sum and difference frequencies (f1 ± f2), but more general nonlinear functions produce higher order mixer products: n⋅f1 + m⋅f2 for integers n and m. Some mixer designs, such as double-balanced mixers, suppress some high order undesired products, while other designs, such as harmonic mixers exploit high order differences.\nExamples of nonlinear components that are used as mixers are vacuum tubes and transistors biased near cutoff (class C), and diodes. Ferromagnetic core inductors driven into saturation can also be used at lower frequencies. In nonlinear optics, crystals that have nonlinear characteristics are used to mix laser light beams to create heterodynes at optical frequencies.\nTo demonstrate mathematically how a nonlinear component can multiply signals and generate heterodyne frequencies, the nonlinear function F can be expanded in a power series (MacLaurin series):\nTo simplify the math, the higher order terms above α2 are indicated by an ellipsis (\". . .\") and only the first terms are shown. Applying the two sine waves at frequencies ω1 = 2πf1 and ω2 = 2πf2 to this device:\nIt can be seen that the second term above contains a product of the two sine waves. Simplifying with trigonometric identities:\nSo the output contains sinusoidal terms with frequencies at the sum ω1 + ω2 and difference ω1 − ω2 of the two original frequencies. It also contains terms at the original frequencies and at multiples of the original frequencies 2ω1, 2ω2, 3ω1, 3ω2, etc.; the latter are called harmonics, as well as more complicated terms at frequencies of Mω1 + Nω2, called intermodulation products. These unwanted frequencies, along with the unwanted heterodyne frequency, must be filtered out of the mixer output by an electronic filter to leave the desired heterodyne.", 
    "dbpedia_url": "http://dbpedia.org/resource/Heterodyne", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Heterodyne\n"
}