{
    "about": "The High-performance Integrated Virtual Environment (HIVE) is a distributed computing environment used for biological research, including analysis of Next Generation Sequencing (NGS) data, post market data, adverse events, metagenomic data, etc.[1]", 
    "classification": "Bioinformatics Algorithms", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/High-performance_Integrated_Virtual_Environment\n", 
    "full_text": "The High-performance Integrated Virtual Environment (HIVE) is a distributed computing environment used for biological research, including analysis of Next Generation Sequencing (NGS) data, post market data, adverse events, metagenomic data, etc.[1]\n\n\nHIVE is a massively parallel distributed computing environment where the distributed storage library and the distributed computational powerhouse are linked seamlessly.[2] The system is both robust and flexible due to maintaining both storage and the metadata database on the same network.[3] The distributed storage layer of software is the key component for file and archive management and is the backbone for the deposition pipeline. The data deposition back-end allows automatic uploads and downloads of external datasets into HIVE data repositories. The metadata database can be used to maintain specific information about extremely large files ingested into the system (big data) as well as metadata related to computations run on the system. This metadata then allows details of a computational pipeline to be brought up easily in the future in order to validate or replicate experiments. Since the metadata is associated with the computation, it stores the parameters of any computation in the system eliminating manual record keeping.[citation needed]\nDifferentiating HIVE from other object oriented databases is that HIVE implements a set of unified APIs to search, view, and manipulate data of all types. The system also facilitates a highly secure hierarchical access control and permission system, allowing determination of data access privileges in a finely granular manner without creating a multiplicity of rules in the security subsystem. The security model, designed for sensitive data, provides comprehensive control and auditing functionality in compliance with HIVE's designation as a FISMA Moderate system.[4]", 
    "name": "High Performance Integrated Virtual Environment"
}