{
    "about": "In mathematics and in signal processing, the Hilbert transform is a linear operator that takes a function, u(t), and produces a function, H(u)(t), with the same domain.", 
    "name": "Hilbert Transform", 
    "classification": "Signal Processing", 
    "full_text": "In mathematics and in signal processing, the Hilbert transform is a linear operator that takes a function, u(t), and produces a function, H(u)(t), with the same domain.\nThe Hilbert transform is important in signal processing, where it derives the analytic representation of a signal u(t). This means that the real signal u(t) is extended into the complex plane such that it satisfies the Cauchy–Riemann equations. For example, the Hilbert transform leads to the harmonic conjugate of a given function in Fourier analysis, aka harmonic analysis. Equivalently, it is an example of a singular integral operator and of a Fourier multiplier.\nThe Hilbert transform was originally defined for periodic functions, or equivalently for functions on the circle, in which case it is given by convolution with the Hilbert kernel. More commonly, however, the Hilbert transform refers to a convolution with the Cauchy kernel, for functions defined on the real line R (the boundary of the upper half-plane). The Hilbert transform is closely related to the Paley–Wiener theorem, another result relating holomorphic functions in the upper half-plane and Fourier transforms of functions on the real line.\nThe Hilbert transform is named after David Hilbert, who first introduced the operator to solve a special case of the Riemann–Hilbert problem for holomorphic functions.\n\n\nThe Hilbert transform of u can be thought of as the convolution of u(t) with the function h(t) = 1/(πt). Because h(t) is not integrable, the integrals defining the convolution do not converge. Instead, the Hilbert transform is defined using the Cauchy principal value (denoted here by p.v.). Explicitly, the Hilbert transform of a function (or signal) u(t) is given by:\nprovided this integral exists as a principal value. This is precisely the convolution of u with the tempered distribution p.v. 1/πt (due to Schwartz (1950); see Pandey (1996, Chapter 3)). Alternatively, by changing variables, the principal value integral can be written explicitly (Zygmund 1968, §XVI.1) as:\nWhen the Hilbert transform is applied twice in succession to a function u, the result is negative u:\nprovided the integrals defining both iterations converge in a suitable sense. In particular, the inverse transform is −H. This fact can most easily be seen by considering the effect of the Hilbert transform on the Fourier transform of u(t) (see Relationship with the Fourier transform, below).\nFor an analytic function in upper half-plane, the Hilbert transform describes the relationship between the real part and the imaginary part of the boundary values. That is, if f(z) is analytic in the plane Im z > 0 and u(t) = Re f(t + 0·i ) then Im f(t + 0·i ) = H(u)(t) up to an additive constant, provided this Hilbert transform exists.\nIn signal processing the Hilbert transform of u(t) is commonly denoted by \n\n\n\n\n\n\nu\n^\n\n\n\n(\nt\n)\n\n\n\n{\\displaystyle {\\widehat {u}}(t)\\,}\n\n (e.g., Brandwood 2003, pg 87). However, in mathematics, this notation is already extensively used to denote the Fourier transform of u(t) (e.g., Stein & Weiss 1971). Occasionally, the Hilbert transform may be denoted by \n\n\n\n\n\n\nu\n~\n\n\n\n(\nt\n)\n\n\n{\\displaystyle {\\tilde {u}}(t)}\n\n. Furthermore, many sources define the Hilbert transform as the negative of the one defined here (e.g., Bracewell 2000, pg 359).\nThe Hilbert transform arose in Hilbert's 1905 work on a problem Riemann posed concerning analytic functions,(Kress (1989)Bitsadze (2001)) which has come to be known as the Riemann–Hilbert problem. Hilbert's work was mainly concerned with the Hilbert transform for functions defined on the circle (Khvedelidze 2001; Hilbert 1953). Some of his earlier work related to the Discrete Hilbert Transform dates back to lectures he gave in Göttingen. The results were later published by Hermann Weyl in his dissertation (Hardy, Littlewood & Polya 1952, §9.1). Schur improved Hilbert's results about the discrete Hilbert transform and extended them to the integral case (Hardy, Littlewood & Polya 1952, §9.2). These results were restricted to the spaces L2 and ℓ2. In 1928, Marcel Riesz proved that the Hilbert transform can be defined for u in Lp(R) for 1 ≤ p < ∞, that the Hilbert transform is a bounded operator on Lp(R) for 1 < p < ∞, and that similar results hold for the Hilbert transform on the circle as well as the discrete Hilbert transform (Riesz 1928). The Hilbert transform was a motivating example for Antoni Zygmund and Alberto Calderón during their study of singular integrals (Calderón & Zygmund 1952). Their investigations have played a fundamental role in modern harmonic analysis. Various generalizations of the Hilbert transform, such as the bilinear and trilinear Hilbert transforms are still active areas of research today.\nThe Hilbert transform is a multiplier operator (Duoandikoetxea 2000, Chapter 3). The multiplier of H is σH(ω) = −i sgn(ω) where sgn is the signum function. Therefore:\nwhere \n\n\n\n\n\nF\n\n\n\n\n{\\displaystyle {\\mathcal {F}}}\n\n denotes the Fourier transform. Since sgn(x) = sgn(2πx), it follows that this result applies to the three common definitions of \n\n\n\n\n\nF\n\n\n\n\n{\\displaystyle {\\mathcal {F}}}\n\n.\nBy Euler's formula,\nTherefore, H(u)(t) has the effect of shifting the phase of the negative frequency components of u(t) by +90° (π/2 radians) and the phase of the positive frequency components by −90°. And i·H(u)(t) has the effect of restoring the positive frequency components while shifting the negative frequency ones an additional +90°, resulting in their negation.\nWhen the Hilbert transform is applied twice, the phase of the negative and positive frequency components of u(t) are respectively shifted by +180° and −180°, which are equivalent amounts. The signal is negated; i.e., H(H(u)) = −u, because:\nAn extensive table of Hilbert transforms is available (King 2009). Note that the Hilbert transform of a constant is zero.\nIt is by no means obvious that the Hilbert transform is well-defined at all, as the improper integral defining it must converge in a suitable sense. However, the Hilbert transform is well-defined for a broad class of functions, namely those in Lp(R) for 1 < p < ∞.\nMore precisely, if u is in Lp(R) for 1 < p < ∞, then the limit defining the improper integral\nexists for almost every t. The limit function is also in Lp(R) and is in fact the limit in the mean of the improper integral as well. That is,\nas ε→0 in the Lp-norm, as well as pointwise almost everywhere, by the Titchmarsh theorem (Titchmarsh 1948, Chapter 5).\nIn the case p = 1, the Hilbert transform still converges pointwise almost everywhere, but may itself fail to be integrable, even locally (Titchmarsh 1948, §5.14). In particular, convergence in the mean does not in general happen in this case. The Hilbert transform of an L1 function does converge, however, in L1-weak, and the Hilbert transform is a bounded operator from L1 to L1,w (Stein & Weiss 1971, Lemma V.2.8). (In particular, since the Hilbert transform is also a multiplier operator on L2, Marcinkiewicz interpolation and a duality argument furnishes an alternative proof that H is bounded on Lp.)\nIf 1 < p < ∞, then the Hilbert transform on Lp(R) is a bounded linear operator, meaning that there exists a constant Cp such that\nfor all u∈Lp(R). This theorem is due to Riesz (1928, VII); see also Titchmarsh (1948, Theorem 101). The best constant Cp is given by\nThis result is due to (Pichorides 1972); see also Grafakos (2004, Remark 4.1.8). The same best constants hold for the periodic Hilbert transform.\nThe boundedness of the Hilbert transform implies the Lp(R) convergence of the symmetric partial sum operator\nto f in Lp(R), see for example (Duoandikoetxea 2000, p. 59).\nThe Hilbert transform is an anti-self adjoint operator relative to the duality pairing between Lp(R) and the dual space Lq(R), where p and q are Hölder conjugates and 1 < p,q < ∞. Symbolically,\nfor u ∈ Lp(R) and v ∈ Lq(R) (Titchmarsh 1948, Theorem 102).\nThe Hilbert transform is an anti-involution (Titchmarsh 1948, p. 120), meaning that\nprovided each transform is well-defined. Since H preserves the space Lp(R), this implies in particular that the Hilbert transform is invertible on Lp(R), and that\nFormally, the derivative of the Hilbert transform is the Hilbert transform of the derivative, i.e. these two linear operators commute:\nIterating this identity,\nThis is rigorously true as stated provided u and its first k derivatives belong to Lp(R) (Pandey 1996, §3.3). One can check this easily in the frequency domain, where differentiation becomes multiplication by ω.\nThe Hilbert transform can formally be realized as a convolution with the tempered distribution (Duistermaat & Kolk 2010, p. 211)\nThus formally,\nHowever, a priori this may only be defined for u a distribution of compact support. It is possible to work somewhat rigorously with this since compactly supported functions (which are distributions a fortiori) are dense in Lp. Alternatively, one may use the fact that h(t) is the distributional derivative of the function log|t|/π; to wit\nFor most operational purposes the Hilbert transform can be treated as a convolution. For example, in a formal sense, the Hilbert transform of a convolution is the convolution of the Hilbert transform on either factor:\nThis is rigorously true if u and v are compactly supported distributions since, in that case,\nBy passing to an appropriate limit, it is thus also true if u ∈ Lp and v ∈ Lr provided\na theorem due to Titchmarsh (1948, Theorem 104).\nThe Hilbert transform has the following invariance properties on L2(R).\nUp to a multiplicative constant, the Hilbert transform is the only bounded operator on L2 with these properties (Stein 1970, §III.1).\nIn fact there is a larger group of operators commuting with the Hilbert transform. The group SL(2,R) acts by unitary operators Ug on the space L2(R) by the formula\nThis unitary representation is an example of a principal series representation of SL(2,R). In this case it is reducible, splitting as the orthogonal sum of two invariant subspaces, Hardy space H2(R) and its conjugate. These are the spaces of L2 boundary values of holomorphic functions on the upper and lower halfplanes. H2(R) and its conjugate consist of exactly those L2 functions with Fourier transforms vanishing on the negative and positive parts of the real axis respectively. Since the Hilbert transform is equal to H = −i (2P − I), with P being the orthogonal projection from L2(R) onto H2(R), it follows that H2(R) and its orthogonal are eigenspaces of H for the eigenvalues ± i. In other words, H commutes with the operators Ug. The restrictions of the operators Ug to H2(R) and its conjugate give irreducible representations of SL(2,R)—the so-called limit of discrete series representations.[1]\nIt is further possible to extend the Hilbert transform to certain spaces of distributions (Pandey 1996, Chapter 3). Since the Hilbert transform commutes with differentiation, and is a bounded operator on Lp, H restricts to give a continuous transform on the inverse limit of Sobolev spaces:\nThe Hilbert transform can then be defined on the dual space of \n\n\n\n\n\n\nD\n\n\n\n\nL\n\np\n\n\n\n\n\n\n{\\displaystyle {\\mathcal {D}}_{L^{p}}}\n\n, denoted \n\n\n\n\n\n\nD\n\n\n\n\nL\n\np\n\n\n\n′\n\n\n\n{\\displaystyle {\\mathcal {D}}_{L^{p}}'}\n\n, consisting of Lp distributions. This is accomplished by the duality pairing: for \n\n\n\nu\n∈\n\n\n\nD\n\n\n\n\nL\n\np\n\n\n\n′\n\n\n\n{\\displaystyle u\\in {\\mathcal {D}}'_{L^{p}}}\n\n, define \n\n\n\nH\n(\nu\n)\n∈\n\n\n\nD\n\n\n\n\nL\n\np\n\n\n\n′\n\n\n\n{\\displaystyle H(u)\\in {\\mathcal {D}}'_{L^{p}}}\n\n by\nfor all \n\n\n\nv\n∈\n\n\n\nD\n\n\n\n\nL\n\np\n\n\n\n\n\n\n{\\displaystyle v\\in {\\mathcal {D}}_{L^{p}}}\n\n.\nIt is possible to define the Hilbert transform on the space of tempered distributions as well by an approach due to Gel'fand & Shilov (1967)[page needed], but considerably more care is needed because of the singularity in the integral.\nThe Hilbert transform can be defined for functions in L∞(R) as well, but it requires some modifications and caveats. Properly understood, the Hilbert transform maps L∞(R) to the Banach space of bounded mean oscillation (BMO) classes.\nInterpreted naïvely, the Hilbert transform of a bounded function is clearly ill-defined. For instance, with u = sgn(x), the integral defining H(u) diverges almost everywhere to ±∞. To alleviate such difficulties, the Hilbert transform of an L∞-function is therefore defined by the following regularized form of the integral\nwhere as above h(x) = 1/πx and\nThe modified transform H agrees with the original transform on functions of compact support by a general result of Calderón & Zygmund (1952); see Fefferman (1971). The resulting integral, furthermore, converges pointwise almost everywhere, and with respect to the BMO norm, to a function of bounded mean oscillation.\nA deep result of Fefferman (1971) and Fefferman & Stein (1972) is that a function is of bounded mean oscillation if and only if it has the form ƒ + H(g) for some ƒ, g ∈ L∞(R).\nThe Hilbert transform can be understood in terms of a pair of functions f(x) and g(x) such that the function\nis the boundary value of a holomorphic function F(z) in the upper half-plane (Titchmarsh 1948, Chapter V). Under these circumstances, if f and g are sufficiently integrable, then one is the Hilbert transform of the other.\nSuppose that f ∈ Lp(R). Then, by the theory of the Poisson integral, f admits a unique harmonic extension into the upper half-plane, and this extension is given by\nwhich is the convolution of f with the Poisson kernel\nFurthermore, there is a unique harmonic function v defined in the upper half-plane such that F(z) = u(z) + iv(z) is holomorphic and\nThis harmonic function is obtained from f by taking a convolution with the conjugate Poisson kernel\nThus\nIndeed, the real and imaginary parts of the Cauchy kernel are\nso that F = u + iv is holomorphic by Cauchy's integral formula.\nThe function v obtained from u in this way is called the harmonic conjugate of u. The (non-tangential) boundary limit of v(x,y) as y → 0 is the Hilbert transform of f. Thus, succinctly,\nA theorem due to Edward Charles Titchmarsh makes precise the relationship between the boundary values of holomorphic functions in the upper half-plane and the Hilbert transform (Titchmarsh 1948, Theorem 95). It gives necessary and sufficient conditions for a complex-valued square-integrable function F(x) on the real line to be the boundary value of a function in the Hardy space H2(U) of holomorphic functions in the upper half-plane U.\nThe theorem states that the following conditions for a complex-valued square-integrable function F : R → C are equivalent:\nA weaker result is true for functions of class Lp for p > 1 (Titchmarsh 1948, Theorem 103). Specifically, if F(z) is a holomorphic function such that\nfor all y, then there is a complex-valued function F(x) in Lp(R) such that F(x + iy) → F(x) in the Lp norm as y → 0 (as well as holding pointwise almost everywhere). Furthermore,\nwhere ƒ is a real-valued function in Lp(R) and g is the Hilbert transform (of class Lp) of ƒ.\nThis is not true in the case p = 1. In fact, the Hilbert transform of an L1 function ƒ need not converge in the mean to another L1 function. Nevertheless, (Titchmarsh 1948, Theorem 105), the Hilbert transform of ƒ does converge almost everywhere to a finite function g such that\nThis result is directly analogous to one by Andrey Kolmogorov for Hardy functions in the disc (Duren 1970, Theorem 4.2).\nOne form of the Riemann–Hilbert problem seeks to identify pairs of functions F+ and F− such that F+ is holomorphic on the upper half-plane and F− is holomorphic on the lower half-plane, such that for x along the real axis,\nwhere f(x) is some given real-valued function of x ∈ R. The left-hand side of this equation may be understood either as the difference of the limits of F± from the appropriate half-planes, or as a hyperfunction distribution. Two functions of this form are a solution of the Riemann–Hilbert problem.\nFormally, if F± solve the Riemann–Hilbert problem\nthen the Hilbert transform of f(x) is given by\nFor a periodic function f the circular Hilbert transform is defined as\nThe circular Hilbert transform is used in giving a characterization of Hardy space and in the study of the conjugate function in Fourier series. The kernel,\nThe Hilbert kernel (for the circular Hilbert transform) can be obtained by making the Cauchy kernel 1/x periodic. More precisely, for x ≠ 0\nMany results about the circular Hilbert transform may be derived from the corresponding results for the Hilbert transform from this correspondence.\nAnother more direct connection is provided by the Cayley transform C(x) = (x – i) / (x + i), which carries the real line onto the circle and the upper half plane onto the unit disk. It induces a unitary map\nof L2(T) onto L2(R). The operator U carries the Hardy space H2(T) onto the Hardy space H2(R).[2]\nBedrosian's theorem states that the Hilbert transform of the product of a low-pass and a high-pass signal with non-overlapping spectra is given by the product of the low-pass signal and the Hilbert transform of the high-pass signal, or\nwhere fLP and fHP are the low- and high-pass signals respectively (Schreier & Scharf 2010, 14).\nAmplitude modulated signals are modeled as the product of a bandlimited \"message\" waveform, um(t), and a sinusoidal \"carrier\":\nWhen um(t) has no frequency content above the carrier frequency, \n\n\n\n\n\nω\n\n2\nπ\n\n\n\n\n Hz\n\n,\n\n\n{\\displaystyle {\\frac {\\omega }{2\\pi }}{\\text{ Hz}},}\n\n then by Bedrosian's theorem:\nIn the context of signal processing, the conjugate function interpretation of the Hilbert transform, discussed above, gives the analytic representation of a signal u(t):\nwhich is a holomorphic function in the upper half plane.\nFor the narrowband model (above), the analytic representation is:\n\n\n\n\n=\n\nu\n\nm\n\n\n(\nt\n)\n⋅\n\ne\n\ni\n(\nω\nt\n+\nϕ\n)\n\n\n\n\n\n{\\displaystyle =u_{m}(t)\\cdot e^{i(\\omega t+\\phi )}\\,}\n\n   (by Euler's formula)\n\n \n \n \n \n(Eq.1)\nThis complex heterodyne operation shifts all the frequency components of um(t) above 0 Hz. In that case, the imaginary part of the result is a Hilbert transform of the real part. This is an indirect way to produce Hilbert transforms.\nThe form:\nis called phase (or frequency) modulation. The instantaneous frequency is  \n\n\n\nω\n+\n\nϕ\n\nm\n\n\n′\n\n\n(\nt\n)\n.\n\n\n{\\displaystyle \\omega +\\phi _{m}^{\\prime }(t).}\n\n  For sufficiently large ω, compared to  \n\n\n\n\nϕ\n\nm\n\n\n′\n\n\n\n\n{\\displaystyle \\phi _{m}^{\\prime }}\n\n:\nand:\nWhen um(t) in  Eq.1 is also an analytic representation (of a message waveform), that is:\nthe result is single-sideband modulation:\nwhose transmitted component is:\nThe function h with h(t) = 1/(πt) is a non-causal filter and therefore cannot be implemented as is, if u is a time-dependent signal. If u is a function of a non-temporal variable (e.g., spatial) the non-causality might not be a problem. The filter is also of infinite support, which may be a problem in certain applications. Another issue relates to what happens with the zero frequency (DC), which can be avoided by assuring that s does not contain a DC-component.\nA practical implementation in many cases implies that a finite support filter, which in addition is made causal by means of a suitable delay, is used to approximate the computation. The approximation may also imply that only a specific frequency range is subject to the characteristic phase shift related to the Hilbert transform. See also quadrature filter.\nFor a discrete function,  \n\n\n\nu\n[\nn\n]\n,\n\n\n{\\displaystyle u[n],}\n\n  with discrete-time Fourier transform (DTFT),  \n\n\n\nU\n(\nω\n)\n,\n\n\n{\\displaystyle U(\\omega ),}\n\n  and discrete Hilbert transform  \n\n\n\n\n\n\nu\n^\n\n\n\n[\nn\n]\n,\n\n\n{\\displaystyle {\\hat {u}}[n],}\n\n  the DTFT of  \n\n\n\n\n\n\nu\n^\n\n\n\n[\nn\n]\n\n\n{\\displaystyle {\\hat {u}}[n]}\n\n  in the region  −π < ω <  π is given by:\nThe inverse DTFT, using the convolution theorem, is:\nwhere:\nwhich is an infinite impulse response (IIR). When the convolution is performed numerically, an FIR approximation is substituted for h[n], as shown in Figure 1. An FIR filter with an odd number of anti-symmetric coefficients is called Type III, which inherently exhibits responses of zero magnitude at frequencies 0 and Nyquist, resulting in this case in a bandpass filter shape. A Type IV design (even number of anti-symmetric coefficients) is shown in Figure 2. Since the magnitude response at Nyquist does not drop out, it approximates an ideal Hilbert transformer a little better than the odd-tap filter. However:\nThe MATLAB function, hilbert(u,N), convolves a u[n] sequence with the periodic summation:[3]\nand returns one cycle (N samples) of the periodic result in the imaginary part of a complex-valued output sequence. The convolution is implemented in the frequency domain as the product of the array  \n\n\n\n\n\nD\nF\nT\n\n\n\n(\nu\n[\nn\n]\n)\n\n\n\n\n\n{\\displaystyle \\scriptstyle {DFT}\\displaystyle \\left(u[n]\\right)}\n\n  with samples of the −i•sgn(ω) distribution (whose real and imaginary components are all just 0 or ±1). Figure 3 compares a half-cycle of hN[n] with an equivalent length portion of h[n]. Given an FIR approximation for  \n\n\n\nh\n[\nn\n]\n,\n\n\n{\\displaystyle h[n],}\n\n denoted by  \n\n\n\n\n\n\nh\n~\n\n\n\n[\nn\n]\n,\n\n\n{\\displaystyle {\\tilde {h}}[n],}\n\n  substituting  \n\n\n\n\n\nD\nF\nT\n\n\n\n(\n\n\n\nh\n~\n\n\n\n[\nn\n]\n)\n\n\n\n\n\n{\\displaystyle \\scriptstyle {DFT}\\displaystyle \\left({\\tilde {h}}[n]\\right)}\n\n  for the −i•sgn(ω) samples results in an FIR version of the convolution.\nThe real part of the output sequence is the original input sequence, so that the complex output is an analytic representation of u[n]. When the input is a segment of a pure cosine, the resulting convolution for two different values of N is depicted in Figure 4 (red and blue plots). Edge effects prevent the result from being a pure sine function (green plot). Since hN[n] is not an FIR sequence, the theoretical extent of the effects is the entire output sequence. But the differences from a sine function diminish with distance from the edges. Parameter N is the output sequence length. If it exceeds the length of the input sequence, the input is modified by appending zero-valued elements. In most cases, that reduces the magnitude of the differences. But their duration is dominated by the inherent rise and fall times of the h[n] impulse response.\nAn appreciation for the edge effects is important when a method called overlap-save is used to perform the convolution on a long u[n] sequence. Segments of length N are convolved with the periodic function:\nWhen the duration of non-zero values of  \n\n\n\n\n\n\nh\n~\n\n\n\n[\nn\n]\n\n\n{\\displaystyle {\\tilde {h}}[n]}\n\n  is M < N, the output sequence includes N − M + 1 samples of  \n\n\n\n\n\n\nu\n^\n\n\n\n.\n\n\n{\\displaystyle {\\hat {u}}.}\n\n  M-1 outputs are discarded from each block of N, and the input blocks are overlapped by that amount to prevent gaps.\nFigure 5 is an example of using both the IIR hilbert() function and the FIR approximation. In the example, a sine function is created by computing the Discrete Hilbert transform of a cosine function, which was processed in four overlapping segments, and pieced back together. As the FIR result (blue) shows, the distortions apparent in the IIR result (red) are not caused by the difference between h[n] and hN[n] (green and red in Fig 3). The fact that hN[n] is tapered (windowed) is actually helpful in this context. The real problem is that it's not windowed enough. Effectively, M = N, whereas the overlap-save method needs M < N.\nThe number theoretic Hilbert transform is an extension (Kak 1970) of the discrete Hilbert transform to integers modulo an appropriate prime number. In this it follows the generalization of discrete Fourier transform to number theoretic transforms. The number theoretic Hilbert transform can be used to generate sets of orthogonal discrete sequences(Kak 2014).", 
    "dbpedia_url": "http://dbpedia.org/resource/Hilbert_transform", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Hilbert_transform\n"
}