{
    "about": "The Hilbert–Huang transform (HHT) is a way to decompose a signal into so-called intrinsic mode functions (IMF) along with a trend, and obtain instantaneous frequency data. It is designed to work well for data that is nonstationary and nonlinear. In contrast to other common transforms like the Fourier transform, the HHT is more like an algorithm (an empirical approach) that can be applied to a data set, rather than a theoretical tool.", 
    "name": "Hilbert–Huang Transform", 
    "classification": "Signal Processing", 
    "full_text": "The Hilbert–Huang transform (HHT) is a way to decompose a signal into so-called intrinsic mode functions (IMF) along with a trend, and obtain instantaneous frequency data. It is designed to work well for data that is nonstationary and nonlinear. In contrast to other common transforms like the Fourier transform, the HHT is more like an algorithm (an empirical approach) that can be applied to a data set, rather than a theoretical tool.\n\n\nThe Hilbert–Huang transform (HHT), a NASA designated name, was proposed by Huang et al. (1996, 1998, 1999, 2003, 2012). It is the result of the empirical mode decomposition (EMD) and the Hilbert spectral analysis (HSA). The HHT uses the EMD method to decompose a signal into so-called intrinsic mode functions (IMF) with a trend, and applies the HSA method to the IMFs to obtain instantaneous frequency data. Since the signal is decomposed in time domain and the length of the IMFs is the same as the original signal, HHT preserves the characteristics of the varying frequency. This is an important advantage of HHT since real-world signal usually has multiple causes happening in different time intervals. The HHT provides a new method of analyzing nonstationary and nonlinear time series data.\nThe fundamental part of the HHT is the empirical mode decomposition (EMD) method. Breaking down signals into various components, EMD can be compared with other analysis methods such as Fourier transform and Wavelet transform. Using the EMD method, any complicated data set can be decomposed into a finite and often small number of components. These components form a complete and nearly orthogonal basis for the original signal. In addition, they can be described as intrinsic mode functions (IMF).[1]\nWithout leaving the time domain, EMD is adaptive and highly efficient[citation needed]. Since the decomposition is based on the local characteristic time scale of the data, it can be applied to nonlinear and nonstationary processes[citation needed].\nAn IMF is defined as a function that satisfies the following requirements:\nIt represents a generally simple oscillatory mode as a counterpart to the simple harmonic function. By definition, an IMF is any function with the same number of extrema and zero crossings, whose envelopes are symmetric with respect to zero[citation needed]. This definition guarantees a well-behaved Hilbert transform of the IMF.\nHilbert spectral analysis (HSA) is a method for examining each IMF's instantaneous frequency as functions of time. The final result is a frequency-time distribution of signal amplitude (or energy), designated as the Hilbert spectrum, which permits the identification of localized features.\nThe EMD method is a necessary step to reduce any given data into a collection of intrinsic mode functions (IMF) to which the Hilbert spectral analysis can be applied.\nIMF represents a simple oscillatory mode as a counterpart to the simple harmonic function, but it is much more general: instead of constant amplitude and frequency in a simple harmonic component, an IMF can have variable amplitude and frequency along the time axis.\nThe procedure of extracting an IMF is called sifting. The sifting process is as follows:\nThe upper and lower envelopes should cover all the data between them. Their mean is m1. The difference between the data and m1 is the first component h1:\nIdeally, h1 should satisfy the definition of an IMF, since the construction of h1 described above should have made it symmetric and having all maxima positive and all minima negative. After the first round of sifting, a crest may become a local maximum. New extrema generated in this way actually reveal the proper modes lost in the initial examination. In the subsequent sifting process, h1 can only be treated as a proto-IMF. In the next step, h1 is treated as data:\n\n\n\n\n\nh\n\n1\n\n\n−\n\nm\n\n11\n\n\n=\n\nh\n\n11\n\n\n.\n\n\n\n{\\displaystyle h_{1}-m_{11}=h_{11}.\\,}\n\n\nAfter repeated sifting up to k times, h1 becomes an IMF, that is\nThen, h1k is designated as the first IMF component of the data:\nThe stoppage criterion determines the number of sifting steps to produce an IMF. Following are the four existing stoppage criterion:\nThis criterion is proposed by Huang et al. (1998). It is similar to the Cauchy convergence test, and we define a sum of the difference, SD, as\nThis criterion is based on the so-called S-number, which is defined as the number of consecutive siftings for which the number of zero-crossings and extrema are equal or at most differing by one. Specifically, an S-number is pre-selected. The sifting process will stop only if, for S consecutive siftings, the numbers of zero-crossings and extrema stay the same, and are equal or at most differ by one.\nProposed by Rilling, Flandrin and Gonçalvés, threshold method set two threshold values to guaranteeing globally small fluctuations in the mean while taking in account locally large excursions.[2]\nProposed by Cheng, Yu and Yang, energy different tracking method utilized the assumption that the original signal is a composition of orthogonal signals, and calculate the energy based on the assumption. If the result of EMD is not an orthogonal basis of the original signal, the amount of energy will be different from the original energy.\nOnce a stoppage criterion is selected, the first IMF, c1, can be obtained. Overall, c1 should contain the finest scale or the shortest period component of the signal. We can, then, separate c1 from the rest of the data by \n\n\n\nX\n(\nt\n)\n−\n\nc\n\n1\n\n\n=\n\nr\n\n1\n\n\n.\n\n\n\n{\\displaystyle X(t)-c_{1}=r_{1}.\\,}\n\n Since the residue, r1, still contains longer period variations in the data, it is treated as the new data and subjected to the same sifting process as described above.\nThis procedure can be repeated for all the subsequent rj's, and the result is\nThe sifting process finally stops when the residue, rn, becomes a monotonic function from which no more IMF can be extracted. From the above equations, we can induce that\nThus, a decomposition of the data into n-empirical modes is achieved. The components of the EMD are usually physically meaningful, for the characteristic scales are defined by the physical data. Flandrin et al. (2003) and Wu and Huang (2004) have shown that the EMD is equivalent to a dyadic filter bank.[3]\nHaving obtained the intrinsic mode function components, the instantaneous frequency can be computed using the Hilbert transform. After performing the Hilbert transform on each IMF component, the original data can be expressed as the real part, Real, in the following form:\nChen and Feng [2003] proposed a technique to improve the HHT procedure.[14] The authors noted that the EMD is limited in distinguishing different components in narrow-band signals. The narrow band may contain either (a) components that have adjacent frequencies or (b) components that are not adjacent in frequency but for which one of the components has a much higher energy intensity than the other components. The improved technique is based on beating-phenomenon waves.\nDatig and Schlurmann [2004] [15] conducted a comprehensive study on the performance and limitations of HHT with particular applications to irregular[disambiguation needed] waves. The authors did extensive investigation into the spline interpolation. The authors discussed using additional points, both forward and backward, to determine better envelopes. They also performed a parametric study on the proposed improvement and showed significant improvement in the overall EMD computations. The authors noted that HHT is capable of differentiating between time-variant components from any given data. Their study also showed that HHT was able to distinguish between riding and carrier waves.\nHuang and Zu [2008] [16] reviewed applications of the Hilbert–Huang transformation emphasizing that the HHT theoretical basis is purely empirical, and noting that \"one of the main drawbacks of EMD is mode mixing\". They also outline outstanding open problems with HHT, which include: End effects of the EMD, Spline problems, Best IMF selection and uniqueness. Although the ensemble EMD (EEMD) may help mitigate the latter.\nEnd effect occurs at the beginning and end of the signal because there is no point before the first data point and after the last data point to be considered together. In most cases, these end points are not the extreme value of the signal. While doing the EMD process of the HHT, the extreme envelope will diverge at the end points and cause significant error. This error distorts the IMF waveform at its endpoints. Furthermore, the error in the decomposition result accumulates through each repetition of the sifting process.[17] Various methods are proposed to solve the end effect in HHT:\nMode mixing problem happens during the EMD process. Straightforward implementation of sifting procedure produces mode mixing due to IMF mode rectification. Specific signal may not be separated into the same IMFs every time. This problem makes it hard to implement feature extraction, model training and pattern recognition since the feature is no longer fixed in one labeling index. Mode mixing problem can be avoided by including an intermittence test during the HHT process.[18]\nThe proposed Ensemble Empirical Mode Decomposition is developed as follows:\nThe effects of the decomposition using the EEMD are that the added white noise series cancel each other, and the mean IMFs stays within the natural dyadic filter windows, significantly reducing the chance of mode mixing and preserving the dyadic property.", 
    "dbpedia_url": "http://dbpedia.org/resource/Hilbert–Huang_transform", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Hilbert–Huang_transform\n"
}