{
    "about": "In mathematics, and more specifically in numerical analysis, Householder's methods are a class of root-finding algorithms that are used for functions of one real variable with continuous derivatives up to some order d+1. Each of these methods is characterized by the number d, which is known as the order of the method. The algorithm is iterative and has a rate of convergence of d+1.", 
    "name": "Householder'S Method", 
    "classification": "Root-Finding Algorithms", 
    "full_text": "In mathematics, and more specifically in numerical analysis, Householder's methods are a class of root-finding algorithms that are used for functions of one real variable with continuous derivatives up to some order d+1. Each of these methods is characterized by the number d, which is known as the order of the method. The algorithm is iterative and has a rate of convergence of d+1.\nThese methods are named after the American mathematician Alston Scott Householder.\n\n\nHouseholder's method is a numerical algorithm for solving the nonlinear equation f(x) = 0. In this case, the function f has to be a function of one real variable. The method consists of a sequence of iterations\nbeginning with an initial guess x0.[1]\nIf f is a (d+1) times continuously differentiable function and a is a zero of f but not of its derivative, then, in a neighborhood of a, the iterates xn satisfy:\nThis means that the iterates converge to the zero if the initial guess is sufficiently close, and that the convergence has order (d+1).\nDespite their order of convergence, these methods are not widely used because the gain in precision is not commensurate with the rise in effort for large d. The Ostrowski index[2] expresses the error reduction in the number of function evaluations instead of the iteration count.\nAn approximate idea of Householder's method derives from the geometric series. Let the real-valued, continuously differentiable function f(x) have a simple zero at x=a, that is a root f(a)=0 of multiplicity one, which is equivalent to \n\n\n\n\nf\n′\n\n(\na\n)\n≠\n0\n\n\n{\\displaystyle f'(a)\\neq 0}\n\n. Then 1/f(x) has a singularity at a, specifically a simple pole (also of multiplicity one), and close to a the behavior of 1/f(x) is dominated by 1/(x-a). Approximately, one gets\nHere \n\n\n\n\nf\n′\n\n(\na\n)\n≠\n0\n\n\n{\\displaystyle f'(a)\\neq 0}\n\n because a is a simple zero of f(x). The coefficient of degree d has the value \n\n\n\nC\n\n\na\n\n−\nd\n\n\n\n\n{\\displaystyle C\\,a^{-d}}\n\n. Thus, one can now reconstruct the zero a by dividing the coefficient of degree d-1 by the coefficient of degree d. Since this geometric series is an approximation to the Taylor expansion of 1/f(x), one can get estimates of the zero of f(x) − now without prior knowledge of the location of this zero − by dividing the corresponding coefficients of the Taylor expansion of 1/f(x) or, more generally, 1/f(b+x). From that one gets, for any integer d, and if the corresponding derivatives exist,\nSuppose x=a is a simple root. Then near x=a, (1/f)(x) is a meromorphic function. Suppose we have the Taylor expansion:\nBy König's theorem, we have:\nThis suggests that Householder's iteration might be a good convergent iteration. The actual proof of the convergence is also based on this idea.\nHouseholder's method of order 1 is just Newton's method, since:\nFor Householder's method of order 2 one gets Halley's method, since the identities\nand\nresult in\nIn the last line, \n\n\n\n\nh\n\nn\n\n\n=\n−\n\n\n\n\nf\n(\n\nx\n\nn\n\n\n)\n\n\n\nf\n′\n\n(\n\nx\n\nn\n\n\n)\n\n\n\n\n\n\n{\\displaystyle h_{n}=-{\\tfrac {f(x_{n})}{f'(x_{n})}}}\n\n is the update of the Newton iteration at the point \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n. This line was added to demonstrate where the difference to the simple Newton's method lies.\nThe third order method is obtained from the identity of the third order derivative of 1/f\nand has the formula\nand so on...\nThe first problem solved by Newton with the Newton-Raphson-Simpson method was the polynomial equation \n\n\n\n\ny\n\n3\n\n\n−\n2\ny\n−\n5\n=\n0\n\n\n{\\displaystyle y^{3}-2y-5=0}\n\n. He observed that there should be a solution close to 2. Replacing y=x+2 transforms the equation into\nThe Taylor series of the reciprocal function starts with\nThe result of applying Householder's methods of various orders at x=0 is also obtained by dividing neighboring coefficients of the latter power series. For the first orders one gets the following values after just one iteration step: For an example, in the case of the 3rd order, \n\n\n\n\nx\n\n1\n\n\n=\n0.0\n+\n106\n\n/\n\n1121\n=\n0.09455842997324\n\n\n{\\displaystyle x_{1}=0.0+106/1121=0.09455842997324}\n\n.\nAs one can see, there are a little bit more than d correct decimal places for each order d.\nLet's calculate the \n\n\n\n\nx\n\n2\n\n\n,\n\nx\n\n3\n\n\n,\n\nx\n\n4\n\n\n\n\n{\\displaystyle x_{2},x_{3},x_{4}}\n\n values for some lowest order,\nAnd using following relations,\n\nAn exact derivation of Householder's methods starts from the Padé approximation of order (d+1) of the function, where the approximant with linear numerator is chosen. Once this has been achieved, the update for the next approximation results from computing the unique zero of the numerator.\nThe Padé approximation has the form\nThe rational function has a zero at \n\n\n\nh\n=\n−\n\na\n\n0\n\n\n\n\n{\\displaystyle h=-a_{0}}\n\n.\nJust as the Taylor polynomial of degree d has d+1 coefficients that depend on the function f, the Padé approximation also has d+1 coefficients dependent on f and its derivatives. More precisely, in any Padé approximant, the degrees of the numerator and denominator polynomials have to add to the order of the approximant. Therefore, \n\n\n\n\nb\n\nd\n\n\n=\n0\n\n\n{\\displaystyle b_{d}=0}\n\n has to hold.\nOne could determine the Padé approximant starting from the Taylor polynomial of f using Euclid's algorithm. However, starting from the Taylor polynomial of 1/f is shorter and leads directly to the given formula. Since\nhas to be equal to the inverse of the desired rational function, we get after multiplying with \n\n\n\n\na\n\n0\n\n\n+\nh\n\n\n{\\displaystyle a_{0}+h}\n\n in the power \n\n\n\n\nh\n\nd\n\n\n\n\n{\\displaystyle h^{d}}\n\n the equation\nNow, solving the last equation for the zero \n\n\n\nh\n=\n−\n\na\n\n0\n\n\n\n\n{\\displaystyle h=-a_{0}}\n\n of the numerator results in\nThis implies the iteration formula", 
    "dbpedia_url": "http://dbpedia.org/resource/Householder's_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Householder's_method\n"
}