{
    "about": "Hypot is a mathematical function defined to calculate the length of the hypotenuse of a right-angle triangle. It was designed to avoid errors arising due to limited-precision calculations performed on computers.", 
    "name": "Hypot", 
    "classification": "Numerical Analysis", 
    "full_text": "Hypot is a mathematical function defined to calculate the length of the hypotenuse of a right-angle triangle. It was designed to avoid errors arising due to limited-precision calculations performed on computers.\n\n\nCalculating the length of the hypotenuse of a triangle is possible using the square root function on the sum of two squares, but hypot(x, y) avoids problems that occur when squaring very large or very small numbers.\nThe magnitude of the hypotenuse from (0, 0) to (x, y) can be calculated using:\nThis operation is also known as Pythagorean addition.\nHowever the squares of very large or small values of x and y may exceed the range of machine precision when calculated on a computer, leading to an inaccurate result caused by arithmetic underflow and/or arithmetic overflow. The hypot function was designed to calculate the result without causing this problem.\nThe hypot function is often used together with the atan2 function to convert from Cartesian coordinates to polar coordinates:\nThe difficulty with the naive implementation is that x2 or y2 may overflow or underflow, unless the intermediate result is computed with extended precision. A common implementation technique is to exchange the values, if necessary, so that |x| ≥ |y|, and then use the equivalent form:\nThe computation of y/x cannot overflow. If y/x underflows, the final result is equal to |x|, which is correct within the precision of the calculation. The square root is computed of a value between 1 and 2. Finally, the multiplication by |x| cannot underflow, and overflows only when the result is too large to represent.\nPseudocode:\nThe function is present in several programming languages:", 
    "dbpedia_url": "http://dbpedia.org/resource/Hypot", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Hypot\n"
}