{
    "about": "Mwave was a technology developed by IBM allowing for the combination of telephony and sound card features on a single adapter card. The technology centers around the Mwave digital signal processor (DSP). The technology was utilized for a time to provide a combination modem and sound card for IBM's Aptiva line and some ThinkPad laptops, in addition to uses on specialized Mwave cards that handled voice recognition or ISDN networking connectivity. Similar adapter cards by third-party vendors using Mwave technology were also sold. However, plagued by consumer complaints about buggy Mwave software and hardware, IBM eventually turned to other audio and telephony solutions for its consumer products.", 
    "name": "Ibm Mwave", 
    "classification": "Digital Signal Processing", 
    "full_text": "Mwave was a technology developed by IBM allowing for the combination of telephony and sound card features on a single adapter card. The technology centers around the Mwave digital signal processor (DSP). The technology was utilized for a time to provide a combination modem and sound card for IBM's Aptiva line and some ThinkPad laptops, in addition to uses on specialized Mwave cards that handled voice recognition or ISDN networking connectivity. Similar adapter cards by third-party vendors using Mwave technology were also sold. However, plagued by consumer complaints about buggy Mwave software and hardware, IBM eventually turned to other audio and telephony solutions for its consumer products.\n\n\nMalcolm Ware, a former developer on Mwave dates the technology back to its development in an IBM research lab in Zurich, Switzerland in 1979. The first prototype was tested in an IBM PC in 1981. After being utilized in some other adapter cards, Mwave was given its official name and used in IBM's WindSurfer ISA/MCA card. IBM manufactured Mwave hardware for both Microsoft Windows and its own OS/2. Another revision of the technology was used in IBM's newly renamed Aptiva line.\nOne of the revisions of the Mwave card was the Mwave Dolphin. The card was an ISA legacy card that did not support plug and play and natively supported Windows through its software. It featured a 28.8k/second fax/modem and a Sound Blaster-compatible audio solution. One of the card's most publicized features was its software upgradeability: a version of the Mwave software upgraded the modem function to 33.6k. In addition, the card was key in the support of some of the Aptiva's Rapid Resume features, including Wake-up On Ring. There were various consumer complaints with users reporting problems involving either the sound or modem features separately, or using both at the same time.[1] Some consumers were offered a check for the purchase of hardware to replace the Mwave card,[2] while others were offered a replacement modem, sound card or both.[3] At one point, a class action lawsuit was filed;[4] it was finally settled in 2001.\nMwave Dolphin drivers version 20D and the Stingray version of the Mwave adapter addressed some shortcomings of the Dolphin (Stingray added plug and play support), but IBM eventually stopped using the Mwave adapter card in its Aptiva computers and resorted to conventional sound card and modem options.\nMwave in some form or another has been produced for the MCA, ISA and PCMCIA busses. Select ThinkPad 600 and 770 models had a PCI version integrated (the Mwave chip integrated in select ThinkPad 755, 760 and 765 models was ISA-based). Certain Sun Sparcstation workstations incorporated the Mwave DSP chip for sound card functionality.\nThough Mwave adapter cards were discontinued, a Linux driver for the PCI-based Mwave in the ThinkPad 600 and 770 models was developed and released by IBM.", 
    "dbpedia_url": "http://dbpedia.org/resource/IBM_Mwave", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/IBM_Mwave\n"
}