{
    "about": "In computer science, imperialist competitive algorithm is a computational method that is used to solve optimization problems of different types.[1] [2] Like most of the methods in the area of evolutionary computation, ICA does not need the gradient of the function in its optimization process. From a specific point of view, ICA can be thought of as the social counterpart of genetic algorithms (GAs). ICA is the mathematical model and the computer simulation of human social evolution, while GAs are based on the biological evolution of species.", 
    "name": "Imperialist Competitive Algorithm", 
    "classification": "Optimization Algorithms And Methods", 
    "full_text": "In computer science, imperialist competitive algorithm is a computational method that is used to solve optimization problems of different types.[1] [2] Like most of the methods in the area of evolutionary computation, ICA does not need the gradient of the function in its optimization process. From a specific point of view, ICA can be thought of as the social counterpart of genetic algorithms (GAs). ICA is the mathematical model and the computer simulation of human social evolution, while GAs are based on the biological evolution of species.\nFigure 1 shows the flowchart of the Imperialist Competitive Algorithm. This algorithm starts by generating a set of candidate random solutions in the search space of the optimization problem. The generated random points are called the initial Countries. Countries in this algorithm are the counterpart of Chromosomes in GAs and Particles in Particle Swarm Optimization (PSO) and it is an array of values of a candidate solution of optimization problem. The cost function of the optimization problem determines the power of each country. Based on their power, some of the best initial countries (the countries with the least cost function value), become Imperialists and start taking control of other countries (called colonies) and form the initial Empires.[1]\nTwo main operators of this algorithm are Assimilation and Revolution. Assimilation makes the colonies of each empire get closer to the imperialist state in the space of socio-political characteristics (optimization search space). Revolution brings about sudden random changes in the position of some of the countries in the search space. During assimilation and revolution a colony might reach a better position and has the chance to take the control of the entire empire and replace the current imperialist state of the empire.[3]\nImperialistic Competition is another part of this algorithm. All the empires try to win this game and take possession of colonies of other empires. In each step of the algorithm, based on their power, all the empires have a chance to take control of one or more of the colonies of the weakest empire.[1]\nAlgorithm continues with the mentioned steps (Assimilation, Revolution, Competition) until a stop condition is satisfied.\nThe above steps can be summarized as the below pseudocode.[2][3]", 
    "dbpedia_url": "http://dbpedia.org/resource/Imperialist_competitive_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Imperialist_competitive_algorithm\n"
}