{
    "about": "Impulse invariance is a technique for designing discrete-time infinite-impulse-response (IIR) filters from continuous-time filters in which the impulse response of the continuous-time system is sampled to produce the impulse response of the discrete-time system. The frequency response of the discrete-time system will be a sum of shifted copies of the frequency response of the continuous-time system; if the continuous-time system is approximately band-limited to a frequency less than the Nyquist frequency of the sampling, then the frequency response of the discrete-time system will be approximately equal to it for frequencies below the Nyquist frequency.", 
    "name": "Impulse Invariance", 
    "classification": "Digital Signal Processing", 
    "full_text": "Impulse invariance is a technique for designing discrete-time infinite-impulse-response (IIR) filters from continuous-time filters in which the impulse response of the continuous-time system is sampled to produce the impulse response of the discrete-time system. The frequency response of the discrete-time system will be a sum of shifted copies of the frequency response of the continuous-time system; if the continuous-time system is approximately band-limited to a frequency less than the Nyquist frequency of the sampling, then the frequency response of the discrete-time system will be approximately equal to it for frequencies below the Nyquist frequency.\n\n\nThe continuous-time system's impulse response, \n\n\n\n\nh\n\nc\n\n\n(\nt\n)\n\n\n{\\displaystyle h_{c}(t)}\n\n, is sampled with sampling period \n\n\n\nT\n\n\n{\\displaystyle T}\n\n to produce the discrete-time system's impulse response, \n\n\n\nh\n[\nn\n]\n\n\n{\\displaystyle h[n]}\n\n.\nThus, the frequency responses of the two systems are related by\nIf the continuous time filter is approximately band-limited (i.e. \n\n\n\n\nH\n\nc\n\n\n(\nj\nΩ\n)\n<\nδ\n\n\n{\\displaystyle H_{c}(j\\Omega )<\\delta }\n\n when \n\n\n\n\n|\n\nΩ\n\n|\n\n≥\nπ\n\n/\n\nT\n\n\n{\\displaystyle |\\Omega |\\geq \\pi /T}\n\n), then the frequency response of the discrete-time system will be approximately the continuous-time system's frequency response for frequencies below π radians per sample (below the Nyquist frequency 1/(2T) Hz):\nNote that aliasing will occur, including aliasing below the Nyquist frequency to the extent that the continuous-time filter's response is nonzero above that frequency. The bilinear transform is an alternative to impulse invariance that uses a different mapping that maps the continuous-time system's frequency response, out to infinite frequency, into the range of frequencies up to the Nyquist frequency in the discrete-time case, as opposed to mapping frequencies linearly with circular overlap as impulse invariance does.\nIf the continuous poles at \n\n\n\ns\n=\n\ns\n\nk\n\n\n\n\n{\\displaystyle s=s_{k}}\n\n, the system function can be written in partial fraction expansion as\nThus, using the inverse Laplace transform, the impulse response is\nThe corresponding discrete-time system's impulse response is then defined as the following\nPerforming a z-transform on the discrete-time impulse response produces the following discrete-time system function\nThus the poles from the continuous-time system function are translated to poles at z = eskT. The zeros, if any, are not so simply mapped.[clarification needed]\nIf the system function has zeros as well as poles, they can be mapped the same way, but the result is no longer an impulse invariance result: the discrete-time impulse response is not equal simply to samples of the continuous-time impulse response. This method is known as the matched Z-transform method, or pole–zero mapping. In the case of all-pole filters, the methods are equivalent.\nSince poles in the continuous-time system at s = sk transform to poles in the discrete-time system at z = exp(skT), poles in the left half of the s-plane map to inside the unit circle in the z-plane; so if the continuous-time filter is causal and stable, then the discrete-time filter will be causal and stable as well.\nWhen a causal continuous-time impulse response has a discontinuity at \n\n\n\nt\n=\n0\n\n\n{\\displaystyle t=0}\n\n, the expressions above are not consistent.[1] This is because \n\n\n\n\nh\n\nc\n\n\n(\n0\n)\n\n\n{\\displaystyle h_{c}(0)}\n\n should really only contribute half its value to \n\n\n\nh\n[\n0\n]\n\n\n{\\displaystyle h[0]}\n\n.\nMaking this correction gives\nPerforming a z-transform on the discrete-time impulse response produces the following discrete-time system function\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Impulse_invariance", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Impulse_invariance\n"
}