{
    "about": "Incremental heuristic search algorithms combine both incremental and heuristic search to speed up searches of sequences of similar search problems, which is important in domains that are only incompletely known or change dynamically.[1] Incremental search has been studied at least since the late 1960s. Incremental search algorithms reuse information from previous searches to speed up the current search and solve search problems potentially much faster than solving them repeatedly from scratch.[2] Similarly, heuristic search has also been studied at least since the late 1960s.", 
    "name": "Incremental Heuristic Search", 
    "classification": "Search Algorithms", 
    "full_text": "Incremental heuristic search algorithms combine both incremental and heuristic search to speed up searches of sequences of similar search problems, which is important in domains that are only incompletely known or change dynamically.[1] Incremental search has been studied at least since the late 1960s. Incremental search algorithms reuse information from previous searches to speed up the current search and solve search problems potentially much faster than solving them repeatedly from scratch.[2] Similarly, heuristic search has also been studied at least since the late 1960s.\nHeuristic search algorithms, often based on A*, use heuristic knowledge in the form of approximations of the goal distances to focus the search and solve search problems potentially much faster than uninformed search algorithms.[3] The resulting search problems, sometimes called dynamic path planning problems, are graph search problems where paths have to be found repeatedly because the topology of the graph, its edge costs, the start vertex or the goal vertices change over time.[4]\nSo far, three main classes of incremental heuristic search algorithms have been developed:\nAll three classes of incremental heuristic search algorithms are different from other replanning algorithms, such as planning by analogy, in that their plan quality does not deteriorate with the number of replanning episodes.\nIncremental heuristic search has been extensively used in robotics, where a larger number of path planning systems are based on either D* (typically earlier systems) or D* Lite (current systems), two different incremental heuristic search algorithms.", 
    "dbpedia_url": "http://dbpedia.org/resource/Incremental_heuristic_search", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Incremental_heuristic_search\n"
}