{
    "about": "The initial attractiveness is a possible extension of the Barabási–Albert model (preferential attachment model). The Barabási–Albert model generates scale-free networks where the degree distribution can be described by a pure power law. However, the degree distribution of most real life networks cannot be described by a power law solely. The most common discrepancies regarding the degree distribution found in real networks are the high degree cut-off (or structural cut-off) and the low degree cut-off. The inclusion of initial attractiveness in the Barabási–Albert model addresses the low-degree cut-off phenomenon.", 
    "name": "Initial Attractiveness", 
    "classification": "Graph Algorithms", 
    "full_text": "The initial attractiveness is a possible extension of the Barabási–Albert model (preferential attachment model). The Barabási–Albert model generates scale-free networks where the degree distribution can be described by a pure power law. However, the degree distribution of most real life networks cannot be described by a power law solely. The most common discrepancies regarding the degree distribution found in real networks are the high degree cut-off (or structural cut-off) and the low degree cut-off. The inclusion of initial attractiveness in the Barabási–Albert model addresses the low-degree cut-off phenomenon.\n\n\nThe Barabási–Albert model defines the following linear preferential attachment rule: \n\n\n\nΠ\n\n(\n\nk\n\ni\n\n\n)\n\n=\n\n\n\nk\n\ni\n\n\n\n\n∑\n\nj\n\n\n\nk\n\nj\n\n\n\n\n\n\n\n{\\displaystyle \\Pi \\left(k_{i}\\right)={\\frac {k_{i}}{\\sum _{j}k_{j}}}}\n\n. This would imply that the probability that a new node will attach to a node that has a zero degree is zero – \n\n\n\nΠ\n(\n0\n)\n=\n0\n\n\n{\\displaystyle \\Pi (0)=0}\n\n. The preferential attachment function of the Barabási–Albert model can be modified as follows: \n\n\n\nΠ\n(\nk\n)\n=\nA\n+\nk\n\n\n{\\displaystyle \\Pi (k)=A+k}\n\n. The constant \n\n\n\nA\n\n\n{\\displaystyle A}\n\n denotes the initial attractiveness of the node. From this the preferential attachment rule with initial attractiveness comes as:\nBased on this attachment rule it can be inferred that: \n\n\n\nΠ\n(\n0\n)\n∼\nA\n\n\n{\\displaystyle \\Pi (0)\\sim A}\n\n. This means that even isolated nodes with \n\n\n\nΠ\n(\n0\n)\n\n\n{\\displaystyle \\Pi (0)}\n\n have a chance to obtain connections with the newly arriving nodes.\nThe presence of initial attractiveness results in two important consequences one is the small degree cut-off (or small degree saturation). The other on is the increased degree exponent of the degree distribution.[1]\nThe small degree saturation is an empirical regularity – the number of nodes with low degree is smaller than it would be expected if a power law would describe the degree distribution. The reason why this appears is the following: initial attractiveness increases the probability that the node obtains connection with an arriving node. This increased attachment probability becomes marginal as the node obtains more connections – it does not effect the right tail of the distribution. The degree distribution of a model with initial attractiveness can be described by the following: \n\n\n\n\np\n\nk\n\n\n=\nC\n⋅\n(\nk\n+\nA\n\n)\n\n−\nγ\n\n\n\n\n{\\displaystyle p_{k}=C\\cdot (k+A)^{-\\gamma }}\n\n.\nThere are numerous real life networks when the degree distribution shows some kind of small degree cut-off. The following list offers some examples:\nImportantly, in case of the Barabási–Albert model the exponent of the degree distribution, here denoted by \n\n\n\nγ\n\n\n{\\displaystyle \\gamma }\n\n, has a value of 3. In case of the Barabási–Albert model with initial attractiveness the degree exponent is simply \n\n\n\nγ\n=\n3\n+\n\n\nA\nm\n\n\n\n\n{\\displaystyle \\gamma =3+{\\frac {A}{m}}}\n\n. Here \n\n\n\nm\n\n\n{\\displaystyle m}\n\n denotes the initial number of links in the network. As \n\n\n\nγ\n\n\n{\\displaystyle \\gamma }\n\n is higher than 3 it follows that the network is in the random network regime and as the number of initial nodes is higher it converges to the scale-free regime. The same holds for the value of the initial attractiveness as \n\n\n\nA\n\n\n{\\displaystyle A}\n\n is higher the more the network is into the random network regime. This means that the number of nodes with relatively high degrees will be lower than it would be in the Barabási–Albert model. The higher degree exponent generally implies that the network is more homogeneous – most nodes are average linked.[6][7]", 
    "dbpedia_url": "http://dbpedia.org/resource/Initial_attractiveness", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Initial_attractiveness\n"
}