{
    "about": "The International Mobile Equipment Identity or IMEI /aɪˈmiː/[1] is a number, usually unique,[2][3] to identify 3GPP (i.e., GSM, UMTS and LTE) and iDEN mobile phones, as well as some satellite phones. It is usually found printed inside the battery compartment of the phone, but can also be displayed on-screen on most phones by entering *#06# on the dialpad, or alongside other system information in the settings menu on smartphone operating systems.", 
    "name": "International Mobile Station Equipment Identity", 
    "classification": "Checksum Algorithms", 
    "full_text": "The International Mobile Equipment Identity or IMEI /aɪˈmiː/[1] is a number, usually unique,[2][3] to identify 3GPP (i.e., GSM, UMTS and LTE) and iDEN mobile phones, as well as some satellite phones. It is usually found printed inside the battery compartment of the phone, but can also be displayed on-screen on most phones by entering *#06# on the dialpad, or alongside other system information in the settings menu on smartphone operating systems.\nThe IMEI number is used by a GSM network to identify valid devices and therefore can be used for stopping a stolen phone from accessing that network. For example, if a mobile phone is stolen, the owner can call their network provider and instruct them to \"blacklist\" the phone using its IMEI number. This renders the phone useless on that network and sometimes other networks too, whether or not the phone's SIM is changed.\nThe IMEI is only used for identifying the device and has no permanent or semi-permanent relation to the subscriber. Instead, the subscriber is identified by transmission of an IMSI number, which is stored on a SIM card that can (in theory) be transferred to any handset. However, many network and security features are enabled by knowing the current device being used by a subscriber.\n\n\nMany countries have acknowledged the use of the IMEI in reducing the effect of mobile phone thefts. For example, in the United Kingdom, under the Mobile Telephones (Re-programming) Act, changing the IMEI of a phone, or possessing equipment that can change it, is considered an offence under some circumstance.[4][5]\nIMEI blocking is not the only approach available for combating phone theft. For example, mobile operators in Singapore are not required by the regulator to implement phone blocking or tracing systems, IMEI-based or other. The regulator has expressed its doubts on the real effectiveness of this kind of system in the context of the mobile market in Singapore. Instead, mobile operators are encouraged to take measures such as the immediate suspension of service and the replacement of SIM cards in case of loss or theft.[6]\nThere is a misunderstanding amongst some regulators that the existence of a formally allocated IMEI number range for a GSM terminal implies that the terminal is approved or complies with regulatory requirements. This is not the case. The linkage between regulatory approval and IMEI allocation was removed in April 2000, with the introduction of the European R&TTE Directive.[7] Since that date, IMEIs have been allocated by BABT (or one of several other regional administrators acting on behalf of the GSM Association) to legitimate GSM terminal manufacturers without the need to provide evidence of approval.\nWhen mobile equipment is stolen or lost, the owner can contact their local operator with a request that it should be blocked from the operator's network, and the operator can be expected to do so if required by law in the operator's jurisdiction. If the local operator possesses an Equipment Identity Register (EIR), it then may put the device IMEI into it, and can optionally communicate this to shared registries, such as the Central Equipment Identity Register (CEIR) which blacklists the device in switches of other operators that use the CEIR. With this blacklisting in place the device becomes unusable on any operator that uses the CEIR, making theft of mobile equipment a useless business proposition, unless for parts.\nThe IMEI number is not supposed to be easy to change, making the CEIR blacklisting effective. However, this is not always the case: a phone's IMEI may be easy to change with special tools. In addition, IMEI is an un-authenticated mobile identifier (as opposed to IMSI, which is routinely being authenticated by home and serving mobile networks.) Spoofed IMEI can thwart all efforts to track handsets, or target handsets for lawful intercept.[citation needed]\nAustralia was first to implement IMEI blocking across all GSM networks, in 2003.[8] In Australia the Electronic Information Exchange (EIE) Administration Node provide a blocked IMEI lookup service for Australian customers.[9]\nIn the UK, a voluntary charter operated by the mobile networks ensures that any operator's blacklisting of a handset is communicated to the CEIR and subsequently to all other networks. This ensures the handset will be unusable for calls quite quickly, at most within 48 hours.\nAll UK Police forces, including the Metropolitan Police Service actively check IMEI numbers of phones found involved in crime, against the National Mobile Property Register (NMPR). The NMPR draws its information from many property databases. One of the databases consulted is Immobilise,[10] which allows optional (and free) registration of devices by the public. Such registration ensures that a device coming into police possession may be easily reunited with its registered owner.\nIn New Zealand the NZ Telecommunications Forum Inc[11] provide a blocked IMEI lookup service for New Zealand consumers. The service allows up to three lookups per day[12] and checks against a database that is updated daily by the three major mobile network operators. A blocked IMEI cannot be connected to any of these three operators.\nIn some countries, such blacklisting is not customary. In 2012, major network companies in the United States, under government pressure, committed to introducing a blacklisting service, but it's not clear whether it will interoperate with the CEIR.[13][14] GSM carriers AT&T and T-Mobile began blocking newly reported IMEIs in November 2012.[15] Thefts reported prior to November 2012 were not added to the database.\nIt is unclear whether local barring of IMEI has any positive effect, as it may result in international smuggling of stolen phones.[16]\nIMEIs can sometimes be unlisted, depending on local arrangements. This would typically include quoting a password that was chosen at the time the blacklisting was applied.[citation needed]\nA target for lawful interception (wiretapping) can be specified by its IMEI number as well as IMSI and MSISDN.[citation needed]\nThe IMEI (15 decimal digits: 14 digits plus a check digit) or IMEISV (16 digits) includes information on the origin, model, and serial number of the device. The structure of the IMEI/SV is specified in 3GPP TS 23.003. The model and origin comprise the initial 8-digit portion of the IMEI/SV, known as the Type Allocation Code (TAC). The remainder of the IMEI is manufacturer-defined, with a Luhn check digit at the end. For the IMEI format prior to 2003, the GSMA guideline was to have this Check Digit always transmitted to the network as zero. This guideline seems to have disappeared for the format valid from 2003 and onwards.[17]\nAs of 2004[update], the format of the IMEI is AA-BBBBBB-CCCCCC-D, although it may not always be displayed this way. The IMEISV drops the Luhn check digit in favor of an additional two digits for the Software Version Number (SVN), making the format AA-BBBBBB-CCCCCC-EE\nPrior to 2002, the TAC was six digits long and was followed by a two-digit Final Assembly Code (FAC), which was a manufacturer-specific code indicating the location of the device's construction. From January 1, 2003 until that April 1, 2004, the FAC for all phones was 00. After April 1, 2004, the Final Assembly Code ceased to exist and the Type Allocation Code increased to eight digits in length.\nIn any of the above cases, the first two digits of the TAC are the Reporting Body Identifier, which identifies the GSMA-approved group that allocated the TAC. The RBI numbers are allocated by the Global Decimal Administrator. IMEI numbers being decimal allows them to be distinguished from an MEID, which is hexadecimal and always has 0xA0 or larger as its first two digits.\nFor example, the old style IMEI code 35-209900-176148-1 or IMEISV code 35-209900-176148-23 tells us the following:\nTAC: 35-2099 - issued by the BABT (code 35) with the allocation number 2099\nFAC: 00 - indicating the phone was made during the transition period when FACs were being removed.\nSNR: 176148 - uniquely identifying a unit of this model\nCD: 1 so it is a GSM Phase 2 or higher\nSVN: 23 - The \"software version number\" identifying the revision of the software installed on the phone. 99 is reserved.\nBy contrast, the new style IMEI code 49-015420-323751 has an 8-digit TAC of 49-015420.\nThe new CDMA Mobile Equipment Identifier (MEID) uses the same basic format as the IMEI.\nThe last number of the IMEI is a check digit calculated using the Luhn algorithm, as defined in the IMEI Allocation and Approval Guidelines:\nThe Check Digit shall be calculated according to Luhn formula (ISO/IEC 7812). (See GSM 02.16 / 3GPP 22.016). The Check Digit is a function of all other digits in the IMEI. The Software Version Number (SVN) of a mobile is not included in the calculation.\nThe purpose of the Check Digit is to help guard against the possibility of incorrect entries to the CEIR and EIR equipment.\nThe presentation of the Check Digit both electronically and in printed form on the label and packaging is very important. Logistics (using bar-code reader) and EIR/CEIR administration cannot use the Check Digit unless it is printed outside of the packaging, and on the ME IMEI/Type Accreditation label.\nThe check digit is not transmitted over the radio interface, nor is it stored in the EIR database at any point. Therefore, all references to the last three or six digits of an IMEI refer to the actual IMEI number, to which the check digit does not belong.\nThe check digit is validated in three steps:\nConversely, one can calculate the IMEI by choosing the check digit that would give a sum divisible by 10. For the example IMEI 49015420323751?,\nTo make the sum divisible by 10, we set ? = 8, so the IMEI is 490154203237518\nThe Broadband Global Area Network (BGAN), Iridium and Thuraya satellite phone networks all use IMEI numbers on their transceiver units as well as SIM cards in much the same way as GSM phones do. The Iridium 9601 modem relies solely on its IMEI number for identification and uses no SIM card; however, Iridium is a proprietary network and the device is incompatible with terrestrial GSM networks.", 
    "dbpedia_url": "http://dbpedia.org/resource/International_Mobile_Station_Equipment_Identity", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/International_Mobile_Station_Equipment_Identity\n"
}