{
    "about": "The International Workshops on Lattice QCD and Numerical Analysis first started in 1995. The aim is to bring together applied mathematicians and theoretical physicists as well as to stimulate the exchange of ideas between leading experts in the fields of Lattice QCD and numerical analysis. As the scale of computational resources available for lattice quantum field theory calculations steadily increases, the ambitions of practitioners has also kept pace in the desire for more realistic calculations of a widening variety of physical observables. Many numerical methods discussed at the workshops have been integrated into current large scale computations, generating ensembles of configurations with such a substantial reduction in overall cost per configuration that computational requirements are fairly balanced between configuration generation and measurement of observables.", 
    "name": "International Workshops On Lattice Qcd And Numerical Analysis", 
    "classification": "Numerical Analysis", 
    "full_text": "The International Workshops on Lattice QCD and Numerical Analysis first started in 1995. The aim is to bring together applied mathematicians and theoretical physicists as well as to stimulate the exchange of ideas between leading experts in the fields of Lattice QCD and numerical analysis. As the scale of computational resources available for lattice quantum field theory calculations steadily increases, the ambitions of practitioners has also kept pace in the desire for more realistic calculations of a widening variety of physical observables. Many numerical methods discussed at the workshops have been integrated into current large scale computations, generating ensembles of configurations with such a substantial reduction in overall cost per configuration that computational requirements are fairly balanced between configuration generation and measurement of observables.\n\n\nThe first workshop was held at the University of Kentucky in 1995. It brought together leading scientists from institutions such as The University of Kentucky, Oak Ridge National Laboratory, Wuppertal University and Fermilab. The diverse topics discussed include: A Chronological Inverter for the Dirac Matrix in HMC, An N*Log(N) Algorithm for Gravitational Forces and its Performances on Parallel Computers, QMRPACK and Applications, Experience with Various Iterative Solvers in Full QCD Simulations, Status of QCD Spectrum Calculations - Numerical and Computational Requirements, Exploiting Structure of the Wilson Fermion Matrix in Krylov Subspace Methods, Lanczos Methods, Large Scale Computations, and The PZ Method for Estimating Determinate Ratios, with Applications.\nAll the talks are available on the web at http://www.yale.edu/QCDNA/program95\nThe Second International Workshop on Lattice QCD and Numerical Analysis was held at the University of Wuppertal in Germany.\nThe Third Workshop continued and expanded the goals of the series. As computational technology became increasingly sophisticated and fast, the last four years in LQCD and NA saw many advances. This workshop held in Edinburgh, Scotland, in 2003. Many of the highlighted talks echoed the continued progress in the field.\nThe Fourth Workshop was held at Yale University this past spring, bringing together researchers involved with statistics, computation and programming, and Lattice QCD. Increased computing power has led to more indepth computational calculations, and more accuracy in the field. The topics discussed emphasized the progression and sophistication of Lattice QCD, and also the importance of mathematics and computing, demonstrating the cross disciplinary nature of the field. The main topics included: QCD simulations in the chiral regime, Hybrid Monte Carlo, Molecular Dynamics and Multigrid Evolution, Iterative solutions of large sparse linear systems, Eigenvalue solvers, Unbiased estimation of matrix functions, Generalized eigenvalues and matrix polynomials, and Exponential time series analysis (including Bayesian methods). All the talks given at this conference can be found in full on the web - at http://www.yale.edu/QCDNA/program07.\n", 
    "dbpedia_url": "http://dbpedia.org/resource/International_Workshops_on_Lattice_QCD_and_Numerical_Analysis", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/International_Workshops_on_Lattice_QCD_and_Numerical_Analysis\n"
}