{
    "about": "The International Standard Music Number or ISMN (ISO 10957) is a thirteen-character alphanumeric identifier for printed music developed by ISO. The original proposal for an ISMN was made by the UK Branch of IAML (International Association of Music Libraries, Archives and Documentation Centres), put forward by Alan Pope (Blackwell's Music Department, Oxford), Malcolm Lewis (music librarian in Nottingham) and Malcolm Jones (music librarian in Birmingham). A draft ISMN structure and application was presented at the 1987 IAML conference in Amsterdam, then after further discussions at the 1989 IAML conference in Oxford it was decided that the UK, French and German branches should, through their respective national standards bodies (BSI, AFNOR and DIN) file ISMN as an ISO work project. After meetings in Ottawa and Paris in 1993 the draft was finalized and published by ISO.[1]", 
    "name": "International Standard Music Number", 
    "classification": "Checksum Algorithms", 
    "full_text": "The International Standard Music Number or ISMN (ISO 10957) is a thirteen-character alphanumeric identifier for printed music developed by ISO. The original proposal for an ISMN was made by the UK Branch of IAML (International Association of Music Libraries, Archives and Documentation Centres), put forward by Alan Pope (Blackwell's Music Department, Oxford), Malcolm Lewis (music librarian in Nottingham) and Malcolm Jones (music librarian in Birmingham). A draft ISMN structure and application was presented at the 1987 IAML conference in Amsterdam, then after further discussions at the 1989 IAML conference in Oxford it was decided that the UK, French and German branches should, through their respective national standards bodies (BSI, AFNOR and DIN) file ISMN as an ISO work project. After meetings in Ottawa and Paris in 1993 the draft was finalized and published by ISO.[1]\nThe original format comprised four elements: a distinguishing prefix M, a publisher ID, an item ID, and a check digit, typically looking like M-2306-7118-7. From 1 January 2008 the ISMN was defined as a thirteen digit identifier beginning 979-0 where the zero replaced M in the old-style number. The resulting number is identical with its EAN-13 number as encoded in the item's barcode.[2]\nThe current format comprises four blocks: the prefix 979-0 reserved for ISMNs — at some future date they are expected to occupy the remainder of the 979 space which is shared with ISBNs, a block to identify the publisher, another to identify the item and one final check digit. The TC 46/SC 9 is responsible for the standard.\nA publication may be assigned both an ISBN and an ISMN. Unlike the ISBN, the ISMN does not segregate publishers by country.\n\n\nTo calculate the check digit, each digit of the ISMN is multiplied by a weight, alternating 1 and 3 left to right. These weighted digits are added together. The check digit is the integer between 0 and 9 that makes the sum a multiple of 10.\nFor instance, for the item with ISMN beginning 979-0-060-11561:\nAs 85 mod 10 = 5, the check digit is 10 - 5 = 5 and the full number is 979-0-060-11561-5.\nFor another example, Robert Fripp's collection of Guitar Craft scores has the ISMN 979-0-9016791-7-7.[3] Given first 12 digits 979-0-9016791-7, the ISMN algorithm evaluates\nwhich implies that the check digit is indeed 7 (because 123+7=130=13x10).\nFripp, Robert (2011). Pozzo, Horacio, ed. Seven Guitar Craft themes: Definitive scores for guitar ensemble. \"Original transcriptions by Curt Golden\", \"Layout scores and tablatures: Ariel Rzezak and Theo Morresi\" (First limited ed.). Partitas Music. ISMN 979-0-9016791-7-7. DGM Sku partitas001. ", 
    "dbpedia_url": "http://dbpedia.org/resource/International_Standard_Music_Number", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/International_Standard_Music_Number\n"
}