{
    "about": "Interior point methods (also referred to as barrier methods) are a certain class of algorithms that solves linear and nonlinear convex optimization problems.", 
    "name": "Interior Point Method", 
    "classification": "Optimization Algorithms And Methods", 
    "full_text": "Interior point methods (also referred to as barrier methods) are a certain class of algorithms that solves linear and nonlinear convex optimization problems.\nJohn von Neumann[1] suggested an interior point method of linear programming which was neither a polynomial time method nor an efficient method in practice. In fact, it turned out to be slower in practice compared to the simplex method which is commonly used in practice. In 1984, Narendra Karmarkar developed a method for linear programming called Karmarkar's algorithm which runs in probably polynomial time and is also very efficient in practice. It enabled solutions of linear programming problems which were beyond the capabilities of the simplex method. Contrary to the simplex method, it reaches a best solution by traversing the interior of the feasible region. The method can be generalized to convex programming based on a self-concordant barrier function used to encode the convex set.\nAny convex optimization problem can be transformed into minimizing (or maximizing) a linear function over a convex set by converting to the epigraph form.[2] The idea of encoding the feasible set using a barrier and designing barrier methods was studied by Anthony V. Fiacco, Garth P. McCormick, and others in the early 1960s. These ideas were mainly developed for general nonlinear programming, but they were later abandoned due to the presence of more competitive methods for this class of problems (e.g. sequential quadratic programming).\nYurii Nesterov and Arkadi Nemirovski came up with a special class of such barriers that can be used to encode any convex set. They guarantee that the number of iterations of the algorithm is bounded by a polynomial in the dimension and accuracy of the solution.[3]\nKarmarkar's breakthrough revitalized the study of interior point methods and barrier problems, showing that it was possible to create an algorithm for linear programming characterized by polynomial complexity and, moreover, that was competitive with the simplex method. Already Khachiyan's ellipsoid method was a polynomial time algorithm; however, it was too slow to be of practical interest.\nThe class of primal-dual path-following interior point methods is considered the most successful. Mehrotra's predictor-corrector algorithm provides the basis for most implementations of this class of methods.[4]\n\n\nThe primal-dual method's idea is easy to demonstrate for constrained nonlinear optimization. For simplicity consider the all-inequality version of a nonlinear optimization problem:\nThe logarithmic barrier function associated with (1) is\nHere \n\n\n\nμ\n\n\n{\\displaystyle \\mu }\n\n is a small positive scalar, sometimes called the \"barrier parameter\". As \n\n\n\nμ\n\n\n{\\displaystyle \\mu }\n\n converges to zero the minimum of \n\n\n\nB\n(\nx\n,\nμ\n)\n\n\n{\\displaystyle B(x,\\mu )}\n\n should converge to a solution of (1).\nThe barrier function gradient is\nwhere \n\n\n\ng\n\n\n{\\displaystyle g}\n\n is the gradient of the original function \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n and \n\n\n\n∇\n\nc\n\ni\n\n\n\n\n{\\displaystyle \\nabla c_{i}}\n\n is the gradient of \n\n\n\n\nc\n\ni\n\n\n\n\n{\\displaystyle c_{i}}\n\n.\nIn addition to the original (\"primal\") variable \n\n\n\nx\n\n\n{\\displaystyle x}\n\n we introduce a Lagrange multiplier inspired dual variable \n\n\n\nλ\n∈\n\n\nR\n\n\nm\n\n\n\n\n{\\displaystyle \\lambda \\in \\mathbb {R} ^{m}}\n\n\n(4) is sometimes called the \"perturbed complementarity\" condition, for its resemblance to \"complementary slackness\" in KKT conditions.\nWe try to find those \n\n\n\n(\n\nx\n\nμ\n\n\n,\n\nλ\n\nμ\n\n\n)\n\n\n{\\displaystyle (x_{\\mu },\\lambda _{\\mu })}\n\n for which the gradient of the barrier function is zero.\nApplying (4) to (3) we get an equation for the gradient:\nwhere the matrix \n\n\n\nA\n\n\n{\\displaystyle A}\n\n is the constraint \n\n\n\nc\n(\nx\n)\n\n\n{\\displaystyle c(x)}\n\n Jacobian.\nThe intuition behind (5) is that the gradient of \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n should lie in the subspace spanned by the constraints' gradients. The \"perturbed complementarity\" with small \n\n\n\nμ\n\n\n{\\displaystyle \\mu }\n\n (4) can be understood as the condition that the solution should either lie near the boundary \n\n\n\n\nc\n\ni\n\n\n(\nx\n)\n=\n0\n\n\n{\\displaystyle c_{i}(x)=0}\n\n or that the projection of the gradient \n\n\n\ng\n\n\n{\\displaystyle g}\n\n on the constraint component \n\n\n\n\nc\n\ni\n\n\n(\nx\n)\n\n\n{\\displaystyle c_{i}(x)}\n\n normal should be almost zero.\nApplying Newton's method to (4) and (5) we get an equation for \n\n\n\n(\nx\n,\nλ\n)\n\n\n{\\displaystyle (x,\\lambda )}\n\n update \n\n\n\n(\n\np\n\nx\n\n\n,\n\np\n\nλ\n\n\n)\n\n\n{\\displaystyle (p_{x},p_{\\lambda })}\n\n:\nwhere \n\n\n\nW\n\n\n{\\displaystyle W}\n\n is the Hessian matrix of \n\n\n\nB\n(\nx\n,\nμ\n)\n\n\n{\\displaystyle B(x,\\mu )}\n\n and \n\n\n\nΛ\n\n\n{\\displaystyle \\Lambda }\n\n is a diagonal matrix of \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n and \n\n\n\nC\n\n\n{\\displaystyle C}\n\n is a diagonal matrix where \n\n\n\n\nC\n\ni\ni\n\n\n\n\n{\\displaystyle C_{ii}}\n\n is \n\n\n\n\nc\n\ni\n\n\n(\nx\n)\n\n\n{\\displaystyle c_{i}(x)}\n\n.\nBecause of (1), (4) the condition\nshould be enforced at each step. This can be done by choosing appropriate \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n:", 
    "dbpedia_url": "http://dbpedia.org/resource/Interior_point_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Interior_point_method\n"
}