{
    "about": "In numerical analysis, inverse quadratic interpolation is a root-finding algorithm, meaning that it is an algorithm for solving equations of the form f(x) = 0. The idea is to use quadratic interpolation to approximate the inverse of f. This algorithm is rarely used on its own, but it is important because it forms part of the popular Brent's method.", 
    "name": "Inverse Quadratic Interpolation", 
    "classification": "Root-Finding Algorithms", 
    "full_text": "In numerical analysis, inverse quadratic interpolation is a root-finding algorithm, meaning that it is an algorithm for solving equations of the form f(x) = 0. The idea is to use quadratic interpolation to approximate the inverse of f. This algorithm is rarely used on its own, but it is important because it forms part of the popular Brent's method.\n\n\nThe inverse quadratic interpolation algorithm is defined by the recurrence relation\nwhere fk = f(xk). As can be seen from the recurrence relation, this method requires three initial values, x0, x1 and x2.\nWe use the three preceding iterates, xn−2, xn−1 and xn, with their function values, fn−2, fn−1 and fn. Applying the Lagrange interpolation formula to do quadratic interpolation on the inverse of f yields\nWe are looking for a root of f, so we substitute y = f(x) = 0 in the above equation and this results in the above recursion formula.\nThe asymptotic behaviour is very good: generally, the iterates xn converge fast to the root once they get close. However, performance is often quite poor if you do not start very close to the actual root. For instance, if by any chance two of the function values fn−2, fn−1 and fn coincide, the algorithm fails completely. Thus, inverse quadratic interpolation is seldom used as a stand-alone algorithm.\nThe order of this convergence is approximately 1.8 as can be proved by Secant Method analysis.\nAs noted in the introduction, inverse quadratic interpolation is used in Brent's method.\nInverse quadratic interpolation is also closely related to some other root-finding methods. Using linear interpolation instead of quadratic interpolation gives the secant method. Interpolating f instead of the inverse of f gives Muller's method.", 
    "dbpedia_url": "http://dbpedia.org/resource/Inverse_quadratic_interpolation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Inverse_quadratic_interpolation\n"
}