{
    "about": "Inverse kinematics refers to the use of the kinematics equations of a robot to determine the joint parameters that provide a desired position of the end-effector.[1] Specification of the movement of a robot so that its end-effector achieves a desired task is known as motion planning. Inverse kinematics transforms the motion plan into joint actuator trajectories for the robot.", 
    "name": "Inverse Kinematics", 
    "classification": "Computational Physics", 
    "full_text": "Inverse kinematics refers to the use of the kinematics equations of a robot to determine the joint parameters that provide a desired position of the end-effector.[1] Specification of the movement of a robot so that its end-effector achieves a desired task is known as motion planning. Inverse kinematics transforms the motion plan into joint actuator trajectories for the robot.\nThe movement of a kinematic chain whether it is a robot or an animated character is modeled by the kinematics equations of the chain. These equations define the configuration of the chain in terms of its joint parameters. Forward kinematics uses the joint parameters to compute the configuration of the chain, and inverse kinematics reverses this calculation to determine the joint parameters that achieves a desired configuration.[2][3][4]\nFor example, inverse kinematics formulas allow calculation of the joint parameters that position a robot arm to pick up a part. Similar formulas determine the positions of the skeleton of an animated character that is to move in a particular way.\n\n\nKinematic analysis is one of the first steps in the design of most industrial robots. Kinematic analysis allows the designer to obtain information on the position of each component within the mechanical system. This information is necessary for subsequent dynamic analysis along with control paths.\nInverse kinematics is an example of the kinematic analysis of a constrained system of rigid bodies, or kinematic chain. The kinematic equations of a robot can be used to define the loop equations of a complex articulated system. These loop equations are non-linear constraints on the configuration parameters of the system. The independent parameters in these equations are known as the degrees of freedom of the system.\nWhile analytical solutions to the inverse kinematics problem exist for a wide range of kinematic chains, computer modeling and animation tools often use Newton's method to solve the non-linear kinematics equations.\nOther applications of inverse kinematic algorithms include interactive manipulation, animation control and collision avoidance.\nInverse kinematics is important to game programming and 3D animation, where it is used to connect game characters physically to the world, such as feet landing firmly on top of terrain.\nAn animated figure is modeled with a skeleton of rigid segments connected with joints, called a kinematic chain. The kinematics equations of the figure define the relationship between the joint angles of the figure and its pose or configuration. The forward kinematic animation problem uses the kinematics equations to determine the pose given the joint angles. The inverse kinematics problem computes the joint angles for a desired pose of the figure.\nIt is often easier for computer-based designers, artists, and animators to define the spatial configuration of an assembly or figure by moving parts, or arms and legs, rather than directly manipulating joint angles. Therefore, inverse kinematics is used in computer-aided design systems to animate assemblies and by computer-based artists and animators to position figures and characters.\nThe assembly is modeled as rigid links connected by joints that are defined as mates, or geometric constraints. Movement of one element requires the computation of the joint angles for the other elements to maintain the joint constraints. For example, inverse kinematics allows an artist to move the hand of a 3D human model to a desired position and orientation and have an algorithm select the proper angles of the wrist, elbow, and shoulder joints. Successful implementation of computer animation usually also requires that the figure move within reasonable anthropomorphic limits.\nAn analytic solution to an inverse kinematics problem is a closed-form expression that takes the end-effector pose as input and gives joint positions as output, \n\n\n\nq\n=\nf\n(\nx\n)\n\n\n{\\displaystyle q=f(x)}\n\n. Analytical inverse kinematics solvers can be significantly faster than numerical solvers and provide more than one solution for a given end-effector pose.\nThe IKFast open-source program can solve for the complete analytical solutions of most common robot manipulators and generate C++ code for them. The generated solvers cover most degenerate cases and can finish in microseconds on recent computers.\nThere are many methods of modelling and solving inverse kinematics problems. The most flexible of these methods typically rely on iterative optimization to seek out an approximate solution, due to the difficulty of inverting the forward kinematics equation and the possibility of an empty solution space. The core idea behind several of these methods is to model the forward kinematics equation using a Taylor series expansion, which can be simpler to invert and solve than the original system.\nThe Jacobian inverse technique is a simple yet effective way of implementing inverse kinematics. Let there be \n\n\n\nm\n\n\n{\\displaystyle m}\n\n variables that govern the forward-kinematics equation, i.e. the position function. These variables may be joint angles, lengths, or other arbitrary real values. If the IK system lives in a 3-dimensional space, the position function can be viewed as a mapping \n\n\n\np\n(\nx\n)\n:\n\nℜ\n\nm\n\n\n→\n\nℜ\n\n3\n\n\n\n\n{\\displaystyle p(x):\\Re ^{m}\\rightarrow \\Re ^{3}}\n\n. Let \n\n\n\n\np\n\n0\n\n\n=\np\n(\n\nx\n\n0\n\n\n)\n\n\n{\\displaystyle p_{0}=p(x_{0})}\n\n give the initial position of the system, and\n\n\n\n\n\np\n\n1\n\n\n=\np\n(\n\nx\n\n0\n\n\n+\nΔ\nx\n)\n\n\n{\\displaystyle p_{1}=p(x_{0}+\\Delta x)}\n\n\nbe the goal position of the system. The Jacobian inverse technique iteratively computes an estimate of \n\n\n\nΔ\nx\n\n\n{\\displaystyle \\Delta x}\n\n that minimizes the error given by \n\n\n\n\n|\n\n\n|\n\np\n(\n\nx\n\n0\n\n\n+\nΔ\nx\n)\n−\n\np\n\n0\n\n\n\n|\n\n\n|\n\n\n\n{\\displaystyle ||p(x_{0}+\\Delta x)-p_{0}||}\n\n.\nFor small \n\n\n\nΔ\nx\n\n\n{\\displaystyle \\Delta x}\n\n-vectors, the series expansion of the position function gives:\n\n\n\n\np\n(\n\nx\n\n1\n\n\n)\n≈\np\n(\n\nx\n\n0\n\n\n)\n+\n\nJ\n\np\n\n\n(\n\nx\n\n0\n\n\n)\nΔ\nx\n\n\n{\\displaystyle p(x_{1})\\approx p(x_{0})+J_{p}(x_{0})\\Delta x}\n\n\nWhere \n\n\n\n\nJ\n\np\n\n\n(\n\nx\n\n0\n\n\n)\n\n\n{\\displaystyle J_{p}(x_{0})}\n\n is the (3 x m) Jacobian matrix of the position function at \n\n\n\n\nx\n\n0\n\n\n\n\n{\\displaystyle x_{0}}\n\n.\nNote that the (i, k)-th entry of the Jacobian matrix can be determined numerically:\n\n\n\n\n\n\n\n∂\n\np\n\ni\n\n\n\n\n∂\n\nx\n\nk\n\n\n\n\n\n≈\n\n\n\n\np\n\ni\n\n\n(\n\nx\n\n0\n,\nk\n\n\n+\nh\n)\n−\n\np\n\ni\n\n\n(\n\nx\n\n0\n\n\n)\n\nh\n\n\n\n\n{\\displaystyle {\\frac {\\partial p_{i}}{\\partial x_{k}}}\\approx {\\frac {p_{i}(x_{0,k}+h)-p_{i}(x_{0})}{h}}}\n\n\nWhere \n\n\n\n\np\n\ni\n\n\n(\nx\n)\n\n\n{\\displaystyle p_{i}(x)}\n\n gives the i-th component of the position function, \n\n\n\n\nx\n\n0\n,\nk\n\n\n+\nh\n\n\n{\\displaystyle x_{0,k}+h}\n\n is simply \n\n\n\n\nx\n\n0\n\n\n\n\n{\\displaystyle x_{0}}\n\n with a small delta added to its k-th component, and \n\n\n\nh\n\n\n{\\displaystyle h}\n\n is a reasonably small positive value.\nTaking the Moore-Penrose pseudoinverse of the Jacobian (computable using a singular value decomposition) and re-arranging terms results in:\n\n\n\n\nΔ\nx\n≈\n\nJ\n\np\n\n\n+\n\n\n(\n\nx\n\n0\n\n\n)\nΔ\np\n\n\n{\\displaystyle \\Delta x\\approx J_{p}^{+}(x_{0})\\Delta p}\n\n\nWhere \n\n\n\nΔ\np\n=\np\n(\n\nx\n\n0\n\n\n+\nΔ\nx\n)\n−\np\n(\n\nx\n\n0\n\n\n)\n\n\n{\\displaystyle \\Delta p=p(x_{0}+\\Delta x)-p(x_{0})}\n\n.\nApplying the inverse Jacobian method once will result in a very rough estimate of the desired \n\n\n\nΔ\nx\n\n\n{\\displaystyle \\Delta x}\n\n-vector. A line search should be used to scale this \n\n\n\nΔ\nx\n\n\n{\\displaystyle \\Delta x}\n\n to an acceptable value. The estimate for \n\n\n\nΔ\nx\n\n\n{\\displaystyle \\Delta x}\n\n can be improved via the following algorithm (known as the Newton-Raphson method):\n\n\n\n\nΔ\n\nx\n\nk\n+\n1\n\n\n=\n\nJ\n\np\n\n\n+\n\n\n(\n\nx\n\nk\n\n\n)\nΔ\n\np\n\nk\n\n\n\n\n{\\displaystyle \\Delta x_{k+1}=J_{p}^{+}(x_{k})\\Delta p_{k}}\n\n\nOnce some \n\n\n\nΔ\nx\n\n\n{\\displaystyle \\Delta x}\n\n-vector has caused the error to drop close to zero, the algorithm should terminate. Existing methods based on the Hessian matrix of the system have been reported to converge to desired \n\n\n\nΔ\nx\n\n\n{\\displaystyle \\Delta x}\n\n values using fewer iterations, though, in some cases more computational resources.", 
    "dbpedia_url": "http://dbpedia.org/resource/Inverse_kinematics", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Inverse_kinematics\n"
}