{
    "about": "In computer science and discrete mathematics a sequence has an inversion where two of its elements are out of their natural order.", 
    "name": "Inversion (Discrete Mathematics)", 
    "classification": "Sorting Algorithms", 
    "full_text": "In computer science and discrete mathematics a sequence has an inversion where two of its elements are out of their natural order.\n\n\nLet \n\n\n\nπ\n\n\n{\\displaystyle \\pi }\n\n be a permutation. If \n\n\n\ni\n<\nj\n\n\n{\\displaystyle i<j}\n\n and \n\n\n\nπ\n(\ni\n)\n>\nπ\n(\nj\n)\n\n\n{\\displaystyle \\pi (i)>\\pi (j)}\n\n, either the pair of places \n\n\n\n(\ni\n,\nj\n)\n\n\n{\\displaystyle (i,j)}\n\n[1][2] or the pair of elements \n\n\n\n\n\n(\n\n\nπ\n(\ni\n)\n,\nπ\n(\nj\n)\n\n\n)\n\n\n\n\n{\\displaystyle {\\bigl (}\\pi (i),\\pi (j){\\bigr )}}\n\n[3][4][5] is called an inversion of \n\n\n\nπ\n\n\n{\\displaystyle \\pi }\n\n.\nThe inversion is usually defined for permutations, but may also be defined for sequences:\nLet \n\n\n\nS\n\n\n{\\displaystyle S}\n\n be a sequence (or multiset permutation[6]). If \n\n\n\ni\n<\nj\n\n\n{\\displaystyle i<j}\n\n and \n\n\n\nS\n(\ni\n)\n>\nS\n(\nj\n)\n\n\n{\\displaystyle S(i)>S(j)}\n\n, either the pair of places \n\n\n\n(\ni\n,\nj\n)\n\n\n{\\displaystyle (i,j)}\n\n[6][7] or the pair of elements \n\n\n\n\n\n(\n\n\nS\n(\ni\n)\n,\nS\n(\nj\n)\n\n\n)\n\n\n\n\n{\\displaystyle {\\bigl (}S(i),S(j){\\bigr )}}\n\n[8] is called an inversion of \n\n\n\nS\n\n\n{\\displaystyle S}\n\n.\nFor sequences inversions according to the element-based definition are not unique, because different pairs of places may have the same pair of values.\nThe inversion set is the set of all inversions. A permutation's inversion set according to the place-based definition is that of the inverse permutation's inversion set according to the element-based definition, and vice versa,[9] just with the elements of the pairs exchanged.\nThe inversion number is the cardinality of inversion set. It is a common measure of the sortedness of a permutation[5] or sequence.[8]\nIt is the number of crossings in the arrow diagram of the permutation,[9] its Kendall tau distance from the identity permutation, and the sum of each of the inversion related vectors defined below.\nIt does not matter if the place-based or the element-based definition of inversion is used to define the inversion number, because a permutation and its inverse have the same number of inversions.\nOther measures of (pre-)sortedness include the minimum number of elements that can be deleted from the sequence to yield a fully sorted sequence, the number and lengths of sorted \"runs\" within the sequence, the Spearman footrule (sum of distances of each element from its sorted position), and the smallest number of exchanges needed to sort the sequence.[10] Standard comparison sorting algorithms can be adapted to compute the inversion number in time O(n log n).\nThree similar vectors are in use that condense the inversions of a permutation into a vector that uniquely determines it. They are often called inversion vector or Lehmer code. (A list of sources is found here.)\nThis article uses the term inversion vector (\n\n\n\nv\n\n\n{\\displaystyle v}\n\n) like Wolfram.[11] The remaining two vectors are sometimes called left and right inversion vector, but to avoid confusion with the inversion vector this article calls them left inversion count (\n\n\n\nl\n\n\n{\\displaystyle l}\n\n) and right inversion count (\n\n\n\nr\n\n\n{\\displaystyle r}\n\n). Interpreted as a factorial number the left inversion count gives the permutations reverse colexicographic,[12] and the right inversion count gives the lexicographic index.\nInversion vector \n\n\n\nv\n\n\n{\\displaystyle v}\n\n:\nWith the element-based definition \n\n\n\nv\n(\ni\n)\n\n\n{\\displaystyle v(i)}\n\n is the number of inversions whose smaller (right) component is \n\n\n\ni\n\n\n{\\displaystyle i}\n\n.[3]\nLeft inversion count \n\n\n\nl\n\n\n{\\displaystyle l}\n\n:\nWith the place-based definition \n\n\n\nl\n(\ni\n)\n\n\n{\\displaystyle l(i)}\n\n is the number of inversions whose bigger (right) component is \n\n\n\ni\n\n\n{\\displaystyle i}\n\n.\nRight inversion count \n\n\n\nr\n\n\n{\\displaystyle r}\n\n, often called Lehmer code:\nWith the place-based definition \n\n\n\nr\n(\ni\n)\n\n\n{\\displaystyle r(i)}\n\n is the number of inversions whose smaller (left) component is \n\n\n\ni\n\n\n{\\displaystyle i}\n\n.\nBoth \n\n\n\nv\n\n\n{\\displaystyle v}\n\n and \n\n\n\nr\n\n\n{\\displaystyle r}\n\n can be found with the help of a Rothe diagram, which is a permutation matrix with the 1s represented by dots, and an inversion (often represented by a cross) in every position that has a dot to the right and below it. \n\n\n\nr\n(\ni\n)\n\n\n{\\displaystyle r(i)}\n\n is the sum of inversions in row \n\n\n\ni\n\n\n{\\displaystyle i}\n\n of the Rothe diagram, while \n\n\n\nv\n(\ni\n)\n\n\n{\\displaystyle v(i)}\n\n is the sum of inversions in column \n\n\n\ni\n\n\n{\\displaystyle i}\n\n. The permutation matrix of the inverse is the transpose, therefore \n\n\n\nv\n\n\n{\\displaystyle v}\n\n of a permutation is \n\n\n\nr\n\n\n{\\displaystyle r}\n\n of its inverse, and vice versa.\nThe following sortable table shows the 24 permutations of four elements with their place-based inversion sets, inversion related vectors and inversion numbers. (The small columns are reflections of the columns next to them, and can be used to sort them in colexicographic order.)\nIt can be seen that \n\n\n\nv\n\n\n{\\displaystyle v}\n\n and \n\n\n\nl\n\n\n{\\displaystyle l}\n\n always have the same digits, and that \n\n\n\nl\n\n\n{\\displaystyle l}\n\n and \n\n\n\nr\n\n\n{\\displaystyle r}\n\n are both related to the place-based inversion set. The nontrivial elements of \n\n\n\nl\n\n\n{\\displaystyle l}\n\n are the sums of the descending diagonals of the shown triangle, and those of \n\n\n\nr\n\n\n{\\displaystyle r}\n\n are the sums of the of the ascending diagonals. (Pairs in descending diagonals have the right components 2, 3, 4 in common, while pairs in ascending diagonals have the left components 1, 2, 3 in common.)\nThe default order of the table is reverse colex order by \n\n\n\nπ\n\n\n{\\displaystyle \\pi }\n\n, which is the same as colex order by \n\n\n\nl\n\n\n{\\displaystyle l}\n\n. Lex order by \n\n\n\nπ\n\n\n{\\displaystyle \\pi }\n\n is the same as lex order by \n\n\n\nr\n\n\n{\\displaystyle r}\n\n.\nThe set of permutations on n items can be given the structure of a partial order, called the weak order of permutations, which forms a lattice.\nThe Hasse diagram of the inversion sets ordered by the subset relation forms the skeleton of a permutohedron.\nIf a permutation is assigned to each inversion set using the place-based definition, the resulting order of permutations is that of the permutohedron, where an edge corresponds to the swapping of two elements with consecutive values. This is the weak order of permutations. The identity is its minimum, and the permutation formed by reversing the identity is its maximum.\nIf a permutation were assigned to each inversion set using the element-based definition, the resulting order of permutations would be that of a Cayley graph, where an edge corresponds to the swapping of two elements on consecutive places. This Cayley graph of the symmetric group is similar to its permutohedron, but with each permutation replaced by its inverse.\nSequences in the OEIS:", 
    "dbpedia_url": "http://dbpedia.org/resource/Inversion_(discrete_mathematics)", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Inversion_(discrete_mathematics)\n"
}