{
    "about": "IOSO (Indirect Optimization on the basis of Self-Organization) is a multiobjective, multidimensional nonlinear optimization technology.", 
    "name": "Ioso", 
    "classification": "Optimization Algorithms And Methods", 
    "full_text": "IOSO (Indirect Optimization on the basis of Self-Organization) is a multiobjective, multidimensional nonlinear optimization technology.\n\n\nIOSO Technology is based on the response surface methodology approach. At each IOSO iteration the internally constructed response surface model for the objective is being optimized within the current search region. This step is followed by a direct call to the actual mathematical model of the system for the candidate optimal point obtained from optimizing internal response surface model. During IOSO operation, the information about the system behavior is stored for the points in the neighborhood of the extremum, so that the response surface model becomes more accurate for this search area. The following steps are internally taken while proceeding from one IOSO iteration to another:\nIOSO is based on the technology being developed for more than 20 years by Sigma Technology which grew out of IOSO Technology Center in 2001. Sigma Technology is headed by prof . Egorov I. N., CEO.\nIOSO is the name of the group of multidisciplinary design optimization software that runs on Microsoft Windows as well as on Unix/Linux OS and was developed by Sigma Technology. It is used to improve the performance of complex systems and technological processes and to develop new materials based on a search for their optimal parameters. IOSO is easily integrated with almost any computer aided engineering (CAE) tool.\nIOSO group of software consists of:\nIOSO NM is used to maximise or minimise system or object characteristics which can include the performance or cost of or loads on the object in question. The search for optimal values for object or system characteristics is carried out by means of optimal change to design, geometrical or other parameters of the object.\nIt is often necessary to select or co-ordinate management parameters for the system while it is in operation in order to achieve a certain effect during the operation of the system or to reduce the impact of some factors on the system.\nWhen the design process involves the use of any mathematical models of real-life objects, whether commercial or corporate, there is the problem of co-ordinating the experiment findings and model computation results. All models imply a set of unknown factors or constants. Searching for the optimal values thereof makes it possible to co-ordinate the experiment findings and model computation results.\nPractical application of the numerical optimization results is difficult because any complex technical system is a stochastic system and the characteristics of this system have probabilistic nature. We would like to emphasize that, speaking about the stochastic properties of a technical system within the frame of optimization tasks, we imply that the important parameters of any system are stochastically spread. Normally it occurs during the production stage despite of the up-to-date level of modern technology. Random deviations of the system parameters lead to a random change in system efficiency.\nAn efficiency extreme value, obtained during the optimization problem while solving in traditional (deterministic) approach, is simply a maximum attainable value and can be considered as just conventional optimum from the point of view of its practical realization. Thus, one can consider two different types of optimization criteria. One of them is an ideal efficiency which can be achieved under the conditions of absolutely precise practical replication of the system parameters under consideration. Other optimization criteria are of probabilistic nature. For example: mathematical expectation of the efficiency; the total probability of assuring preset constraints; variance of the efficiency and so on It is evident that the extreme of the one of these criteria doesn't guarantee the assurance of the high level of another one. Even more, these criteria may contradict to each other. Thus, in this case we have a multiobjective optimization problem.\nIOSO concept of robust design optimization and robust optimal control allows to determine the optimal practical solution that could be implemented with the high probability for the given technology level of the production plants. Many modern probabilistic approaches either employ the estimation of probabilistic efficiency criteria only at the stage of the analysis of obtaining deterministic solution, or use significantly simplified assessments of probabilistic criteria during optimization process. The distinctive feature of our approach is that during robust design optimization we solve the optimization problem involving direct stochastic formulation, where the estimation of probabilistic criteria is accomplished at each iteration. This procedure reliably produces fully robust optimal solution. High efficiency of the robust design optimization is provided by the capabilities of IOSO algorithms to solve stochastic optimization problems with large level of noise.\nApplication examples", 
    "dbpedia_url": "http://dbpedia.org/resource/IOSO", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/IOSO\n"
}