{
    "about": "ISO 6346 is an international standard covering the coding, identification and marking of intermodal (shipping) containers used within containerized intermodal freight transport. The standard establishes a visual identification system for every container that includes a unique serial number (with check digit), the owner, a country code, a size, type and equipment category as well as any operational marks. The standard is managed by the International Container Bureau (BIC).", 
    "name": "Iso 6346", 
    "classification": "Checksum Algorithms", 
    "full_text": "ISO 6346 is an international standard covering the coding, identification and marking of intermodal (shipping) containers used within containerized intermodal freight transport. The standard establishes a visual identification system for every container that includes a unique serial number (with check digit), the owner, a country code, a size, type and equipment category as well as any operational marks. The standard is managed by the International Container Bureau (BIC).\n\n\nExample of an ISO 6346 conform container number:\n\nThe owner code consists of three capital letters of the Latin alphabet to indicate the owner or principal operator of the container. Such code needs to be registered at the Bureau International des Conteneurs in Paris to ensure uniqueness worldwide.\nThe equipment category identifier consists of one of the following capital letters of the Latin alphabet:\nUnder the ISO code, then, only U, J, and Z are in use—the reefer container is identified by means of the size type code.\nThe serial number consists of 6 numeric digits, assigned by the owner or operator, uniquely identifying the container within that owner/operator's fleet.\nThe check digit consists of one numeric digit providing a means of validating the recording and transmission accuracies of the owner code and serial number.\nTo compute the check digit, the letters have to be converted to numbers. This is done in three steps:\nAn equivalent numerical value is assigned to each letter of the alphabet, beginning with 10 for the letter A (11 and multiples thereof are omitted):\nThe individual digits of the serial number keep their numeric value.\nEach of the numbers calculated in step 1 is multiplied by 2position, where position is the exponent to base 2. Position starts at 0, from left to right.\nThe following table shows the multiplication factors:\nIf the final difference is 10, then the check digit becomes 0. To ensure that this does not happen, the standard recommends that serial numbers should not be used which produce a final difference of 10; however, there are containers in the market which do not follow this recommendation, so handling this case has to be included if a check digit calculator is programmed.\nNotice that step (ii) to (v) is a calculation of the remainder found after division of (i) by 11. Most programming languages have a modulo operator for this. Attention should be paid on how it is working in the language chosen; i. e. if it is giving back the decimal rest or the integer rest in order to get proper results. 11 is used as divisor because a container number has 11 letters and digits in total. In step 1 the numbers 11, 22 and 33 are left out as they are multiples of the divisor.\nThe following are the algorithm in various programming languages:\nBelow is a code Snippet implementing the above algorithm in MATLAB validating string \"cid\":\nBelow is the Visual Basic (VBA) code to create a custom \"ISO6346Check\" function in Microsoft Excel (Alt + F11) that returns the correct check digit:\nBelow is Python (2.7) code to validate the string \"cid\":\nBelow is the Javascript code to create a custom \"ISO6346Check\":\nBelow is an Excel Formula to validate container number in Cell A1[citation needed]\nBelow is a shorter Excel formula for the same function (container number in cell A1):\nBelow is the PHP code to validate a container number:\nCode Sample (Java) Below is the Java code do validate a container number:\nBelow is a VFP codesample, adopted from the above VB sample\nBelow is an Eiffel code sample.\nBelow is a Select statement implementing the above algorithm in T-SQL for Microsoft SQL Server, validating column ContainerNumber on all rows of the dbo.Containers table:\nIn day-to-day business it happens that containers do appear which do not follow the ISO 6346 identification at all; however, they are fully CSC safety approved containers. Usually these are \"shippers owned\" containers, which means that they are not owned by the carrier but supplied by the cargo owners (shippers). They may have no registered owner code and no category identifier and have no check digit. It is advisable to follow ISO 6346 as the absence of a compliant identification code causes problems for both carriers and container terminals to correctly identify the equipment and properly deliver the cargo, because computer systems require ISO 6346 conformant naming and as such missing prefixes are invented. For example, YYYY at the carrier and XXXX at the terminal causes the equipment to mismatch. Moreover, since ISO 6346 identification has become a requirement in international Customs conventions (Customs Conventions on Containers and Istanbul Convention), many Customs Administrations have begun validating that containers are marked as per the standard.\nThe codes are compiled of the following elements:\nThe following is an overview of the most common codes:\nUse the below to calculate Size/Type of a less commonly used ISO 6346 containers:\nThe country code consists of two capital letters of the Latin alphabet as described in ISO 3166. It indicates the country where the code is registered not the nationality of the owner or operator of the container. The letters of the code shall not be less than 100 mm high.\nOperational marks are intended solely to convey information requested for the movement of containers or give visual warnings. They relate to\nThe following is a list of further freight container related ISO specifications, where not all have an article assigned yet (you can help improve Wikipedia and start one):", 
    "dbpedia_url": "http://dbpedia.org/resource/ISO_6346", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/ISO_6346\n"
}