{
    "about": "Isomap is a nonlinear dimensionality reduction method. It is one of several widely used low-dimensional embedding methods.[1] Isomap is used for computing a quasi-isometric, low-dimensional embedding of a set of high-dimensional data points. The algorithm provides a simple method for estimating the intrinsic geometry of a data manifold based on a rough estimate of each data point’s neighbors on the manifold. Isomap is highly efficient and generally applicable to a broad range of data sources and dimensionalities.", 
    "name": "Isomap", 
    "classification": "Computational Statistics", 
    "full_text": "Isomap is a nonlinear dimensionality reduction method. It is one of several widely used low-dimensional embedding methods.[1] Isomap is used for computing a quasi-isometric, low-dimensional embedding of a set of high-dimensional data points. The algorithm provides a simple method for estimating the intrinsic geometry of a data manifold based on a rough estimate of each data point’s neighbors on the manifold. Isomap is highly efficient and generally applicable to a broad range of data sources and dimensionalities.\n\n\nIsomap is one representative of isometric mapping methods, and extends metric multidimensional scaling (MDS) by incorporating the geodesic distances imposed by a weighted graph. To be specific, the classical scaling of metric MDS performs low-dimensional embedding based on the pairwise distance between data points, which is generally measured using straight-line Euclidean distance. Isomap is distinguished by its use of the geodesic distance induced by a neighborhood graph embedded in the classical scaling. This is done to incorporate manifold structure in the resulting embedding. Isomap defines the geodesic distance to be the sum of edge weights along the shortest path between two nodes (computed using Dijkstra's algorithm, for example). The top n eigenvectors of the geodesic distance matrix, represent the coordinates in the new n-dimensional Euclidean space.\nA very high-level description of Isomap algorithm is given below.\nThe connectivity of each data point in the neighborhood graph is defined as its nearest k Euclidean neighbors in the high-dimensional space. This step is vulnerable to \"short-circuit errors\" if k is too large with respect to the manifold structure or if noise in the data moves the points slightly off the manifold.[3] Even a single short-circuit error can alter many entries in the geodesic distance matrix, which in turn can lead to a drastically different (and incorrect) low-dimensional embedding. Conversely, if k is too small, the neighborhood graph may become too sparse to approximate geodesic paths accurately. But improvements have been made to this algorithm to make it work better for sparse and noisy data sets.[4]\nFollowing the connection between the classical scaling and PCA, metric MDS can be interpreted as kernel PCA. In a similar manner, the geodesic distance matrix in Isomap can be viewed as a kernel matrix. The doubly centered geodesic distance matrix K in Isomap is of the form\nwhere \n\n\n\n\nD\n\n2\n\n\n=\n\nD\n\ni\nj\n\n\n2\n\n\n:=\n(\n\nD\n\ni\nj\n\n\n\n)\n\n2\n\n\n\n\n{\\displaystyle D^{2}=D_{ij}^{2}:=(D_{ij})^{2}}\n\n is the elementwise square of the geodesic distance matrix D = [Dij], H is the centering matrix, given by\nHowever, the kernel matrix K is not always positive semidefinite. The main idea for kernel Isomap is to make this K as a Mercer kernel matrix (that is positive semidefinite) using a constant-shifting method, in order to relate it to kernel PCA such that the generalization property naturally emerges .[5]", 
    "dbpedia_url": "http://dbpedia.org/resource/Isomap", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Isomap\n"
}