{
    "about": "The iterative proportional fitting procedure (IPFP, also known as biproportional fitting in statistics, RAS algorithm[1] in economics and matrix raking or matrix scaling in computer science) is an iterative algorithm for estimating cell values of a contingency table such that the marginal totals remain fixed and the estimated table decomposes into an outer product.", 
    "name": "Iterative Proportional Fitting", 
    "classification": "Statistical Algorithms", 
    "full_text": "The iterative proportional fitting procedure (IPFP, also known as biproportional fitting in statistics, RAS algorithm[1] in economics and matrix raking or matrix scaling in computer science) is an iterative algorithm for estimating cell values of a contingency table such that the marginal totals remain fixed and the estimated table decomposes into an outer product.\nIPF is a method that has been \"re-invented\" many times, e.g. G.U. Yule in 1912[2] in relation to standardizing cross-tabulations and Kruithof in 1937 [3] [4] in relation to telephone traffic (\"Kruithof’s double factor method\") , and expanded upon by Deming and Stephan in 1940[5] (they proposed IPFP as an algorithm leading to a minimizer of the Pearson X-squared statistic, which it does not,[6] and even failed to prove convergence), it has seen various extensions and related research. A rigorous proof of convergence by means of differential geometry is due to Fienberg (1970).[7] He interpreted the family of contingency tables of constant crossproduct ratios as a particular (IJ − 1)-dimensional manifold of constant interaction and showed that the IPFP is a fixed-point iteration on that manifold. Nevertheless, he assumed strictly positive observations. Generalization to tables with zero entries is still considered a hard and only partly solved problem.\nAn exhaustive treatment of the algorithm and its mathematical foundations can be found in the book of Bishop et al. (1975).[8] The first general proof of convergence, built on non-trivial measure theoretic theorems and entropy minimization, is due to Csiszár (1975).[9] Relatively new results on convergence and error behavior have been published by Pukelsheim and Simeone (2009) .[10] They proved simple necessary and sufficient conditions for the convergence of the IPFP for arbitrary two-way tables (i.e. tables with zero entries) by analysing an \n\n\n\n\nL\n\n1\n\n\n\n\n{\\displaystyle L_{1}}\n\n-error function.\nOther general algorithms can be modified to yield the same limit as the IPFP, for instance the Newton–Raphson method and the EM algorithm. In most cases, IPFP is preferred due to its computational speed, numerical stability and algebraic simplicity.\n\n\nGiven a two-way (I × J)-table of counts \n\n\n\n(\n\nx\n\ni\nj\n\n\n)\n\n\n{\\displaystyle (x_{ij})}\n\n, where the cell values are assumed to be Poisson or multinomially distributed, we wish to estimate a decomposition \n\n\n\n\n\n\n\nm\n^\n\n\n\n\ni\nj\n\n\n=\n\na\n\ni\n\n\n\nb\n\nj\n\n\n\n\n{\\displaystyle {\\hat {m}}_{ij}=a_{i}b_{j}}\n\n for all i and j such that \n\n\n\n(\n\n\n\n\nm\n^\n\n\n\n\ni\nj\n\n\n)\n\n\n{\\displaystyle ({\\hat {m}}_{ij})}\n\n is the maximum likelihood estimate (MLE) of the expected values \n\n\n\n(\n\nm\n\ni\nj\n\n\n)\n\n\n{\\displaystyle (m_{ij})}\n\n leaving the marginals \n\n\n\n\n\nx\n\ni\n+\n\n\n=\n\n∑\n\nj\n\n\n\nx\n\ni\nj\n\n\n\n\n\n\n{\\displaystyle \\textstyle x_{i+}=\\sum _{j}x_{ij}\\,}\n\n and \n\n\n\n\n\nx\n\n+\nj\n\n\n=\n\n∑\n\ni\n\n\n\nx\n\ni\nj\n\n\n\n\n\n\n{\\displaystyle \\textstyle x_{+j}=\\sum _{i}x_{ij}\\,}\n\n fixed. The assumption that the table factorizes in such a manner is known as the model of independence (I-model). Written in terms of a log-linear model, we can write this assumption as \n\n\n\nlog\n⁡\n \n\nm\n\ni\nj\n\n\n=\nu\n+\n\nv\n\ni\n\n\n+\n\nw\n\nj\n\n\n+\n\nz\n\ni\nj\n\n\n\n\n{\\displaystyle \\log \\ m_{ij}=u+v_{i}+w_{j}+z_{ij}}\n\n, where \n\n\n\n\nm\n\ni\nj\n\n\n:=\n\nE\n\n(\n\nx\n\ni\nj\n\n\n)\n\n\n{\\displaystyle m_{ij}:=\\mathbb {E} (x_{ij})}\n\n, \n\n\n\n\n∑\n\ni\n\n\n\nv\n\ni\n\n\n=\n\n∑\n\nj\n\n\n\nw\n\nj\n\n\n=\n0\n\n\n{\\displaystyle \\sum _{i}v_{i}=\\sum _{j}w_{j}=0}\n\n and the interaction term vanishes, that is \n\n\n\n\nz\n\ni\nj\n\n\n=\n0\n\n\n{\\displaystyle z_{ij}=0}\n\n for all i and j.\nChoose initial values \n\n\n\n\n\n\n\nm\n^\n\n\n\n\ni\nj\n\n\n(\n0\n)\n\n\n:=\n1\n\n\n{\\displaystyle {\\hat {m}}_{ij}^{(0)}:=1}\n\n (different choices of initial values may lead to changes in convergence behavior), and for \n\n\n\nη\n≥\n1\n\n\n{\\displaystyle \\eta \\geq 1}\n\n set\nNotes:\nAssume the same setting as in the classical IPFP. Alternatively, we can estimate the row and column factors separately: Choose initial values \n\n\n\n\n\n\n\nb\n^\n\n\n\n\nj\n\n\n(\n0\n)\n\n\n:=\n1\n\n\n{\\displaystyle {\\hat {b}}_{j}^{(0)}:=1}\n\n, and for \n\n\n\nη\n≥\n1\n\n\n{\\displaystyle \\eta \\geq 1}\n\n set\nSetting \n\n\n\n\n\n\n\nm\n^\n\n\n\n\ni\nj\n\n\n(\n2\nη\n)\n\n\n=\n\n\n\n\na\n^\n\n\n\n\ni\n\n\n(\nη\n)\n\n\n\n\n\n\nb\n^\n\n\n\n\nj\n\n\n(\nη\n)\n\n\n\n\n{\\displaystyle {\\hat {m}}_{ij}^{(2\\eta )}={\\hat {a}}_{i}^{(\\eta )}{\\hat {b}}_{j}^{(\\eta )}}\n\n, the two variants of the algorithm are mathematically equivalent (can be seen by formal induction).\nNotes:\nObviously, the I-model is a particular case of the Q-model.\nThe Problem: Let \n\n\n\nM\n:=\n(\n\nm\n\ni\nj\n\n\n(\n0\n)\n\n\n)\n∈\n\n\nR\n\n\nI\n×\nJ\n\n\n\n\n{\\displaystyle M:=(m_{ij}^{(0)})\\in \\mathbb {R} ^{I\\times J}}\n\n be the initial matrix with nonnegative entries, \n\n\n\nu\n∈\n\n\nR\n\n\nI\n\n\n\n\n{\\displaystyle u\\in \\mathbb {R} ^{I}}\n\n a vector of specified row marginals (e.i. row sums) and \n\n\n\nv\n∈\n\n\nR\n\n\nJ\n\n\n\n\n{\\displaystyle v\\in \\mathbb {R} ^{J}}\n\n a vector of column marginals. We wish to compute a matrix \n\n\n\n\n\n\nM\n^\n\n\n\n=\n(\n\n\n\n\nm\n^\n\n\n\n\ni\nj\n\n\n)\n∈\n\n\nR\n\n\nI\n×\nJ\n\n\n\n\n{\\displaystyle {\\hat {M}}=({\\hat {m}}_{ij})\\in \\mathbb {R} ^{I\\times J}}\n\n similar to M and consistent with the predefined marginals, meaning\nand\nDefine the diagonalization operator \n\n\n\nd\ni\na\ng\n:\n\n\nR\n\n\nk\n\n\n⟶\n\n\nR\n\n\nk\n×\nk\n\n\n\n\n{\\displaystyle diag:\\mathbb {R} ^{k}\\longrightarrow \\mathbb {R} ^{k\\times k}}\n\n, which produces a (diagonal) matrix with its input vector on the main diagonal and zero elsewhere. Then, for \n\n\n\nη\n≥\n0\n\n\n{\\displaystyle \\eta \\geq 0}\n\n, set\nwhere\nFinally, we obtain \n\n\n\n\n\n\nM\n^\n\n\n\n=\n\nlim\n\nη\n→\n∞\n\n\n\nM\n\n(\nη\n)\n\n\n.\n\n\n{\\displaystyle {\\hat {M}}=\\lim _{\\eta \\rightarrow \\infty }M^{(\\eta )}.}\n\n\nAlthough RAS seems to be the solution of an entirely different problem, it is indeed identical to the classical IPFP. In practice, one would not implement actual matrix multiplication, since diagonal matrices are involved. Reducing the operations to the necessary ones, it can easily be seen that RAS does the same as IPFP. The vaguely demanded 'similarity' can be explained as follows: IPFP (and thus RAS) maintains the crossproduct ratios, e.i.\nsince \n\n\n\n\nm\n\ni\nj\n\n\n(\nη\n)\n\n\n=\n\na\n\ni\n\n\n(\nη\n)\n\n\n\nb\n\nj\n\n\n(\nη\n)\n\n\n.\n\n\n{\\displaystyle m_{ij}^{(\\eta )}=a_{i}^{(\\eta )}b_{j}^{(\\eta )}.}\n\n\nThis property is sometimes called structure conservation and directly leads to the geometrical interpretation of contingency tables and the proof of convergence in the seminal paper of Fienberg (1970).\nNevertheless, direct factor estimation (algorithm 2) is under all circumstances the best way to deal with IPF: Whereas classical IPFP needs\nelementary operations in each iteration step (including a row and a column fitting step), factor estimation needs only\noperations being at least one order in magnitude faster than classical IPFP.\nNecessary and sufficient conditions for the existence and uniqueness of MLEs are complicated in the general case (see[11]), but sufficient conditions for 2-dimensional tables are simple:\nIf unique MLEs exist, IPFP exhibits linear convergence in the worst case (Fienberg 1970), but exponential convergence has also been observed (Pukelsheim and Simeone 2009). If a direct estimator (i.e. a closed form of \n\n\n\n(\n\n\n\n\nm\n^\n\n\n\n\ni\nj\n\n\n)\n\n\n{\\displaystyle ({\\hat {m}}_{ij})}\n\n) exists, IPFP converges after 2 iterations. If unique MLEs do not exist, IPFP converges toward the so-called extended MLEs by design (Haberman 1974), but convergence may be arbitrarily slow and often computationally infeasible.\nIf all observed values are strictly positive, existence and uniqueness of MLEs and therefore convergence is ensured.\nChecking if the assumption of independence is adequate, one uses the Pearson X-squared statistic\nor alternatively the likelihood-ratio test (G-test) statistic\nBoth statistics are asymptotically \n\n\n\n\n\nX\n\n\nr\n\n\n2\n\n\n\n\n{\\displaystyle \\mathrm {X} _{r}^{2}}\n\n-distributed, where \n\n\n\nr\n=\n(\nI\n−\n1\n)\n(\nJ\n−\n1\n)\n\n\n{\\displaystyle r=(I-1)(J-1)}\n\n is the number of degrees of freedom. That is, if the p-values \n\n\n\n1\n−\n\n\nX\n\n\nr\n\n\n2\n\n\n(\n\nX\n\n2\n\n\n)\n\n\n{\\displaystyle 1-\\mathrm {X} _{r}^{2}(X^{2})}\n\n and \n\n\n\n1\n−\n\n\nX\n\n\nr\n\n\n2\n\n\n(\nG\n)\n\n\n{\\displaystyle 1-\\mathrm {X} _{r}^{2}(G)}\n\n are not too small (> 0.05 for instance), there is no indication to discard the hypothesis of independence.\nIf the rows correspond to different values of property A, and the columns correspond to different values of property B, and the hypothesis of independence is not discarded, the properties A and B are considered independent.\nConsider a table of observations (taken from the entry on contingency tables):\nFor executing the classical IPFP, we first initialize the matrix with ones, leaving the marginals untouched:\nOf course, the marginal sums do not correspond to the matrix anymore, but this is fixed in the next two iterations of IPFP. The first iteration deals with the row sums:\nNote that, by definition, the row sums always constitute a perfect match after odd iterations, as do the column sums for even ones. The subsequent iteration updates the matrix column-wise:\nNow, both row and column sums of the matrix match the given marginals again.\nThe p-value of this matrix approximates to \n\n\n\np\n(\n\nX\n\n2\n\n\n)\n≈\n0.1824671\n\n\n{\\displaystyle p(X^{2})\\approx 0.1824671}\n\n, meaning: gender and left-handedness/right-handedness can be considered independent.\nThe R package mipfp (currently in version 3.1) provides a multi-dimensional implementation of the traditional iterative proportional fitting procedure.[12] The package allows the updating of a N-dimensional array with respect to given target marginal distributions (which, in turn can be multi-dimensional).\nPython has an equivalent package, ipfn[13][14] that can be installed via pip. The package supports numpy and pandas input objects.", 
    "dbpedia_url": "http://dbpedia.org/resource/Iterative_proportional_fitting", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Iterative_proportional_fitting\n"
}