{
    "about": "In mathematics, a Janet basis is a normal form for systems of linear homogeneous partial differential equations (PDEs) that removes the inherent arbitrariness of any such system. It was introduced in 1920 by Maurice Janet.[1] It was first called the Janet basis by Fritz Schwarz in 1998.[2]", 
    "name": "Janet Basis", 
    "classification": "Computer Algebra", 
    "full_text": "In mathematics, a Janet basis is a normal form for systems of linear homogeneous partial differential equations (PDEs) that removes the inherent arbitrariness of any such system. It was introduced in 1920 by Maurice Janet.[1] It was first called the Janet basis by Fritz Schwarz in 1998.[2]\nThe left hand sides of such systems of equations may be considered as differential polynomials of a ring, and Janet's normal form as a special basis of the ideal that they generate. By abuse of language, this terminology will be applied both to the original system and the ideal of differential polynomials generated by the left hand sides. A Janet basis is the predecessor of a Groebner basis introduced by Bruno Buchberger[3] for polynomial ideals. In order to generate a Janet basis for any given system of linear pde's a ranking of its derivatives must be provided; then the corresponding Janet basis is unique. If a system of linear pde's is given in terms of a Janet basis its differential dimension may easily be determined; it is a measure for the degree of indeterminacy of its general solution. In order to generate a Loewy decomposition of a system of linear pde's its Janet basis must be determined first.\nAny system of linear homogeneous pde's is highly non-unique, e.g. an arbitrary linear combination of its elements may be added to the system without changing its solution set. A priori it is not known whether it has any nontrivial solutions. More generally, the degree of arbitrariness of its general solution is not known, i.e. how many undetermined constants or functions it may contain. These questions were the starting point of Janet's work; he considered systems of linear pde's in any number of dependent and independent variables and generated a normal form for them. Here mainly linear pde's in the plane with the coordinates \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\ny\n\n\n{\\displaystyle y}\n\n will be considered; the number of unknown functions is one or two. Most results described here may be generalized in an obvious way to any number of variables or functions.[4][5][6] In order to generate a unique representation for a given system of linear pde's, at first a ranking of its derivatives must be defined.\nDefinition A ranking of derivatives is a total ordering such that for any two derivatives \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n, \n\n\n\n\nδ\n\n1\n\n\n\n\n{\\displaystyle \\delta _{1}}\n\n and \n\n\n\n\nδ\n\n2\n\n\n\n\n{\\displaystyle \\delta _{2}}\n\n, and any derivation operator \n\n\n\nθ\n\n\n{\\displaystyle \\theta }\n\n the relations \n\n\n\nδ\n≤\nθ\nδ\n\n\n{\\displaystyle \\delta \\leq \\theta \\delta }\n\n and \n\n\n\n\nδ\n\n1\n\n\n≤\n\nδ\n\n2\n\n\n→\nδ\n\nδ\n\n1\n\n\n≤\nδ\n\nδ\n\n2\n\n\n\n\n{\\displaystyle \\delta _{1}\\leq \\delta _{2}\\rightarrow \\delta \\delta _{1}\\leq \\delta \\delta _{2}}\n\n are valid.\nA derivative \n\n\n\n\nδ\n\n2\n\n\n\n\n{\\displaystyle \\delta _{2}}\n\n is called higher than \n\n\n\n\nδ\n\n1\n\n\n\n\n{\\displaystyle \\delta _{1}}\n\n if \n\n\n\n\nδ\n\n2\n\n\n>\n\nδ\n\n1\n\n\n\n\n{\\displaystyle \\delta _{2}>\\delta _{1}}\n\n. The highest derivative in an equation is called its leading derivative. For the derivatives up to order two of a single function \n\n\n\nz\n\n\n{\\displaystyle z}\n\n depending on \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\ny\n\n\n{\\displaystyle y}\n\n with \n\n\n\nx\n>\ny\n\n\n{\\displaystyle x>y}\n\n two possible order are\nHere the usual notation \n\n\n\n\n∂\n\nx\n\n\nz\n=\n\nz\n\nx\n\n\n,\n\n∂\n\ny\n\n\nz\n=\n\nz\n\ny\n\n\n,\n…\n\n\n{\\displaystyle \\partial _{x}z=z_{x},\\partial _{y}z=z_{y},\\ldots }\n\n is used. If the number of functions is higher than one, these orderings have to be generalized appropriately, e.g. the orderings \n\n\n\nT\nO\nP\n\n\n{\\displaystyle TOP}\n\n or \n\n\n\nP\nO\nT\n\n\n{\\displaystyle POT}\n\n may be applied.[7] The first basic operation to be applied in generating a Janet basis is the reduction of an equation \n\n\n\n\ne\n\n1\n\n\n\n\n{\\displaystyle e_{1}}\n\n w.r.t. another one \n\n\n\n\ne\n\n2\n\n\n\n\n{\\displaystyle e_{2}}\n\n. In colloquial terms this means the following: Whenever a derivative of \n\n\n\n\ne\n\n1\n\n\n\n\n{\\displaystyle e_{1}}\n\n may be obtained from the leading derivative of \n\n\n\n\ne\n\n2\n\n\n\n\n{\\displaystyle e_{2}}\n\n by suitable differentiation, this differentiation is performed and the result is subtracted from \n\n\n\n\ne\n\n1\n\n\n\n\n{\\displaystyle e_{1}}\n\n. Reduction w.r.t. a system of pde's means reduction w.r.t. all elements of the system. A system of linear pde's is called autoreduced if all possible reductions have been performed.\nThe second basic operation for generating a Janet basis is the inclusion of integrability conditions. They are obtained as follows: If two equations \n\n\n\n\ne\n\n1\n\n\n\n\n{\\displaystyle e_{1}}\n\n and \n\n\n\n\ne\n\n2\n\n\n\n\n{\\displaystyle e_{2}}\n\n are such that by suitable differentiations two new equations may be obtained with like leading derivatives, by cross-multiplication with its leading coefficients and subtraction of the resulting equations a new equation is obtained, it is called an integrability condition. If by reduction w.r.t. the remaining equations of the system it does not vanish it is included as a new equation to the system.\nIt may be shown that repeating these operations always terminates after a finite number of steps with a unique answer which is called the Janet basis for the input system. Janet has organized them in terms of the following algorithm.\nJanet's Algorithm Given a system of linear differential polynomials \n\n\n\nS\n≡\n{\n\ne\n\n1\n\n\n,\n\ne\n\n2\n\n\n,\n…\n}\n\n\n{\\displaystyle S\\equiv \\{e_{1},e_{2},\\ldots \\}}\n\n, the Janet basis corresponding to \n\n\n\nS\n\n\n{\\displaystyle S}\n\n is returned.\nand determine the integrability conditions\nHere \n\n\n\nA\nu\nt\no\nr\ne\nd\nu\nc\ne\n\n\n{\\displaystyle Autoreduce}\n\n is a subalgorithm that returns its argument with all possible reductions performed, \n\n\n\nC\no\nm\np\nl\ne\nt\ni\no\nn\n\n\n{\\displaystyle Completion}\n\n adds certain equations to the system in order to facilitate determining the integrability conditions. To this end the variables are divides into multipliers and non-multipliers; details may be found in the above references. Upon successful termination a Janet basis for the input system will be returned.\nExample 1 Let the system \n\n\n\n{\n\ne\n\n1\n\n\n≡\n\nz\n\nx\ny\n\n\n−\n\n\n\nx\n\n2\n\n\n\ny\n\n2\n\n\n\n\n\nz\n\nx\n\n\n−\n\n\n\nx\n−\ny\n\n\ny\n\n2\n\n\n\n\nz\n=\n0\n,\n\ne\n\n2\n\n\n≡\n\nz\n\nx\n\n\n+\n\n\n1\nx\n\n\n\nz\n\ny\n\n\n+\nx\nz\n=\n0\n}\n\n\n{\\displaystyle \\{e_{1}\\equiv z_{xy}-{\\frac {x^{2}}{y^{2}}}z_{x}-{\\frac {x-y}{y^{2}}}z=0,e_{2}\\equiv z_{x}+{\\frac {1}{x}}z_{y}+xz=0\\}}\n\n be given with ordering \n\n\n\nG\nR\nL\nE\nX\n\n\n{\\displaystyle GRLEX}\n\n and \n\n\n\nx\n>\ny\n\n\n{\\displaystyle x>y}\n\n. Step S1 returns the autoreduced system\nSteps S3 and S4 generate the integrability condition \n\n\n\n\nc\n\n3\n,\n2\n\n\n≡\n\n\n\n∂\n\ne\n\n3\n\n\n\n\n∂\nx\n\n\n\n−\n\n\n\n\n∂\n\n2\n\n\n\ne\n\n2\n\n\n\n\n∂\n\ny\n\n2\n\n\n\n\n\n\n\n{\\displaystyle c_{3,2}\\equiv {\\frac {\\partial e_{3}}{\\partial x}}-{\\frac {\\partial ^{2}e_{2}}{\\partial y^{2}}}}\n\n and reduces it to \n\n\n\nz\n=\n0\n\n\n{\\displaystyle z=0}\n\n, i.e. the Janet basis for the originally given system is \n\n\n\n{\nz\n=\n0\n}\n\n\n{\\displaystyle \\{z=0\\}}\n\n with the trivial solution \n\n\n\nz\n=\n0\n\n\n{\\displaystyle z=0}\n\n.\nThe next example involves two unknown functions \n\n\n\nw\n\n\n{\\displaystyle w}\n\n and \n\n\n\nz\n\n\n{\\displaystyle z}\n\n, both depending on \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\ny\n\n\n{\\displaystyle y}\n\n.\nExample 2 Consider the system\nin \n\n\n\nG\nR\nL\nE\nX\n,\nw\n>\nz\n,\nx\n>\ny\n\n\n{\\displaystyle GRLEX,w>z,x>y}\n\n ordering. The system is already autoreduced, i.e. step S1 returns it unchanged. Step S3 generates the two integrability conditions\nUpon reduction in step S4 they are\nIn step S5 they are included into the system and the algorithms starts again with step S1 with the extended system. After a few more iterations finally the Janet basis\nis obtained. It yields the general solution \n\n\n\nz\n=\n\nC\n\n1\n\n\n−\n\nC\n\n2\n\n\nx\n,\nw\n=\n2\n\nC\n\n2\n\n\ny\n\n\n{\\displaystyle z=C_{1}-C_{2}x,w=2C_{2}y}\n\n with two undetermined constants \n\n\n\n\nC\n\n1\n\n\n\n\n{\\displaystyle C_{1}}\n\n and \n\n\n\n\nC\n\n2\n\n\n\n\n{\\displaystyle C_{2}}\n\n.\nJanet's algorithm has been implemented in Maple\nThe most important application of a Janet basis is its use for deciding the degree of indeterminacy of a system of linear homogeneous partial differential equations. The answer in the above Example 1 is that the system under consideration allows only the trivial solution. In the second Example 2 a two-dimensional solution space is obtained. In general, the answer may be more involved, there may be infinitely many free constants in the general solution; they may be obtained from the Loewy decomposition of the respective Janet basis.[9] Furthermore, the Janet basis of a module allows to read off a Janet basis for the syzygy module [5]", 
    "dbpedia_url": "http://dbpedia.org/resource/Janet_basis", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Janet_basis\n"
}