{
    "about": "Job shop scheduling (or job-shop problem) is an optimization problem in computer science and operations research in which ideal jobs are assigned to resources at particular times. The most basic version is as follows: We are given n jobs J1, J2, ..., Jn of varying processing times, which need to be scheduled on m machines with varying processing power, while trying to minimize the makespan. The makespan is the total length of the schedule (that is, when all the jobs have finished processing). In most practical settings, the problem is presented as an online problem (dynamic scheduling), that is, the decision of scheduling a job can only be made online, when the job is presented to the algorithm.", 
    "name": "Job Shop Scheduling", 
    "classification": "Optimization Algorithms And Methods", 
    "full_text": "Job shop scheduling (or job-shop problem) is an optimization problem in computer science and operations research in which ideal jobs are assigned to resources at particular times. The most basic version is as follows: We are given n jobs J1, J2, ..., Jn of varying processing times, which need to be scheduled on m machines with varying processing power, while trying to minimize the makespan. The makespan is the total length of the schedule (that is, when all the jobs have finished processing). In most practical settings, the problem is presented as an online problem (dynamic scheduling), that is, the decision of scheduling a job can only be made online, when the job is presented to the algorithm.\nThis problem is one of the best known combinatorial optimization problems, and was the first problem for which competitive analysis was presented, by Graham in 1966.[1] Best problem instances for basic model with makespan objective are due to Taillard.[2]\n\n\nMany variations of the problem exist, including the following:\nSince the travelling salesman problem is NP-hard, the job-shop problem with sequence-dependent setup is clearly also NP-hard, since the TSP is a special case of the JSP with \n\n\n\nm\n=\n1\n\n\n{\\displaystyle m=1}\n\n (the salesman is the machine and the cities are the jobs).\nThe disjunctive graph [4] is one of the popular models used for describing the job shop scheduling problem instances.[5]\nA mathematical statement of the problem can be made as follows:\nLet \n\n\n\nM\n=\n{\n\nM\n\n1\n\n\n,\n\nM\n\n2\n\n\n,\n…\n,\n\nM\n\nm\n\n\n}\n\n\n{\\displaystyle M=\\{M_{1},M_{2},\\dots ,M_{m}\\}}\n\n and \n\n\n\nJ\n=\n{\n\nJ\n\n1\n\n\n,\n\nJ\n\n2\n\n\n,\n…\n,\n\nJ\n\nn\n\n\n}\n\n\n{\\displaystyle J=\\{J_{1},J_{2},\\dots ,J_{n}\\}}\n\n be two finite sets. On account of the industrial origins of the problem, the \n\n\n\n\n\nM\n\ni\n\n\n\n\n\n{\\displaystyle \\displaystyle M_{i}}\n\n are called machines and the \n\n\n\n\n\nJ\n\nj\n\n\n\n\n\n{\\displaystyle \\displaystyle J_{j}}\n\n are called jobs.\nLet \n\n\n\n\n \n\n\nX\n\n\n\n\n\n{\\displaystyle \\displaystyle \\ {\\mathcal {X}}}\n\n denote the set of all sequential assignments of jobs to machines, such that every job is done by every machine exactly once; elements \n\n\n\nx\n∈\n\n\nX\n\n\n\n\n{\\displaystyle x\\in {\\mathcal {X}}}\n\n may be written as \n\n\n\nn\n×\nm\n\n\n{\\displaystyle n\\times m}\n\n matrices, in which column \n\n\n\n\ni\n\n\n\n{\\displaystyle \\displaystyle i}\n\n lists the jobs that machine \n\n\n\n\n\nM\n\ni\n\n\n\n\n\n{\\displaystyle \\displaystyle M_{i}}\n\n will do, in order. For example, the matrix\nmeans that machine \n\n\n\n\n\nM\n\n1\n\n\n\n\n\n{\\displaystyle \\displaystyle M_{1}}\n\n will do the three jobs \n\n\n\n\n\nJ\n\n1\n\n\n,\n\nJ\n\n2\n\n\n,\n\nJ\n\n3\n\n\n\n\n\n{\\displaystyle \\displaystyle J_{1},J_{2},J_{3}}\n\n in the order \n\n\n\n\n\nJ\n\n1\n\n\n,\n\nJ\n\n2\n\n\n,\n\nJ\n\n3\n\n\n\n\n\n{\\displaystyle \\displaystyle J_{1},J_{2},J_{3}}\n\n, while machine \n\n\n\n\n\nM\n\n2\n\n\n\n\n\n{\\displaystyle \\displaystyle M_{2}}\n\n will do the jobs in the order \n\n\n\n\n\nJ\n\n2\n\n\n,\n\nJ\n\n3\n\n\n,\n\nJ\n\n1\n\n\n\n\n\n{\\displaystyle \\displaystyle J_{2},J_{3},J_{1}}\n\n.\nSuppose also that there is some cost function \n\n\n\nC\n:\n\n\nX\n\n\n→\n[\n0\n,\n+\n∞\n]\n\n\n{\\displaystyle C:{\\mathcal {X}}\\to [0,+\\infty ]}\n\n. The cost function may be interpreted as a \"total processing time\", and may have some expression in terms of times \n\n\n\n\nC\n\ni\nj\n\n\n:\nM\n×\nJ\n→\n[\n0\n,\n+\n∞\n]\n\n\n{\\displaystyle C_{ij}:M\\times J\\to [0,+\\infty ]}\n\n, the cost/time for machine \n\n\n\n\n\nM\n\ni\n\n\n\n\n\n{\\displaystyle \\displaystyle M_{i}}\n\n to do job \n\n\n\n\n\nJ\n\nj\n\n\n\n\n\n{\\displaystyle \\displaystyle J_{j}}\n\n.\nThe job-shop problem is to find an assignment of jobs \n\n\n\nx\n∈\n\n\nX\n\n\n\n\n{\\displaystyle x\\in {\\mathcal {X}}}\n\n such that \n\n\n\n\nC\n(\nx\n)\n\n\n\n{\\displaystyle \\displaystyle C(x)}\n\n is a minimum, that is, there is no \n\n\n\ny\n∈\n\n\nX\n\n\n\n\n{\\displaystyle y\\in {\\mathcal {X}}}\n\n such that \n\n\n\n\nC\n(\nx\n)\n>\nC\n(\ny\n)\n\n\n\n{\\displaystyle \\displaystyle C(x)>C(y)}\n\n.\nScheduling efficiency can be defined for a schedule through the ratio of total machine idle time to the total processing time as below:\n\n\n\n\n\nC\n′\n\n=\n1\n+\n\n\n\n\n∑\n\ni\n\n\n\nl\n\ni\n\n\n\n\n\n∑\n\nj\n,\nk\n\n\n\np\n\nj\nk\n\n\n\n\n\n=\n\n\n\nC\n.\nm\n\n\n\n∑\n\nj\n,\nk\n\n\n\np\n\nj\nk\n\n\n\n\n\n\n\n{\\displaystyle C'=1+{\\sum _{i}l_{i} \\over \\sum _{j,k}p_{jk}}={C.m \\over \\sum _{j,k}p_{jk}}}\n\n\nHere \n\n\n\n\nl\n\ni\n\n\n\n\n{\\displaystyle l_{i}}\n\n is the idle time of machine \n\n\n\ni\n\n\n{\\displaystyle i}\n\n, \n\n\n\nC\n\n\n{\\displaystyle C}\n\n is the makespan and \n\n\n\nm\n\n\n{\\displaystyle m}\n\n is the number of machines. Notice that with the above definition, scheduling efficiency is simply the makespan normalized to the number of machines and the total processing time. This makes it possible to compare the usage of resources across JSP instances of different size.[6]\nOne of the first problems that must be dealt with in the JSP is that many proposed solutions have infinite cost: i.e., there exists \n\n\n\n\nx\n\n∞\n\n\n∈\n\n\nX\n\n\n\n\n{\\displaystyle x_{\\infty }\\in {\\mathcal {X}}}\n\n such that \n\n\n\nC\n(\n\nx\n\n∞\n\n\n)\n=\n+\n∞\n\n\n{\\displaystyle C(x_{\\infty })=+\\infty }\n\n. In fact, it is quite simple to concoct examples of such \n\n\n\n\nx\n\n∞\n\n\n\n\n{\\displaystyle x_{\\infty }}\n\n by ensuring that two machines will deadlock, so that each waits for the output of the other's next step.\nGraham had already provided the List scheduling algorithm in 1966, which is (2 − 1/m)-competitive, where m is the number of machines.[1] Also, it was proved that List scheduling is optimum online algorithm for 2 and 3 machines. The Coffman–Graham algorithm (1972) for uniform-length jobs is also optimum for two machines, and is (2 − 2/m)-competitive.[7][8] In 1992, Bartal, Fiat, Karloff and Vohra presented an algorithm that is 1.986 competitive.[9] A 1.945-competitive algorithm was presented by Karger, Philips and Torng in 1994.[10] In 1992, Albers provided a different algorithm that is 1.923-competitive.[11] Currently, the best known result is an algorithm given by Fleischer and Wahl, which achieves a competitive ratio of 1.9201.[12]\nA lower bound of 1.852 was presented by Albers.[13] Taillard instances has an important role in developing job shop scheduling with makespan objective.\nIn 1976 Garey provided a proof[14] that this problem is NP-complete for m>2, that is, no optimal solution can be computed in polynomial time for three or more machines (unless P=NP).\nIn 2011 Xin Chen et al. provided optimal algorithms for online scheduling on two related machines[15] improving previous results.[16]\nThe simplest form of the offline makespan minimisation problem deals with atomic jobs, that is, jobs that are not subdivided into multiple operations. It is equivalent to packing a number of items of various different sizes into a fixed number of bins, such that the maximum bin size needed is as small as possible. (If instead the number of bins is to be minimised, and the bin size is fixed, the problem becomes a different problem, known as the bin packing problem.)\nDorit S. Hochbaum and David Shmoys presented a polynomial-time approximation scheme in 1987 that finds an approximate solution to the offline makespan minimisation problem with atomic jobs to any desired degree of accuracy.[17]\nThe basic form of the problem of scheduling jobs with multiple (M) operations, over M machines, such that all of the first operations must be done on the first machine, all of the second operations on the second, etc., and a single job cannot be performed in parallel, is known as the open shop scheduling problem. Various algorithms exist, including genetic algorithms.[18]\nA heuristic algorithm by S. M. Johnson can be used to solve the case of a 2 machine N job problem when all jobs are to be processed in the same order.[19] The steps of algorithm are as follows:\nJob Pi has two operations, of duration Pi1, Pi2, to be done on Machine M1, M2 in that sequence.\nIf the minimum belongs to Pk1,\nRemove K from list A; Add K to beginning of List L1.\nIf minimum belongs to Pk2,\nRemove K from list A; Add K to end of List L2.\nJohnson's method only works optimally for two machines. However, since it is optimal, and easy to compute, some researchers have tried to adopt it for M machines, (M > 2.)\nThe idea is as follows: Imagine that each job requires m operations in sequence, on M1, M2 … Mm. We combine the first m/2 machines into an (imaginary) Machining center, MC1, and the remaining Machines into a Machining Center MC2. Then the total processing time for a Job P on MC1 = sum( operation times on first m/2 machines), and processing time for Job P on MC2 = sum(operation times on last m/2 machines).\nBy doing so, we have reduced the m-Machine problem into a Two Machining center scheduling problem. We can solve this using Johnson's method.\nMachine learning has been recently used to predict the optimal makespan of a JSP instance without actually producing the optimal schedule.[6] Preliminary results show an accuracy of around 80% when supervised machine learning methods were applied to classify small randomly generated JSP instances based on their optimal scheduling efficiency compared to the average.\nHere is an example of a job shop scheduling problem formulated in AMPL as a mixed-integer programming problem with indicator constraints:", 
    "dbpedia_url": "http://dbpedia.org/resource/Job_shop_scheduling", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Job_shop_scheduling\n"
}