{
    "about": "Johnson's algorithm is a way to find the shortest paths between all pairs of vertices in a sparse, edge weighted, directed graph. It allows some of the edge weights to be negative numbers, but no negative-weight cycles may exist. It works by using the Bellman–Ford algorithm to compute a transformation of the input graph that removes all negative weights, allowing Dijkstra's algorithm to be used on the transformed graph.[1][2] It is named after Donald B. Johnson, who first published the technique in 1977.[3]", 
    "name": "Johnson'S Algorithm", 
    "classification": "Graph Algorithms", 
    "full_text": "Johnson's algorithm is a way to find the shortest paths between all pairs of vertices in a sparse, edge weighted, directed graph. It allows some of the edge weights to be negative numbers, but no negative-weight cycles may exist. It works by using the Bellman–Ford algorithm to compute a transformation of the input graph that removes all negative weights, allowing Dijkstra's algorithm to be used on the transformed graph.[1][2] It is named after Donald B. Johnson, who first published the technique in 1977.[3]\nA similar reweighting technique is also used in Suurballe's algorithm for finding two disjoint paths of minimum total length between the same two vertices in a graph with non-negative edge weights.[4]\n\n\nJohnson's algorithm consists of the following steps:[1][2]\nThe first three stages of Johnson's algorithm are depicted in the illustration below.\nThe graph on the left of the illustration has two negative edges, but no negative cycles. At the center is shown the new vertex q, a shortest path tree as computed by the Bellman–Ford algorithm with q as starting vertex, and the values h(v) computed at each other node as the length of the shortest path from q to that node. Note that these values are all non-positive, because q has a length-zero edge to each vertex and the shortest path can be no longer than that edge. On the right is shown the reweighted graph, formed by replacing each edge weight w(u,v) by w(u,v) + h(u) − h(v). In this reweighted graph, all edge weights are non-negative, but the shortest path between any two nodes uses the same sequence of edges as the shortest path between the same two nodes in the original graph. The algorithm concludes by applying Dijkstra's algorithm to each of the four starting nodes in the reweighted graph.\nIn the reweighted graph, all paths between a pair s and t of nodes have the same quantity h(s) − h(t) added to them. The previous statement can be proven as follows: Let p be an s-t path. Its weight W in the reweighted graph is given by the following expression:\nEvery \n\n\n\n+\nh\n(\n\np\n\ni\n\n\n)\n\n\n{\\displaystyle +h(p_{i})}\n\n is cancelled by \n\n\n\n−\nh\n(\n\np\n\ni\n\n\n)\n\n\n{\\displaystyle -h(p_{i})}\n\n in the previous bracketed expression; therefore, we are left with the following expression for W:\nThe bracketed expression is the weight of p in the original weighting.\nSince the reweighting adds the same amount to the weight of every s-t path, a path is a shortest path in the original weighting if and only if it is a shortest path after reweighting. The weight of edges that belong to a shortest path from q to any node is zero, and therefore the lengths of the shortest paths from q to every node become zero in the reweighted graph; however, they still remain shortest paths. Therefore, there can be no negative edges: if edge uv had a negative weight after the reweighting, then the zero-length path from q to u together with this edge would form a negative-length path from q to v, contradicting the fact that all vertices have zero distance from q. The non-existence of negative edges ensures the optimality of the paths found by Dijkstra's algorithm. The distances in the original graph may be calculated from the distances calculated by Dijkstra's algorithm in the reweighted graph by reversing the reweighting transformation.[1]\nThe time complexity of this algorithm, using Fibonacci heaps in the implementation of Dijkstra's algorithm, is \n\n\n\nO\n(\n\n|\n\nV\n\n\n|\n\n\n2\n\n\nlog\n⁡\n\n|\n\nV\n\n|\n\n+\n\n|\n\nV\n\n|\n\n\n|\n\nE\n\n|\n\n)\n\n\n{\\displaystyle O(|V|^{2}\\log |V|+|V||E|)}\n\n: the algorithm uses \n\n\n\nO\n(\n\n|\n\nV\n\n|\n\n\n|\n\nE\n\n|\n\n)\n\n\n{\\displaystyle O(|V||E|)}\n\n time for the Bellman–Ford stage of the algorithm, and \n\n\n\nO\n(\n\n|\n\nV\n\n|\n\nlog\n⁡\n\n|\n\nV\n\n|\n\n+\n\n|\n\nE\n\n|\n\n)\n\n\n{\\displaystyle O(|V|\\log |V|+|E|)}\n\n for each of the \n\n\n\n\n|\n\nV\n\n|\n\n\n\n{\\displaystyle |V|}\n\n instantiations of Dijkstra's algorithm. Thus, when the graph is sparse, the total time can be faster than the Floyd–Warshall algorithm, which solves the same problem in time \n\n\n\nO\n(\n\n|\n\nV\n\n\n|\n\n\n3\n\n\n)\n\n\n{\\displaystyle O(|V|^{3})}\n\n.[1]", 
    "dbpedia_url": "http://dbpedia.org/resource/Johnson's_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Johnson's_algorithm\n"
}