{
    "about": "Julian day is the continuous count of days since the beginning of the Julian Period and is used primarily by astronomers.", 
    "name": "Julian Day", 
    "classification": "Calendar Algorithms", 
    "full_text": "Julian day is the continuous count of days since the beginning of the Julian Period and is used primarily by astronomers.\nThe Julian Day Number (JDN) is the integer assigned to a whole solar day in the Julian day count starting from noon Universal time, with Julian day number 0 assigned to the day starting at noon on January 1, 4713 BC, proleptic Julian calendar (November 24, 4714 BC, in the proleptic Gregorian calendar),[1][2][3] a date at which three multi-year cycles started (which are: Indiction, Solar, and Lunar cycles) and which preceded any dates in recorded history.[4] For example, the Julian day number for the day starting at 12:00 UT on January 1, 2000, was 2,451,545.[5]\nThe Julian date (JD) of any instant is the Julian day number for the preceding noon in Universal Time plus the fraction of the day since that instant. Julian dates are expressed as a Julian day number with a decimal fraction added.[6] For example, the Julian Date for 00:30:00.0 UT January 1, 2013, is 2,456,293.520833.[7]\nThe Julian Period is a chronological interval of 7980 years; year 1 of the Julian Period was 4713 BC.[8] It has been used by historians since its introduction in 1583 to convert between different calendars. The Julian calendar year 2017 is year 6730 of the current Julian Period. The next Julian Period begins in the year AD 3268.\n\n\nThe term Julian date may also refer, outside of astronomy, to the day-of-year number (more properly, the ordinal date) in the Gregorian calendar, especially in computer programming, the military and the food industry,[9] or it may refer to dates in the Julian calendar. For example, if a given \"Julian date\" is \"October 5, 1582\", this means that date in the Julian calendar (which was October 15, 1582, in the Gregorian calendar—the date it was first established). Without an astronomical or historical context, a \"Julian date\" given as \"40\" most likely means the fortieth day of a given Gregorian year, namely February 9. Other possible meanings of a \"Julian date\" of \"40\" include an astronomical Julian Day Number, or the year AD 40 in the Julian calendar, or a duration of 40 astronomical Julian years). This is why the terms \"ordinal date\" or \"day-of-year\" are preferred. In contexts where a \"Julian date\" means simply an ordinal date, calendars of a Gregorian year with formatting for ordinal dates are often called \"Julian calendars\",[9] but this could also mean that the calendars are of years in the Julian calendar system.\nHistorical Julian dates were recorded relative to GMT or Ephemeris Time, but the International Astronomical Union now recommends that Julian dates be specified in Terrestrial Time, and that when necessary to specify Julian dates using a different time scale, that the time scale used be indicated when required, such as JD(UT1). The fraction of the day is found by converting the number of hours, minutes, and seconds after noon into the equivalent decimal fraction. Time intervals calculated from differences of Julian Dates specified in non-uniform time scales, such as Coordinated Universal Time (UTC), may need to be corrected for changes in time scales (e.g. leap seconds).[6]\nBecause the starting point or reference epoch is so long ago, numbers in the Julian day can be quite large and cumbersome. A more recent starting point is sometimes used, for instance by dropping the leading digits, in order to fit into limited computer memory with an adequate amount of precision. In the following table, times are given in 24-hour notation.\nIn the table below, Epoch refers to the point in time used to set the origin (usually zero, but (1) where explicitly indicated) of the alternative convention being discussed in that row. The date given is a Gregorian calendar date if it is October 15, 1582, or later, but a Julian calendar date if it is earlier. JD stands for Julian Date. 0h is 00:00 midnight, 12h is 12:00 noon, UT unless otherwise specified.\nThe Heliocentric Julian Day (HJD) is the same as the Julian day, but adjusted to the frame of reference of the Sun, and thus can differ from the Julian day by as much as 8.3 minutes (498 seconds), that being the time it takes the Sun's light to reach Earth.\nTo illustrate the ambiguity that could arise, consider the two separate astronomical measurements of an astronomical object from the earth: Assume that three objects—the Earth, the Sun, and the astronomical object targeted, that is whose distance is to be measured—happen to be in a straight line for both measures. However, for the first measurement, the Earth is between the Sun and the targeted object, and for the second, the Earth is on the opposite side of the Sun from that object. Then, the two measurements would differ by about 1000 light-seconds: For the first measurement, the Earth is roughly 500 light seconds closer to the target than the Sun, and roughly 500 light seconds further from the target astronomical object than the Sun for the second measure.\nAn error of about 1000 light-seconds is over 1% of a light-day, which can be a significant error when measuring temporal phenomena for short period astronomical objects over long time intervals. To clarify this issue, the ordinary Julian day is sometimes referred to as the Geocentric Julian Day (GJD) in order to distinguish it from HJD.\nThe Julian day number is based on the Julian Period proposed by Joseph Scaliger, a classical scholar, in 1583, at the time of the Gregorian calendar reform, as it is the least common multiple of three calendar cycles used with the Julian calendar:\nIts epoch falls at the last time when all three cycles (if they are continued backward far enough) were in their first year together — Scaliger chose this because it preceded all historical dates. Years of the Julian Period are counted from this year, 4713 BC, which was chosen to be before any historical record.[23]\nSince it is now certain that every possible combination of the three cyclic numbers finds its place in the Julian Period, it is evident that the first year of the Christian era, which was the 10th year of a Solar Cycle, the 2nd of a Lunar Cycle, and the 4th of a Cycle of Indiction, finds its place within this artificial era, and must answer to that particular year of the period which is characterized by the same cyclic numbers. Hence, to refer the Christian era to the Julian Period is the same thing as to find out what year of that period it is which, when divided by 28 will leave a remainder 10, divided by 19 will leave a remainder 2, and divided by 15 will leave a remainder 4. The solution of this problem belongs to the higher mathematics, by which it is found that the year required is the 4714th of the period in question. Hence Jul. Per. 4714=A.D.1, and consequently Julian Period 4713=B.C.1.[24]\nIn point of fact, finding the year is a very straightforward arithmetical procedure. See \"Calculation\" below.\nAlthough many references say that the Julian in \"Julian Period\" refers to Scaliger's father, Julius Scaliger, in the introduction to Book V of his Opus de Emendatione Temporum (\"Work on the Emendation of Time\") he states, \"Iulianam vocauimus: quia ad annum Iulianum dumtaxat accomodata est\", which translates more or less as \"We have called it Julian merely because it is accommodated to the Julian year.\" Thus Julian refers to Julius Caesar, who introduced the Julian calendar in 46 BC.\nOriginally the Julian Period was used only to count years, and the Julian calendar was used to express historical dates within years. In his book Outlines of Astronomy, first published in 1849, the astronomer John Herschel added the counting of days elapsed from the beginning of the Julian Period:\nThe period thus arising of 7980 Julian years, is called the Julian period, and it has been found so useful, that the most competent authorities have not hesitated to declare that, through its employment, light and order were first introduced into chronology.[25] We owe its invention or revival to Joseph Scaliger, who is said to have received it from the Greeks of Constantinople. The first year of the current Julian period, or that of which the number in each of the three subordinate cycles is 1, was the year 4713 BC, and the noon of the 1st of January of that year, for the meridian of Alexandria, is the chronological epoch, to which all historical eras are most readily and intelligibly referred, by computing the number of integer days intervening between that epoch and the noon (for Alexandria) of the day, which is reckoned to be the first of the particular era in question. The meridian of Alexandria is chosen as that to which Ptolemy refers the commencement of the era of Nabonassar, the basis of all his calculations.[26]\nAstronomers adopted Herschel's \"days of the Julian period\" in the late nineteenth century, but used the meridian of Greenwich instead of Alexandria, after the former was adopted as the Prime Meridian after the International Meridian Conference in Washington in 1884. This has now become the standard system of Julian days numbers.\nThe French mathematician and astronomer Pierre-Simon Laplace first expressed the time of day as a decimal fraction added to calendar dates in his book, Traité de Mécanique Céleste, in 1799.[27] Other astronomers added fractions of the day to the Julian day number to create Julian Dates, which are typically used by astronomers to date astronomical observations, thus eliminating the complications resulting from using standard calendar periods like eras, years, or months. They were first introduced into variable star work by Edward Charles Pickering, of the Harvard College Observatory, in 1890.[28]\nJulian days begin at noon because when Herschel recommended them, the astronomical day began at noon. The astronomical day had begun at noon ever since Ptolemy chose to begin the days in his astronomical periods at noon. He chose noon because the transit of the Sun across the observer's meridian occurs at the same apparent time every day of the year, unlike sunrise or sunset, which vary by several hours. Midnight was not even considered because it could not be accurately determined using water clocks. Nevertheless, he double-dated most nighttime observations with both Egyptian days beginning at sunrise and Babylonian days beginning at sunset. This would seem to imply that his choice of noon was not, as is sometimes stated, made in order to allow all observations from a given night to be recorded with the same date. When this practice ended in 1925, it was decided to keep Julian days continuous with previous practice.\nThe Julian day number can be calculated using the following formulas (integer division is used exclusively, that is, the remainder of all divisions are dropped):\nThe months (M) January to December are 1 to 12. For the year (Y) astronomical year numbering is used, thus 1 BC is 0, 2 BC is −1, and 4713 BC is −4712. D is the day of the month. JDN is the Julian Day Number, which pertains to the noon occurring in the corresponding calendar date.\nThe algorithm is valid at least for all positive Julian day numbers.[29] The meaning of the variables are explained by the Computer Science Department of the University of Texas at San Antonio.\nIt is worth noting that this algorithm does not follow the NASA[30] or the US Naval Observatory[31] – the convention in these systems being that the Gregorian calendar did not exist before the date October 15, 1582 (Gregorian). This algorithm effectively back-dates the Gregorian calendar onto the Julian calendar for dates before the introduction of the Gregorian calendar. Thus any calculations made with this formula before October 15, 1582, will not agree with these previous ephemerides.\nYou must compute first the number of years (y) and months (m) since March 1 −4800 (March 1, 4801 BC):\n\n\n\n\n\n\n\n\na\n\n\n\n=\n\n⌊\n\n\n\n14\n−\n\nmonth\n\n\n12\n\n\n⌋\n\n\n\n\n\ny\n\n\n\n=\n\nyear\n\n+\n4800\n−\na\n\n\n\n\nm\n\n\n\n=\n\nmonth\n\n+\n12\na\n−\n3\n\n\n\n\n\n\n{\\displaystyle {\\begin{aligned}a&=\\left\\lfloor {\\frac {14-{\\text{month}}}{12}}\\right\\rfloor \\\\y&={\\text{year}}+4800-a\\\\m&={\\text{month}}+12a-3\\end{aligned}}}\n\n\nThe value 'a' will be 1 for January and February, and 0 for other months. And 'm' will be 0 for March and 11 for February.\nAll years in the BC era must be converted to astronomical years, so that 1 BC is year 0, 2 BC is year −1, etc. Convert to a negative number, then increment toward zero.\nThen, if starting from a Gregorian calendar date compute (note the floor brackets!):\n\n\n\n\nJ\n\nD\n\nN\n=\n\nday\n\n+\n\n⌊\n\n\n\n153\nm\n+\n2\n\n5\n\n\n⌋\n\n+\n365\ny\n+\n\n⌊\n\n\ny\n4\n\n\n⌋\n\n−\n\n⌊\n\n\ny\n100\n\n\n⌋\n\n+\n\n⌊\n\n\ny\n400\n\n\n⌋\n\n−\n32045\n\n\n{\\displaystyle J\\!D\\!N={\\text{day}}+\\left\\lfloor {\\frac {153m+2}{5}}\\right\\rfloor +365y+\\left\\lfloor {\\frac {y}{4}}\\right\\rfloor -\\left\\lfloor {\\frac {y}{100}}\\right\\rfloor +\\left\\lfloor {\\frac {y}{400}}\\right\\rfloor -32045}\n\n\nOtherwise, if starting from a Julian calendar date compute:\n\n\n\n\nJ\n\nD\n\nN\n=\n\nday\n\n+\n\n⌊\n\n\n\n153\nm\n+\n2\n\n5\n\n\n⌋\n\n+\n365\ny\n+\n\n⌊\n\n\ny\n4\n\n\n⌋\n\n−\n32083\n\n\n{\\displaystyle J\\!D\\!N={\\text{day}}+\\left\\lfloor {\\frac {153m+2}{5}}\\right\\rfloor +365y+\\left\\lfloor {\\frac {y}{4}}\\right\\rfloor -32083}\n\n\nNote: (153m+2)/5 gives the number of days since March 1 and comes from the repetition of days in the month from March in groups of five:\nFor the full Julian Date (divisions are real numbers):\n\n\n\n\n\n\n\n\nJ\n\nD\n\n\n=\n\n\nJ\n\nD\n\nN\n+\n\n\n\n\nhour\n\n−\n12\n\n24\n\n\n+\n\n\nminute\n1440\n\n\n+\n\n\nsecond\n86400\n\n\n\n\n\n\n\n\n{\\displaystyle {\\begin{matrix}J\\!D&=&J\\!D\\!N+{\\frac {{\\text{hour}}-12}{24}}+{\\frac {\\text{minute}}{1440}}+{\\frac {\\text{second}}{86400}}\\end{matrix}}}\n\n\nSo, for example, January 1, 2000, at 12:00:00 UT corresponds to JD = 2451545.0\nThe US day of the week W1 can be determined from the Julian Day Number J with the expression:\nThe ISO day of the week W0 can be determined from the Julian Day Number J with the expression:\nThis is an algorithm by Richards to convert a Julian Day Number, J, to a date in the Gregorian calendar (proleptic, when applicable). Richards does not state which dates the algorithm is valid for.[33] All variables are integer values, and the notation \"a div b\" indicates integer division, and \"mod(a,b)\" denotes the modulus operator.\nFor Julian calendar:\nFor Gregorian calendar:\nFor Julian or Gregorian, continue:\nD, M, and Y are the numbers of the day, month, and year respectively.\nLet Y be the year BC or AD and i, m and s respectively its positions in the indiction, Metonic and solar cycles. Divide 6916i + 4200m + 4845s by 7980 and call the remainder r.\nExample\ni = 8, m = 2, s = 8. What is the year?\nAs stated above, the Julian date (JD) of any instant is the Julian day number for the preceding noon in Universal Time plus the fraction of the day since that instant. Ordinarily calculating the fractional portion of the JD is straightforward; the number of seconds that have elapsed in the day divided by the number of seconds in a day, 86,400. But if the UTC timescale is being used, a day containing a positive leap second contains 86,401 seconds (or in the unlikely event of a negative leap second, 86,399 seconds). One authoritative source, the Standards of Fundamental Astronomy, deals with this issue by treating days containing a leap second as having a different length (86,401 or 86,399 seconds, as required). SOFA refers to the result of such a calculation as \"quasi-JD\".[35]", 
    "dbpedia_url": "http://dbpedia.org/resource/Julian_day", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Julian_day\n"
}