{
    "about": "In computer science, k-approximation of k-hitting set is an approximation algorithm for weighted hitting set. The input is a collection S of subsets of some universe T and a mapping W from T to non-negative numbers called the weights of the elements of T. In k-hitting set the size of the sets in S cannot be larger than k. That is, \n\n\n\n∀\ni\n∈\nS\n:\n\n|\n\ni\n\n|\n\n≤\nk\n\n\n{\\displaystyle \\forall i\\in S:|i|\\leq k}\n\n. The problem is now to pick some subset T' of T such that every set in S contains some element of T', and such that the total weight of all elements in T' is as small as possible.", 
    "classification": "Approximation Algorithms", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/K-approximation_of_k-hitting_set\n", 
    "full_text": "In computer science, k-approximation of k-hitting set is an approximation algorithm for weighted hitting set. The input is a collection S of subsets of some universe T and a mapping W from T to non-negative numbers called the weights of the elements of T. In k-hitting set the size of the sets in S cannot be larger than k. That is, \n\n\n\n∀\ni\n∈\nS\n:\n\n|\n\ni\n\n|\n\n≤\nk\n\n\n{\\displaystyle \\forall i\\in S:|i|\\leq k}\n\n. The problem is now to pick some subset T' of T such that every set in S contains some element of T', and such that the total weight of all elements in T' is as small as possible.\n\n\nFor each set \n\n\n\nj\n\n\n{\\displaystyle j}\n\n in S is maintained a price, \n\n\n\n\np\n\nj\n\n\n\n\n{\\displaystyle p_{j}}\n\n, which is initially 0. For an element a in T, let S(a) be the collection of sets from S containing a. During the algorithm the following invariant is kept\nWe say that an element, a, from T is tight if \n\n\n\n\nΣ\n\nj\n∈\nS\n(\na\n)\n\n\n\np\n\nj\n\n\n=\nW\n(\na\n)\n\n\n{\\displaystyle \\Sigma _{j\\in S(a)}p_{j}=W(a)}\n\n. The main part of the algorithm consists of a loop: As long as there is a set in S that contains an element from T which is not tight, the price of this set is increased as much as possible without violating the invariant above. When this loop exits, all sets contain some tight element. Pick all the tight elements to be the hitting set.\nThe algorithm always terminates because in each iteration of the loop the price of some set in S is increased enough to make one more element from T tight. If it cannot increase any price, it exits. It runs in polynomial time because the loop will not make more iterations than the number of elements in the union of all the sets of S. It returns a hitting set, because when the loop exits, all sets in S contain a tight element from T, and the set of these tight elements are returned.\nNote that for any hitting set T* and any prices \n\n\n\n\np\n\n1\n\n\n,\n…\n,\n\np\n\n\n|\n\nS\n\n|\n\n\n\n\n\n{\\displaystyle p_{1},\\ldots ,p_{|S|}}\n\n where the invariant from the algorithm is true, the total weight of the hitting set is an upper limit to the sum over all members of T* of the sum of the prices of sets containing this element, that is: \n\n\n\n\nΣ\n\na\n∈\n\nT\n\n∗\n\n\n\n\n\nΣ\n\nj\n∈\nS\n(\na\n)\n\n\n\np\n\nj\n\n\n≤\n\nΣ\n\na\n∈\n\nT\n\n∗\n\n\n\n\nW\n(\na\n)\n\n\n{\\displaystyle \\Sigma _{a\\in T^{*}}\\Sigma _{j\\in S(a)}p_{j}\\leq \\Sigma _{a\\in T^{*}}W(a)}\n\n. This follows from the invariant property. Further, since the price of every set must occur at least once on the left hand side, we get \n\n\n\n\nΣ\n\nj\n∈\nS\n\n\n\np\n\nj\n\n\n≤\n\nΣ\n\na\n∈\n\nT\n\n∗\n\n\n\n\nW\n(\na\n)\n\n\n{\\displaystyle \\Sigma _{j\\in S}p_{j}\\leq \\Sigma _{a\\in T^{*}}W(a)}\n\n. Especially, this property is true for the optimal hitting set.\nFurther, for the hitting set H returned from the algorithm above, we have \n\n\n\n\nΣ\n\na\n∈\nH\n\n\n\nΣ\n\nj\n∈\nS\n(\na\n)\n\n\n\np\n\nj\n\n\n=\n\nΣ\n\na\n∈\nH\n\n\nW\n(\na\n)\n\n\n{\\displaystyle \\Sigma _{a\\in H}\\Sigma _{j\\in S(a)}p_{j}=\\Sigma _{a\\in H}W(a)}\n\n. Since any price \n\n\n\n\np\n\nj\n\n\n\n\n{\\displaystyle p_{j}}\n\n can appear at most k times in the left-hand side (since subsets of S can contain no more than k element from T) we get \n\n\n\n\nΣ\n\na\n∈\nH\n\n\nW\n(\na\n)\n≤\nk\n⋅\n\nΣ\n\nj\n∈\nS\n\n\n\np\n\nj\n\n\n\n\n{\\displaystyle \\Sigma _{a\\in H}W(a)\\leq k\\cdot \\Sigma _{j\\in S}p_{j}}\n\n Combined with the previous paragraph we get \n\n\n\n\nΣ\n\na\n∈\nH\n\n\nW\n(\na\n)\n≤\nk\n⋅\n\nΣ\n\na\n∈\n\nT\n\n∗\n\n\n\n\nW\n(\na\n)\n\n\n{\\displaystyle \\Sigma _{a\\in H}W(a)\\leq k\\cdot \\Sigma _{a\\in T^{*}}W(a)}\n\n, where T* is the optimal hitting set. This is exactly the guarantee that it is a k-approximation algorithm.\nThis algorithm is an instance of the primal-dual method, also called the pricing method. The intuition is that it is dual to a linear programming algorithm. For an explanation see http://algo.inria.fr/seminars/sem00-01/vazirani.html.", 
    "name": "K Approximation Of K Hitting Set"
}