{
    "about": "The Kabsch algorithm, named after Wolfgang Kabsch, is a method for calculating the optimal rotation matrix that minimizes the RMSD (root mean squared deviation) between two paired sets of points. It is useful in graphics, cheminformatics to compare molecular structures, and also bioinformatics for comparing protein structures (in particular, see root-mean-square deviation (bioinformatics)).", 
    "name": "Kabsch Algorithm", 
    "classification": "Bioinformatics Algorithms", 
    "full_text": "The Kabsch algorithm, named after Wolfgang Kabsch, is a method for calculating the optimal rotation matrix that minimizes the RMSD (root mean squared deviation) between two paired sets of points. It is useful in graphics, cheminformatics to compare molecular structures, and also bioinformatics for comparing protein structures (in particular, see root-mean-square deviation (bioinformatics)).\nThe algorithm only computes the rotation matrix, but it also requires the computation of a translation vector. When both the translation and rotation are actually performed, the algorithm is sometimes called partial Procrustes superimposition (see also orthogonal Procrustes problem).\n\n\nThe algorithm starts with two sets of paired points, P and Q. Each set of points can be represented as an N×3 matrix. The first row is the coordinates of the first point, the second row is the coordinates of the second point, the Nth row is the coordinates of the Nth point.\nThe algorithm works in three steps: a translation, the computation of a covariance matrix, and the computation of the optimal rotation matrix.\nBoth sets of coordinates must be translated first, so that their centroid coincides with the origin of the coordinate system. This is done by subtracting from the point coordinates the coordinates of the respective centroid.\nThe second step consists of calculating a cross-covariance matrix A. In matrix notation,\nor, using summation notation,\nIt is possible to calculate the optimal rotation U based on the matrix formula \n\n\n\nU\n=\n(\n\nA\n\nT\n\n\nA\n\n)\n\n1\n\n/\n\n2\n\n\n\nA\n\n−\n1\n\n\n\n\n{\\displaystyle U=(A^{T}A)^{1/2}A^{-1}}\n\n but implementing a numerical solution to this formula becomes complicated when all special cases are accounted for (for example, the case of A not having an inverse).\nIf singular value decomposition (SVD) routines are available, the optimal rotation, U, can be calculated using the following simple algorithm.\nFirst, calculate the SVD of the covariance matrix A.\nNext, decide whether we need to correct our rotation matrix to ensure a right-handed coordinate system\nFinally, calculate our optimal rotation matrix, U, as\nCoutsias, Seok, and Dill[1] have found an equivalent method that uses quaternions. Expressing the optimal rotation matrix with a quaternion goes back to 1999: see appendix in [2] and was generalized in 2002 to probability distributions (continuous or not): see appendix A.5 in.[3]\nThe algorithm was described for points in a three-dimensional space. The generalization to D dimensions is immediate.\nThis SVD algorithm is described in more detail at http://cnx.org/content/m11608/latest/\nA Matlab function is available at http://www.mathworks.com/matlabcentral/fileexchange/25746-kabsch-algorithm\nA C++ implementation (and unit test) using Eigen\nA Python script is available at https://github.com/charnley/rmsd\nA free PyMol plugin easily implementing Kabsch is Cealign. VMD uses the Kabsch algorithm for its alignment.", 
    "dbpedia_url": "http://dbpedia.org/resource/Kabsch_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Kabsch_algorithm\n"
}