{
    "about": "The Kaiser window, also known as the Kaiser–Bessel window, was developed by James Kaiser at Bell Laboratories. It is a one-parameter family of window functions used for digital signal processing, and is defined by the formula[1][2]:", 
    "name": "Kaiser Window", 
    "classification": "Signal Processing", 
    "full_text": "The Kaiser window, also known as the Kaiser–Bessel window, was developed by James Kaiser at Bell Laboratories. It is a one-parameter family of window functions used for digital signal processing, and is defined by the formula[1][2]:\nwhere:\nWhen N is an odd number, the peak value of the window is  \n\n\n\n\nw\n[\n(\nN\n−\n1\n)\n\n/\n\n2\n]\n=\n1\n,\n\n\n\n{\\displaystyle \\scriptstyle w[(N-1)/2]=1,}\n\n  and when N is even, the peak values are  \n\n\n\n\nw\n[\nN\n\n/\n\n2\n−\n1\n]\n \n=\n \nw\n[\nN\n\n/\n\n2\n]\n \n<\n \n1.\n\n\n\n{\\displaystyle \\scriptstyle w[N/2-1]\\ =\\ w[N/2]\\ <\\ 1.}\n\n\n\n\nUnderlying the discrete sequence is this continuous-time function and its Fourier transform:\nThe maximum value of w0(t) is w0(0) = 1.  The w[n] sequence defined above are the samples of:\nand where rect() is the rectangle function.  The first null after the main lobe of W0(f) occurs at:\nα controls the tradeoff between main-lobe width and side-lobe area.  As α increases, the main lobe of W0(f) increases in width, and the side lobes decrease in amplitude, as illustrated in the figure at right.  α = 0 corresponds to a rectangular window. For large α, the shape of the Kaiser window (in both time and frequency domain) tends to a Gaussian curve.  The Kaiser window is nearly optimal in the sense of its peak's concentration around frequency 0 (Oppenheim et al., 1999).\nA related window function is the Kaiser–Bessel-derived (KBD) window, which is designed to be suitable for use with the modified discrete cosine transform (MDCT). The KBD window function is defined in terms of the Kaiser window of length M+1, by the formula:\nThis defines a window of length 2M, where by construction dn satisfies the Princen-Bradley condition for the MDCT (using the fact that wM−n = wn): dn2 + dn + M2 = 1 (interpreting n and n + M modulo 2M). The KBD window is also symmetric in the proper manner for the MDCT: dn = d2M−1−n.\nThe KBD window is used in the Advanced Audio Coding digital audio format.", 
    "dbpedia_url": "http://dbpedia.org/resource/Kaiser_window", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Kaiser_window\n"
}