{
    "about": "The Kempner series is a modification of the harmonic series, formed by omitting all terms whose denominator expressed in base 10 contains the digit 9. That is, it is the sum", 
    "name": "Kempner Series", 
    "classification": "Numerical Analysis", 
    "full_text": "The Kempner series is a modification of the harmonic series, formed by omitting all terms whose denominator expressed in base 10 contains the digit 9. That is, it is the sum\nwhere the prime indicates that n takes only values whose decimal expansion has no nines. The series was first studied by A. J. Kempner in 1914.[1] The series is interesting because of the counter-intuitive result that, unlike the harmonic series, the Kempner series converges. Kempner showed the sum of this series is less than 80. Baillie[2] showed that, rounded to 20 decimals, the actual sum is 22.92067 66192 64150 34816 (sequence A082838 in the OEIS)).\nHeuristically, this series converges because most large integers contain all digits. For example, a random 100-digit integer is very likely to contain at least one '9', causing it to be excluded from the above sum.\nSchmelzer and Baillie[3] found an efficient algorithm for the more general problem of any omitted string of digits. For example, the sum of 1/n where n has no \"42\" is about 228.44630 41592 30813 25415. Another example: the sum of 1/n where n has no occurrence of the digit string \"314159\" is about 2302582.33386 37826 07892 02376. (All values are rounded in the last decimal place).\n\n\nKempner's proof of convergence[1] is repeated in many textbooks, for example Hardy and Wright[4]:120 and Apostol.[5]:212 We group the terms of the sum by the number of digits in the denominator. The number of n-digit positive integers that have no digit equal to '9' is 8(9n−1) because there are 8 choices (1 through 8) for the first digit, and 9 independent choices (0 through 8) for each of the other n−1 digits. Each of these numbers having no '9' is bigger than or equal to 10n−1, so the contribution of this group to the sum of reciprocals is less than 8(9/10)n−1. Therefore the whole sum of reciprocals is at most\nThe same argument works for any omitted non-zero digit. The number of n-digit positive integers that have no '0' is 9n, so the sum of 1/n where n has no digit '0' is at most\nThe series also converge if strings of k digits are omitted, for example if we omit all denominators that have a decimal substring of 42. This can be proved in almost the same way.[3] First we observe that we can work with numbers in base 10k and omit all denominators that have the given string as a \"digit\". The analogous argument to the base 10 case shows that this series converges. Now switching back to base 10, we see that this series contains all denominators that omit the given string, as well as denominators that include it if it is not on a \"k-digit\" boundary. For example, if we are omitting 42, the base-100 series would omit 4217 and 1742, but not 1427, so it is larger than the series that omits all 42s.\nFarhi[6] considered generalized Kempner series, namely, the sums S(d, n) of the reciprocals of the positive integers that have exactly n instances of the digit d where 0 ≤ d ≤ 9 (so that the original Kempner series is S(9, 0)). He showed that for each d the sequence of values S(d, n) for n ≥ 1 is decreasing and converges to 10 ln 10. Interestingly, the sequence is not in general decreasing starting with n = 0; for example, for the original Kempner series we have S(9, 0) ≈ 22.921 < 23.026 ≈ 10 ln 10 < S(9, n) for n ≥ 1.\nThe series converges extremely slowly. Baillie[2] remarks that after summing 1027 terms the remainder is still larger than 1.\nThe upper bound of 80 is very crude, and Irwin showed[7] by a slightly finer analysis of the bounds that the value of the Kempner series is near 23, since refined to about 22.92067.[8]\nBaillie[2] developed a recursion that expresses the contribution from each k+1-digit block in terms of the contributions of the k-digit blocks for all choices of omitted digit. This permits a very accurate estimate with a small amount of computation.\nMost authors do not name this series. The name \"Kempner series\" is used in MathWorld[9] and in Havil's book Gamma on the Euler–Mascheroni constant.[10]:31–33", 
    "dbpedia_url": "http://dbpedia.org/resource/Kempner_series", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Kempner_series\n"
}