{
    "about": "The knapsack problem or rucksack problem is a problem in combinatorial optimization: Given a set of items, each with a weight and a value, determine the number of each item to include in a collection so that the total weight is less than or equal to a given limit and the total value is as large as possible. It derives its name from the problem faced by someone who is constrained by a fixed-size knapsack and must fill it with the most valuable items.", 
    "name": "Knapsack Problem", 
    "classification": "Pseudo-Polynomial Time Algorithms", 
    "full_text": "The knapsack problem or rucksack problem is a problem in combinatorial optimization: Given a set of items, each with a weight and a value, determine the number of each item to include in a collection so that the total weight is less than or equal to a given limit and the total value is as large as possible. It derives its name from the problem faced by someone who is constrained by a fixed-size knapsack and must fill it with the most valuable items.\nThe problem often arises in resource allocation where there are financial constraints and is studied in fields such as combinatorics, computer science, complexity theory, cryptography, applied mathematics, and daily fantasy sports.\nThe knapsack problem has been studied for more than a century, with early works dating as far back as 1897.[1] The name \"knapsack problem\" dates back to the early works of mathematician Tobias Dantzig (1884–1956),[2] and refers to the commonplace problem of packing your most valuable or useful items without overloading your luggage.\n\n\nA 1998 study of the Stony Brook University Algorithm Repository showed that, out of 75 algorithmic problems, the knapsack problem was the 18th most popular and the 4th most needed after kd-trees, suffix trees, and the bin packing problem.[3]\nKnapsack problems appear in real-world decision-making processes in a wide variety of fields, such as finding the least wasteful way to cut raw materials,[4] selection of investments and portfolios,[5] selection of assets for asset-backed securitization,[6] and generating keys for the Merkle–Hellman[7] and other knapsack cryptosystems.\nOne early application of knapsack algorithms was in the construction and scoring of tests in which the test-takers have a choice as to which questions they answer. For small examples it is a fairly simple process to provide the test-takers with such a choice. For example, if an exam contains 12 questions each worth 10 points, the test-taker need only answer 10 questions to achieve a maximum possible score of 100 points. However, on tests with a heterogeneous distribution of point values—i.e. different questions are worth different point values— it is more difficult to provide choices. Feuerman and Weiss proposed a system in which students are given a heterogeneous test with a total of 125 possible points. The students are asked to answer all of the questions to the best of their abilities. Of the possible subsets of problems whose total point values add up to 100, a knapsack algorithm would determine which subset gives each student the highest possible score.[8]\nThe most common problem being solved is the 0-1 knapsack problem, which restricts the number xi of copies of each kind of item to zero or one. Given a set of n items numbered from 1 up to n, each with a weight wi and a value vi, along with a maximum weight capacity W,\nHere xi represents the number of instances of item i to include in the knapsack. Informally, the problem is to maximize the sum of the values of the items in the knapsack so that the sum of the weights is less than or equal to the knapsack's capacity.\nThe bounded knapsack problem (BKP) removes the restriction that there is only one of each item, but restricts the number \n\n\n\n\nx\n\ni\n\n\n\n\n{\\displaystyle x_{i}}\n\n of copies of each kind of item to a maximum non-negative integer value \n\n\n\nc\n\n\n{\\displaystyle c}\n\n:\nThe unbounded knapsack problem (UKP) places no upper bound on the number of copies of each kind of item and can be formulated as above except for that the only restriction on \n\n\n\n\nx\n\ni\n\n\n\n\n{\\displaystyle x_{i}}\n\n is that it is a non-negative integer.\nOne example of the unbounded knapsack problem is given using the figure shown at the beginning of this article and the text \"if any number of each box is available\" in the caption of that figure.\nThe knapsack problem is interesting from the perspective of computer science for many reasons:\nThere is a link between the \"decision\" and \"optimization\" problems in that if there exists a polynomial algorithm that solves the \"decision\" problem, then one can find the maximum value for the optimization problem in polynomial time by applying this algorithm iteratively while increasing the value of k . On the other hand, if an algorithm finds the optimal value of optimization problem in polynomial time, then the decision problem can be solved in polynomial time by comparing the value of the solution output by this algorithm with the value of k . Thus, both versions of the problem are of similar difficulty.\nOne theme in research literature is to identify what the \"hard\" instances of the knapsack problem look like,[9][10] or viewed another way, to identify what properties of instances in practice might make them more amenable than their worst-case NP-complete behaviour suggests.[11] The goal in finding these \"hard\" instances is for their use in public key cryptography systems, such as the Merkle-Hellman knapsack cryptosystem.\nSeveral algorithms are available to solve knapsack problems, based on dynamic programming approach,[12] branch and bound approach[13] or hybridizations of both approaches.[11][14][15][16]\nIf all weights (\n\n\n\n\nw\n\n1\n\n\n,\n…\n,\n\nw\n\nn\n\n\n\n\n{\\displaystyle w_{1},\\ldots ,w_{n}}\n\n) are nonnegative integers, the knapsack problem can be solved in pseudo-polynomial time using dynamic programming. The following describes a dynamic programming solution for the unbounded knapsack problem.\nTo simplify things, assume all weights are strictly positive (\n\n\n\n\nw\n\ni\n\n\n>\n0\n\n\n{\\displaystyle w_{i}>0}\n\n). We wish to maximize total value subject to the constraint that total weight is less than or equal to \n\n\n\nW\n\n\n{\\displaystyle W}\n\n. Then for each \n\n\n\nw\n≤\nW\n\n\n{\\displaystyle w\\leq W}\n\n, define \n\n\n\nm\n[\nw\n]\n\n\n{\\displaystyle m[w]}\n\n to be the maximum value that can be attained with total weight less than or equal to \n\n\n\nw\n\n\n{\\displaystyle w}\n\n. Then, \n\n\n\nm\n[\nW\n]\n\n\n{\\displaystyle m[W]}\n\n is the solution to the problem.\nObserve that \n\n\n\nm\n[\nw\n]\n\n\n{\\displaystyle m[w]}\n\n has the following properties:\nwhere \n\n\n\n\nv\n\ni\n\n\n\n\n{\\displaystyle v_{i}}\n\n is the value of the i-th kind of item.\n(To formulate the equation above, the idea used is that the solution for a knapsack is the same as the value of one correct item plus the solution for a knapsack with smaller capacity, specifically one with the capacity reduced by the weight of that chosen item.)\nHere the maximum of the empty set is taken to be zero. Tabulating the results from \n\n\n\nm\n[\n0\n]\n\n\n{\\displaystyle m[0]}\n\n up through \n\n\n\nm\n[\nW\n]\n\n\n{\\displaystyle m[W]}\n\n gives the solution. Since the calculation of each \n\n\n\nm\n[\nw\n]\n\n\n{\\displaystyle m[w]}\n\n involves examining \n\n\n\nn\n\n\n{\\displaystyle n}\n\n items, and there are \n\n\n\nW\n\n\n{\\displaystyle W}\n\n values of \n\n\n\nm\n[\nw\n]\n\n\n{\\displaystyle m[w]}\n\n to calculate, the running time of the dynamic programming solution is \n\n\n\nO\n(\nn\nW\n)\n\n\n{\\displaystyle O(nW)}\n\n. Dividing \n\n\n\n\nw\n\n1\n\n\n,\n\n\nw\n\n2\n\n\n,\n\n…\n,\n\n\nw\n\nn\n\n\n,\n\nW\n\n\n{\\displaystyle w_{1},\\,w_{2},\\,\\ldots ,\\,w_{n},\\,W}\n\n by their greatest common divisor is a way to improve the running time.\nThe \n\n\n\nO\n(\nn\nW\n)\n\n\n{\\displaystyle O(nW)}\n\n complexity does not contradict the fact that the knapsack problem is NP-complete, since \n\n\n\nW\n\n\n{\\displaystyle W}\n\n, unlike \n\n\n\nn\n\n\n{\\displaystyle n}\n\n, is not polynomial in the length of the input to the problem. The length of the \n\n\n\nW\n\n\n{\\displaystyle W}\n\n input to the problem is proportional to the number of bits in \n\n\n\nW\n\n\n{\\displaystyle W}\n\n, \n\n\n\nlog\n⁡\nW\n\n\n{\\displaystyle \\log W}\n\n, not to \n\n\n\nW\n\n\n{\\displaystyle W}\n\n itself.\nA similar dynamic programming solution for the 0/1 knapsack problem also runs in pseudo-polynomial time. Assume \n\n\n\n\nw\n\n1\n\n\n,\n\n\nw\n\n2\n\n\n,\n\n…\n,\n\n\nw\n\nn\n\n\n,\n\nW\n\n\n{\\displaystyle w_{1},\\,w_{2},\\,\\ldots ,\\,w_{n},\\,W}\n\n are strictly positive integers. Define \n\n\n\nm\n[\ni\n,\nw\n]\n\n\n{\\displaystyle m[i,w]}\n\n to be the maximum value that can be attained with weight less than or equal to \n\n\n\nw\n\n\n{\\displaystyle w}\n\n using items up to \n\n\n\ni\n\n\n{\\displaystyle i}\n\n (first \n\n\n\ni\n\n\n{\\displaystyle i}\n\n items).\nWe can define \n\n\n\nm\n[\ni\n,\nw\n]\n\n\n{\\displaystyle m[i,w]}\n\n recursively as follows:\nThe solution can then be found by calculating \n\n\n\nm\n[\nn\n,\nW\n]\n\n\n{\\displaystyle m[n,W]}\n\n. To do this efficiently we can use a table to store previous computations.\nThe following is pseudo code for the dynamic program:\nThis solution will therefore run in \n\n\n\nO\n(\nn\nW\n)\n\n\n{\\displaystyle O(nW)}\n\n time and \n\n\n\nO\n(\nn\nW\n)\n\n\n{\\displaystyle O(nW)}\n\n space. Additionally, if we use only a 1-dimensional array \n\n\n\nm\n[\nw\n]\n\n\n{\\displaystyle m[w]}\n\n to store the current optimal values and pass over this array \n\n\n\ni\n+\n1\n\n\n{\\displaystyle i+1}\n\n times, rewriting from \n\n\n\nm\n[\nW\n]\n\n\n{\\displaystyle m[W]}\n\n to \n\n\n\nm\n[\n1\n]\n\n\n{\\displaystyle m[1]}\n\n every time, we get the same result for only \n\n\n\nO\n(\nW\n)\n\n\n{\\displaystyle O(W)}\n\n space.[citation needed]\nAnother algorithm for 0-1 knapsack, discovered in 1974 [17] and sometimes called \"meet-in-the-middle\" due to parallels to a similarly named algorithm in cryptography, is exponential in the number of different items but may be preferable to the DP algorithm when \n\n\n\nW\n\n\n{\\displaystyle W}\n\n is large compared to n. In particular, if the \n\n\n\n\nw\n\ni\n\n\n\n\n{\\displaystyle w_{i}}\n\n are nonnegative but not integers, we could still use the dynamic programming algorithm by scaling and rounding (i.e. using fixed-point arithmetic), but if the problem requires \n\n\n\nd\n\n\n{\\displaystyle d}\n\n fractional digits of precision to arrive at the correct answer, \n\n\n\nW\n\n\n{\\displaystyle W}\n\n will need to be scaled by \n\n\n\n\n10\n\nd\n\n\n\n\n{\\displaystyle 10^{d}}\n\n, and the DP algorithm will require \n\n\n\nO\n(\nW\n\n10\n\nd\n\n\n)\n\n\n{\\displaystyle O(W10^{d})}\n\n space and \n\n\n\nO\n(\nn\nW\n\n10\n\nd\n\n\n)\n\n\n{\\displaystyle O(nW10^{d})}\n\n time.\nThe algorithm takes \n\n\n\nO\n(\n\n2\n\nn\n\n/\n\n2\n\n\n)\n\n\n{\\displaystyle O(2^{n/2})}\n\n space, and efficient implementations of step 3 (for instance, sorting the subsets of B by weight, discarding subsets of B which weigh more than other subsets of B of greater or equal value, and using binary search to find the best match) result in a runtime of \n\n\n\nO\n(\nn\n\n2\n\nn\n\n/\n\n2\n\n\n)\n\n\n{\\displaystyle O(n2^{n/2})}\n\n. As with the meet in the middle attack in cryptography, this improves on the \n\n\n\nO\n(\nn\n∗\n\n2\n\nn\n\n\n)\n\n\n{\\displaystyle O(n*2^{n})}\n\n runtime of a naive brute force approach (examining all subsets of {1...n}), at the cost of using exponential rather than constant space (see also baby-step giant-step).\nAs for most NP-complete problems, it may be enough to find workable solutions even if they are not optimal. Preferably, however, the approximation comes with a guarantee on the difference between the value of the solution found and the value of the optimal solution.\nAs with many useful but computationally complex algorithms, there has been substantial research on creating and analyzing algorithms that approximate a solution. The knapsack problem, though NP-Hard, is one of a collection of algorithms that can still be approximated to any specified degree. This means that the problem has a polynomial time approximation scheme. To be exact, the knapsack problem has a fully polynomial time approximation scheme (FPTAS).[18]\nGeorge Dantzig proposed a greedy approximation algorithm to solve the unbounded knapsack problem.[19] His version sorts the items in decreasing order of value per unit of weight, \n\n\n\n\nv\n\ni\n\n\n\n/\n\n\nw\n\ni\n\n\n\n\n{\\displaystyle v_{i}/w_{i}}\n\n. It then proceeds to insert them into the sack, starting with as many copies as possible of the first kind of item until there is no longer space in the sack for more. Provided that there is an unlimited supply of each kind of item, if \n\n\n\nm\n\n\n{\\displaystyle m}\n\n is the maximum value of items that fit into the sack, then the greedy algorithm is guaranteed to achieve at least a value of \n\n\n\nm\n\n/\n\n2\n\n\n{\\displaystyle m/2}\n\n. However, for the bounded problem, where the supply of each kind of item is limited, the algorithm may be far from optimal.\nThe fully polynomial time approximation scheme (FPTAS) for the knapsack problem takes advantage of the fact that the reason the problem has no known polynomial time solutions is because the profits associated with the items are not restricted. If one rounds off some of the least significant digits of the profit values then they will be bounded by a polynomial and 1/ε where ε is a bound on the correctness of the solution. This restriction then means that an algorithm can find a solution in polynomial time that is correct within a factor of (1-ε) of the optimal solution.[18]\nTheorem: The set \n\n\n\n\nS\n′\n\n\n\n{\\displaystyle S'}\n\n computed by the algorithm above satisfies \n\n\n\n\np\nr\no\nf\ni\nt\n\n(\n\nS\n′\n\n)\n≥\n(\n1\n−\nε\n)\n⋅\n\np\nr\no\nf\ni\nt\n\n(\n\nS\n\n∗\n\n\n)\n\n\n{\\displaystyle \\mathrm {profit} (S')\\geq (1-\\varepsilon )\\cdot \\mathrm {profit} (S^{*})}\n\n, where \n\n\n\n\nS\n\n∗\n\n\n\n\n{\\displaystyle S^{*}}\n\n is an optimal solution.\nSolving the unbounded knapsack problem can be made easier by throwing away items which will never be needed. For a given item i, suppose we could find a set of items J such that their total weight is less than the weight of i, and their total value is greater than the value of i. Then i cannot appear in the optimal solution, because we could always improve any potential solution containing i by replacing i with the set J. Therefore, we can disregard the i-th item altogether. In such cases, J is said to dominate i. (Note that this does not apply to bounded knapsack problems, since we may have already used up the items in J.)\nFinding dominance relations allows us to significantly reduce the size of the search space. There are several different types of dominance relations,[11] which all satisfy an inequality of the form:\n\n\n\n\n\n\n∑\n\nj\n∈\nJ\n\n\n\nw\n\nj\n\n\n\n\nx\n\nj\n\n\n \n≤\nα\n\n\nw\n\ni\n\n\n\n\n{\\displaystyle \\qquad \\sum _{j\\in J}w_{j}\\,x_{j}\\ \\leq \\alpha \\,w_{i}}\n\n, and \n\n\n\n\n∑\n\nj\n∈\nJ\n\n\n\nv\n\nj\n\n\n\n\nx\n\nj\n\n\n \n≥\nα\n\n\nv\n\ni\n\n\n\n\n\n{\\displaystyle \\sum _{j\\in J}v_{j}\\,x_{j}\\ \\geq \\alpha \\,v_{i}\\,}\n\n for some \n\n\n\nx\n∈\n\nZ\n\n+\n\n\nn\n\n\n\n\n{\\displaystyle x\\in Z_{+}^{n}}\n\n\nwhere \n\n\n\nα\n∈\n\nZ\n\n+\n\n\n\n,\nJ\n⊊\nN\n\n\n{\\displaystyle \\alpha \\in Z_{+}\\,,J\\subsetneq N}\n\n and \n\n\n\ni\n∉\nJ\n\n\n{\\displaystyle i\\not \\in J}\n\n. The vector \n\n\n\nx\n\n\n{\\displaystyle x}\n\n denotes the number of copies of each member of J.\nThere are many variations of the knapsack problem that have arisen from the vast number of applications of the basic problem. The main variations occur by changing the number of some problem parameter such as the number of items, number of objectives, or even the number of knapsacks.\nThis variation changes the goal of the individual filling the knapsack. Instead of one objective, such as maximizing the monetary profit, the objective could have several dimensions. For example, there could be environmental or social concerns as well as economic goals. Problems frequently addressed include portfolio and transportation logistics optimizations.[20][21]\nAs a concrete example, suppose you ran a cruise ship. You have to decide how many famous comedians to hire. This boat can handle no more than one ton of passengers and the entertainers must weigh less than 1000 lbs. Each comedian has a weight, brings in business based on their popularity and asks for a specific salary. In this example you have multiple objectives. You want, of course, to maximize the popularity of your entertainers while minimizing their salaries. Also, you want to have as many entertainers as possible.\nIn this variation, the weight of knapsack item \n\n\n\ni\n\n\n{\\displaystyle i}\n\n is given by a D-dimensional vector \n\n\n\n\n\n\nw\n\ni\n\n\n¯\n\n\n=\n(\n\nw\n\ni\n1\n\n\n,\n…\n,\n\nw\n\ni\nD\n\n\n)\n\n\n{\\displaystyle {\\overline {w_{i}}}=(w_{i1},\\ldots ,w_{iD})}\n\n and the knapsack has a D-dimensional capacity vector \n\n\n\n(\n\nW\n\n1\n\n\n,\n…\n,\n\nW\n\nD\n\n\n)\n\n\n{\\displaystyle (W_{1},\\ldots ,W_{D})}\n\n. The target is to maximize the sum of the values of the items in the knapsack so that the sum of weights in each dimension \n\n\n\nd\n\n\n{\\displaystyle d}\n\n does not exceed \n\n\n\n\nW\n\nd\n\n\n\n\n{\\displaystyle W_{d}}\n\n.\nMulti-dimensional knapsack is computationally harder than knapsack; even for \n\n\n\nD\n=\n2\n\n\n{\\displaystyle D=2}\n\n, the problem does not have EPTAS unless P\n\n\n\n=\n\n\n{\\displaystyle =}\n\nNP.[22] However, the algorithm in [23] is shown to solve sparse instances efficiently. An instance of multi-dimensional knapsack is sparse if there is a set \n\n\n\nJ\n=\n{\n1\n,\n2\n,\n…\n,\nm\n}\n\n\n{\\displaystyle J=\\{1,2,\\ldots ,m\\}}\n\n for \n\n\n\nm\n<\nD\n\n\n{\\displaystyle m<D}\n\n such that for every knapsack item \n\n\n\ni\n\n\n{\\displaystyle i}\n\n, \n\n\n\n∃\nz\n>\nm\n\n\n{\\displaystyle \\exists z>m}\n\n such that \n\n\n\n∀\nj\n∈\nJ\n∪\n{\nz\n}\n,\n \n\nw\n\ni\nj\n\n\n≥\n0\n\n\n{\\displaystyle \\forall j\\in J\\cup \\{z\\},\\ w_{ij}\\geq 0}\n\n and \n\n\n\n∀\ny\n∉\nJ\n∪\n{\nz\n}\n,\n\nw\n\ni\ny\n\n\n=\n0\n\n\n{\\displaystyle \\forall y\\notin J\\cup \\{z\\},w_{iy}=0}\n\n. Such instances occur, for example, when scheduling packets in a wireless network with relay nodes.[23] The algorithm from [23] also solves sparse instances of the multiple choice variant, multiple-choice multi-dimensional knapsack.\nThe IHS (Increasing Height Shelf) algorithm is optimal for 2D knapsack (packing squares into a two-dimensional unit size square): when there are at most five square in an optimal packing.[24]\nThis variation is similar to the Bin Packing Problem. It differs from the Bin Packing Problem in that a subset of items can be selected, whereas, in the Bin Packing Problem, all items have to be packed to certain bins. The concept is that there are multiple knapsacks. This may seem like a trivial change, but it is not equivalent to adding to the capacity of the initial knapsack. This variation is used in many loading and scheduling problems in Operations Research and has a PTAS[25]\nAs described by Wu et al.:\nThe quadratic knapsack problem (QKP) maximizes a quadratic objective function subject to a binary and linear capacity constraint.[26]\nThe quadratic knapsack problem was discussed under that title by Gallo, Hammer, and Simeone in 1980.[27] However, Gallo and Simeone[28] attribute the first treatment of the problem to Witzgall[29] in 1975.\nThe subset sum problem is a special case of the decision and 0-1 problems where each kind of item, the weight equals the value: \n\n\n\n\nw\n\ni\n\n\n=\n\nv\n\ni\n\n\n\n\n{\\displaystyle w_{i}=v_{i}}\n\n. In the field of cryptography, the term knapsack problem is often used to refer specifically to the subset sum problem and is commonly known as one of Karp's 21 NP-complete problems.[30]\nThe generalization of subset sum problem is called multiple subset-sum problem, in which multiple bins exist with the same capacity. It has been shown that the generalization does not have an FPTAS.[31]", 
    "dbpedia_url": "http://dbpedia.org/resource/Knapsack_problem", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Knapsack_problem\n"
}