{
    "about": "Kruskal's algorithm is a minimum-spanning-tree algorithm which finds an edge of the least possible weight that connects any two trees in the forest.[1] It is a greedy algorithm in graph theory as it finds a minimum spanning tree for a connected weighted graph adding increasing cost arcs at each step.[1] This means it finds a subset of the edges that forms a tree that includes every vertex, where the total weight of all the edges in the tree is minimized. If the graph is not connected, then it finds a minimum spanning forest (a minimum spanning tree for each connected component).", 
    "name": "Kruskal'S Algorithm", 
    "classification": "Graph Algorithms", 
    "full_text": "Kruskal's algorithm is a minimum-spanning-tree algorithm which finds an edge of the least possible weight that connects any two trees in the forest.[1] It is a greedy algorithm in graph theory as it finds a minimum spanning tree for a connected weighted graph adding increasing cost arcs at each step.[1] This means it finds a subset of the edges that forms a tree that includes every vertex, where the total weight of all the edges in the tree is minimized. If the graph is not connected, then it finds a minimum spanning forest (a minimum spanning tree for each connected component).\nThis algorithm first appeared in Proceedings of the American Mathematical Society, pp. 48–50 in 1956, and was written by Joseph Kruskal.[2]\nOther algorithms for this problem include Prim's algorithm, Reverse-delete algorithm, and Borůvka's algorithm.\n\n\nAt the termination of the algorithm, the forest forms a minimum spanning forest of the graph. If the graph is connected, the forest has a single component and forms a minimum spanning tree.\nThe following code is implemented with disjoint-set data structure:\ncomplexity:\nO(Elog(v))\nWhere E is the number of edges in the graph and V is the number of vertices, Kruskal's algorithm can be shown to run in O(E log E) time, or equivalently, O(E log V) time, all with simple data structures. These running times are equivalent because:\nWe can achieve this bound as follows: first sort the edges by weight using a comparison sort in O(E log E) time; this allows the step \"remove an edge with minimum weight from S\" to operate in constant time. Next, we use a disjoint-set data structure (Union&Find) to keep track of which vertices are in which components. We need to perform O(V) operations, as in each iteration we connect a vertex to the spanning tree, two 'find' operations and possibly one union for each edge. Even a simple disjoint-set data structure such as disjoint-set forests with union by rank can perform O(V) operations in O(V log V) time. Thus the total time is O(E log E) = O(E log V).\nProvided that the edges are either already sorted or can be sorted in linear time (for example with counting sort or radix sort), the algorithm can use a more sophisticated disjoint-set data structure to run in O(E α(V)) time, where α is the extremely slowly growing inverse of the single-valued Ackermann function.\nThe proof consists of two parts. First, it is proved that the algorithm produces a spanning tree. Second, it is proved that the constructed spanning tree is of minimal weight.\nLet \n\n\n\nP\n\n\n{\\displaystyle P}\n\n be a connected, weighted graph and let \n\n\n\nY\n\n\n{\\displaystyle Y}\n\n be the subgraph of \n\n\n\nP\n\n\n{\\displaystyle P}\n\n produced by the algorithm. \n\n\n\nY\n\n\n{\\displaystyle Y}\n\n cannot have a cycle, being within one subtree and not between two different trees. \n\n\n\nY\n\n\n{\\displaystyle Y}\n\n cannot be disconnected, since the first encountered edge that joins two components of \n\n\n\nY\n\n\n{\\displaystyle Y}\n\n would have been added by the algorithm. Thus, \n\n\n\nY\n\n\n{\\displaystyle Y}\n\n is a spanning tree of \n\n\n\nP\n\n\n{\\displaystyle P}\n\n.\nWe show that the following proposition P is true by induction: If F is the set of edges chosen at any stage of the algorithm, then there is some minimum spanning tree that contains F.", 
    "dbpedia_url": "http://dbpedia.org/resource/Kruskal's_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Kruskal's_algorithm\n"
}