{
    "about": "The Tabular Islamic calendar (an example is the Fatimid or Misri calendar) is a rule-based variation of the Islamic calendar. It has the same numbering of years and months, but the months are determined by arithmetical rules rather than by observation or astronomical calculations. It was developed by early Muslim astronomers of the second hijra century (the 8th century of the Common Era) to provide a predictable time base for calculating the positions of the moon, sun, and planets. It is now used by historians to convert an Islamic date into a Western calendar when no other information (like the day of the week) is available.", 
    "name": "Kuwaiti Algorithm", 
    "classification": "Calendar Algorithms", 
    "full_text": "The Tabular Islamic calendar (an example is the Fatimid or Misri calendar) is a rule-based variation of the Islamic calendar. It has the same numbering of years and months, but the months are determined by arithmetical rules rather than by observation or astronomical calculations. It was developed by early Muslim astronomers of the second hijra century (the 8th century of the Common Era) to provide a predictable time base for calculating the positions of the moon, sun, and planets. It is now used by historians to convert an Islamic date into a Western calendar when no other information (like the day of the week) is available.\nIt is used by some Muslims in everyday life, particularly in the Ismaili and Dawoodi Bohra communities and they believe that this calendar was developed by Ali. It is believed that when Ali drew up this calendar, the previous events of the earlier prophets also fell into line with this calendar. It is their belief that all Fatimid Imams and their Da'is have followed this tradition.\nEach year has 12 months. The odd numbered months have 30 days and the even numbered months have 29 days, except in a leap year when the 12th and final month has 30 days.\n\n\nIn its most common form there are 11 leap years in a 30-year cycle. Noting that the average year has 354 11/30 days and a common year has 354 days, at the end of the first year of the 30-year cycle the remainder is 11/30 day. Whenever the remainder exceeds a half day (15/30 day), then a leap day is added to that year, reducing the remainder by one day. Thus at the end of the second year the remainder would be 22/30 day which is reduced to −8/30 day by a leap day. Using this rule the leap years are\nof the 30-year cycle. If leap days are added whenever the remainder equals or exceeds a half day, then all leap years are the same except 15 replaces 16.\nThe Ismaili Tayyebi community uses the following order of leap years in their 30-year cycle.\nApart from these, there is another version which orders the leap years as follows\nThe mean month is 29 191/360 days = 29.5305555... days, or 29d 12h 44m. This is slightly too short and so will be a day out in about 2500 years. The Tabular Islamic calendar also deviates from the observation based calendar in the short term for various reasons.\nThe \"Kuwaiti algorithm\" is used by Microsoft to convert between Gregorian calendar dates and Islamic calendar dates.[1][2] There is no fixed correspondence defined in advance between the Gregorian solar calendar and the Islamic lunar calendar, since the latter is defined by the visibility of the new moon by religious authorities and can therefore vary by a day or two, depending on the particular Islamic authority, weather conditions, and other variables. As an attempt to make conversions between the calendars somewhat predictable, Microsoft claims to have created this algorithm based on statistical analysis of historical data from Kuwait.\nAccording to Robert Harry van Gent at Utrecht University, the so-called \"Kuwaiti algorithm\" is simply an implementation of a standard Tabular Islamic calendar algorithm used in Islamic astronomical tables since the 11th century.[3]\nTabular Islamic calendars based on an eight - year cycle (with 2, 5 and 8 as leap years) were also used in the Ottoman Empire and in South-East Asia.[4] The cycle contains 96 months in 2835 days, giving a mean month length of 29.53125 days, or 29d 12h 45m. Though less accurate than the tabular calendars based on a 30-year cycle, it was popular due to the fact that in each cycle the weekdays fall on the same calendar date. In the Dutch East Indies the cycle was reset every 120 years by omitting the intercalary day at the end of the last year, thus resulting in a mean month length equal with that used in the 30-year cycles.[5]", 
    "dbpedia_url": "http://dbpedia.org/resource/Kuwaiti_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Kuwaiti_algorithm\n"
}