{
    "about": "In computer science, particularly the study of approximation algorithms, an L-reduction (\"linear reduction\") is a transformation of optimization problems which linearly preserves approximability features; it is one type of approximation-preserving reduction. L-reductions in studies of approximability of optimization problems play a similar role to that of polynomial reductions in the studies of computational complexity of decision problems.", 
    "classification": "Approximation Algorithms", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/L-reduction\n", 
    "full_text": "In computer science, particularly the study of approximation algorithms, an L-reduction (\"linear reduction\") is a transformation of optimization problems which linearly preserves approximability features; it is one type of approximation-preserving reduction. L-reductions in studies of approximability of optimization problems play a similar role to that of polynomial reductions in the studies of computational complexity of decision problems.\nThe term L reduction is sometimes used to refer to log-space reductions, by analogy with the complexity class L, but this is a different concept.\n\n\nLet A and B be optimization problems and cA and cB their respective cost functions. A pair of functions f and g is an L-reduction if all of the following conditions are met:\nAn L-reduction from problem A to problem B implies an AP-reduction when A and B are minimization problems and a PTAS reduction when A and B are maximization problems. In both cases, when B has a PTAS and there is a L-reduction from A to B, then A also has a PTAS.[1][2] This enables the use of L-reduction as a replacement for showing the existence of a PTAS-reduction; Crescenzi has suggested that the more natural formulation of L-reduction is actually more useful in many cases due to ease of usage.[3]\nLet the approximation ratio of B be \n\n\n\n1\n+\nδ\n\n\n{\\displaystyle 1+\\delta }\n\n. Begin with the approximation ratio of A, \n\n\n\n\n\n\n\nc\n\nA\n\n\n(\ny\n)\n\n\n\n\nO\nP\nT\n\n\nA\n\n\n(\nx\n)\n\n\n\n\n\n{\\displaystyle {\\frac {c_{A}(y)}{\\mathrm {OPT} _{A}(x)}}}\n\n. We can remove absolute values around the third condition of the L-reduction definition since we know A and B are minimization problems. Substitute that condition to obtain\nSimplifying, and substituting the first condition, we have\nBut the term in parentheses on the right-hand side actually equals \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n. Thus, the approximation ratio of A is \n\n\n\n1\n+\nα\nβ\nδ\n\n\n{\\displaystyle 1+\\alpha \\beta \\delta }\n\n.\nThis meets the conditions for AP-reduction.\nLet the approximation ratio of B be \n\n\n\n\n\n1\n\n1\n−\n\nδ\n′\n\n\n\n\n\n\n{\\displaystyle {\\frac {1}{1-\\delta '}}}\n\n. Begin with the approximation ratio of A, \n\n\n\n\n\n\n\nc\n\nA\n\n\n(\ny\n)\n\n\n\n\nO\nP\nT\n\n\nA\n\n\n(\nx\n)\n\n\n\n\n\n{\\displaystyle {\\frac {c_{A}(y)}{\\mathrm {OPT} _{A}(x)}}}\n\n. We can remove absolute values around the third condition of the L-reduction definition since we know A and B are maximization problems. Substitute that condition to obtain\nSimplifying, and substituting the first condition, we have\nBut the term in parentheses on the right-hand side actually equals \n\n\n\n\nδ\n′\n\n\n\n{\\displaystyle \\delta '}\n\n. Thus, the approximation ratio of A is \n\n\n\n\n\n1\n\n1\n−\nα\nβ\n\nδ\n′\n\n\n\n\n\n\n{\\displaystyle {\\frac {1}{1-\\alpha \\beta \\delta '}}}\n\n.\nIf \n\n\n\n\n\n1\n\n1\n−\nα\nβ\n\nδ\n′\n\n\n\n\n=\n1\n+\nϵ\n\n\n{\\displaystyle {\\frac {1}{1-\\alpha \\beta \\delta '}}=1+\\epsilon }\n\n, then \n\n\n\n\n\n1\n\n1\n−\n\nδ\n′\n\n\n\n\n=\n1\n+\n\n\nϵ\n\nα\nβ\n(\n1\n+\nϵ\n)\n−\nϵ\n\n\n\n\n\n{\\displaystyle {\\frac {1}{1-\\delta '}}=1+{\\frac {\\epsilon }{\\alpha \\beta (1+\\epsilon )-\\epsilon }}}\n\n, which meets the requirements for PTAS reduction but not AP-reduction.\nL-reductions also imply P-reduction.[3] One may deduce that L-reductions imply PTAS reductions from this fact and the fact that P-reductions imply PTAS reductions.\nL-reductions preserve membership in APX for the minimizing case only, as a result of implying AP-reductions.", 
    "name": "L Reduction"
}