{
    "about": "A Lagged Fibonacci generator (LFG or sometimes LFib) is an example of a pseudorandom number generator. This class of random number generator is aimed at being an improvement on the 'standard' linear congruential generator. These are based on a generalisation of the Fibonacci sequence.", 
    "name": "Lagged Fibonacci Generator", 
    "classification": "Pseudorandom Number Generators", 
    "full_text": "A Lagged Fibonacci generator (LFG or sometimes LFib) is an example of a pseudorandom number generator. This class of random number generator is aimed at being an improvement on the 'standard' linear congruential generator. These are based on a generalisation of the Fibonacci sequence.\nThe Fibonacci sequence may be described by the recurrence relation:\nHence, the new term is the sum of the last two terms in the sequence. This can be generalised to the sequence:\nIn which case, the new term is some combination of any two previous terms. m is usually a power of 2 (m = 2M), often 232 or 264. The \n\n\n\n⋆\n\n\n{\\displaystyle \\star }\n\n operator denotes a general binary operation. This may be either addition, subtraction, multiplication, or the bitwise arithmetic exclusive-or operator (XOR). The theory of this type of generator is rather complex, and it may not be sufficient simply to choose random values for j and k. These generators also tend to be very sensitive to initialisation.\nGenerators of this type employ k words of state (they 'remember' the last k values).\nIf the operation used is addition, then the generator is described as an Additive Lagged Fibonacci Generator or ALFG, if multiplication is used, it is a Multiplicative Lagged Fibonacci Generator or MLFG, and if the XOR operation is used, it is called a Two-tap generalised feedback shift register or GFSR. The Mersenne twister algorithm is a variation on a GFSR. The GFSR is also related to the linear feedback shift register, or LFSR.\n\n\nLagged Fibonacci generators have a maximum period of (2k - 1)*2M-1 if addition or subtraction is used, and (2k-1)*k if exclusive-or operations are used to combine the previous values. If, on the other hand, multiplication is used, the maximum period is (2k - 1)*2M-3, or 1/4 of period of the additive case.\nFor the generator to achieve this maximum period, the polynomial:\nmust be primitive over the integers mod 2. Values of j and k satisfying this constraint have been published in the literature. Popular pairs are:\nAnother list of possible values for j and k is on page 29 of volume 2 of The Art of Computer Programming:\nNote that the smaller number have short periods (only a few \"random\" numbers are generated before the first \"random\" number is repeated and the sequence restarts).\nIf addition is used, it is required that at least one of the first k values chosen to initialise the generator be odd; if multiplication is used, instead, it is required that all the first k values be odd.[1]\nIt has been suggested that good ratios between j and k are approximately the golden ratio.[2]\nIn a paper on four-tap shift registers, Robert M. Ziff, referring to LFGs that use the XOR operator, states that \"It is now widely known that such generators, in particular with the two-tap rules such as R(103, 250), have serious deficiencies. Marsaglia observed very poor behavior with R(24,55) and smaller generators, and advised against using generators of this type altogether. ... The basic problem of two-tap generators R(a, b) is that they have a built-in three-point correlation between \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n, \n\n\n\n\nx\n\nn\n−\na\n\n\n\n\n{\\displaystyle x_{n-a}}\n\n, and \n\n\n\n\nx\n\nn\n−\nb\n\n\n\n\n{\\displaystyle x_{n-b}}\n\n, simply given by the generator itself ... While these correlations are spread over the size \n\n\n\np\n=\nm\na\nx\n(\na\n,\nb\n,\nc\n,\n…\n)\n\n\n{\\displaystyle p=max(a,b,c,\\ldots )}\n\n of the generator itself, they can evidently still lead to significant errors.\".[3] This only refers to the standard LFG where each new number in the sequence depends on two previous numbers. A three-tap LFG has been shown to eliminate some statistical problems such as failing the Birthday Spacings and Generalized Triple tests.[2]\nThe initialization of LFGs is a very complex problem. The output of LFGs is very sensitive to initial conditions, and statistical defects may appear initially but also periodically in the output sequence unless extreme care is taken .[citation needed] Another potential problem with LFGs is that the mathematical theory behind them is incomplete, making it necessary to rely on statistical tests rather than theoretical performance.", 
    "dbpedia_url": "http://dbpedia.org/resource/Lagged_Fibonacci_generator", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Lagged_Fibonacci_generator\n"
}