{
    "about": "In numerical analysis, Laguerre's method is a root-finding algorithm tailored to polynomials. In other words, Laguerre's method can be used to numerically solve the equation p(x) = 0 for a given polynomial p(x). One of the most useful properties of this method is that it is, from extensive empirical study, very close to being a \"sure-fire\" method, meaning that it is almost guaranteed to always converge to some root of the polynomial, no matter what initial guess is chosen. This method is named in honour of Edmond Laguerre, a French mathematician.", 
    "name": "Laguerre'S Method", 
    "classification": "Root-Finding Algorithms", 
    "full_text": "In numerical analysis, Laguerre's method is a root-finding algorithm tailored to polynomials. In other words, Laguerre's method can be used to numerically solve the equation p(x) = 0 for a given polynomial p(x). One of the most useful properties of this method is that it is, from extensive empirical study, very close to being a \"sure-fire\" method, meaning that it is almost guaranteed to always converge to some root of the polynomial, no matter what initial guess is chosen. This method is named in honour of Edmond Laguerre, a French mathematician.\n\n\nThe algorithm of the Laguerre method to find one root of a polynomial p(x) of degree n is:\nIf a root has been found, the corresponding linear factor can be removed from p. This deflation step reduces the degree of the polynomial by one, so that eventually, approximations for all roots of p can be found. Note however that deflation can lead to approximate factors that differ significantly from the corresponding exact factors. This error is least if the roots are found in the order of increasing magnitude.\nThe fundamental theorem of algebra states that every nth degree polynomial \n\n\n\np\n\n\n{\\displaystyle p}\n\n can be written in the form\nsuch that \n\n\n\n\nx\n\nk\n\n\n\n\n{\\displaystyle x_{k}}\n\n where \n\n\n\n(\nk\n=\n1\n,\n2\n,\n.\n.\n.\n,\nn\n)\n\n\n{\\displaystyle (k=1,2,...,n)}\n\n are the roots of the polynomial. If we take the natural logarithm of both sides, we find that\nDenote the derivative by\nand the negated second derivative by\nWe then make what Acton calls a 'drastic set of assumptions', that the root we are looking for, say, \n\n\n\n\nx\n\n1\n\n\n\n\n{\\displaystyle x_{1}}\n\n is a certain distance away from our guess \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, and all the other roots are clustered together some distance away. If we denote these distances by\nand\nthen our equation for \n\n\n\nG\n\n\n{\\displaystyle G}\n\n may be written as\nand the expression for \n\n\n\nH\n\n\n{\\displaystyle H}\n\n becomes\nSolving these equations for \n\n\n\na\n\n\n{\\displaystyle a}\n\n, we find that\nwhere the square root of a complex number is chosen to produce larger absolute value of the denominator, or equivalently, to satisfy:\nwhere Re denotes real part of a complex number, and G is the complex conjugate of G; or\nwhere the square root of a complex number is chosen to have a non-negative real part.\nFor small values of p(x) this formula differs from the offset of the third order Halley's method by an error of O(p(x)3), so convergence close to a root will be cubic as well.\nNote that, even if the 'drastic set of assumptions' does not work for some particular polynomial p(x), p(x) can be transformed into a related polynomial r for which the assumptions are correct, e.g. by shifting the origin towards a suitable complex number w, giving q(x) = p(x − w), to give distinct roots distinct magnitudes if necessary (which it will be if some roots are complex conjugates), and then getting r from q(x) by repeatedly applying the root squaring transformation used in Graeffe's method enough times to make the smaller roots significantly smaller than the largest root (and so, clustered in comparison); the approximate root from Graeffe's method can then be used to start the new iteration for Laguerre's method on r. An approximate root for p(x) may then be obtained straightforwardly from that for r.\nIf we make the stronger assumption that the terms in G corresponding to the roots xi, i = 2, 3, …, n are negligibly small in comparison to the term corresponding to the root x1, this leads to Newton's method.\nIf x is a simple root of the polynomial p(x), then Laguerre's method converges cubically whenever the initial guess x0 is close enough to the root x. On the other hand, if x is a multiple root then the convergence is only linear. This is obtained with the penalty of calculating values for the polynomial and its first and second derivatives at each stage of the iteration.\nA major advantage of Laguerre's method is that it is almost guaranteed to converge to some root of the polynomial no matter where the initial approximation is chosen. This is in contrast to other methods such as the Newton–Raphson method which may fail to converge for poorly chosen initial guesses. It may even converge to a complex root of the polynomial, because of the square root being taken in the calculation of a above may be of a negative number. This may be considered an advantage or a liability depending on the application to which the method is being used. Empirical evidence has shown that convergence failure is extremely rare, making this a good candidate for a general purpose polynomial root finding algorithm. However, given the fairly limited theoretical understanding of the algorithm, many numerical analysts are hesitant to use it as such, and prefer better understood methods such as the Jenkins–Traub algorithm, for which more solid theory has been developed. Nevertheless, the algorithm is fairly simple to use compared to these other \"sure-fire\" methods, easy enough to be used by hand or with the aid of a pocket calculator when an automatic computer is unavailable. The speed at which the method converges means that one is only very rarely required to compute more than a few iterations to get high accuracy.", 
    "dbpedia_url": "http://dbpedia.org/resource/Laguerre's_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Laguerre's_method\n"
}