{
    "about": "In mathematics, the Lanczos approximation is a method for computing the gamma function numerically, published by Cornelius Lanczos in 1964. It is a practical alternative to the more popular Stirling's approximation for calculating the gamma function with fixed precision.", 
    "name": "Lanczos Approximation", 
    "classification": "Numerical Analysis", 
    "full_text": "In mathematics, the Lanczos approximation is a method for computing the gamma function numerically, published by Cornelius Lanczos in 1964. It is a practical alternative to the more popular Stirling's approximation for calculating the gamma function with fixed precision.\n\n\nThe Lanczos approximation consists of the formula\nfor the gamma function, with\nHere g is a constant that may be chosen arbitrarily subject to the restriction that Re(z) > 1/2.[1] The coefficients p, which depend on g, are slightly more difficult to calculate (see below). Although the formula as stated here is only valid for arguments in the right complex half-plane, it can be extended to the entire complex plane by the reflection formula,\nThe series A is convergent, and may be truncated to obtain an approximation with the desired precision. By choosing an appropriate g (typically a small integer), only some 5–10 terms of the series are needed to compute the Gamma function with typical single or double floating-point precision. If a fixed g is chosen, the coefficients can be calculated in advance and the sum is recast into the following form:\nThus computing the gamma function becomes a matter of evaluating only a small number of elementary functions and multiplying by stored constants. The Lanczos approximation was popularized by Numerical Recipes, according to which computing the Gamma function becomes \"not much more difficult than other built-in functions that we take for granted, such as sin x or ex\". The method is also implemented in the GNU Scientific Library.\nThe coefficients are given by\nwith C(i, j) denoting the (i, j)th element of the Chebyshev polynomial coefficient matrix which can be calculated recursively from the identities\nPaul Godfrey describes how to obtain the coefficients and also the value of the truncated series A as a matrix product.\nLanczos derived the formula from Leonhard Euler's integral\nperforming a sequence of basic manipulations to obtain\nand deriving a series for the integral.\nThe following implementation in the Python programming language works for complex arguments and typically gives 15 correct decimal places:", 
    "dbpedia_url": "http://dbpedia.org/resource/Lanczos_approximation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Lanczos_approximation\n"
}