{
    "about": "In combinatorics and in experimental design, a Latin square is an n × n array filled with n different symbols, each occurring exactly once in each row and exactly once in each column. An example of a 3x3 Latin square is:", 
    "name": "Latin Square", 
    "classification": "Error Detection And Correction", 
    "full_text": "In combinatorics and in experimental design, a Latin square is an n × n array filled with n different symbols, each occurring exactly once in each row and exactly once in each column. An example of a 3x3 Latin square is:\nThe name \"Latin square\" was inspired by mathematical papers by Leonhard Euler (1707–1783), who used Latin characters as symbols,[1] but any set of symbols can be used: in the above example, the alphabetic sequence A, B, C can be replaced by the integer sequence 1, 2, 3.\n\n\nA Latin square is said to be reduced (also, normalized or in standard form) if both its first row and its first column are in their natural order. For example, the Latin square above is not reduced because its first column is A, C, B rather than A, B, C.\nAny Latin square can be reduced by permuting (that is, reordering) the rows and columns. Here switching the above matrix's second and third rows yields the following square:\nThis Latin square is reduced; both its first row and its first column are alphabetically ordered A, B, C.\nIf each entry of an n × n Latin square is written as a triple (r,c,s), where r is the row, c is the column, and s is the symbol, we obtain a set of n2 triples called the orthogonal array representation of the square. For example, the orthogonal array representation of the following Latin square is:\nwhere for example the triple (2,3,1) means that in row 2 and column 3 there is the symbol 1. The definition of a Latin square can be written in terms of orthogonal arrays:\nFor any Latin square, there are n2 triples since choosing any two uniquely determines the third. (Otherwise, an ordered pair would appear more than once in the Latin square.)\nThe orthogonal array representation shows that rows, columns and symbols play rather similar roles, as will be made clear below.\nMany operations on a Latin square produce another Latin square (for example, turning it upside down).\nIf we permute the rows, permute the columns, and permute the names of the symbols of a Latin square, we obtain a new Latin square said to be isotopic to the first. Isotopism is an equivalence relation, so the set of all Latin squares is divided into subsets, called isotopy classes, such that two squares in the same class are isotopic and two squares in different classes are not isotopic.\nAnother type of operation is easiest to explain using the orthogonal array representation of the Latin square. If we systematically and consistently reorder the three items in each triple, another orthogonal array (and, thus, another Latin square) is obtained. For example, we can replace each triple (r,c,s) by (c,r,s) which corresponds to transposing the square (reflecting about its main diagonal), or we could replace each triple (r,c,s) by (c,s,r), which is a more complicated operation. Altogether there are 6 possibilities including \"do nothing\", giving us 6 Latin squares called the conjugates (also parastrophes) of the original square.\nFinally, we can combine these two equivalence operations: two Latin squares are said to be paratopic, also main class isotopic, if one of them is isotopic to a conjugate of the other. This is again an equivalence relation, with the equivalence classes called main classes, species, or paratopy classes. Each main class contains up to 6 isotopy classes.\nThere is no known easily computable formula for the number Ln of n × n Latin squares with symbols 1,2,...,n. The most accurate upper and lower bounds known for large n are far apart. One classic result[2] is that\nA simple and explicit formula for the number of Latin squares was published in 1992, but it is still not easily computable due to the exponential increase in the number of terms. This formula for the number Ln of n × n Latin squares is,[3]\n\n\n\n\n\nL\n\nn\n\n\n=\nn\n!\n\n∑\n\nA\n∈\n\nB\n\nn\n\n\n\n\n\n\n(\n−\n1\n\n)\n\n\nσ\n\n0\n\n\n(\nA\n)\n\n\n\n(\n\n \n \nn\n\n\np\ne\nr\nA\n\n\n)\n,\n\n\n{\\displaystyle L_{n}=n!\\sum _{A\\in B_{n}}^{}(-1)^{\\sigma _{0}(A)}(_{\\ \\ n}^{perA}),}\n\n\nwhere Bn is the set of all {0,1} n × n matrices, σ0(A) is the number of zero entries in matrix A, and per(A) is the permanent of matrix A.\nThe table below contains all known exact values. It can be seen that the numbers grow exceedingly quickly. For each n, the number of Latin squares altogether (sequence A002860 in the OEIS) is n! (n-1)! times the number of reduced Latin squares (sequence A000315 in the OEIS).\nFor each n, each isotopy class (sequence A040082 in the OEIS) contains up to (n!)3 Latin squares (the exact number varies), while each main class (sequence A003090 in the OEIS) contains either 1, 2, 3 or 6 isotopy classes.\nThe number of structurally distinct Latin squares (i.e. the squares cannot be made identical by means of rotation, reflexion, and/or permutation of the symbols) for n = 1 up to 6 is 1, 1, 1, 12, 192, 145164 respectively (sequence A264603 in the OEIS) .\nWe give one example of a Latin square from each main class up to order 5.\nThey present, respectively, the multiplication tables of the following groups:\nFor small squares it is possible to generate permutations and test whether the Latin square property is met. For larger squares, Jacobson and Matthews' algorithm allows sampling from a uniform distribution over the space of n × n Latin squares.[4]\nSets of Latin squares that are orthogonal to each other have found an application as error correcting codes in situations where communication is disturbed by more types of noise than simple white noise, such as when attempting to transmit broadband Internet over powerlines.[7][8][9]\nFirstly, the message is sent by using several frequencies, or channels, a common method that makes the signal less vulnerable to noise at any one specific frequency. A letter in the message to be sent is encoded by sending a series of signals at different frequencies at successive time intervals. In the example below, the letters A to L are encoded by sending signals at four different frequencies, in four time slots. The letter C, for instance, is encoded by first sending at frequency 3, then 4, 1 and 2.\nThe encoding of the twelve letters are formed from three Latin squares that are orthogonal to each other. Now imagine that there's added noise in channels 1 and 2 during the whole transmission. The letter A would then be picked up as:\nIn other words, in the first slot we receive signals from both frequency 1 and frequency 2; while the third slot has signals from frequencies 1, 2 and 3. Because of the noise, we can no longer tell if the first two slots were 1,1 or 1,2 or 2,1 or 2,2. But the 1,2 case is the only one that yields a sequence matching a letter in the above table, the letter A. Similarly, we may imagine a burst of static over all frequencies in the third slot:\nAgain, we are able to infer from the table of encodings that it must have been the letter A being transmitted. The number of errors this code can spot is one less than the number of time slots. It has also been proved that if the number of frequencies is a prime or a power of a prime, the orthogonal Latin squares produce error detecting codes that are as efficient as possible.\nThe problem of determining if a partially filled square can be completed to form a Latin square is NP-complete.[10]\nThe popular Sudoku puzzles are a special case of Latin squares; any solution to a Sudoku puzzle is a Latin square.\nSudoku imposes the additional restriction that nine particular 3×3 adjacent subsquares must also contain the digits 1–9 (in the standard version). The more recent KenKen puzzles are also examples of Latin squares.\nLatin squares have been used as the basis for several board games, notably the popular abstract strategy game Kamisado.\nThe Latin square also figures in the arms of the Statistical Society of Canada,[11] being specifically mentioned in its blazon. Also, it appears in the logo of the International Biometric Society.[12]", 
    "dbpedia_url": "http://dbpedia.org/resource/Latin_square", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Latin_square\n"
}