{
    "about": "Lattice Boltzmann methods (LBM) (or thermal Lattice Boltzmann methods (TLBM)) is a class of computational fluid dynamics (CFD) methods for fluid simulation. Instead of solving the Navier–Stokes equations, the discrete Boltzmann equation is solved to simulate the flow of a Newtonian fluid with collision models such as Bhatnagar–Gross–Krook (BGK). By simulating streaming and collision processes across a limited number of particles, the intrinsic particle interactions evince a microcosm of viscous flow behavior applicable across the greater mass.", 
    "name": "Lattice Boltzmann Methods", 
    "classification": "Computational Physics", 
    "full_text": "Lattice Boltzmann methods (LBM) (or thermal Lattice Boltzmann methods (TLBM)) is a class of computational fluid dynamics (CFD) methods for fluid simulation. Instead of solving the Navier–Stokes equations, the discrete Boltzmann equation is solved to simulate the flow of a Newtonian fluid with collision models such as Bhatnagar–Gross–Krook (BGK). By simulating streaming and collision processes across a limited number of particles, the intrinsic particle interactions evince a microcosm of viscous flow behavior applicable across the greater mass.\n\n\nLBM is a relatively new simulation technique for complex fluid systems and has attracted interest from researchers in computational physics. Unlike the traditional CFD methods, which solve the conservation equations of macroscopic properties (i.e., mass, momentum, and energy) numerically, LBM models the fluid consisting of fictive particles, and such particles perform consecutive propagation and collision processes over a discrete lattice mesh. Due to its particulate nature and local dynamics, LBM has several advantages over other conventional CFD methods, especially in dealing with complex boundaries, incorporating microscopic interactions, and parallelization of the algorithm.[citation needed] A different interpretation of the Lattice Boltzmann equation is that of a discrete-velocity Boltzmann equation. The numerical methods of solution of the system of partial differential equations then gives rise to a discrete map, which can be interpreted as the propagation and collision of fictitious particles.\nIn the computer algorithm, the collision and streaming step are defined as follows:\nCollision step: \n\n\n\n\nf\n\ni\n\n\nt\n\n\n(\n\n\n\nx\n→\n\n\n\n,\nt\n+\n\nδ\n\nt\n\n\n)\n=\n\nf\n\ni\n\n\n(\n\n\n\nx\n→\n\n\n\n,\nt\n)\n+\n\n\n1\n\nτ\n\nf\n\n\n\n\n(\n\nf\n\ni\n\n\ne\nq\n\n\n−\n\nf\n\ni\n\n\n)\n\n\n\n\n{\\displaystyle f_{i}^{t}({\\vec {x}},t+\\delta _{t})=f_{i}({\\vec {x}},t)+{\\frac {1}{\\tau _{f}}}(f_{i}^{eq}-f_{i})\\,\\!}\n\n\nStreaming step: \n\n\n\n\nf\n\ni\n\n\n(\n\n\n\nx\n→\n\n\n\n+\n\n\n\n\ne\n→\n\n\n\n\ni\n\n\n\nδ\n\nt\n\n\n,\nt\n+\n\nδ\n\nt\n\n\n)\n=\n\nf\n\ni\n\n\nt\n\n\n(\n\n\n\nx\n→\n\n\n\n,\nt\n+\n\nδ\n\nt\n\n\n)\n\n\n\n\n{\\displaystyle f_{i}({\\vec {x}}+{\\vec {e}}_{i}\\delta _{t},t+\\delta _{t})=f_{i}^{t}({\\vec {x}},t+\\delta _{t})\\,\\!}\n\n\nHere i are the directions of momentum.\nDespite the increasing popularity of LBM in simulating complex fluid systems, this novel approach has some limitations. At present, high-Mach number flows in aerodynamics are still difficult for LBM, and a consistent thermo-hydrodynamic scheme is absent. However, as with Navier–Stokes based CFD, LBM methods have been successfully coupled to thermal-specific solutions to enable heat transfer (solids-based conduction, convection and radiation) simulation capability. For multiphase/multicomponent models, the interface thickness is usually large and the density ratio across the interface is small when compared with real fluids. Recently this problem has been resolved by Yuan and Schaefer who improved on models by Shan and Chen, Swift, and He, Chen, and Zhang. They were able to reach density ratios of 1000:1 by simply changing the equation of state.\nNevertheless, the wide applications and fast advancements of this method during the past twenty years have proven its potential in computational physics, including microfluidics: LBM demonstrates promising results in the area of high Knudsen number flows.\nLBM originated from the lattice gas automata (LGA) method, which can be considered as a simplified fictitious molecular dynamics model in which space, time, and particle velocities are all discrete. For example, in the 2-dimensional FHP Model each lattice node is connected to its neighbors by 6 lattice velocities on a triangular lattice; there can be either 0 or 1 particles at a lattice node moving with a given lattice velocity. After a time interval, each particle will move to the neighboring node in its direction; this process is called the propagation or streaming step. When more than one particle arrives at the same node from different directions, they collide and change their velocities according to a set of collision rules. Streaming steps and collision steps alternate. Suitable collision rules should conserve the particle number (mass), momentum, and energy before and after the collision. LGA suffer from several innate defects for use in hydrodynamic simulations: lack of Galilean invariance for fast flows, statistical noise and poor Reynolds number scaling with lattice size. LGA are, however, well suited to simplify and extend the reach of reaction diffusion and molecular dynamics models.\nThe main motivation for the transition from LGA to LBM was the desire to remove the statistical noise by replacing the Boolean particle number in a lattice direction with its ensemble average, the so-called density distribution function. Accompanying this replacement, the discrete collision rule is also replaced by a continuous function known as the collision operator. In the LBM development, an important simplification is to approximate the collision operator with the Bhatnagar-Gross-Krook (BGK) relaxation term. This lattice BGK (LBGK) model makes simulations more efficient and allows flexibility of the transport coefficients. On the other hand, it has been shown that the LBM scheme can also be considered as a special discretized form of the continuous Boltzmann equation. From Chapman-Enskog theory, one can recover the governing continuity and Navier–Stokes equations from the LBM algorithm. In addition, th also directly available from the density distributions and hence there is no extra Poisson equation to be solved as in traditional CFD methods.\nLattice Boltzmann models can be operated on a number of different lattices, both cubic and triangular, and with or without rest particles in the discrete distribution function.\nA popular way of classifying the different methods by lattice is the DnQm scheme. Here \"Dn\" stands for \"n dimensions\", while \"Qm\" stands for \"m speeds\". For example, D3Q15 is a 3-dimensional Lattice Boltzmann model on a cubic grid, with rest particles present. Each node has a crystal shape and can deliver particles to 15 nodes: each of the 6 neighboring nodes that share a surface, the 8 neighboring nodes sharing a corner, and itself.[1] (The D3Q15 model does not contain particles moving to the 12 neighboring nodes that share an edge; adding those would create a \"D3Q27\" model.)\nReal quantities as space and time need to be converted to lattice units prior to simulation. Nondimensional quantities, like the Reynolds number, remain the same.\nIn most Lattice Boltzmann simulations \n\n\n\n\nδ\n\nx\n\n\n\n\n\n\n{\\displaystyle \\delta _{x}\\,\\!}\n\n is the basic unit for lattice spacing, so if the domain of length \n\n\n\nL\n\n\n\n\n{\\displaystyle L\\,\\!}\n\n has \n\n\n\nN\n\n\n\n\n{\\displaystyle N\\,\\!}\n\n lattice units along its entire length, the space unit is simply defined as \n\n\n\n\nδ\n\nx\n\n\n=\nL\n\n/\n\nN\n\n\n\n\n{\\displaystyle \\delta _{x}=L/N\\,\\!}\n\n. Speeds in Lattice Boltzmann simulations are typically given in terms of the speed of sound. The discrete time unit can therefore be given as \n\n\n\n\nδ\n\nt\n\n\n=\n\n\n\nδ\n\nx\n\n\n\nC\n\ns\n\n\n\n\n\n\n\n\n{\\displaystyle \\delta _{t}={\\frac {\\delta _{x}}{C_{s}}}\\,\\!}\n\n, where the denominator \n\n\n\n\nC\n\ns\n\n\n\n\n{\\displaystyle C_{s}}\n\n is the physical speed of sound.[2]\nFor small-scale flows (such as those seen in porous media mechanics), operating with the true speed of sound can lead to unacceptably short time steps. It is therefore common to raise the lattice Mach number to something much larger than the real Mach number, and compensating for this by raising the viscosity as well in order to preserve the Reynolds number.[3]\nSimulating multiphase/multicomponent flows has always been a challenge to conventional CFD because of the moving and deformable interfaces. More fundamentally, the interfaces between different phases (liquid and vapor) or components (e.g., oil and water) originate from the specific interactions among fluid molecules. Therefore, it is difficult to implement such microscopic interactions into the macroscopic Navier–Stokes equation. However, in LBM, the particulate kinetics provides a relatively easy and consistent way to incorporate the underlying microscopic interactions by modifying the collision operator. Several LBM multiphase/multicomponent models have been developed. Here phase separations are generated automatically from the particle dynamics and no special treatment is needed to manipulate the interfaces as in traditional CFD methods. Successful applications of multiphase/multicomponent LBM models can be found in various complex fluid systems, including interface instability, bubble/droplet dynamics, wetting on solid surfaces, interfacial slip, and droplet electrohydrodynamic deformations.\nA Lattice Boltzmann model for simulation of gas mixture combustion capable of accommodating significant density variations at low-Mach number regime has been recently proposed.[4]\nTo this respect, it is worth to notice that, since LBM deals with a larger set of fields (as compared to conventional CFD), the simulation of reactive gas mixtures presents some additional challenges in terms of memory demand as far as large detailed combustion mechanisms are concerned. Those issues may be addressed, though, by resorting to systematic model reduction techniques.[5][6][7]\nCurrently (2009), a thermal lattice-Boltzmann method (TLBM) falls into one of three categories: the multi-speed approach,[8] the passive scalar approach,[9] and the thermal energy distribution.[10]\nStarting with the discrete Lattice Boltzmann equation (also referred to as LBGK equation due to the collision operator used). We first do a 2nd-order Taylor series expansion about the left side of the LBE. This is chosen over a simpler 1st-order Taylor expansion as the discrete LBE cannot be recovered. When doing the 2nd-order Taylor series expansion, the zero derivative term and the first term on the right will cancel, leaving only the first and second derivative terms of the Taylor expansion and the collision operator:\nFor simplicity, write \n\n\n\n\nf\n\ni\n\n\n(\n\n\n\nx\n→\n\n\n\n,\nt\n)\n\n\n{\\displaystyle f_{i}({\\vec {x}},t)}\n\n as \n\n\n\n\nf\n\ni\n\n\n\n\n{\\displaystyle f_{i}}\n\n. The slightly simplified Taylor series expansion is then as follows, where \":\" is the colon product between dyads:\nBy expanding the particle distribution function into equilibrium and non-equilibrium components and using the Chapman-Enskog expansion, where \n\n\n\nK\n\n\n{\\displaystyle K}\n\n is the Knudsen number, the Taylor-expanded LBE can be decomposed into different magnitudes of order for the Knudsen number in order to obtain the proper continuum equations:\nThe equilibrium and non-equilibrium distributions satisfy the following relations to their macroscopic variables (these will be used later, once the particle distributions are in the \"correct form\" in order to scale from the particle to macroscopic level):\nThe Chapman-Enskog expansion is then:\nBy substituting the expanded equilibrium and non-equilibrium into the Taylor expansion and separating into different orders of \n\n\n\nK\n\n\n{\\displaystyle K}\n\n, the continuum equations are nearly derived.\nFor order \n\n\n\n\nK\n\n0\n\n\n\n\n{\\displaystyle K^{0}}\n\n:\nFor order \n\n\n\n\nK\n\n1\n\n\n\n\n{\\displaystyle K^{1}}\n\n:\nThen, the second equation can be simplified with some algebra and the first equation into the following:\nApplying the relations between the particle distribution functions and the macroscopic properties from above, the mass and momentum equations are achieved:\nThe momentum flux tensor \n\n\n\nΠ\n\n\n{\\displaystyle \\Pi }\n\n has the following form then:\nwhere \n\n\n\n\n\n\n\ne\n→\n\n\n\n\ni\nx\n\n\n\n\n\n\ne\n→\n\n\n\n\ni\ny\n\n\n\n\n{\\displaystyle {\\vec {e}}_{ix}{\\vec {e}}_{iy}}\n\n is shorthand for the square of the sum of all the components of \n\n\n\n\n\n\n\ne\n→\n\n\n\n\ni\n\n\n\n\n{\\displaystyle {\\vec {e}}_{i}}\n\n (i. e. \n\n\n\n\n\n\n(\n\n∑\n\nx\n\n\n\n\n\n\ne\n→\n\n\n\n\ni\nx\n\n\n)\n\n\n2\n\n\n=\n\n∑\n\nx\n\n\n\n∑\n\ny\n\n\n\n\n\n\ne\n→\n\n\n\n\ni\nx\n\n\n\n\n\n\ne\n→\n\n\n\n\ni\ny\n\n\n\n\n\n{\\displaystyle \\textstyle \\left(\\sum _{x}{\\vec {e}}_{ix}\\right)^{2}=\\sum _{x}\\sum _{y}{\\vec {e}}_{ix}{\\vec {e}}_{iy}}\n\n), and the equilibrium particle distribution with second order to be comparable to the Navier–Stokes equation is:\nThe equilibrium distribution is only valid for small velocities or small Mach numbers. Inserting the equilibrium distribution back into the flux tensor leads to:\nFinally, the Navier–Stokes equation is recovered under the assumption that density variation is small:\nThis derivation follows the work of Chen and Doolen.[11]\nThe continuous Boltzmann equation is an evolution equation for a single particle probability distribution function \n\n\n\nf\n(\n\n\n\nx\n→\n\n\n\n,\n\n\n\n\ne\n→\n\n\n\n\ni\n\n\n,\nt\n)\n\n\n{\\displaystyle f({\\vec {x}},{\\vec {e}}_{i},t)}\n\n and the internal energy density distribution function \n\n\n\ng\n(\n\n\n\nx\n→\n\n\n\n,\n\n\n\n\ne\n→\n\n\n\n\ni\n\n\n,\nt\n)\n\n\n{\\displaystyle g({\\vec {x}},{\\vec {e}}_{i},t)}\n\n (He et al.) are each respectively:\nwhere \n\n\n\ng\n(\n\n\n\nx\n→\n\n\n\n,\n\n\n\n\ne\n→\n\n\n\n\ni\n\n\n,\nt\n)\n\n\n{\\displaystyle g({\\vec {x}},{\\vec {e}}_{i},t)}\n\n is related to \n\n\n\nf\n(\n\n\n\nx\n→\n\n\n\n,\n\n\n\n\ne\n→\n\n\n\n\ni\n\n\n,\nt\n)\n\n\n{\\displaystyle f({\\vec {x}},{\\vec {e}}_{i},t)}\n\n by\n\n\n\n\nF\n\n\n{\\displaystyle F}\n\n is an external force, \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n is a collision integral, and \n\n\n\n\n\n\ne\n→\n\n\n\n\n\n{\\displaystyle {\\vec {e}}}\n\n (also labeled by \n\n\n\n\n\n\nξ\n→\n\n\n\n\n\n{\\displaystyle {\\vec {\\xi }}}\n\n in literature) is the microscopic velocity. The external force \n\n\n\nF\n\n\n{\\displaystyle F}\n\n is related to temperature external force \n\n\n\nG\n\n\n{\\displaystyle G}\n\n by the relation below. A typical test for one's model is the Rayleigh–Bénard convection for \n\n\n\nG\n\n\n{\\displaystyle G}\n\n.\nMacroscopic variables such as density \n\n\n\nρ\n\n\n{\\displaystyle \\rho }\n\n, velocity \n\n\n\n\n\n\nu\n→\n\n\n\n\n\n{\\displaystyle {\\vec {u}}}\n\n, and temperature \n\n\n\nT\n\n\n{\\displaystyle T}\n\n can be calculated as the moments of the density distribution function:\nThe Lattice Boltzmann method discretizes this equation by limiting space to a lattice and the velocity space to a discrete set of microscopic velocities (i. e. \n\n\n\n\n\n\n\ne\n→\n\n\n\n\ni\n\n\n=\n(\n\n\n\n\ne\n→\n\n\n\n\ni\nx\n\n\n,\n\n\n\n\ne\n→\n\n\n\n\ni\ny\n\n\n)\n\n\n{\\displaystyle {\\vec {e}}_{i}=({\\vec {e}}_{ix},{\\vec {e}}_{iy})}\n\n). The microscopic velocities in D2Q9, D3Q15, and D3Q19 for example are given as:\nThe single-phase discretized Boltzmann equation for mass density and internal energy density are:\nThe collision operator is often approximated by a BGK collision operator under the condition it also satisfies the conservation laws:\nIn the collision operator \n\n\n\n\nf\n\ni\n\n\neq\n\n\n\n\n{\\displaystyle f_{i}^{\\text{eq}}}\n\n is the discrete, equilibrium particle probability distribution function[clarify]. In D2Q9 and D3Q19, it is shown below for an incompressible flow in continuous and discrete form where D, R, and T are the dimension, universal gas constant, and absolute temperature respectively. The partial derivation for the continuous to discrete form is provided through a simple derivation to second order accuracy.\nLetting \n\n\n\nc\n=\n\n\n3\nR\nT\n\n\n\n\n{\\displaystyle c={\\sqrt {3RT}}}\n\n yields the final result:\nAs much work has already been done on a single-component flow, the following TLBM will be discussed. The multicomponent/multiphase TLBM is also more intriguing and useful than simply one component. To be in line with current research, define the set of all components of the system (i. e. walls of porous media, multiple fluids/gases, etc.) \n\n\n\nΨ\n\n\n{\\displaystyle \\Psi }\n\n with elements \n\n\n\n\nσ\n\nj\n\n\n\n\n{\\displaystyle \\sigma _{j}}\n\n.\nThe relaxation parameter,\n\n\n\n\nτ\n\nf\n\n\n\nσ\n\nj\n\n\n\n\n\n\n\n\n{\\displaystyle \\tau _{f}^{\\sigma _{j}}\\,\\!}\n\n, is related to the kinematic viscosity,\n\n\n\n\nν\n\nf\n\n\n\nσ\n\nj\n\n\n\n\n\n\n\n\n{\\displaystyle \\nu _{f}^{\\sigma _{j}}\\,\\!}\n\n, by the following relationship:\nThe moments of the \n\n\n\n\nf\n\ni\n\n\n\n\n\n\n{\\displaystyle f_{i}\\,\\!}\n\n give the local conserved quantities. The density is given by\nand the weighted average velocity, \n\n\n\n\n\n\n\nu\n′\n\n→\n\n\n\n\n\n\n\n{\\displaystyle {\\vec {u'}}\\,\\!}\n\n, and the local momentum are given by\nIn the above equation for the equilibrium velocity \n\n\n\n\nv\n\nσ\n\n\n\n\n\n\n{\\displaystyle v^{\\sigma }\\,\\!}\n\n, the \n\n\n\n\n\n\n\nF\n→\n\n\n\n\nσ\n\n\n\n\n\n\n{\\displaystyle {\\vec {F}}^{\\sigma }\\,\\!}\n\n term is the interaction force between a component and the other components. It is still the subject of much discussion as it is typically a tuning parameter that determines how fluid-fluid, fluid-gas, etc. interact. Frank et al. list current models for this force term. The commonly used derivations are Gunstensen chromodynamic model, Swift's free energy-based approach for both liquid/vapor systems and binary fluids, He's intermolecular interaction-based model, the Inamuro approach, and the Lee and Lin approach.[12]\nThe following is the general description for \n\n\n\n\n\n\n\nF\n→\n\n\n\n\nσ\n\n\n\n\n\n\n{\\displaystyle {\\vec {F}}^{\\sigma }\\,\\!}\n\n as given by several authors.[13][14]\n\n\n\n\n\n\n\n\nF\n→\n\n\n\n\nσ\n\n\n=\n−\n\nψ\n\nσ\n\n\n(\n\n\n\nx\n→\n\n\n\n)\n\n∑\n\n\nσ\n\nj\n\n\n\n\n\nH\n\nσ\n\nσ\n\nj\n\n\n\n\n(\n\n\n\nx\n→\n\n\n\n,\n\n\n\n\nx\n→\n\n\n\n′\n\n)\n\n∑\n\ni\n\n\n\nψ\n\n\nσ\n\nj\n\n\n\n\n(\n\n\n\nx\n→\n\n\n\n+\n\n\n\n\ne\n→\n\n\n\n\ni\n\n\n)\n\n\n\n\ne\n→\n\n\n\n\ni\n\n\n\n\n\n\n{\\displaystyle {\\vec {F}}^{\\sigma }=-\\psi ^{\\sigma }({\\vec {x}})\\sum _{\\sigma _{j}}H^{\\sigma \\sigma _{j}}({\\vec {x}},{\\vec {x}}')\\sum _{i}\\psi ^{\\sigma _{j}}({\\vec {x}}+{\\vec {e}}_{i}){\\vec {e}}_{i}\\,\\!}\n\n\n\n\n\n\nψ\n(\n\n\n\nx\n→\n\n\n\n)\n\n\n\n\n{\\displaystyle \\psi ({\\vec {x}})\\,\\!}\n\n is the effective mass and \n\n\n\nH\n(\n\n\n\nx\n→\n\n\n\n,\n\n\n\n\nx\n→\n\n\n\n′\n\n)\n\n\n\n\n{\\displaystyle H({\\vec {x}},{\\vec {x}}')\\,\\!}\n\n is Green's function representing the interparticle interaction with \n\n\n\n\n\n\n\nx\n→\n\n\n\n′\n\n\n\n\n\n{\\displaystyle {\\vec {x}}'\\,\\!}\n\n as the neighboring site. Satisfying \n\n\n\nH\n(\n\n\n\nx\n→\n\n\n\n,\n\n\n\n\nx\n→\n\n\n\n′\n\n)\n=\nH\n(\n\n\n\n\nx\n→\n\n\n\n′\n\n,\n\n\n\nx\n→\n\n\n\n)\n\n\n\n\n{\\displaystyle H({\\vec {x}},{\\vec {x}}')=H({\\vec {x}}',{\\vec {x}})\\,\\!}\n\n and where \n\n\n\nH\n(\n\n\n\nx\n→\n\n\n\n,\n\n\n\n\nx\n→\n\n\n\n′\n\n)\n>\n0\n\n\n\n\n{\\displaystyle H({\\vec {x}},{\\vec {x}}')>0\\,\\!}\n\n represents repulsive forces. For D2Q9 and D3Q19, this leads to\n\n\n\n\n\nH\n\nσ\n\nσ\n\nj\n\n\n\n\n(\n\n\n\nx\n→\n\n\n\n,\n\n\n\n\nx\n→\n\n\n\n′\n\n)\n=\n\n\n{\n\n\n\n\nh\n\nσ\n\nσ\n\nj\n\n\n\n\n\n\n\n|\n\n\n\nx\n→\n\n\n\n−\n\n\n\n\nx\n→\n\n\n\n′\n\n|\n\n≤\nc\n\n\n\n\n0\n\n\n\n|\n\n\n\nx\n→\n\n\n\n−\n\n\n\n\nx\n→\n\n\n\n′\n\n|\n\n>\nc\n\n\n\n\n\n\n\n\n{\\displaystyle H^{\\sigma \\sigma _{j}}({\\vec {x}},{\\vec {x}}')={\\begin{cases}h^{\\sigma \\sigma _{j}}&\\left|{\\vec {x}}-{\\vec {x}}'\\right|\\leq c\\\\0&\\left|{\\vec {x}}-{\\vec {x}}'\\right|>c\\\\\\end{cases}}}\n\n\n\n\n\n\n\nH\n\nσ\n\nσ\n\nj\n\n\n\n\n(\n\n\n\nx\n→\n\n\n\n,\n\n\n\n\nx\n→\n\n\n\n′\n\n)\n=\n\n\n{\n\n\n\n\nh\n\nσ\n\nσ\n\nj\n\n\n\n\n\n\n\n|\n\n\n\nx\n→\n\n\n\n−\n\n\n\n\nx\n→\n\n\n\n′\n\n|\n\n=\nc\n\n\n\n\n\nh\n\nσ\n\nσ\n\nj\n\n\n\n\n\n/\n\n2\n\n\n\n|\n\n\n\nx\n→\n\n\n\n−\n\n\n\n\nx\n→\n\n\n\n′\n\n|\n\n=\n\n\n2\nc\n\n\n\n\n\n\n0\n\n\n\notherwise\n\n\n\n\n\n\n\n\n\n{\\displaystyle H^{\\sigma \\sigma _{j}}({\\vec {x}},{\\vec {x}}')={\\begin{cases}h^{\\sigma \\sigma _{j}}&\\left|{\\vec {x}}-{\\vec {x}}'\\right|=c\\\\h^{\\sigma \\sigma _{j}}/2&\\left|{\\vec {x}}-{\\vec {x}}'\\right|={\\sqrt {2c}}\\\\0&{\\text{otherwise}}\\\\\\end{cases}}}\n\n\nThe effective mass as proposed by Shan and Chen uses the following effective mass for a single-component, multiphase system. The equation of state is also given under the condition of a single component and multiphase.\nSo far, it appears that \n\n\n\n\nρ\n\n0\n\n\nσ\n\n\n\n\n\n\n{\\displaystyle \\rho _{0}^{\\sigma }\\,\\!}\n\n and \n\n\n\n\nh\n\nσ\n\nσ\n\nj\n\n\n\n\n\n\n\n\n{\\displaystyle h^{\\sigma \\sigma _{j}}\\,\\!}\n\n are free constants to tune but once plugged into the system's equation of state(EOS), they must satisfy the thermodynamic relationships at the critical point such that \n\n\n\n(\n∂\nP\n\n/\n\n∂\n\nρ\n\n\n)\n\nT\n\n\n=\n(\n\n∂\n\n2\n\n\nP\n\n/\n\n∂\n\n\nρ\n\n2\n\n\n\n\n)\n\nT\n\n\n=\n0\n\n\n\n\n{\\displaystyle (\\partial P/\\partial {\\rho })_{T}=(\\partial ^{2}P/\\partial {\\rho ^{2}})_{T}=0\\,\\!}\n\n and \n\n\n\np\n=\n\np\n\nc\n\n\n\n\n\n\n{\\displaystyle p=p_{c}\\,\\!}\n\n. For the EOS, \n\n\n\n\nc\n\n0\n\n\n\n\n\n\n{\\displaystyle c_{0}\\,\\!}\n\n is 3.0 for D2Q9 and D3Q19 while it equals 10.0 for D3Q15.[15]\nIt was later shown by Yuan and Schaefer[16] that the effective mass density needs to be changed to simulate multiphase flow more accurately. They compared the Shan and Chen (SC), Carnahan-Starling (C–S), van der Waals (vdW), Redlich–Kwong (R–K), Redlich–Kwong Soave (RKS), and Peng–Robinson (P–R) EOS. Their results revealed that the SC EOS was insufficient and that C–S, P–R, R–K, and RKS EOS are all more accurate in modeling multiphase flow of a single component.\nFor the popular isothermal Lattice Boltzmann methods these are the only conserved quantities. Thermal models also conserve energy and therefore have an additional conserved quantity:\nDuring the last years, the LBM has proven to be a powerful tool for solving problems at different length scales. The behavior of fluid flow through porous media can be analyzed using the Lattice Boltzmann method. LBM has been applied to: - Earth sciences (Soil filtration). - Energy Sciences (Fuel Cells[17]).", 
    "dbpedia_url": "http://dbpedia.org/resource/Lattice_Boltzmann_methods", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Lattice_Boltzmann_methods\n"
}