{
    "about": "In mathematics, the goal of lattice basis reduction is given an integer lattice basis as input, to find a basis with short, nearly orthogonal vectors. This is realized using different algorithms, whose running time is usually at least exponential in the dimension of the lattice.", 
    "name": "Lattice Reduction", 
    "classification": "Computational Number Theory", 
    "full_text": "In mathematics, the goal of lattice basis reduction is given an integer lattice basis as input, to find a basis with short, nearly orthogonal vectors. This is realized using different algorithms, whose running time is usually at least exponential in the dimension of the lattice.\n\n\nOne measure of nearly orthogonal is the orthogonality defect. This compares the product of the lengths of the basis vectors with the volume of the parallelepiped they define. For perfectly orthogonal basis vectors, these quantities would be the same.\nAny particular basis of \n\n\n\nn\n\n\n{\\displaystyle n}\n\n vectors may be represented by a matrix \n\n\n\nB\n\n\n{\\displaystyle B}\n\n, whose columns are the basis vectors \n\n\n\n\nb\n\ni\n\n\n,\ni\n=\n1\n,\n…\n,\nn\n\n\n{\\displaystyle b_{i},i=1,\\ldots ,n}\n\n. In the fully dimensional case where the number of basis vectors is equal to the dimension of the space they occupy, this matrix is square, and the volume of the fundamental parallelepiped is simply the absolute value of the determinant of this matrix \n\n\n\ndet\n(\nB\n)\n\n\n{\\displaystyle \\det(B)}\n\n. If the number of vectors is less than the dimension of the underlying space, then volume is \n\n\n\n\n\ndet\n(\n\nB\n\nT\n\n\nB\n)\n\n\n\n\n{\\displaystyle {\\sqrt {\\det(B^{T}B)}}}\n\n. For a given lattice \n\n\n\nΛ\n\n\n{\\displaystyle \\Lambda }\n\n, this volume is the same (up to sign) for any basis, and hence is referred to as the determinant of the lattice \n\n\n\ndet\n(\nΛ\n)\n\n\n{\\displaystyle \\det(\\Lambda )}\n\n or lattice constant \n\n\n\nd\n(\nΛ\n)\n\n\n{\\displaystyle d(\\Lambda )}\n\n.\nThe orthogonality defect is the product of the basis vector lengths divided by the parallelepiped volume;\nFrom the geometric definition it may be appreciated that \n\n\n\nδ\n(\nB\n)\n≥\n1\n\n\n{\\displaystyle \\delta (B)\\geq 1}\n\n with equality if and only if the basis is orthogonal.\nIf the lattice reduction problem is defined as finding the basis with the smallest possible defect, then the problem is NP complete. However, there exist polynomial time algorithms to find a basis with defect \n\n\n\nδ\n(\nB\n)\n≤\nc\n\n\n{\\displaystyle \\delta (B)\\leq c}\n\n where c is some constant depending only on the number of basis vectors and the dimension of the underlying space (if different). This is a good enough solution in many practical applications.\nFor a basis consisting of just two vectors, there is a simple and efficient method of reduction closely analogous to the Euclidean algorithm for the greatest common divisor of two integers. As with the Euclidean algorithm, the method is iterative; at each step the larger of the two vectors is reduced by adding or subtracting an integer multiple of the smaller vector.\nLattice reduction algorithms are used in a number of modern number theoretical applications, including in the discovery of a spigot algorithm for \n\n\n\nπ\n\n\n{\\displaystyle \\pi }\n\n. Although determining the shortest basis is possibly an NP-complete problem, algorithms such as the LLL algorithm [1] can find a short (not necessarily shortest) basis in polynomial time with guaranteed worst-case performance. LLL is widely used in the cryptanalysis of public key cryptosystems.\nWhen used to find integer relations, a typical input to the algorithm consists of an augmented \n\n\n\nn\n\n\n{\\displaystyle n}\n\n x \n\n\n\nn\n\n\n{\\displaystyle n}\n\n identity matrix with the entries in the last column consisting of the \n\n\n\nn\n\n\n{\\displaystyle n}\n\n elements (multiplied by a large positive constant \n\n\n\nw\n\n\n{\\displaystyle w}\n\n to penalize vectors that do not sum to zero) between which the relation is sought.\nThe LLL algorithm for computing a nearly-orthogonal basis was used to show that integer programming in any fixed dimension can be done in polynomial time.[2]\nThe following algorithms reduce lattice bases. They can be compared in terms of runtime and approximation to an optimal solution, always relative to the dimension of the given lattice. If there are public implementations of these algorithms this should also be noted here.", 
    "dbpedia_url": "http://dbpedia.org/resource/Lattice_reduction", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Lattice_reduction\n"
}