{
    "about": "The Legendre pseudospectral method for optimal control problems is based on Legendre polynomials. It is part of the larger theory of pseudospectral optimal control, a term coined by Ross.[1] A basic version of the Legendre pseudospectral was originally proposed by Elnagar and his coworkers in 1995.[2] Since then, Ross, Fahroo and their coworkers[3][4][5][6][7] have extended, generalized and applied the method for a large range of problems.[8] An application that has received wide publicity[9][10] is the use of their method for generating real time trajectories for the International Space Station.", 
    "name": "Legendre Pseudospectral Method", 
    "classification": "Numerical Analysis", 
    "full_text": "The Legendre pseudospectral method for optimal control problems is based on Legendre polynomials. It is part of the larger theory of pseudospectral optimal control, a term coined by Ross.[1] A basic version of the Legendre pseudospectral was originally proposed by Elnagar and his coworkers in 1995.[2] Since then, Ross, Fahroo and their coworkers[3][4][5][6][7] have extended, generalized and applied the method for a large range of problems.[8] An application that has received wide publicity[9][10] is the use of their method for generating real time trajectories for the International Space Station.\n\n\nThere are three basic types of Legendre pseudospectral methods:[1]\nThe first software to implement the Legendre pseudospectral method was DIDO in 2001.[12][15] Subsequently, the method was incorporated in the NASA code OTIS.[16] Years later, many other software products emerged at an increasing pace, such as PSOPT, PROPT and GPOPS.\nThe Legendre pseudospectral method (based on Gauss-Lobatto points) has been implemented in flight[1] by NASA on several spacecraft through the use of the software, DIDO. The first flight implementation was on November 5, 2006, when NASA used DIDO to maneuver the International Space Station to perform the Zero Propellant Maneuver. The Zero Propellant Maneuver was discovered by Nazereth Bedrossian using DIDO. Watch a video of this historic maneuver.", 
    "dbpedia_url": "http://dbpedia.org/resource/Legendre_pseudospectral_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Legendre_pseudospectral_method\n"
}