{
    "about": "The Les Houches Accords are agreements between particle physicists to standardize the interface between the matrix element programs and the event generators used to calculate different quantities. The original accord was initially formed in 2001, at a conference in Les Houches, France, and was subsequently expanded.", 
    "name": "Les Houches Accords", 
    "classification": "Computational Physics", 
    "full_text": "The Les Houches Accords are agreements between particle physicists to standardize the interface between the matrix element programs and the event generators used to calculate different quantities. The original accord was initially formed in 2001, at a conference in Les Houches, France, and was subsequently expanded.\nIn experimental high energy physics, several levels of computing are used to simulate data runs, including programs that generate matrix elements and ones that generate events. However, there are several programs for each of these tasks, such as CompHEP and MadGraph to generate matrix elements, and PYTHIA and HERWIG for event generation. Depending on specific properties of the particle decay that physicists are interested in, they may desire to use a certain program for these tasks, but before the Les Houches Accords, there was no general interface for communicating between the programs. This enables physicists to choose more freely between different programs. The Accords also make it easier to generate probability density function cross sections for events.\nThe original Accord defined a programmatic interface for transfer of event information, in terms of Fortran common blocks, but no data exchange file format was defined until 2006. Events that conform to the formats described in the Les Houches Accords are said to be in Les Houches Event format, or more often, LHE format.\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Les_Houches_Accords", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Les_Houches_Accords\n"
}