{
    "about": "In Hamiltonian mechanics, the linear canonical transformation (LCT) is a family of integral transforms that generalizes many classical transforms. It has 4 parameters and 1 constraint, so it is a 3-dimensional family, and can be visualized as the action of the special linear group SL2(R) on the time–frequency plane (domain).", 
    "name": "Linear Canonical Transformation", 
    "classification": "Signal Processing", 
    "full_text": "In Hamiltonian mechanics, the linear canonical transformation (LCT) is a family of integral transforms that generalizes many classical transforms. It has 4 parameters and 1 constraint, so it is a 3-dimensional family, and can be visualized as the action of the special linear group SL2(R) on the time–frequency plane (domain).\nThe LCT generalizes the Fourier, fractional Fourier, Laplace, Gauss–Weierstrass, Bargmann and the Fresnel transforms as particular cases. The name \"linear canonical transformation\" is from canonical transformation, a map that preserves the symplectic structure, as SL2(R) can also be interpreted as the symplectic group Sp2, and thus LCTs are the linear maps of the time–frequency domain which preserve the symplectic form.\n\n\nThe LCT can be represented in several ways; most easily,[1] it can be parameterized by a 2×2 matrix with determinant 1, i.e., an element of the special linear group SL2(R). Then for any such matrix \n\n\n\n\n(\n\n\n\n\n\na\n\n\nb\n\n\n\n\nc\n\n\nd\n\n\n\n\n\n)\n\n,\n\n\n{\\displaystyle \\left({\\begin{smallmatrix}a&b\\\\c&d\\end{smallmatrix}}\\right),}\n\n with ad − bc = 1, the corresponding integral transform from a function \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n to \n\n\n\nX\n(\nu\n)\n\n\n{\\displaystyle X(u)}\n\n is defined as\nMany classical transforms are special cases of the linear canonical transform:\nComposition of LCTs corresponds to multiplication of the corresponding matrices; this is also known as the \"additivity property of the WDF\".\nIn detail, if the LCT is denoted by OF(a,b,c,d), i.e.\nthen\nwhere\nParaxial optical systems implemented entirely with thin lenses and propagation through free space and/or graded index (GRIN) media, are quadratic phase systems (QPS); these were known before Moshinsky and Quesne (1974) called attention to their significance in connection with canonical transformations in quantum mechanics. The effect of any arbitrary QPS on an input wavefield can be described using the linear canonical transform, a particular case of which was developed by Segal (1963) and Bargmann (1961) in order to formalize Fock's (1928) boson calculus.[3]\nCanonical transforms are used to analyze differential equations. These include diffusion, the Schrödinger free particle, the linear potential (free-fall), and the attractive and repulsive oscillator equations. It also includes a few others such as the Fokker–Planck equation. Although this class is far from universal, the ease with which solutions and properties are found makes canonical transforms an attractive tool for problems such as these.[4]\nWave propagation through air, a lens, and between satellite dishes are discussed here. All of the computations can be reduced to 2×2 matrix algebra. This is the spirit of LCT.\n\nAssuming the system looks like as depicted in the figure, the wave travels from plane xi, yi to the plane of x and y. The Fresnel transform is used to describe electromagnetic wave propagation in air:\nwith\nThis is equivalent to LCT (shearing), when\nWhen the travel distance (z) is larger, the shearing effect is larger.\nWith the lens as depicted in the figure, and the refractive index denoted as n, the result is:[5]\nwith f the focal length and Δ the thickness of the lens.\nThe distortion passing through the lens is similar to LCT, when\nThis is also a shearing effect: when the focal length is smaller, the shearing effect is larger.\nThe spherical mirror—e.g., a satellite dish—can be described as a LCT, with\nThis is very similar to lens, except focal length is replaced by the radius of the dish. Therefore, if the radius is smaller, the shearing effect is larger.\nThe system considered is depicted in the figure to the right: two dishes – one being the emitter and the other one the receiver – and a signal travelling between them over a distance D. First, for dish A (emitter), the LCT matrix looks like this:\nThen, for dish B (receiver), the LCT matrix similarly becomes:\nLast, for the propagation of the signal in air, the LCT matrix is:\nPutting all three components together, the LCT of the system is:", 
    "dbpedia_url": "http://dbpedia.org/resource/Linear_canonical_transformation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Linear_canonical_transformation\n"
}