{
    "about": "Line spectral pairs (LSP) or line spectral frequencies (LSF) are used to represent linear prediction coefficients (LPC) for transmission over a channel.[1] LSPs have several properties (e.g. smaller sensitivity to quantization noise) that make them superior to direct quantization of LPCs. For this reason, LSPs are very useful in speech coding. LSP representation was developed by Fumitada Itakura in the 1970s.[2]", 
    "name": "Line Spectral Pairs", 
    "classification": "Digital Signal Processing", 
    "full_text": "Line spectral pairs (LSP) or line spectral frequencies (LSF) are used to represent linear prediction coefficients (LPC) for transmission over a channel.[1] LSPs have several properties (e.g. smaller sensitivity to quantization noise) that make them superior to direct quantization of LPCs. For this reason, LSPs are very useful in speech coding. LSP representation was developed by Fumitada Itakura in the 1970s.[2]\n\n\nThe LP polynomial \n\n\n\nA\n(\nz\n)\n=\n1\n−\n\n∑\n\nk\n=\n1\n\n\np\n\n\n\na\n\nk\n\n\n\nz\n\n−\nk\n\n\n\n\n{\\displaystyle A(z)=1-\\sum _{k=1}^{p}a_{k}z^{-k}}\n\n can be expressed as \n\n\n\nA\n(\nz\n)\n=\n0.5\n[\nP\n(\nz\n)\n+\nQ\n(\nz\n)\n]\n\n\n{\\displaystyle A(z)=0.5[P(z)+Q(z)]}\n\n, where:\nBy construction, P is a palindromic polynomial and Q an antipalindromic polynomial; physically P(z) corresponds to the vocal tract with the glottis closed and Q(z) with the glottis open.[3] It can be shown that:\nThe Line Spectral Pair representation of the LP polynomial consists simply of the location of the roots of P and Q (i.e. \n\n\n\nω\n\n\n{\\displaystyle \\omega }\n\n such that \n\n\n\nz\n=\n\ne\n\ni\nω\n\n\n,\nP\n(\nz\n)\n=\n0\n\n\n{\\displaystyle z=e^{i\\omega },P(z)=0}\n\n). As they occur in pairs, only half of the actual roots (conventionally between 0 and \n\n\n\nπ\n\n\n{\\displaystyle \\pi }\n\n) need be transmitted. The total number of coefficients for both P and Q is therefore equal to p, the number of original LP coefficients (not counting \n\n\n\n\na\n\n0\n\n\n=\n1\n\n\n{\\displaystyle a_{0}=1}\n\n).\nA common algorithm for finding these[4] is to evaluate the polynomial at a sequence of closely spaced points around the unit circle, observing when the result changes sign; when it does a root must lie between the points tested. Because the roots of P are interspersed with those of Q a single pass is sufficient to find the roots of both polynomials.\nTo convert back to LPCs, we need to evaluate \n\n\n\nA\n(\nz\n)\n=\n0.5\n[\nP\n(\nz\n)\n+\nQ\n(\nz\n)\n]\n\n\n{\\displaystyle A(z)=0.5[P(z)+Q(z)]}\n\n by \"clocking\" an impulse through it N times (order of the filter), yielding the original filter, A(z).\nLine spectral pairs have several interesting and useful properties. When the roots of P(z) and Q(z) are interleaved, stability of the filter is ensured if and only if the roots are monotonically increasing. Moreover, the closer two roots are, the more resonant the filter is at the corresponding frequency. Because LSPs are not overly sensitive to quantization noise and stability is easily ensured, LSP are widely used for quantizing LPC filters. Line spectral frequencies can be interpolated.\nIncludes an overview in relation to LPC.", 
    "dbpedia_url": "http://dbpedia.org/resource/Line_spectral_pairs", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Line_spectral_pairs\n"
}