{
    "about": "In optimization, the line search strategy is one of two basic iterative approaches to find a local minimum \n\n\n\n\n\nx\n\n\n∗\n\n\n\n\n{\\displaystyle \\mathbf {x} ^{*}}\n\n of an objective function \n\n\n\nf\n:\n\n\nR\n\n\nn\n\n\n→\n\nR\n\n\n\n{\\displaystyle f:\\mathbb {R} ^{n}\\to \\mathbb {R} }\n\n. The other approach is trust region.", 
    "name": "Line Search", 
    "classification": "Optimization Algorithms And Methods", 
    "full_text": "In optimization, the line search strategy is one of two basic iterative approaches to find a local minimum \n\n\n\n\n\nx\n\n\n∗\n\n\n\n\n{\\displaystyle \\mathbf {x} ^{*}}\n\n of an objective function \n\n\n\nf\n:\n\n\nR\n\n\nn\n\n\n→\n\nR\n\n\n\n{\\displaystyle f:\\mathbb {R} ^{n}\\to \\mathbb {R} }\n\n. The other approach is trust region.\nThe line search approach first finds a descent direction along which the objective function \n\n\n\nf\n\n\n{\\displaystyle f}\n\n will be reduced and then computes a step size that determines how far \n\n\n\n\nx\n\n\n\n{\\displaystyle \\mathbf {x} }\n\n should move along that direction. The descent direction can be computed by various methods, such as gradient descent, Newton's method and Quasi-Newton method. The step size can be determined either exactly or inexactly.\n\n\nHere is an example gradient method that uses a line search in step 4.\nAt the line search step (4) the algorithm might either exactly minimize h, by solving \n\n\n\n\nh\n′\n\n(\n\nα\n\nk\n\n\n)\n=\n0\n\n\n{\\displaystyle h'(\\alpha _{k})=0}\n\n, or loosely, by asking for a sufficient decrease in h. One example of the former is conjugate gradient method. The latter is called inexact line search and may be performed in a number of ways, such as a backtracking line search or using the Wolfe conditions.\nLike other optimization methods, line search may be combined with simulated annealing to allow it to jump over some local minima.\nIn this method, the minimum must first be bracketed, so the algorithm must identify points x1 and x2 such that the sought minimum lies between them. The interval is then divided by computing \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n at two internal points, x3 and x4, and rejecting whichever of the two outer points is not adjacent to that of x3 and x4 which has the lowest function value. In subsequent steps, only one extra internal point needs to be calculated. Of the various methods of dividing the interval,[1] golden section search is particularly simple and effective, as the interval proportions are preserved regardless of how the search proceeds:", 
    "dbpedia_url": "http://dbpedia.org/resource/Line_search", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Line_search\n"
}