{
    "about": "In mathematics, a linear approximation is an approximation of a general function using a linear function (more precisely, an affine function). They are widely used in the method of finite differences to produce first order methods for solving or approximating solutions to equations.", 
    "name": "Linear Approximation", 
    "classification": "Numerical Analysis", 
    "full_text": "In mathematics, a linear approximation is an approximation of a general function using a linear function (more precisely, an affine function). They are widely used in the method of finite differences to produce first order methods for solving or approximating solutions to equations.\n\n\nGiven a twice continuously differentiable function \n\n\n\nf\n\n\n{\\displaystyle f}\n\n of one real variable, Taylor's theorem for the case \n\n\n\nn\n=\n1\n\n\n{\\displaystyle n=1}\n\n states that\nwhere \n\n\n\n\nR\n\n2\n\n\n\n\n{\\displaystyle R_{2}}\n\n is the remainder term. The linear approximation is obtained by dropping the remainder:\nThis is a good approximation for \n\n\n\nx\n\n\n{\\displaystyle x}\n\n when it is close enough to \n\n\n\na\n\n\n{\\displaystyle a}\n\n; since a curve, when closely observed, will begin to resemble a straight line. Therefore, the expression on the right-hand side is just the equation for the tangent line to the graph of \n\n\n\nf\n\n\n{\\displaystyle f}\n\n at \n\n\n\n(\na\n,\nf\n(\na\n)\n)\n\n\n{\\displaystyle (a,f(a))}\n\n. For this reason, this process is also called the tangent line approximation.\nIf \n\n\n\nf\n\n\n{\\displaystyle f}\n\n is concave down in the interval between \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\na\n\n\n{\\displaystyle a}\n\n, the approximation will be an overestimate (since the derivative is decreasing in that interval). If \n\n\n\nf\n\n\n{\\displaystyle f}\n\n is concave up, the approximation will be an underestimate.[1]\nLinear approximations for vector functions of a vector variable are obtained in the same way, with the derivative at a point replaced by the Jacobian matrix. For example, given a differentiable function \n\n\n\nf\n(\nx\n,\ny\n)\n\n\n{\\displaystyle f(x,y)}\n\n with real values, one can approximate \n\n\n\nf\n(\nx\n,\ny\n)\n\n\n{\\displaystyle f(x,y)}\n\n for \n\n\n\n(\nx\n,\ny\n)\n\n\n{\\displaystyle (x,y)}\n\n close to \n\n\n\n(\na\n,\nb\n)\n\n\n{\\displaystyle (a,b)}\n\n by the formula\nThe right-hand side is the equation of the plane tangent to the graph of \n\n\n\nz\n=\nf\n(\nx\n,\ny\n)\n\n\n{\\displaystyle z=f(x,y)}\n\n at \n\n\n\n(\na\n,\nb\n)\n.\n\n\n{\\displaystyle (a,b).}\n\n\nIn the more general case of Banach spaces, one has\nwhere \n\n\n\nD\nf\n(\na\n)\n\n\n{\\displaystyle Df(a)}\n\n is the Fréchet derivative of \n\n\n\nf\n\n\n{\\displaystyle f}\n\n at \n\n\n\na\n\n\n{\\displaystyle a}\n\n.\nGaussian optics is a technique in geometrical optics that describes the behaviour of light rays in optical systems by using the paraxial approximation, in which only rays which make small angles with the optical axis of the system are considered.[2] In this approximation, trigonometric functions can be expressed as linear functions of the angles. Gaussian optics applies to systems in which all the optical surfaces are either flat or are portions of a sphere. In this case, simple explicit formulae can be given for parameters of an imaging system such as focal distance, magnification and brightness, in terms of the geometrical shapes and material properties of the constituent elements.\nThe period of swing of a simple gravity pendulum depends on its length, the local strength of gravity, and to a small extent on the maximum angle that the pendulum swings away from vertical, θ0, called the amplitude.[3] It is independent of the mass of the bob. The true period T of a simple pendulum, the time taken for a complete cycle of an ideal simple gravity pendulum, can be written in several different forms (see Pendulum (mathematics) ), one example being the infinite series:[4][5]\nwhere L is the length of the pendulum and g is the local acceleration of gravity.\nHowever, if one takes the linear approximation (i.e. if the amplitude is limited to small swings,[Note 1] ) the period is:[6]\nIn the linear approximation, the period of swing is approximately the same for different size swings: that is, the period is independent of amplitude. This property, called isochronism, is the reason pendulums are so useful for timekeeping.[7] Successive swings of the pendulum, even if changing in amplitude, take the same amount of time.\nThe electrical resistivity of most materials changes with temperature. If the temperature T does not vary too much, a linear approximation is typically used:\nwhere \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n is called the temperature coefficient of resistivity, \n\n\n\n\nT\n\n0\n\n\n\n\n{\\displaystyle T_{0}}\n\n is a fixed reference temperature (usually room temperature), and \n\n\n\n\nρ\n\n0\n\n\n\n\n{\\displaystyle \\rho _{0}}\n\n is the resistivity at temperature \n\n\n\n\nT\n\n0\n\n\n\n\n{\\displaystyle T_{0}}\n\n. The parameter \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n is an empirical parameter fitted from measurement data. Because the linear approximation is only an approximation, \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n is different for different reference temperatures. For this reason it is usual to specify the temperature that \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n was measured at with a suffix, such as \n\n\n\n\nα\n\n15\n\n\n\n\n{\\displaystyle \\alpha _{15}}\n\n, and the relationship only holds in a range of temperatures around the reference.[8] When the temperature varies over a large temperature range, the linear approximation is inadequate and a more detailed analysis and understanding should be used.", 
    "dbpedia_url": "http://dbpedia.org/resource/Linear_approximation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Linear_approximation\n"
}