{
    "about": "In statistics and mathematics, linear least squares is an approach fitting a mathematical or statistical model to data in cases where the idealized value provided by the model for any data point is expressed linearly in terms of the unknown parameters of the model. The resulting fitted model can be used to summarize the data, to predict unobserved values from the same system, and to understand the mechanisms that may underlie the system.", 
    "name": "Linear Least Squares (Mathematics)", 
    "classification": "Computational Statistics", 
    "full_text": "In statistics and mathematics, linear least squares is an approach fitting a mathematical or statistical model to data in cases where the idealized value provided by the model for any data point is expressed linearly in terms of the unknown parameters of the model. The resulting fitted model can be used to summarize the data, to predict unobserved values from the same system, and to understand the mechanisms that may underlie the system.\nMathematically, linear least squares is the problem of approximately solving an overdetermined system of linear equations, where the best approximation is defined as that which minimizes the sum of squared differences between the data values and their corresponding modeled values. The approach is called linear least squares since the assumed function is linear in the parameters to be estimated. Linear least squares problems are convex and have a closed-form solution that is unique, provided that the number of data points used for fitting equals or exceeds the number of unknown parameters, except in special degenerate situations. In contrast, non-linear least squares problems generally must be solved by an iterative procedure, and the problems can be non-convex with multiple optima for the objective function. If prior distributions are available, then even an underdetermined system can be solved using the Bayesian MMSE estimator.\nIn statistics, linear least squares problems correspond to a particularly important type of statistical model called linear regression which arises as a particular form of regression analysis. One basic form of such a model is an ordinary least squares model. The present article concentrates on the mathematical aspects of linear least squares problems, with discussion of the formulation and interpretation of statistical regression models and statistical inferences related to these being dealt with in the articles just mentioned. See outline of regression analysis for an outline of the topic.\n\n\nAs a result of an experiment, four \n\n\n\n(\nx\n,\ny\n)\n\n\n{\\displaystyle (x,y)}\n\n data points were obtained, \n\n\n\n(\n1\n,\n6\n)\n,\n\n\n{\\displaystyle (1,6),}\n\n \n\n\n\n(\n2\n,\n5\n)\n,\n\n\n{\\displaystyle (2,5),}\n\n \n\n\n\n(\n3\n,\n7\n)\n,\n\n\n{\\displaystyle (3,7),}\n\n and \n\n\n\n(\n4\n,\n10\n)\n\n\n{\\displaystyle (4,10)}\n\n (shown in red in the picture on the right). We hope to find a line \n\n\n\ny\n=\n\nβ\n\n1\n\n\n+\n\nβ\n\n2\n\n\nx\n\n\n{\\displaystyle y=\\beta _{1}+\\beta _{2}x}\n\n that best fits these four points. In other words, we would like to find the numbers \n\n\n\n\nβ\n\n1\n\n\n\n\n{\\displaystyle \\beta _{1}}\n\n and \n\n\n\n\nβ\n\n2\n\n\n\n\n{\\displaystyle \\beta _{2}}\n\n that approximately solve the overdetermined linear system\nof four equations in two unknowns in some \"best\" sense.\nThe \"error\", at each point, between the curve fit and the data is the difference between the right- and left-hand sides of the equations above. The least squares approach to solving this problem is to try to make the sum of the squares of these errors as small as possible; that is, to find the minimum of the function\nThe minimum is determined by calculating the partial derivatives of \n\n\n\nS\n(\n\nβ\n\n1\n\n\n,\n\nβ\n\n2\n\n\n)\n\n\n{\\displaystyle S(\\beta _{1},\\beta _{2})}\n\n with respect to \n\n\n\n\nβ\n\n1\n\n\n\n\n{\\displaystyle \\beta _{1}}\n\n and \n\n\n\n\nβ\n\n2\n\n\n\n\n{\\displaystyle \\beta _{2}}\n\n and setting them to zero\nThis results in a system of two equations in two unknowns, called the normal equations, which give, when solved\nand the equation \n\n\n\ny\n=\n3.5\n+\n1.4\nx\n\n\n{\\displaystyle y=3.5+1.4x}\n\n of the line of best fit. The residuals, that is, the discrepancies between the \n\n\n\ny\n\n\n{\\displaystyle y}\n\n values from the experiment and the \n\n\n\ny\n\n\n{\\displaystyle y}\n\n values calculated using the line of best fit are then found to be \n\n\n\n1.1\n,\n\n\n{\\displaystyle 1.1,}\n\n \n\n\n\n−\n1.3\n,\n\n\n{\\displaystyle -1.3,}\n\n \n\n\n\n−\n0.7\n,\n\n\n{\\displaystyle -0.7,}\n\n and \n\n\n\n0.9\n\n\n{\\displaystyle 0.9}\n\n (see the picture on the right). The minimum value of the sum of squares of the residuals is \n\n\n\nS\n(\n3.5\n,\n1.4\n)\n=\n\n1.1\n\n2\n\n\n+\n(\n−\n1.3\n\n)\n\n2\n\n\n+\n(\n−\n0.7\n\n)\n\n2\n\n\n+\n\n0.9\n\n2\n\n\n=\n4.2.\n\n\n{\\displaystyle S(3.5,1.4)=1.1^{2}+(-1.3)^{2}+(-0.7)^{2}+0.9^{2}=4.2.}\n\n\nMore generally, one can have \n\n\n\nn\n\n\n{\\displaystyle n}\n\n regressors \n\n\n\n\nx\n\nj\n\n\n\n\n{\\displaystyle x_{j}}\n\n, and a linear model\nImportantly, in \"linear least squares\", we are not restricted to using a line as the model as in the above example. For instance, we could have chosen the restricted quadratic model \n\n\n\ny\n=\n\nβ\n\n1\n\n\n\nx\n\n2\n\n\n\n\n{\\displaystyle y=\\beta _{1}x^{2}}\n\n. This model is still linear in the \n\n\n\n\nβ\n\n1\n\n\n\n\n{\\displaystyle \\beta _{1}}\n\n parameter, so we can still perform the same analysis, constructing a system of equations from the data points:\nThe partial derivatives with respect to the parameters (this time there is only one) are again computed and set to 0:\n\n\n\n\n\n\n\n∂\nS\n\n\n∂\n\nβ\n\n1\n\n\n\n\n\n=\n0\n=\n708\n\nβ\n\n1\n\n\n−\n498\n\n\n{\\displaystyle {\\frac {\\partial S}{\\partial \\beta _{1}}}=0=708\\beta _{1}-498}\n\n\nand solved\n\n\n\n\n\nβ\n\n1\n\n\n=\n0.703\n\n\n{\\displaystyle \\beta _{1}=0.703}\n\n\nleading to the resulting best fit model \n\n\n\ny\n=\n0.703\n\nx\n\n2\n\n\n\n\n{\\displaystyle y=0.703x^{2}}\n\n\nConsider an overdetermined system\nof m linear equations in n unknown coefficients, β1,β2,…,βn, with m > n. (Note: for a linear model as above, not all of \n\n\n\nX\n\n\n{\\displaystyle X}\n\n contains information on the data points. The first column is populated with ones, \n\n\n\n\nX\n\ni\n1\n\n\n=\n1\n\n\n{\\displaystyle X_{i1}=1}\n\n, only the other columns contain actual data, and n = number of regressors + 1). This can be written in matrix form as\nwhere\nSuch a system usually has no solution, so the goal is instead to find the coefficients \n\n\n\n\nβ\n\n\n\n{\\displaystyle {\\boldsymbol {\\beta }}}\n\n which fit the equations \"best,\" in the sense of solving the quadratic minimization problem\nwhere the objective function S is given by\nA justification for choosing this criterion is given in properties below. This minimization problem has a unique solution, provided that the n columns of the matrix \n\n\n\n\nX\n\n\n\n{\\displaystyle \\mathbf {X} }\n\n are linearly independent, given by solving the normal equations\nThe matrix \n\n\n\n\n\nX\n\n\n\nT\n\n\n\n\nX\n\n\n\n{\\displaystyle \\mathbf {X} ^{\\rm {T}}\\mathbf {X} }\n\n is known as the Gramian matrix of \n\n\n\n\nX\n\n\n\n{\\displaystyle \\mathbf {X} }\n\n, which possesses several nice properties such as being a positive semi-definite matrix, and the matrix \n\n\n\n\n\nX\n\n\n\nT\n\n\n\n\ny\n\n\n\n{\\displaystyle \\mathbf {X} ^{\\rm {T}}\\mathbf {y} }\n\n is known as the moment matrix of regressand by regressors.[1] Finally, \n\n\n\n\n\n\nβ\n^\n\n\n\n\n\n{\\displaystyle {\\hat {\\boldsymbol {\\beta }}}}\n\n is the coefficient vector of the least-squares hyperplane, expressed as\nThe following MATLAB code shows implementation of this approach on the data used in the first example above.\nPython code using the same variable naming as the MATLAB code above:\nDefine the \n\n\n\ni\n\n\n{\\displaystyle i}\n\nth residual to be\nThen \n\n\n\nS\n\n\n{\\displaystyle S}\n\n can be rewritten\nGiven that S is convex, it is minimized when its gradient vector is zero (This follows by definition: if the gradient vector is not zero, there is a direction in which we can move to minimize it further - see maxima and minima.) The elements of the gradient vector are the partial derivatives of S with respect to the parameters:\nThe derivatives are\nSubstitution of the expressions for the residuals and the derivatives into the gradient equations gives\nThus if \n\n\n\n\n\n\nβ\n^\n\n\n\n\n\n{\\displaystyle {\\hat {\\beta }}}\n\n minimizes S, we have\nUpon rearrangement, we obtain the normal equations:\nThe normal equations are written in matrix notation as\nThe solution of the normal equations yields the vector \n\n\n\n\n\n\nβ\n^\n\n\n\n\n\n{\\displaystyle {\\hat {\\boldsymbol {\\beta }}}}\n\n of the optimal parameter values.\nThe normal equations can be derived directly from a matrix representation of the problem as follows. The objective is to minimize\nNote that  :\n\n\n\n(\n\n\nβ\n\n\n\nT\n\n\n\n\n\nX\n\n\n\nT\n\n\n\n\ny\n\n\n)\n\n\nT\n\n\n\n=\n\n\ny\n\n\n\nT\n\n\n\n\nX\n\n\nβ\n\n\n\n{\\displaystyle ({\\boldsymbol {\\beta }}^{\\rm {T}}\\mathbf {X} ^{\\rm {T}}\\mathbf {y} )^{\\rm {T}}=\\mathbf {y} ^{\\rm {T}}\\mathbf {X} {\\boldsymbol {\\beta }}}\n\n has the dimension 1x1 (the number of columns of \n\n\n\n\ny\n\n\n\n{\\displaystyle \\mathbf {y} }\n\n), so it is a scalar and equal to its own transpose, hence \n\n\n\n\n\nβ\n\n\n\nT\n\n\n\n\n\nX\n\n\n\nT\n\n\n\n\ny\n\n=\n\n\ny\n\n\n\nT\n\n\n\n\nX\n\n\nβ\n\n\n\n{\\displaystyle {\\boldsymbol {\\beta }}^{\\rm {T}}\\mathbf {X} ^{\\rm {T}}\\mathbf {y} =\\mathbf {y} ^{\\rm {T}}\\mathbf {X} {\\boldsymbol {\\beta }}}\n\n and the quantity to minimize becomes\nDifferentiating this with respect to \n\n\n\n\nβ\n\n\n\n{\\displaystyle {\\boldsymbol {\\beta }}}\n\n and equating to zero to satisfy the first-order conditions gives\nwhich is equivalent to the above-given normal equations. A sufficient condition for satisfaction of the second-order conditions for a minimum is that \n\n\n\n\nX\n\n\n\n{\\displaystyle \\mathbf {X} }\n\n have full column rank, in which case \n\n\n\n\n\nX\n\n\n\nT\n\n\n\n\nX\n\n\n\n{\\displaystyle \\mathbf {X} ^{\\rm {T}}\\mathbf {X} }\n\n is positive definite.\nWhen \n\n\n\n\n\nX\n\n\n\nT\n\n\n\n\nX\n\n\n\n{\\displaystyle \\mathbf {X} ^{\\rm {T}}\\mathbf {X} }\n\n is positive definite, the formula for the minimizing value of \n\n\n\n\nβ\n\n\n\n{\\displaystyle {\\boldsymbol {\\beta }}}\n\n can be derived without the use of derivatives. The quantity\ncan be written as\nwhere \n\n\n\nC\n\n\n{\\displaystyle C}\n\n depends only on \n\n\n\n\ny\n\n\n\n{\\displaystyle \\mathbf {y} }\n\n and \n\n\n\n\nX\n\n\n\n{\\displaystyle \\mathbf {X} }\n\n, and \n\n\n\n⟨\n⋅\n,\n⋅\n⟩\n\n\n{\\displaystyle \\langle \\cdot ,\\cdot \\rangle }\n\n is the inner product defined by\nIt follows that \n\n\n\nS\n(\n\nβ\n\n)\n\n\n{\\displaystyle S({\\boldsymbol {\\beta }})}\n\n is equal to\nand therefore minimized exactly when\nIn general, the coefficients of the matrices \n\n\n\n\n\n\nX\n\n\n\n,\n\n\n\nβ\n\n\n\n\n\n{\\displaystyle {\\displaystyle \\mathbf {X} },{\\displaystyle {\\boldsymbol {\\beta }}}}\n\n and \n\n\n\n\n\n\ny\n\n\n\n\n\n{\\displaystyle {\\displaystyle \\mathbf {y} }}\n\n can be complex. By using a Hermitian transpose instead of a simple transpose, it is possible to find a vector \n\n\n\n\n\n\n\n\nβ\n^\n\n\n\n\n\n\n\n{\\displaystyle {\\displaystyle {\\boldsymbol {\\hat {\\beta }}}}}\n\n which minimize \n\n\n\n\n\nS\n(\n\nβ\n\n)\n\n\n\n\n{\\displaystyle {\\displaystyle S({\\boldsymbol {\\beta }})}}\n\n , just as for the real matrices. In order to get the normal equations we follow a similar path as in previous derivations:\nwhere \n\n\n\n\n\n†\n\n\n\n\n{\\displaystyle {\\displaystyle \\dagger }}\n\n stands for Hermitian transpose.\nWe should now take derivatives of \n\n\n\n\n\nS\n(\n\nβ\n\n)\n\n\n\n\n{\\displaystyle {\\displaystyle S({\\boldsymbol {\\beta }})}}\n\n with respect to each of the coefficient \n\n\n\n\n\n\nβ\n\nj\n\n\n\n\n\n\n{\\displaystyle {\\displaystyle \\beta _{j}}}\n\n, but first we separate real and imaginary part to deal with the conjugate factors in above expression. For the \n\n\n\n\n\n\nβ\n\nj\n\n\n\n\n\n\n{\\displaystyle {\\displaystyle \\beta _{j}}}\n\n we have\nand the derivatives changes into\nAfter rewriting \n\n\n\n\n\nS\n(\n\nβ\n\n)\n\n\n\n\n{\\displaystyle {\\displaystyle S({\\boldsymbol {\\beta }})}}\n\n in the summation form and writing \n\n\n\n\n\n\nβ\n\nj\n\n\n\n\n\n\n{\\displaystyle {\\displaystyle \\beta _{j}}}\n\n explicite, we can calculate both partial derivatives with result:\nwhich, after adding it together and comparing to zero ( minimalization condition for \n\n\n\n\n\n\n\n\nβ\n^\n\n\n\n\n\n\n\n{\\displaystyle {\\displaystyle {\\boldsymbol {\\hat {\\beta }}}}}\n\n) yields\nIn matrix form:\nA general approach to the least squares problem \n\n\n\n\n\nm\ni\nn\n\n\n\n\n∥\n\n\n\ny\n\n−\nX\n\nβ\n\n\n\n\n∥\n\n\n\n2\n\n\n\n\n{\\displaystyle \\operatorname {\\,min} \\,{\\big \\|}\\mathbf {y} -X{\\boldsymbol {\\beta }}{\\big \\|}^{2}}\n\n can be described as follows. Suppose that we can find an n by m matrix S such that XS is an orthogonal projection onto the image of X. Then a solution to our minimization problem is given by\nsimply because\nis exactly a sought for orthogonal projection of \n\n\n\n\ny\n\n\n\n{\\displaystyle \\mathbf {y} }\n\n onto an image of X (see the picture below and note that as explained in the next section the image of X is just a subspace generated by column vectors of X). A few popular ways to find such a matrix S are described below.\nThe algebraic solution of the normal equations can be written as\nwhere X + is the Moore–Penrose pseudoinverse of X. Although this equation is correct, and can work in many applications, it is not computationally efficient to invert the normal equations matrix (the Gramian matrix). An exception occurs in numerical smoothing and differentiation where an analytical expression is required.\nIf the matrix XTX is well-conditioned and positive definite, implying that it has full rank, the normal equations can be solved directly by using the Cholesky decomposition RTR, where R is an upper triangular matrix, giving:\nThe solution is obtained in two stages, a forward substitution step, solving for z:\nfollowed by a backward substitution, solving for \n\n\n\n\n\n\nβ\n^\n\n\n\n\n\n{\\displaystyle {\\hat {\\boldsymbol {\\beta }}}}\n\n\nBoth substitutions are facilitated by the triangular nature of R.\nSee example of linear regression for a worked-out numerical example with three parameters.\nOrthogonal decomposition methods of solving the least squares problem are slower than the normal equations method but are more numerically stable because they avoid forming the product XTX.\nThe residuals are written in matrix notation as\nThe matrix X is subjected to an orthogonal decomposition, e.g., the QR decomposition as follows.\nwhere Q is an m×m orthogonal matrix (QTQ=I) and R is an n×n upper triangular matrix with \n\n\n\n\nr\n\ni\ni\n\n\n>\n0\n\n\n{\\displaystyle r_{ii}>0}\n\n.\nThe residual vector is left-multiplied by QT.\nBecause Q is orthogonal, the sum of squares of the residuals, s, may be written as:\nSince v doesn't depend on β, the minimum value of s is attained when the upper block, u, is zero. Therefore the parameters are found by solving:\nThese equations are easily solved as R is upper triangular.\nAn alternative decomposition of X is the singular value decomposition (SVD)[2]\nwhere U is m by m orthogonal matrix, V is n by n orthogonal matrix and \n\n\n\nΣ\n\n\n{\\displaystyle \\Sigma }\n\n is an m by n matrix with all its elements outside of the main diagonal equal to 0. The pseudoinverse of \n\n\n\nΣ\n\n\n{\\displaystyle \\Sigma }\n\n is easily obtained by inverting its non-zero diagonal elements and transposing. Hence,\nwhere P is obtained from \n\n\n\nΣ\n\n\n{\\displaystyle \\Sigma }\n\n by replacing its non-zero diagonal elements with ones. Since \n\n\n\n(\n\nX\n\n\n\nX\n\n\n+\n\n\n\n)\n\n∗\n\n\n=\n\nX\n\n\n\nX\n\n\n+\n\n\n\n\n{\\displaystyle (\\mathbf {X} \\mathbf {X} ^{+})^{*}=\\mathbf {X} \\mathbf {X} ^{+}}\n\n (the property of pseudoinverse), the matrix \n\n\n\nU\nP\n\nU\n\n\nT\n\n\n\n\n\n{\\displaystyle UPU^{\\rm {T}}}\n\n is an orthogonal projection onto the image (column-space) of X. In accordance with a general approach described in the introduction above (find XS which is an orthogonal projection),\nand thus,\nis a solution of a least squares problem. This method is the most computationally intensive, but is particularly useful if the normal equations matrix, XTX, is very ill-conditioned (i.e. if its condition number multiplied by the machine's relative round-off error is appreciably large). In that case, including the smallest singular values in the inversion merely adds numerical noise to the solution. This can be cured with the truncated SVD approach, giving a more stable and exact answer, by explicitly setting to zero all singular values below a certain threshold and so ignoring them, a process closely related to factor analysis.\nThe gradient equations at the minimum can be written as\nA geometrical interpretation of these equations is that the vector of residuals, \n\n\n\n\ny\n\n−\nX\n\n\n\nβ\n^\n\n\n\n\n\n{\\displaystyle \\mathbf {y} -X{\\hat {\\boldsymbol {\\beta }}}}\n\n is orthogonal to the column space of X, since the dot product \n\n\n\n(\n\ny\n\n−\nX\n\n\n\nβ\n^\n\n\n\n)\n⋅\nX\n\nv\n\n\n\n{\\displaystyle (\\mathbf {y} -X{\\hat {\\boldsymbol {\\beta }}})\\cdot X\\mathbf {v} }\n\n is equal to zero for any conformal vector, v. This means that \n\n\n\n\ny\n\n−\nX\n\n\n\nβ\n^\n\n\n\n\n\n{\\displaystyle \\mathbf {y} -X{\\boldsymbol {\\hat {\\beta }}}}\n\n is the shortest of all possible vectors \n\n\n\n\ny\n\n−\nX\n\nβ\n\n\n\n{\\displaystyle \\mathbf {y} -X{\\boldsymbol {\\beta }}}\n\n, that is, the variance of the residuals is the minimum possible. This is illustrated at the right.\nIntroducing \n\n\n\n\n\n\nγ\n^\n\n\n\n\n\n{\\displaystyle {\\hat {\\boldsymbol {\\gamma }}}}\n\n and a matrix K with the assumption that a matrix \n\n\n\n[\nX\n \nK\n]\n\n\n{\\displaystyle [X\\ K]}\n\n is non-singular and KT X = 0 (cf. Orthogonal projections), the residual vector should satisfy the following equation:\nThe equation and solution of linear least squares are thus described as follows:\nIf the experimental errors, \n\n\n\nϵ\n\n\n\n{\\displaystyle \\epsilon \\,}\n\n, are uncorrelated, have a mean of zero and a constant variance, \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n, the Gauss-Markov theorem states that the least-squares estimator, \n\n\n\n\n\n\nβ\n^\n\n\n\n\n\n{\\displaystyle {\\hat {\\boldsymbol {\\beta }}}}\n\n, has the minimum variance of all estimators that are linear combinations of the observations. In this sense it is the best, or optimal, estimator of the parameters. Note particularly that this property is independent of the statistical distribution function of the errors. In other words, the distribution function of the errors need not be a normal distribution. However, for some probability distributions, there is no guarantee that the least-squares solution is even possible given the observations; still, in such cases it is the best estimator that is both linear and unbiased.\nFor example, it is easy to show that the arithmetic mean of a set of measurements of a quantity is the least-squares estimator of the value of that quantity. If the conditions of the Gauss-Markov theorem apply, the arithmetic mean is optimal, whatever the distribution of errors of the measurements might be.\nHowever, in the case that the experimental errors do belong to a normal distribution, the least-squares estimator is also a maximum likelihood estimator.[3]\nThese properties underpin the use of the method of least squares for all types of data fitting, even when the assumptions are not strictly valid.\nAn assumption underlying the treatment given above is that the independent variable, x, is free of error. In practice, the errors on the measurements of the independent variable are usually much smaller than the errors on the dependent variable and can therefore be ignored. When this is not the case, total least squares or more generally errors-in-variables models, or rigorous least squares, should be used. This can be done by adjusting the weighting scheme to take into account errors on both the dependent and independent variables and then following the standard procedure.[4][5]\nIn some cases the (weighted) normal equations matrix XTX is ill-conditioned. When fitting polynomials the normal equations matrix is a Vandermonde matrix. Vandermonde matrices become increasingly ill-conditioned as the order of the matrix increases.[citation needed] In these cases, the least squares estimate amplifies the measurement noise and may be grossly inaccurate.[citation needed] Various regularization techniques can be applied in such cases, the most common of which is called ridge regression. If further information about the parameters is known, for example, a range of possible values of \n\n\n\n\n\n\nβ\n^\n\n\n\n\n\n{\\displaystyle \\mathbf {\\hat {\\boldsymbol {\\beta }}} }\n\n, then various techniques can be used to increase the stability of the solution. For example, see constrained least squares.\nAnother drawback of the least squares estimator is the fact that the norm of the residuals, \n\n\n\n∥\n\ny\n\n−\nX\n\n\n\nβ\n^\n\n\n\n∥\n\n\n{\\displaystyle \\|\\mathbf {y} -X{\\hat {\\boldsymbol {\\beta }}}\\|}\n\n is minimized, whereas in some cases one is truly interested in obtaining small error in the parameter \n\n\n\n\n\n\nβ\n^\n\n\n\n\n\n{\\displaystyle \\mathbf {\\hat {\\boldsymbol {\\beta }}} }\n\n, e.g., a small value of \n\n\n\n∥\n\nβ\n\n−\n\n\n\nβ\n^\n\n\n\n∥\n\n\n{\\displaystyle \\|{\\boldsymbol {\\beta }}-{\\hat {\\boldsymbol {\\beta }}}\\|}\n\n.[citation needed] However, since the true parameter \n\n\n\n\nβ\n\n\n\n{\\displaystyle {\\boldsymbol {\\beta }}}\n\n is necessarily unknown, this quantity cannot be directly minimized. If a prior probability on \n\n\n\n\n\n\nβ\n^\n\n\n\n\n\n{\\displaystyle {\\hat {\\boldsymbol {\\beta }}}}\n\n is known, then a Bayes estimator can be used to minimize the mean squared error, \n\n\n\nE\n\n{\n∥\n\nβ\n\n−\n\n\n\nβ\n^\n\n\n\n\n∥\n\n2\n\n\n}\n\n\n\n{\\displaystyle E\\left\\{\\|{\\boldsymbol {\\beta }}-{\\hat {\\boldsymbol {\\beta }}}\\|^{2}\\right\\}}\n\n. The least squares method is often applied when no prior is known. Surprisingly, when several parameters are being estimated jointly, better estimators can be constructed, an effect known as Stein's phenomenon. For example, if the measurement error is Gaussian, several estimators are known which dominate, or outperform, the least squares technique; the best known of these is the James–Stein estimator. This is an example of more general shrinkage estimators that have been applied to regression problems.\nIn some cases the observations may be weighted—for example, they may not be equally reliable. In this case, one can minimize the weighted sum of squares:\nwhere wi > 0 is the weight of the ith observation, and W is the diagonal matrix of such weights.\nThe weights should, ideally, be equal to the reciprocal of the variance of the measurement.[6][7] The normal equations are then:\nThis method is used in iteratively reweighted least squares.\nThe estimated parameter values are linear combinations of the observed values\nTherefore an expression for the residuals (i.e., the estimated errors in the parameters) can be obtained by error propagation from the errors in the observations. Let the variance-covariance matrix for the observations be denoted by M and that of the parameters by Mβ. Then,\nWhen W = M −1 this simplifies to\nWhen unit weights are used (W = I, the identity matrix) it is implied that the experimental errors are uncorrelated and all equal: M = σ2I, where σ2 is the a priori variance of an observation. In any case, σ2 is approximated by the reduced chi-squared \n\n\n\n\nχ\n\nν\n\n\n2\n\n\n\n\n{\\displaystyle \\chi _{\\nu }^{2}}\n\n:\nwhere S is the minimum value of the (weighted) objective function:\nThe denominator, \n\n\n\nν\n=\nm\n−\nn\n\n\n{\\displaystyle \\nu =m-n}\n\n is the number of degrees of freedom; see effective degrees of freedom for generalizations for the case of correlated observations.\nIn all cases, the variance of the parameter \n\n\n\n\nβ\n\ni\n\n\n\n\n{\\displaystyle \\beta _{i}}\n\n is given by \n\n\n\n\nM\n\ni\ni\n\n\nβ\n\n\n\n\n{\\displaystyle M_{ii}^{\\beta }}\n\n and the covariance between parameters \n\n\n\n\nβ\n\ni\n\n\n\n\n{\\displaystyle \\beta _{i}}\n\n and \n\n\n\n\nβ\n\nj\n\n\n\n\n{\\displaystyle \\beta _{j}}\n\n is given by \n\n\n\n\nM\n\ni\nj\n\n\nβ\n\n\n\n\n{\\displaystyle M_{ij}^{\\beta }}\n\n. Standard deviation is the square root of variance, and the correlation coefficient is given by \n\n\n\n\nρ\n\ni\nj\n\n\n=\n\nM\n\ni\nj\n\n\nβ\n\n\n\n/\n\n(\n\nσ\n\ni\n\n\n\nσ\n\nj\n\n\n)\n\n\n{\\displaystyle \\rho _{ij}=M_{ij}^{\\beta }/(\\sigma _{i}\\sigma _{j})}\n\n. These error estimates reflect only random errors in the measurements. The true uncertainty in the parameters is larger due to the presence of systematic errors which, by definition, cannot be quantified. Note that even though the observations may be un-correlated, the parameters are typically correlated.\nIt is often assumed, for want of any concrete evidence but often appealing to the central limit theorem—see Normal distribution#Occurrence—that the error on each observation belongs to a normal distribution with a mean of zero and standard deviation \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n. Under that assumption the following probabilities can be derived for a single scalar parameter estimate in terms of its estimated standard error \n\n\n\ns\n\ne\n\nβ\n\n\n\n\n{\\displaystyle se_{\\beta }}\n\n (given here):\nThe assumption is not unreasonable when m >> n. If the experimental errors are normally distributed the parameters will belong to a Student's t-distribution with m − n degrees of freedom. When m >> n Student's t-distribution approximates a normal distribution. Note, however, that these confidence limits cannot take systematic error into account. Also, parameter errors should be quoted to one significant figure only, as they are subject to sampling error.[8]\nWhen the number of observations is relatively small, Chebychev's inequality can be used for an upper bound on probabilities, regardless of any assumptions about the distribution of experimental errors: the maximum probabilities that a parameter will be more than 1, 2 or 3 standard deviations away from its expectation value are 100%, 25% and 11% respectively.\nThe residuals are related to the observations by\nwhere H is the idempotent matrix known as the hat matrix:\nand I is the identity matrix. The variance-covariance matrix of the residuals, Mr is given by\nThus the residuals are correlated, even if the observations are not.\nWhen \n\n\n\nW\n=\n\nM\n\n−\n1\n\n\n\n\n{\\displaystyle W=M^{-1}}\n\n,\nThe sum of residual values is equal to zero whenever the model function contains a constant term. Left-multiply the expression for the residuals by XT:\nSay, for example, that the first term of the model is a constant, so that \n\n\n\n\nX\n\ni\n1\n\n\n=\n1\n\n\n{\\displaystyle X_{i1}=1}\n\n for all i. In that case it follows that\nThus, in the motivational example, above, the fact that the sum of residual values is equal to zero it is not accidental but is a consequence of the presence of the constant term, α, in the model.\nIf experimental error follows a normal distribution, then, because of the linear relationship between residuals and observations, so should residuals,[9] but since the observations are only a sample of the population of all possible observations, the residuals should belong to a Student's t-distribution. Studentized residuals are useful in making a statistical test for an outlier when a particular residual appears to be excessively large.\nThe optimal value of the objective function, found by substituting in the optimal expression for the coefficient vector, can be written as (assuming unweighted observations)\nthe latter equality holding since (I – H) is symmetric and idempotent. It can be shown from this[10] that under an appropriate assignment of weights the expected value of S is m-n. If instead unit weights are assumed, the expected value of S is \n\n\n\n(\nm\n−\nn\n)\n\nσ\n\n2\n\n\n\n\n{\\displaystyle (m-n)\\sigma ^{2}}\n\n, where \n\n\n\n\nσ\n\n2\n\n\n\n\n{\\displaystyle \\sigma ^{2}}\n\n is the variance of each observation.\nIf it is assumed that the residuals belong to a normal distribution, the objective function, being a sum of weighted squared residuals, will belong to a chi-squared (\n\n\n\n\nχ\n\n2\n\n\n\n\n{\\displaystyle \\chi ^{2}}\n\n) distribution with m-n degrees of freedom. Some illustrative percentile values of \n\n\n\n\nχ\n\n2\n\n\n\n\n{\\displaystyle \\chi ^{2}}\n\n are given in the following table.[11]\nThese values can be used for a statistical criterion as to the goodness-of-fit. When unit weights are used, the numbers should be divided by the variance of an observation.\nOften it is of interest to solve a linear least squares problem with an additional constraint on the solution. With constrained linear least squares, the original equation\nmust be fit as closely as possible (in the least squares sense) while ensuring that some other property of \n\n\n\n\nβ\n\n\n\n{\\displaystyle {\\boldsymbol {\\beta }}}\n\n is maintained. There are often special purpose algorithms for solving such problems efficiently. Some examples of constraints are given below:\nWhen the constraint only applies to some of the variables, the mixed problem may be solved using separable least squares by letting \n\n\n\n\nX\n\n=\n[\n\n\nX\n\n1\n\n\n\n\n\nX\n\n2\n\n\n\n]\n\n\n{\\displaystyle \\mathbf {X} =[\\mathbf {X_{1}} \\mathbf {X_{2}} ]}\n\n and \n\n\n\n\n\nβ\n\n\n\nT\n\n\n\n=\n[\n\n\n\nβ\n\n1\n\n\n\n\n\nT\n\n\n\n\n\n\nβ\n\n2\n\n\n\n\n\nT\n\n\n\n]\n\n\n{\\displaystyle \\mathbf {\\beta } ^{\\rm {T}}=[\\mathbf {\\beta _{1}} ^{\\rm {T}}\\mathbf {\\beta _{2}} ^{\\rm {T}}]}\n\n represent the unconstrained (1) and constrained (2) components. Then substituting the least squares solution for \n\n\n\n\n\nβ\n\n1\n\n\n\n\n\n{\\displaystyle \\mathbf {\\beta _{1}} }\n\n, i.e.\nback into the original expression gives (following some rearrangement) an equation that can be solved as a purely constrained problem in \n\n\n\n\n\nβ\n\n2\n\n\n\n\n\n{\\displaystyle \\mathbf {\\beta _{2}} }\n\n.\nwhere \n\n\n\n\nP\n\n:=\n\nI\n\n−\n\n\nX\n\n1\n\n\n\n\n\n\nX\n\n1\n\n\n\n\n+\n\n\n\n\n{\\displaystyle \\mathbf {P} :=\\mathbf {I} -\\mathbf {X_{1}} \\mathbf {X_{1}} ^{+}}\n\n is a projection matrix. Following the constrained estimation of \n\n\n\n\n\n\n\nβ\n\n2\n\n\n^\n\n\n\n\n\n{\\displaystyle {\\hat {\\boldsymbol {\\beta _{2}}}}}\n\n the vector \n\n\n\n\n\n\n\nβ\n\n1\n\n\n^\n\n\n\n\n\n{\\displaystyle {\\hat {\\boldsymbol {\\beta _{1}}}}}\n\n is obtained from the expression above.\nThe primary application of linear least squares is in data fitting. Given a set of m data points \n\n\n\n\ny\n\n1\n\n\n,\n\ny\n\n2\n\n\n,\n…\n,\n\ny\n\nm\n\n\n,\n\n\n{\\displaystyle y_{1},y_{2},\\dots ,y_{m},}\n\n consisting of experimentally measured values taken at m values \n\n\n\n\nx\n\n1\n\n\n,\n\nx\n\n2\n\n\n,\n…\n,\n\nx\n\nm\n\n\n\n\n{\\displaystyle x_{1},x_{2},\\dots ,x_{m}}\n\n of an independent variable (\n\n\n\n\nx\n\ni\n\n\n\n\n{\\displaystyle x_{i}}\n\n may be scalar or vector quantities), and given a model function \n\n\n\ny\n=\nf\n(\nx\n,\n\nβ\n\n)\n,\n\n\n{\\displaystyle y=f(x,{\\boldsymbol {\\beta }}),}\n\n with \n\n\n\n\nβ\n\n=\n(\n\nβ\n\n1\n\n\n,\n\nβ\n\n2\n\n\n,\n…\n,\n\nβ\n\nn\n\n\n)\n,\n\n\n{\\displaystyle {\\boldsymbol {\\beta }}=(\\beta _{1},\\beta _{2},\\dots ,\\beta _{n}),}\n\n it is desired to find the parameters \n\n\n\n\nβ\n\nj\n\n\n\n\n{\\displaystyle \\beta _{j}}\n\n such that the model function \"best\" fits the data. In linear least squares, linearity is meant to be with respect to parameters \n\n\n\n\nβ\n\nj\n\n\n,\n\n\n{\\displaystyle \\beta _{j},}\n\n so\nHere, the functions \n\n\n\n\nϕ\n\nj\n\n\n\n\n{\\displaystyle \\phi _{j}}\n\n may be nonlinear with respect to the variable x.\nIdeally, the model function fits the data exactly, so\nfor all \n\n\n\ni\n=\n1\n,\n2\n,\n…\n,\nm\n.\n\n\n{\\displaystyle i=1,2,\\dots ,m.}\n\n This is usually not possible in practice, as there are more data points than there are parameters to be determined. The approach chosen then is to find the minimal possible value of the sum of squares of the residuals\nso to minimize the function\nAfter substituting for \n\n\n\n\nr\n\ni\n\n\n\n\n{\\displaystyle r_{i}}\n\n and then for \n\n\n\nf\n\n\n{\\displaystyle f}\n\n, this minimization problem becomes the quadratic minimization problem above with\nand the best fit can be found by solving the normal equations.\nThe numerical methods for linear least squares are important because linear regression models are among the most important types of model, both as formal statistical models and for exploration of data-sets. The majority of statistical computer packages contain facilities for regression analysis that make use of linear least squares computations. Hence it is appropriate that considerable effort has been devoted to the task of ensuring that these computations are undertaken efficiently and with due regard to round-off error.\nIndividual statistical analyses are seldom undertaken in isolation, but rather are part of a sequence of investigatory steps. Some of the topics involved in considering numerical methods for linear least squares relate to this point. Thus important topics can be\nFitting of linear models by least squares often, but not always, arise in the context of statistical analysis. It can therefore be important that considerations of computation efficiency for such problems extend to all of the auxiliary quantities required for such analyses, and are not restricted to the formal solution of the linear least squares problem.\nMatrix calculations, like any other, are affected by rounding errors. An early summary of these effects, regarding the choice of computation methods for matrix inversion, was provided by Wilkinson.[14]", 
    "dbpedia_url": "http://dbpedia.org/resource/Linear_least_squares_(mathematics)", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Linear_least_squares_(mathematics)\n"
}