{
    "about": "This is a list of numerical analysis topics.", 
    "name": "List Of Numerical Analysis Topics", 
    "classification": "Numerical Analysis", 
    "full_text": "This is a list of numerical analysis topics.\n\n\nError analysis (mathematics)\nNumerical linear algebra — study of numerical algorithms for linear algebra problems\nEigenvalue algorithm — a numerical algorithm for locating the eigenvalues of a matrix\nInterpolation — construct a function going through some given data points\nPolynomial interpolation — interpolation by polynomials\nSpline interpolation — interpolation by piecewise polynomials\nTrigonometric interpolation — interpolation by trigonometric polynomials\nApproximation theory\nRoot-finding algorithm — algorithms for solving the equation f(x) = 0\nMathematical optimization — algorithm for finding maxima or minima of a given function\nLinear programming (also treats integer programming) — objective function and constraints are linear\nConvex optimization\nNonlinear programming — the most general optimization problem in the usual framework\nOptimal control\nInfinite-dimensional optimization\nNumerical integration — the numerical evaluation of an integral\nNumerical methods for ordinary differential equations — the numerical solution of ordinary differential equations (ODEs)\nNumerical partial differential equations — the numerical solution of partial differential equations (PDEs)\nFinite difference method — based on approximating differential operators with difference operators\nFinite element method — based on a discretization of the space of solutions Gradient discretisation method — based on both the discretization of the solution and of its gradient\nFor a large list of software, see the list of numerical analysis software.", 
    "dbpedia_url": "http://dbpedia.org/resource/List_of_numerical_analysis_topics", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/List_of_numerical_analysis_topics\n"
}