{
    "about": "In computer science, particularly in coding theory, list decoding is an alternative to unique decoding of error-correcting codes for large error rates. The notion was proposed by Elias in the 1950s. The main idea behind list decoding is that the decoding algorithm instead of outputting a single possible message outputs a list of possibilities one of which is correct. This allows for handling a greater number of errors than that allowed by unique decoding.", 
    "name": "List Decoding", 
    "classification": "Error Detection And Correction", 
    "full_text": "In computer science, particularly in coding theory, list decoding is an alternative to unique decoding of error-correcting codes for large error rates. The notion was proposed by Elias in the 1950s. The main idea behind list decoding is that the decoding algorithm instead of outputting a single possible message outputs a list of possibilities one of which is correct. This allows for handling a greater number of errors than that allowed by unique decoding.\nThe unique decoding model in coding theory, which is constrained to output a single valid codeword from the received word could not tolerate greater fraction of errors. This resulted in a gap between the error-correction performance for stochastic noise models (proposed by Shannon) and the adversarial noise model (considered by Richard Hamming). Since the mid 90s, significant algorithmic progress by the coding theory community has bridged this gap. Much of this progress is based on a relaxed error-correction model called list decoding, wherein the decoder outputs a list of codewords for worst-case pathological error patterns where the actual transmitted codeword is included in the output list. In case of typical error patterns though, the decoder outputs a unique single codeword, given a received word, which is almost always the case (However, this is not known to be true for all codes). The improvement here is significant in that the error-correction performance doubles. This is because now the decoder is not confined by the half-the-minimum distance barrier. This model is very appealing because having a list of codewords is certainly better than just giving up. The notion of list-decoding has many interesting applications in complexity theory.\nThe way the channel noise is modeled plays a crucial role in that it governs the rate at which reliable communication is possible. There are two main schools of thought in modeling the channel behavior:\nThe highlight of list-decoding is that even under adversarial noise conditions, it is possible to achieve the information-theoretic optimal trade-off between rate and fraction of errors that can be corrected. Hence, in a sense this is like improving the error-correction performance to that possible in case of a weaker, stochastic noise model.\n\n\nLet \n\n\n\n\n\nC\n\n\n\n\n{\\displaystyle {\\mathcal {C}}}\n\n be a \n\n\n\n(\nn\n,\nk\n,\nd\n\n)\n\nq\n\n\n\n\n{\\displaystyle (n,k,d)_{q}}\n\n error-correcting code; in other words, \n\n\n\n\n\nC\n\n\n\n\n{\\displaystyle {\\mathcal {C}}}\n\n is a code of length \n\n\n\nn\n\n\n{\\displaystyle n}\n\n, dimension \n\n\n\nk\n\n\n{\\displaystyle k}\n\n and minimum distance \n\n\n\nd\n\n\n{\\displaystyle d}\n\n over an alphabet \n\n\n\nΣ\n\n\n{\\displaystyle \\Sigma }\n\n of size \n\n\n\nq\n\n\n{\\displaystyle q}\n\n. The list-decoding problem can now be formulated as follows:\nInput: Received word \n\n\n\nx\n∈\n\nΣ\n\nn\n\n\n\n\n{\\displaystyle x\\in \\Sigma ^{n}}\n\n, error bound \n\n\n\ne\n\n\n{\\displaystyle e}\n\n\nOutput: A list of all codewords \n\n\n\n\nx\n\n1\n\n\n,\n\nx\n\n2\n\n\n,\n…\n,\n\nx\n\nm\n\n\n∈\n\n\nC\n\n\n\n\n{\\displaystyle x_{1},x_{2},\\ldots ,x_{m}\\in {\\mathcal {C}}}\n\n whose hamming distance from \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is at most \n\n\n\ne\n\n\n{\\displaystyle e}\n\n.\nGiven a received word \n\n\n\ny\n\n\n{\\displaystyle y}\n\n, which is a noisy version of some transmitted codeword \n\n\n\nc\n\n\n{\\displaystyle c}\n\n, the decoder tries to output the transmitted codeword by placing its bet on a codeword that is “nearest” to the received word. The Hamming distance between two codewords is used as a metric in finding the nearest codeword, given the received word by the decoder. If \n\n\n\nd\n\n\n{\\displaystyle d}\n\n is the minimum Hamming distance of a code \n\n\n\n\n\nC\n\n\n\n\n{\\displaystyle {\\mathcal {C}}}\n\n, then there exists two codewords \n\n\n\n\nc\n\n1\n\n\n\n\n{\\displaystyle c_{1}}\n\n and \n\n\n\n\nc\n\n2\n\n\n\n\n{\\displaystyle c_{2}}\n\n that differ in exactly \n\n\n\nd\n\n\n{\\displaystyle d}\n\n positions. Now, in the case where the received word \n\n\n\ny\n\n\n{\\displaystyle y}\n\n is equidistant from the codewords \n\n\n\n\nc\n\n1\n\n\n\n\n{\\displaystyle c_{1}}\n\n and \n\n\n\n\nc\n\n2\n\n\n\n\n{\\displaystyle c_{2}}\n\n, unambiguous decoding becomes impossible as the decoder cannot decide which one of \n\n\n\n\nc\n\n1\n\n\n\n\n{\\displaystyle c_{1}}\n\n and \n\n\n\n\nc\n\n2\n\n\n\n\n{\\displaystyle c_{2}}\n\n to output as the original transmitted codeword. As a result, the half-the minimum distance acts as a combinatorial barrier beyond which unambiguous error-correction is impossible, if we only insist on unique decoding. However, received words such as \n\n\n\ny\n\n\n{\\displaystyle y}\n\n considered above occur only in the worst-case and if one looks at the way Hamming balls are packed in high-dimensional space, even for error patterns \n\n\n\ne\n\n\n{\\displaystyle e}\n\n beyond half-the minimum distance, there is only a single codeword \n\n\n\nc\n\n\n{\\displaystyle c}\n\n within Hamming distance \n\n\n\ne\n\n\n{\\displaystyle e}\n\n from the received word. This claim has been shown to hold with high probability for a random code picked from a natural ensemble and more so for the case of Reed–Solomon codes which is well studied and quite ubiquitous in the real world applications. In fact, Shannon’s proof of the capacity theorem for q-ary symmetric channels can be viewed in light of the above claim for random codes.\nUnder the mandate of list-decoding, for worst-case errors, the decoder is allowed to output a small list of codewords. With some context specific or side information, it may be possible to prune the list and recover the original transmitted codeword. Hence, in general, this seems to be a stronger error-recovery model than unique decoding.\nFor a polynomial-time list-decoding algorithm to exist, we need the combinatorial guarantee that any Hamming ball of radius \n\n\n\np\nn\n\n\n{\\displaystyle pn}\n\n around a received word \n\n\n\nr\n\n\n{\\displaystyle r}\n\n (where \n\n\n\np\n\n\n{\\displaystyle p}\n\n is the fraction of errors in terms of the block length \n\n\n\nn\n\n\n{\\displaystyle n}\n\n) has a small number of codewords. This is because the list size itself is clearly a lower bound on the running time of the algorithm. Hence, we require the list size to be a polynomial in the block length \n\n\n\nn\n\n\n{\\displaystyle n}\n\n of the code. A combinatorial consequence of this requirement is that it imposes an upper bound on the rate of a code. List decoding promises to meet this upper bound. It has been shown non-constructively that codes of rate \n\n\n\nR\n\n\n{\\displaystyle R}\n\n exist that can be list decoded up to a fraction of errors approaching \n\n\n\n1\n−\nR\n\n\n{\\displaystyle 1-R}\n\n. The quantity \n\n\n\n1\n−\nR\n\n\n{\\displaystyle 1-R}\n\n is referred to in the literature as the list-decoding capacity. This is a substantial gain compared to the unique decoding model as we now have the potential to correct twice as many errors. Naturally, we need to have at least a fraction \n\n\n\nR\n\n\n{\\displaystyle R}\n\n of the transmitted symbols to be correct in order to recover the message. This is an information-theoretic lower bound on the number of correct symbols required to perform decoding and with list decoding, we can potentially achieve this information-theoretic limit. However, to realize this potential, we need explicit codes (codes that can be constructed in polynomial time) and efficient algorithms to perform encoding and decoding.\nFor any error fraction \n\n\n\n0\n⩽\np\n⩽\n1\n\n\n{\\displaystyle 0\\leqslant p\\leqslant 1}\n\n and an integer \n\n\n\nL\n⩾\n1\n\n\n{\\displaystyle L\\geqslant 1}\n\n, a code \n\n\n\n\n\nC\n\n\n⊆\n\nΣ\n\nn\n\n\n\n\n{\\displaystyle {\\mathcal {C}}\\subseteq \\Sigma ^{n}}\n\n is said to be list decodable up to a fraction \n\n\n\np\n\n\n{\\displaystyle p}\n\n of errors with list size at most \n\n\n\nL\n\n\n{\\displaystyle L}\n\n or \n\n\n\n(\np\n,\nL\n)\n\n\n{\\displaystyle (p,L)}\n\n-list-decodable if for every \n\n\n\ny\n∈\n\nΣ\n\nn\n\n\n\n\n{\\displaystyle y\\in \\Sigma ^{n}}\n\n, the number of codewords \n\n\n\nc\n∈\nC\n\n\n{\\displaystyle c\\in C}\n\n within Hamming distance \n\n\n\np\nn\n\n\n{\\displaystyle pn}\n\n from \n\n\n\ny\n\n\n{\\displaystyle y}\n\n is at most \n\n\n\nL\n.\n\n\n{\\displaystyle L.}\n\n\nThe relation between list decodability of a code and other fundamental parameters such as minimum distance and rate have been fairly well studied. It has been shown that every code can be list decoded using small lists beyond half the minimum distance up to a bound called the Johnson radius. This is quite significant because it proves the existence of \n\n\n\n(\np\n,\nL\n)\n\n\n{\\displaystyle (p,L)}\n\n-list-decodable codes of good rate with a list-decoding radius much larger than \n\n\n\n\n\n\nd\n2\n\n\n\n.\n\n\n{\\displaystyle {\\tfrac {d}{2}}.}\n\n In other words, the Johnson bound rules out the possibility of having a large number of codewords in a Hamming ball of radius slightly greater than \n\n\n\n\n\n\nd\n2\n\n\n\n\n\n{\\displaystyle {\\tfrac {d}{2}}}\n\n which means that it is possible to correct far more errors with list decoding.\nWhat this means is that for rates approaching the channel capacity, there exists list decodable codes with polynomial sized lists enabling efficient decoding algorithms whereas for rates exceeding the channel capacity, the list size becomes exponential which rules out the existence of efficient decoding algorithms.\nThe proof for list-decoding capacity is a significant one in that it exactly matches the capacity of a \n\n\n\nq\n\n\n{\\displaystyle q}\n\n-ary symmetric channel \n\n\n\nq\nS\n\nC\n\np\n\n\n\n\n{\\displaystyle qSC_{p}}\n\n. In fact, the term \"list-decoding capacity\" should actually be read as the capacity of an adversarial channel under list decoding. Also, the proof for list-decoding capacity is an important result that pin points the optimal trade-off between rate of a code and the fraction of errors that can be corrected under list decoding.\nThe idea behind the proof is similar to that of Shannon's proof for capacity of the binary symmetric channel \n\n\n\nB\nS\n\nC\n\np\n\n\n\n\n{\\displaystyle BSC_{p}}\n\n where a random code is picked and showing that it is \n\n\n\n(\np\n,\nL\n)\n\n\n{\\displaystyle (p,L)}\n\n-list-decodable with high probability as long as the rate \n\n\n\nR\n⩽\n1\n−\n\nH\n\nq\n\n\n(\np\n)\n−\n\n\n\n1\nL\n\n\n\n.\n\n\n{\\displaystyle R\\leqslant 1-H_{q}(p)-{\\tfrac {1}{L}}.}\n\n For rates exceeding the above quantity, it can be shown that the list size \n\n\n\nL\n\n\n{\\displaystyle L}\n\n becomes super-polynomially large.\nA \"bad\" event is defined as one in which, given a received word \n\n\n\ny\n∈\n[\nq\n\n]\n\nn\n\n\n\n\n{\\displaystyle y\\in [q]^{n}}\n\n and \n\n\n\nL\n+\n1\n\n\n{\\displaystyle L+1}\n\n messages \n\n\n\n\nm\n\n0\n\n\n,\n…\n,\n\nm\n\nL\n\n\n∈\n[\nq\n\n]\n\nk\n\n\n,\n\n\n{\\displaystyle m_{0},\\ldots ,m_{L}\\in [q]^{k},}\n\n it so happens that \n\n\n\n\n\nC\n\n\n(\n\nm\n\ni\n\n\n)\n∈\nB\n(\ny\n,\np\nn\n)\n\n\n{\\displaystyle {\\mathcal {C}}(m_{i})\\in B(y,pn)}\n\n, for every \n\n\n\n0\n⩽\ni\n⩽\nL\n\n\n{\\displaystyle 0\\leqslant i\\leqslant L}\n\n where \n\n\n\np\n\n\n{\\displaystyle p}\n\n is the fraction of errors that we wish to correct and \n\n\n\nB\n(\ny\n,\np\nn\n)\n\n\n{\\displaystyle B(y,pn)}\n\n is the Hamming ball of radius \n\n\n\np\nn\n\n\n{\\displaystyle pn}\n\n with the received word \n\n\n\ny\n\n\n{\\displaystyle y}\n\n as the center.\nNow, the probability that a codeword \n\n\n\n\n\nC\n\n\n(\n\nm\n\ni\n\n\n)\n\n\n{\\displaystyle {\\mathcal {C}}(m_{i})}\n\n associated with a fixed message \n\n\n\n\nm\n\ni\n\n\n∈\n[\nq\n\n]\n\nk\n\n\n\n\n{\\displaystyle m_{i}\\in [q]^{k}}\n\n lies in a Hamming ball \n\n\n\nB\n(\ny\n,\np\nn\n)\n\n\n{\\displaystyle B(y,pn)}\n\n is given by\nwhere the quantity \n\n\n\nV\no\n\nl\n\nq\n\n\n(\ny\n,\np\nn\n)\n\n\n{\\displaystyle Vol_{q}(y,pn)}\n\n is the volume of a Hamming ball of radius \n\n\n\np\nn\n\n\n{\\displaystyle pn}\n\n with the received word \n\n\n\ny\n\n\n{\\displaystyle y}\n\n as the center. The inequality in the above relation follows from the upper bound on the volume of a Hamming ball. The quantity \n\n\n\n\nq\n\n\nH\n\nq\n\n\n(\np\n)\n\n\n\n\n{\\displaystyle q^{H_{q}(p)}}\n\n gives a very good estimate on the volume of a Hamming ball of radius \n\n\n\np\n\n\n{\\displaystyle p}\n\n centered on any word in \n\n\n\n[\nq\n\n]\n\nn\n\n\n.\n\n\n{\\displaystyle [q]^{n}.}\n\n Put another way, the volume of a Hamming ball is translation invariant. To continue with the proof sketch, we conjure the union bound in probability theory which tells us that the probability of a bad event happening for a given \n\n\n\n(\ny\n,\n\nm\n\n0\n\n\n,\n…\n,\n\nm\n\nL\n\n\n)\n\n\n{\\displaystyle (y,m_{0},\\dots ,m_{L})}\n\n is upper bounded by the quantity \n\n\n\n\nq\n\n−\nn\n(\nL\n+\n1\n)\n(\n1\n−\n\nH\n\nq\n\n\n(\np\n)\n)\n\n\n\n\n{\\displaystyle q^{-n(L+1)(1-H_{q}(p))}}\n\n.\nWith the above in mind, the probability of \"any\" bad event happening can be shown to be less than \n\n\n\n1\n\n\n{\\displaystyle 1}\n\n. To show this, we work our way over all possible received words \n\n\n\ny\n∈\n[\nq\n\n]\n\nn\n\n\n\n\n{\\displaystyle y\\in [q]^{n}}\n\n and every possible subset of \n\n\n\nL\n\n\n{\\displaystyle L}\n\n messages in \n\n\n\n[\nq\n\n]\n\nk\n\n\n.\n\n\n{\\displaystyle [q]^{k}.}\n\n\nNow turning to the proof of part (ii), we need to show that there are super-polynomially many codewords around every \n\n\n\ny\n∈\n[\nq\n\n]\n\nn\n\n\n\n\n{\\displaystyle y\\in [q]^{n}}\n\n when the rate exceeds the list-decoding capacity. We need to show that \n\n\n\n\n|\n\n\n\nC\n\n\n∩\nB\n(\ny\n,\np\nn\n)\n\n|\n\n\n\n{\\displaystyle |{\\mathcal {C}}\\cap B(y,pn)|}\n\n is super-polynomially large if the rate \n\n\n\nR\n⩾\n1\n−\n\nH\n\nq\n\n\n(\np\n)\n+\nϵ\n\n\n{\\displaystyle R\\geqslant 1-H_{q}(p)+\\epsilon }\n\n. Fix a codeword \n\n\n\nc\n∈\n\n\nC\n\n\n\n\n{\\displaystyle c\\in {\\mathcal {C}}}\n\n. Now, for every \n\n\n\ny\n∈\n[\nq\n\n]\n\nn\n\n\n\n\n{\\displaystyle y\\in [q]^{n}}\n\n picked at random, we have\nsince Hamming balls are translation invariant. From the definition of the volume of a Hamming ball and the fact that \n\n\n\ny\n\n\n{\\displaystyle y}\n\n is chosen uniformly at random from \n\n\n\n[\nq\n\n]\n\nn\n\n\n\n\n{\\displaystyle [q]^{n}}\n\n we also have\nLet us now define an indicator variable \n\n\n\n\nX\n\nc\n\n\n\n\n{\\displaystyle X_{c}}\n\n such that\nTaking the expectation of the volume of a Hamming ball we have\nTherefore, by the probabilistic method, we have shown that if the rate exceeds the list-decoding capacity, then the list size becomes super-polynomially large. This completes the proof sketch for the list-decoding capacity.\nIn the period from 1995 to 2007, the coding theory community developed progressively more efficient list-decoding algorithms. Algorithms for Reed–Solomon codes that can decode up to the Johnson radius which is \n\n\n\n1\n−\n\n\n1\n−\nδ\n\n\n\n\n{\\displaystyle 1-{\\sqrt {1-\\delta }}}\n\n exist where \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n is the normalised distance or relative distance. However, for Reed-Solomon codes, \n\n\n\nδ\n=\n1\n−\nR\n\n\n{\\displaystyle \\delta =1-R}\n\n which means a fraction \n\n\n\n1\n−\n\n\nR\n\n\n\n\n{\\displaystyle 1-{\\sqrt {R}}}\n\n of errors can be corrected. Some of the most prominent list-decoding algorithms are the following:\nBecause of their ubiquity and the nice algebraic properties they possess, list-decoding algorithms for Reed–Solomon codes were a main focus of researchers. The list-decoding problem for Reed–Solomon codes can be formulated as follows:\nInput: For an \n\n\n\n[\nn\n,\nk\n+\n1\n\n]\n\nq\n\n\n\n\n{\\displaystyle [n,k+1]_{q}}\n\n Reed-Solomon code, we are given the pair \n\n\n\n(\n\nα\n\ni\n\n\n,\n\ny\n\ni\n\n\n)\n\n\n{\\displaystyle (\\alpha _{i},y_{i})}\n\n for \n\n\n\n1\n≤\ni\n≤\nn\n\n\n{\\displaystyle 1\\leq i\\leq n}\n\n, where \n\n\n\n\ny\n\ni\n\n\n\n\n{\\displaystyle y_{i}}\n\n is the \n\n\n\ni\n\n\n{\\displaystyle i}\n\nth bit of the received word and the \n\n\n\n\nα\n\ni\n\n\n\n\n{\\displaystyle \\alpha _{i}}\n\n's are distinct points in the finite field \n\n\n\n\nF\n\nq\n\n\n\n\n{\\displaystyle F_{q}}\n\n and an error parameter \n\n\n\ne\n=\nn\n−\nt\n\n\n{\\displaystyle e=n-t}\n\n.\nOutput: The goal is to find all the polynomials \n\n\n\nP\n(\nX\n)\n∈\n\nF\n\nq\n\n\n[\nX\n]\n\n\n{\\displaystyle P(X)\\in F_{q}[X]}\n\n of degree at most \n\n\n\nk\n\n\n{\\displaystyle k}\n\n which is the message length such that \n\n\n\np\n(\n\nα\n\ni\n\n\n)\n=\n\ny\n\ni\n\n\n\n\n{\\displaystyle p(\\alpha _{i})=y_{i}}\n\n for at least \n\n\n\nt\n\n\n{\\displaystyle t}\n\n values of \n\n\n\ni\n\n\n{\\displaystyle i}\n\n. Here, we would like to have \n\n\n\nt\n\n\n{\\displaystyle t}\n\n as small as possible so that greater number of errors can be tolerated.\nWith the above formulation, the general structure of list-decoding algorithms for Reed-Solomon codes is as follows:\nStep 1: (Interpolation) Find a non-zero bivariate polynomial \n\n\n\nQ\n(\nX\n,\nY\n)\n\n\n{\\displaystyle Q(X,Y)}\n\n such that \n\n\n\nQ\n(\n\nα\n\ni\n\n\n,\n\ny\n\ni\n\n\n)\n=\n0\n\n\n{\\displaystyle Q(\\alpha _{i},y_{i})=0}\n\n for \n\n\n\n1\n≤\ni\n≤\nn\n\n\n{\\displaystyle 1\\leq i\\leq n}\n\n.\nStep 2: (Root finding/Factorization) Output all degree \n\n\n\nk\n\n\n{\\displaystyle k}\n\n polynomials \n\n\n\np\n(\nX\n)\n\n\n{\\displaystyle p(X)}\n\n such that \n\n\n\nY\n−\np\n(\nX\n)\n\n\n{\\displaystyle Y-p(X)}\n\n is a factor of \n\n\n\nQ\n(\nX\n,\nY\n)\n\n\n{\\displaystyle Q(X,Y)}\n\n i.e. \n\n\n\nQ\n(\nX\n,\np\n(\nX\n)\n)\n=\n0\n\n\n{\\displaystyle Q(X,p(X))=0}\n\n. For each of these polynomials, check if \n\n\n\np\n(\n\nα\n\ni\n\n\n)\n=\n\ny\n\ni\n\n\n\n\n{\\displaystyle p(\\alpha _{i})=y_{i}}\n\n for at least \n\n\n\nt\n\n\n{\\displaystyle t}\n\n values of \n\n\n\ni\n∈\n[\nn\n]\n\n\n{\\displaystyle i\\in [n]}\n\n. If so, include such a polynomial \n\n\n\np\n(\nX\n)\n\n\n{\\displaystyle p(X)}\n\n in the output list.\nGiven the fact that bivariate polynomials can be factored efficiently, the above algorithm runs in polynomial time.\nAlgorithms developed for list decoding of several interesting code families have found interesting applications in computational complexity and the field of cryptography. Following is a sample list of applications outside of coding theory:", 
    "dbpedia_url": "http://dbpedia.org/resource/List_decoding", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/List_decoding\n"
}