{
    "about": "A locally testable code is a type of error-correcting code for which it can be determined if a string is a word in that code by looking at a small (frequently constant) number of bits of the string. In some situations, it is useful to know if the data is corrupted without decoding all of it so that appropriate action can be taken in response. For example, in communication, if the receiver encounters a corrupted code, it can request the data be re-sent, which could increase the accuracy of said data. Similarly, in data storage, these codes can allow for damaged data to be recovered and rewritten properly.", 
    "name": "Locally Testable Code", 
    "classification": "Error Detection And Correction", 
    "full_text": "A locally testable code is a type of error-correcting code for which it can be determined if a string is a word in that code by looking at a small (frequently constant) number of bits of the string. In some situations, it is useful to know if the data is corrupted without decoding all of it so that appropriate action can be taken in response. For example, in communication, if the receiver encounters a corrupted code, it can request the data be re-sent, which could increase the accuracy of said data. Similarly, in data storage, these codes can allow for damaged data to be recovered and rewritten properly.\nIn contrast, locally decodable codes use a small number of bits of the codeword to probabilistically recover the original information. The fraction of errors determines how likely it is that the decoder correctly recovers the original bit; however, not all locally decodable codes are locally testable.[1]\nClearly, any valid codeword should be accepted as a codeword, but strings that are not codewords could be only one bit off, which would require many (certainly more than a constant number) probes. To account for this, testing failure is only defined if the string is off by at least a set fraction of its bits. This implies words of the code must be longer than the input strings by adding some redundancy.\n\n\nTo measure the distance between two strings, the Hamming distance is used\nThe distance of a string \n\n\n\nw\n\n\n{\\displaystyle w}\n\n from a code \n\n\n\nC\n:\n{\n0\n,\n1\n\n}\n\nk\n\n\n→\n{\n0\n,\n1\n\n}\n\nn\n\n\n\n\n{\\displaystyle C:\\{0,1\\}^{k}\\to \\{0,1\\}^{n}}\n\n is computed by\nRelative distances are computed as a fraction of the number of bits\nA code \n\n\n\nC\n:\n{\n0\n,\n1\n\n}\n\nk\n\n\n→\n\n\n0\n,\n1\n\n\nn\n\n\n\n\n{\\displaystyle C:\\{0,1\\}^{k}\\to {0,1}^{n}}\n\n is called \n\n\n\nq\n\n\n{\\displaystyle q}\n\n-local \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n-testable if there exists a Turing machine M given random access to an input \n\n\n\nw\n\n\n{\\displaystyle w}\n\n that makes at most \n\n\n\nq\n\n\n{\\displaystyle q}\n\n non-adaptive queries of \n\n\n\nw\n\n\n{\\displaystyle w}\n\n and satisfies the following:[2]\nIt remains an open question whether there are any locally testable codes of linear size, but there are several constructions that are considered \"nearly linear\":[3]\nThese have both been achieved, even with constant query complexity and a binary alphabet, such as with \n\n\n\nn\n=\n\nk\n\n1\n+\n1\n\n/\n\n(\nlog\n⁡\nk\n\n)\n\nc\n\n\n\n\n\n\n{\\displaystyle n=k^{1+1/(\\log k)^{c}}}\n\n for any \n\n\n\nc\n∈\n(\n0\n,\n1\n)\n\n\n{\\displaystyle c\\in (0,1)}\n\n. The next nearly linear goal is linear up to a polylogarithmic factor; \n\n\n\nn\n=\n\npoly\n\n(\nlog\n⁡\nk\n)\n∗\nk\n\n\n{\\displaystyle n={\\text{poly}}(\\log k)*k}\n\n. Nobody has yet to come up with a linearly testable code that satisfies this constraint.[3]\nLocally testable codes have a lot in common with probabilistically checkable proofs (PCPs). This should be apparent from the similarities of their construction. In both, we are given \n\n\n\nq\n\n\n{\\displaystyle q}\n\n random nonadaptive queries into a large string and if we want to accept, we must with probability 1, and if not, we must accept no more than half the time. The major difference is that PCPs are interested in accepting \n\n\n\nx\n\n\n{\\displaystyle x}\n\n if there exists a \n\n\n\nw\n\n\n{\\displaystyle w}\n\n so that \n\n\n\n\nM\n\nw\n\n\n(\nx\n)\n=\n1\n\n\n{\\displaystyle M^{w}(x)=1}\n\n. Locally testable codes, on the other hand, accept \n\n\n\nw\n\n\n{\\displaystyle w}\n\n if it is part of the code. Many things can go wrong in assuming a PCP proof encodes a locally testable code. For example, the PCP definition says nothing about invalid proofs, only invalid inputs.\nDespite this difference, locally testable codes and PCPs are similar enough that frequently to construct one, a prover will construct the other along the way.[4]\nOne of the most famous error-correcting codes, the Hadamard code is a locally testable code. A codeword x is encoded in the Hadamard code to be the linear function \n\n\n\nf\n(\ny\n)\n=\n\n\n∑\n\ni\n\n\n\n\nx\n\ni\n\n\n\ny\n\ni\n\n\n\n\n\n\n{\\displaystyle f(y)={\\sum _{i}{x_{i}y_{i}}}}\n\n (mod 2). This requires listing out the result of this function for every possible y, which requires exponentially more bits than its input. To test if a string w is a codeword of the Hadamard code, all we have to do is test if the function it encodes is linear. This means simply checking if \n\n\n\nw\n(\nx\n)\n⊕\nw\n(\ny\n)\n=\nw\n(\nx\n⊕\ny\n)\n\n\n{\\displaystyle w(x)\\oplus w(y)=w(x\\oplus y)}\n\n for x and y uniformly random vectors (where \n\n\n\n⊕\n\n\n{\\displaystyle \\oplus }\n\n denotes bitwise XOR).\nIt is easy to see that for any valid encoding \n\n\n\nw\n\n\n{\\displaystyle w}\n\n, this equation is true, as that is the definition of a linear function. Somewhat harder, however, is showing that a string that is \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n-far from C will have an upper bound on its error in terms of \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n. One bound is found by the direct approach of approximating the chances of exactly one of the three probes yielding an incorrect result. Let A, B, and C be the events of \n\n\n\nw\n(\nx\n)\n\n\n{\\displaystyle w(x)}\n\n, \n\n\n\nw\n(\ny\n)\n\n\n{\\displaystyle w(y)}\n\n, and \n\n\n\nw\n(\nx\n⊕\ny\n)\n\n\n{\\displaystyle w(x\\oplus y)}\n\n being incorrect. Let E be the event of exactly one of these occurring. This comes out to\nThis works for \n\n\n\n0\n<\nδ\n≤\n5\n\n/\n\n16\n\n\n{\\displaystyle 0<\\delta \\leq 5/16}\n\n, but shortly after, \n\n\n\n3\nδ\n−\n6\n\nδ\n\n2\n\n\n<\nδ\n\n\n{\\displaystyle 3\\delta -6\\delta ^{2}<\\delta }\n\n. With additional work, it can be shown that the error is bounded by\nFor any given \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n, this only has a constant chance of false positives, so we can simply check a constant number of times to get the probability below 1/2.[3]\nThe Long code is another code with very large blowup which is close to locally testable. Given an input \n\n\n\n0\n≤\ni\n≤\n\n2\n\nk\n\n\n\n\n{\\displaystyle 0\\leq i\\leq 2^{k}}\n\n (note, this takes \n\n\n\nk\n\n\n{\\displaystyle k}\n\n bits to represent), the function that returns the \n\n\n\n\ni\n\nt\nh\n\n\n\n\n{\\displaystyle i^{th}}\n\n bit of the input, \n\n\n\n\nf\n\ni\n\n\n(\nx\n)\n=\n\nx\n\ni\n\n\n\n\n{\\displaystyle f_{i}(x)=x_{i}}\n\n, is evaluated on all possible \n\n\n\n\n2\n\nk\n\n\n\n\n{\\displaystyle 2^{k}}\n\n-bit inputs \n\n\n\n0\n≤\nx\n≤\n\n2\n\n\n2\n\nk\n\n\n\n\n\n\n{\\displaystyle 0\\leq x\\leq 2^{2^{k}}}\n\n, and the codeword is the concatenation of these (of length \n\n\n\nn\n=\n\n2\n\n\n2\n\nk\n\n\n\n\n\n\n{\\displaystyle n=2^{2^{k}}}\n\n). The way to locally test this with some errors is to pick a uniformly random input \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and set \n\n\n\ny\n=\nx\n\n\n{\\displaystyle y=x}\n\n, but with a small chance of flipping each bit, \n\n\n\nμ\n>\n0\n\n\n{\\displaystyle \\mu >0}\n\n. Accept a function \n\n\n\nf\n\n\n{\\displaystyle f}\n\n as a codeword if \n\n\n\nf\n(\nx\n)\n=\nf\n(\ny\n)\n\n\n{\\displaystyle f(x)=f(y)}\n\n. If \n\n\n\nf\n\n\n{\\displaystyle f}\n\n is a codeword, this will accept \n\n\n\nf\n\n\n{\\displaystyle f}\n\n as long as \n\n\n\n\nx\n\ni\n\n\n\n\n{\\displaystyle x_{i}}\n\n was unchanged, which happens with probability \n\n\n\n1\n−\nμ\n\n\n{\\displaystyle 1-\\mu }\n\n. This violates the requirement that codewords are always accepted, but may be good enough for some needs.[5]\nOther locally testable codes include Reed-Muller codes (see locally decodable codes for a decoding algorithm), Reed-Solomon codes, and the short code.", 
    "dbpedia_url": "http://dbpedia.org/resource/Locally_testable_code", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Locally_testable_code\n"
}