{
    "about": "In anomaly detection, the local outlier factor (LOF) is an algorithm proposed by Markus M. Breunig, Hans-Peter Kriegel, Raymond T. Ng and Jörg Sander in 2000 for finding anomalous data points by measuring the local deviation of a given data point with respect to its neighbours.[1]", 
    "name": "Local Outlier Factor", 
    "classification": "Machine Learning Algorithms", 
    "full_text": "In anomaly detection, the local outlier factor (LOF) is an algorithm proposed by Markus M. Breunig, Hans-Peter Kriegel, Raymond T. Ng and Jörg Sander in 2000 for finding anomalous data points by measuring the local deviation of a given data point with respect to its neighbours.[1]\nLOF shares some concepts with DBSCAN and OPTICS such as the concepts of \"core distance\" and \"reachability distance\", which are used for local density estimation.[2]\n\n\nThe local outlier factor is based on a concept of a local density, where locality is given by \n\n\n\nk\n\n\n{\\displaystyle k}\n\n nearest neighbors, whose distance is used to estimate the density. By comparing the local density of an object to the local densities of its neighbors, one can identify regions of similar density, and points that have a substantially lower density than their neighbors. These are considered to be outliers.\nThe local density is estimated by the typical distance at which a point can be \"reached\" from its neighbors. The definition of \"reachability distance\" used in LOF is an additional measure to produce more stable results within clusters.\nLet \n\n\n\n\nk-distance\n\n(\nA\n)\n\n\n{\\displaystyle {\\mbox{k-distance}}(A)}\n\n be the distance of the object \n\n\n\nA\n\n\n{\\displaystyle A}\n\n to the k-th nearest neighbor. Note that the set of the k nearest neighbors includes all objects at this distance, which can in the case of a \"tie\" be more than k objects. We denote the set of k nearest neighbors as \n\n\n\n\nN\n\nk\n\n\n(\nA\n)\n\n\n{\\displaystyle N_{k}(A)}\n\n.\nThis distance is used to define what is called reachability distance:\n\n\n\n\n\n\nreachability-distance\n\n\nk\n\n\n(\nA\n,\nB\n)\n=\nmax\n{\n\nk-distance\n\n(\nB\n)\n,\nd\n(\nA\n,\nB\n)\n}\n\n\n{\\displaystyle {\\mbox{reachability-distance}}_{k}(A,B)=\\max\\{{\\mbox{k-distance}}(B),d(A,B)\\}}\n\n\nIn words, the reachability distance of an object \n\n\n\nA\n\n\n{\\displaystyle A}\n\n from \n\n\n\nB\n\n\n{\\displaystyle B}\n\n is the true distance of the two objects, but at least the \n\n\n\n\nk-distance\n\n\n\n{\\displaystyle {\\mbox{k-distance}}}\n\n of \n\n\n\nB\n\n\n{\\displaystyle B}\n\n. Objects that belong to the k nearest neighbors of \n\n\n\nB\n\n\n{\\displaystyle B}\n\n (the \"core\" of \n\n\n\nB\n\n\n{\\displaystyle B}\n\n, see DBSCAN cluster analysis) are considered to be equally distant. The reason for this distance is to get more stable results. Note that this is not a distance in the mathematical definition, since it is not symmetric. (While it is a common mistake[3] to always use the \n\n\n\n\nk-distance\n\n\n\n{\\displaystyle {\\mbox{k-distance}}}\n\n, this yields a slightly different method, referred to as Simplified-LOF[3])\nThe local reachability density of an object \n\n\n\nA\n\n\n{\\displaystyle A}\n\n is defined by\n\n\n\n\n\nlrd\n\n(\nA\n)\n:=\n1\n\n/\n\n\n(\n\n\n\n\n∑\n\nB\n∈\n\nN\n\nk\n\n\n(\nA\n)\n\n\n\n\nreachability-distance\n\n\nk\n\n\n(\nA\n,\nB\n)\n\n\n\n|\n\n\nN\n\nk\n\n\n(\nA\n)\n\n|\n\n\n\n\n)\n\n\n\n{\\displaystyle {\\mbox{lrd}}(A):=1/\\left({\\frac {\\sum _{B\\in N_{k}(A)}{\\mbox{reachability-distance}}_{k}(A,B)}{|N_{k}(A)|}}\\right)}\n\n\nwhich is the inverse of the average reachability distance of the object \n\n\n\nA\n\n\n{\\displaystyle A}\n\n from its neighbors. Note that it is not the average reachability of the neighbors from \n\n\n\nA\n\n\n{\\displaystyle A}\n\n (which by definition would be the \n\n\n\n\nk-distance\n\n(\nA\n)\n\n\n{\\displaystyle {\\mbox{k-distance}}(A)}\n\n), but the distance at which it can be \"reached\" from its neighbors. With duplicate points, this value can become infinite.\nThe local reachability densities are then compared with those of the neighbors using\n\n\n\n\n\n\nLOF\n\n\nk\n\n\n(\nA\n)\n:=\n\n\n\n\n∑\n\nB\n∈\n\nN\n\nk\n\n\n(\nA\n)\n\n\n\n\n\n\nlrd\n\n(\nB\n)\n\n\n\nlrd\n\n(\nA\n)\n\n\n\n\n\n\n|\n\n\nN\n\nk\n\n\n(\nA\n)\n\n|\n\n\n\n\n=\n\n\n\n\n∑\n\nB\n∈\n\nN\n\nk\n\n\n(\nA\n)\n\n\n\nlrd\n\n(\nB\n)\n\n\n\n|\n\n\nN\n\nk\n\n\n(\nA\n)\n\n|\n\n\n\n\n\n/\n\n\nlrd\n\n(\nA\n)\n\n\n{\\displaystyle {\\mbox{LOF}}_{k}(A):={\\frac {\\sum _{B\\in N_{k}(A)}{\\frac {{\\mbox{lrd}}(B)}{{\\mbox{lrd}}(A)}}}{|N_{k}(A)|}}={\\frac {\\sum _{B\\in N_{k}(A)}{\\mbox{lrd}}(B)}{|N_{k}(A)|}}/{\\mbox{lrd}}(A)}\n\n\nwhich is the average local reachability density of the neighbors divided by the object's own local reachability density. A value of approximately \n\n\n\n1\n\n\n{\\displaystyle 1}\n\n indicates that the object is comparable to its neighbors (and thus not an outlier). A value below \n\n\n\n1\n\n\n{\\displaystyle 1}\n\n indicates a denser region (which would be an inlier), while values significantly larger than \n\n\n\n1\n\n\n{\\displaystyle 1}\n\n indicate outliers.\nDue to the local approach, LOF is able to identify outliers in a data set that would not be outliers in another area of the data set. For example, a point at a \"small\" distance to a very dense cluster is an outlier, while a point within a sparse cluster might exhibit similar distances to its neighbors.\nWhile the geometric intuition of LOF is only applicable to low-dimensional vector spaces, the algorithm can be applied in any context a dissimilarity function can be defined. It has experimentally been shown to work very well in numerous setups, often outperforming the competitors, for example in network intrusion detection[4] and on processed classification benchmark data.[5]\nThe LOF family of methods can be easily generalized and then applied to various other problems, such as detecting outliers in geographic data, video streams or authorship networks.[3]\nThe resulting values are quotient-values and hard to interpret. A value of 1 or even less indicates a clear inlier, but there is no clear rule for when a point is an outlier. In one data set, a value of 1.1 may already be an outlier, in another dataset and parameterization (with strong local fluctuations) a value of 2 could still be an inlier. These differences can also occur within a dataset due to the locality of the method. There exist extensions of LOF that try to improve over LOF in these aspects:", 
    "dbpedia_url": "http://dbpedia.org/resource/Local_outlier_factor", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Local_outlier_factor\n"
}