{
    "about": "In signal processing it is useful to simultaneously analyze the space and frequency characteristics of a signal. While the Fourier transform gives the frequency information of the signal, it is not localized. This means that we cannot determine which part of a (perhaps long) signal produced a particular frequency. It is possible to use a short time Fourier transform for this purpose, however the short time Fourier transform limits the basis functions to be sinusoidal. To provide a more flexible space-frequency signal decomposition several filters (including wavelets) have been proposed. The Log-Gabor[1] filter is one such filter that is an improvement upon the original Gabor filter.[2] The advantage of this filter over the many alternatives is that it better fits the statistics of natural images compared with Gabor filters and other wavelet filters.", 
    "name": "Log Gabor Filter", 
    "classification": "Signal Processing", 
    "full_text": "In signal processing it is useful to simultaneously analyze the space and frequency characteristics of a signal. While the Fourier transform gives the frequency information of the signal, it is not localized. This means that we cannot determine which part of a (perhaps long) signal produced a particular frequency. It is possible to use a short time Fourier transform for this purpose, however the short time Fourier transform limits the basis functions to be sinusoidal. To provide a more flexible space-frequency signal decomposition several filters (including wavelets) have been proposed. The Log-Gabor[1] filter is one such filter that is an improvement upon the original Gabor filter.[2] The advantage of this filter over the many alternatives is that it better fits the statistics of natural images compared with Gabor filters and other wavelet filters.\n\n\nThe Log-Gabor filter is able to describe a signal in terms of the local frequency responses. Because this is a fundamental signal analysis technique, it has many applications in signal processing. Indeed, any application that uses Gabor filters, or other wavelet basis functions may benefit from the Log-Gabor filter. However, there may not be any benefit depending on the particulars of the design problem. Nevertheless, the Log-Gabor filter has been shown to be particularly useful in image processing applications, because it has been shown to better capture the statistics of natural images.\nIn image processing, there are a few low-level examples of the use of Log-Gabor filters. Edge detection is one such primitive operation, where the edges of the image are labeled. Because edges appear in the frequency domain as high frequencies, it is natural to use a filter such as the Log-Gabor to pick out these edges.[3][4] These detected edges can be used as the input to a segmentation algorithm or a recognition algorithm. A related problem is corner detection. In corner detection the goal is to find points in the image that are corners. Corners are useful to find because they represent stable locations that can be used for image matching problems. The corner can be described in terms of localized frequency information by using a Log-Gabor filter.[5]\nIn pattern recognition, the input image must be transformed into a feature representation that is easier for a classification algorithm to separate classes. Features formed from the response of Log-Gabor filters may form a good set of features for some applications because it can locally represent frequency information. For example, the filter has been successfully used in face expression classification.[6] There is some evidence that the human visual system processes visual information in a similar way.[7]\nThere are a host of other applications that require localized frequency information. The Log-Gabor filter has been used in applications such as image enhancement,[8] speech analysis,[9] contour detection,[10] texture synthesis [11] and image denoising [12] among others.\nThere are several existing approaches for computing localized frequency information. These approaches are advantageous because unlike the Fourier transform, these filters can more easily represent discontinuities in the signal. For example, the Fourier transform can represent an edge, but only by using an infinite number of sine waves.\nWhen considering filters that extract local frequency information, there is a relationship between the frequency resolution and the time/space resolution. When more samples are taken the resolution of the frequency information is higher, however the time/space resolution will be lower. Likewise taking only a few samples means a higher spatial/temporal resolution, but this is at the cost of less frequency resolution. A good filter should be able to obtain the maximum frequency resolution given a set time/space resolution, and vice versa. The Gabor filter achieves this bound.[2] Because of this, the Gabor filter is a good method for simultaneously localizing spatial/temporal and frequency information. A Gabor filter in the space (or time) domain is formulated as a Gaussian envelope multiplied by a complex exponential. It was found that the cortical responses in the human visual system can be modeled by the Gabor filter.[7][13] The Gabor filter was modified by Morlet to form an orthonormal continuous wavelet transform.[14]\nAlthough the Gabor filter achieves a sense of optimality in terms of the space-frequency tradeoff, in certain applications it might not be an ideal filter. At certain bandwidths, the Gabor filter has a non-zero DC component. This means that the response of the filter depends on the mean value of the signal. If the output of the filter is to be used for an application such as pattern recognition, this DC component is undesirable because it gives a feature that changes with the average value. As we will soon see, the Log-Gabor filter does not exhibit this problem. Also the original Gabor filter has an infinite length impulse response. Finally, the original Gabor filter, while optimum in the sense of uncertainty, does not properly fit the statistics of natural images. As shown in,[1] it is better to choose a filter with a longer sloping tail in an image coding task.\nIn certain applications, other decompositions have advantages. Although there are many such decompositions possible, here we briefly present two popular methods: mexican hat wavelets and the steerable pyramid.\nThe Ricker wavelet, commonly called the mexican hat wavelet is another type of filter that is used to model data. In multiple dimensions this becomes the Laplacian of a Gaussian function. For reasons of computational complexity, the Laplacian of a Gaussian function is often simplified as a difference of Gaussians. This difference of Gaussian function has found use in several computer vision applications such as keypoint detection.[15] The disadvantage of the Mexican hat wavelet is that it exhibits some aliasing and does not represent oblique orientations well.\nThe steerable pyramid decomposition [16] was presented as an alternative to the Morlet (Gabor) and Ricket wavelets. This decomposition ignores the orthogonality constraint of the wavelet formulation, and by doing this is able to construct a set of filters which are both translation and rotation independent. The disadvantage of the steerable pyramid decomposition is that it is overcomplete. This means that more filters than truly necessary are used to describe the signal.\nField introduced the Log-Gabor filter and showed that it is able to better encode natural images compared with the original Gabor filter.[1] Additionally, the Log-Gabor filter does not have the same DC problem as the original Gabor filter. A one dimensional Log-Gabor function has the frequency response:\n\n\n\n\nG\n(\nf\n)\n=\nexp\n⁡\n\n(\n\n\n\n−\n\n\n(\nlog\n⁡\n(\nf\n\n/\n\n\nf\n\n0\n\n\n)\n)\n\n\n2\n\n\n\n\n2\n\n\n(\nlog\n⁡\n(\nσ\n\n/\n\n\nf\n\n0\n\n\n)\n)\n\n\n2\n\n\n\n\n\n)\n\n\n\n{\\displaystyle G(f)=\\exp \\left({\\frac {-\\left(\\log(f/f_{0})\\right)^{2}}{2\\left(\\log(\\sigma /f_{0})\\right)^{2}}}\\right)}\n\n\nwhere \n\n\n\n\nf\n\n0\n\n\n\n\n{\\displaystyle f_{0}}\n\n and \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n are the parameters of the filter. \n\n\n\n\nf\n\n0\n\n\n\n\n{\\displaystyle f_{0}}\n\n will give the center frequency of the filter. \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n affects the bandwidth of the filter. It is useful to maintain the same shape while the frequency parameter is varied. To do this, the ratio \n\n\n\nσ\n\n/\n\n\nf\n\n0\n\n\n\n\n{\\displaystyle \\sigma /f_{0}}\n\n should remain constant. The following figure shows the frequency response of the Gabor compared with the Log-Gabor:\nAnother definition of the Log-Gabor filter is to consider it as a probability distribution function, with a normal distribution, but considering the logarithm of frequencies. This makes sense in contexts where the Weber–Fechner law applies, such as in visual or auditive perception. Following the change of variable rule, a one dimensional Log-Gabor function has thus the modified frequency response:\n\n\n\n\nG\n(\nf\n)\n=\n\n\n\nf\n\n0\n\n\nf\n\n\nexp\n⁡\n\n(\n\n\n\n−\n\n\n(\nlog\n⁡\n(\nf\n\n/\n\n\nf\n\n0\n\n\n)\n)\n\n\n2\n\n\n\n\n2\n\n\n(\nlog\n⁡\n(\nσ\n\n/\n\n\nf\n\n0\n\n\n)\n)\n\n\n2\n\n\n\n\n\n)\n\n\n\n{\\displaystyle G(f)={\\frac {f_{0}}{f}}\\exp \\left({\\frac {-\\left(\\log(f/f_{0})\\right)^{2}}{2\\left(\\log(\\sigma /f_{0})\\right)^{2}}}\\right)}\n\n\nNote that this extends to the origin and that we still have $G(0)=0$.\nIn both definitions, because of the zero at the DC value, it is not possible to derive an analytic expression for the filter in the space domain. In practice the filter is first designed in the frequency domain, and then an inverse Fourier transform gives the time domain impulse response.\nLike the Gabor filter, the log-Gabor filter has seen great popularity in image processing. Because of this it is useful to consider the 2-dimensional extension of the log-Gabor filter. With this added dimension the filter is not only designed for a particular frequency, but also is designed for a particular orientation. The orientation component is a Gaussian distance function according to the angle in polar coordinates (see [1] or [2]):\n\n\n\n\nG\n(\nf\n,\nθ\n)\n=\nexp\n⁡\n\n(\n\n\n\n−\n(\nlog\n⁡\n(\nf\n\n/\n\n\nf\n\n0\n\n\n)\n\n)\n\n2\n\n\n\n\n2\n(\nlog\n⁡\n(\n\nσ\n\nf\n\n\n\n/\n\n\nf\n\n0\n\n\n)\n\n)\n\n2\n\n\n\n\n\n)\n\nexp\n⁡\n\n(\n\n\n\n−\n(\nθ\n−\n\nθ\n\n0\n\n\n\n)\n\n2\n\n\n\n\n2\n\nσ\n\nθ\n\n\n2\n\n\n\n\n\n)\n\n\n\n{\\displaystyle G(f,\\theta )=\\exp \\left({\\frac {-(\\log(f/f_{0}))^{2}}{2(\\log(\\sigma _{f}/f_{0}))^{2}}}\\right)\\exp \\left({\\frac {-(\\theta -\\theta _{0})^{2}}{2\\sigma _{\\theta }^{2}}}\\right)}\n\n\nwhere here there are now four parameters: \n\n\n\n\nf\n\n0\n\n\n\n\n{\\displaystyle f_{0}}\n\n the center frequency, \n\n\n\n\nσ\n\nf\n\n\n\n\n{\\displaystyle \\sigma _{f}}\n\n the width parameter for the frequency, \n\n\n\n\nθ\n\n0\n\n\n\n\n{\\displaystyle \\theta _{0}}\n\n the center orientation, and \n\n\n\n\nσ\n\nθ\n\n\n\n\n{\\displaystyle \\sigma _{\\theta }}\n\n the width parameter of the orientation. An example of this filter is shown below.\nThe bandwidth in the frequency is given by:\n\n\n\n\nB\n=\n2\n\n\n2\n\n/\n\nlog\n⁡\n(\n2\n)\n\n\n\n(\n∥\nlog\n⁡\n(\n\nσ\n\nf\n\n\n\n/\n\n\nf\n\n0\n\n\n)\n∥\n)\n\n\n\n{\\displaystyle B=2{\\sqrt {2/\\log(2)}}\\left(\\|\\log(\\sigma _{f}/f_{0})\\|\\right)}\n\n\nThe angular bandwidth is given by:\n\n\n\n\n\nB\n\nθ\n\n\n=\n2\n\nσ\n\nθ\n\n\n\n\n2\nlog\n⁡\n2\n\n\n\n\n{\\displaystyle B_{\\theta }=2\\sigma _{\\theta }{\\sqrt {2\\log 2}}}\n\n\nIn many practical applications, a set of filters are designed to form a filter bank. Because the filters do not form a set of orthogonal basis, the design of the filter bank is somewhat of an art and may depend upon the particular task at hand. The necessary parameters that must be chosen are: the minimum and maximum frequencies, the filter bandwidth, the number of orientations, the angular bandwidth, the filter scaling and the number of scales.", 
    "dbpedia_url": "http://dbpedia.org/resource/Log_Gabor_filter", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Log_Gabor_filter\n"
}