{
    "about": "A logarithmic number system (LNS) is an arithmetic system used for representing real numbers in computer and digital hardware, especially for digital signal processing.", 
    "name": "Logarithmic Number System", 
    "classification": "Digital Signal Processing", 
    "full_text": "A logarithmic number system (LNS) is an arithmetic system used for representing real numbers in computer and digital hardware, especially for digital signal processing.\n\n\nIn LNS, a number, \n\n\n\nX\n\n\n{\\displaystyle X}\n\n, is represented by the logarithm, \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, of its absolute value as follows:\nwhere \n\n\n\ns\n\n\n{\\displaystyle s}\n\n is a bit denoting the sign of \n\n\n\nX\n\n\n{\\displaystyle X}\n\n (\n\n\n\ns\n=\n0\n\n\n{\\displaystyle s=0}\n\n if \n\n\n\nX\n>\n0\n\n\n{\\displaystyle X>0}\n\n and \n\n\n\ns\n=\n1\n\n\n{\\displaystyle s=1}\n\n if \n\n\n\nX\n<\n0\n\n\n{\\displaystyle X<0}\n\n).\nThe number \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is represented by a binary word which usually is in the two's complement format. LNS can be considered as a floating-point number with the significand being always equal to 1. This formulation simplifies the operations of multiplication, division, powers and roots, since they are reduced down to addition, subtraction, multiplication and division, respectively.\nOn the other hand, the operations of addition and subtraction are more complicated and they are calculated by the formula:\nwhere the \"sum\" function is defined by \n\n\n\n\ns\n\nb\n\n\n(\nz\n)\n=\n\nlog\n\nb\n\n\n⁡\n(\n1\n+\n\nb\n\nz\n\n\n)\n\n\n{\\displaystyle s_{b}(z)=\\log _{b}(1+b^{z})}\n\n, and the \"difference\" function by \n\n\n\n\nd\n\nb\n\n\n(\nz\n)\n=\n\nlog\n\nb\n\n\n⁡\n(\n\n|\n\n1\n−\n\nb\n\nz\n\n\n\n|\n\n)\n\n\n{\\displaystyle d_{b}(z)=\\log _{b}(|1-b^{z}|)}\n\n. These functions \n\n\n\n\ns\n\nb\n\n\n(\nz\n)\n\n\n{\\displaystyle s_{b}(z)}\n\n and \n\n\n\n\nd\n\nb\n\n\n(\nz\n)\n\n\n{\\displaystyle d_{b}(z)}\n\n, depicted in the figures to the right, are also known as Gaussian logarithms. For natural logarithms we have the following identity with hyperbolic functions:\nThat shows, that \n\n\n\n\ns\n\ne\n\n\n\n\n{\\displaystyle s_{e}}\n\n has a Taylor expansion where all but the first term are rational and all odd terms except the linear one are zero.\nThe simplification of multiplication, division, roots, and powers is counterbalanced by the cost of evaluating these functions for addition and subtraction. This added cost of evaluation may not be critical when using LNS primarily for increasing the precision of floating-point math operations.\nLogarithmic number systems have been independently invented and published at least three times, as an alternative to fixed-point and floating-point number systems.[1]\nKingsbury and Rayner introduced \"logarithmic arithmetic\" for digital signal processing in 1971.[2]\nA similar LNS was described in 1975 by Swartzlander and Alexopoulos; rather than use two's complement notation for the logarithms, they offset them (scale the numbers being represented) to avoid negative logs.[3]\nLee and Edgar described a similar system, which they called the \"focus\" number system, in 1977.[4]\nThe mathematical foundations for addition and subtraction in an LNS trace back to Carl Friedrich Gauss and Z. Leonelli.[5][6]\nLNS has been used in the Gravity Pipe (GRAPE) special-purpose supercomputer[7] that won the Gordon Bell Prize in 1999.\nA substantial effort to explore the applicability of LNS as a viable alternative to floating point for general-purpose processing of single-precision real numbers is described in the context of the European Logarithmic Microprocessor (ELM).[8] A fabricated prototype of the processor, which has a 32-bit cotransformation-based LNS arithmetic logic unit (ALU), demonstrated LNS as a \"more accurate alternative to floating-point,\" with improved speed. Further improvement of the LNS design based on the ELM architecture has again shown its capability to offer significantly better in speed and more accurate than the floating-point.[9]\nLNS is sometimes used in FPGA-based applications where most arithmetic operations are multiplication or division.[10]", 
    "dbpedia_url": "http://dbpedia.org/resource/Logarithmic_number_system", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Logarithmic_number_system\n"
}