{
    "about": "In statistics, Markov chain Monte Carlo (MCMC) methods are a class of algorithms for sampling from a probability distribution based on constructing a Markov chain that has the desired distribution of its equilibrium distribution. The state of the chain after a number of steps is then used as a sample of the desired distribution. The quality of the sample improves as a function of the number of steps.", 
    "name": "Markov Chain Monte Carlo", 
    "classification": "Computational Statistics", 
    "full_text": "In statistics, Markov chain Monte Carlo (MCMC) methods are a class of algorithms for sampling from a probability distribution based on constructing a Markov chain that has the desired distribution of its equilibrium distribution. The state of the chain after a number of steps is then used as a sample of the desired distribution. The quality of the sample improves as a function of the number of steps.\nRandom walk Monte Carlo methods make up a large subclass of MCMC methods.\n\n\nWhen an MCMC method is used for approximating a multi-dimensional integral, an ensemble of \"walkers\" move around randomly. At each point where a walker steps, the integrand value at that point is counted towards the integral. The walker then may make a number of tentative steps around the area, looking for a place with a reasonably high contribution to the integral to move into next.\nRandom walk Monte Carlo methods are a kind of random simulation or Monte Carlo method. However, whereas the random samples of the integrand used in a conventional Monte Carlo integration are statistically independent, those used in MCMC methods are correlated. A Markov chain is constructed in such a way as to have the integrand as its equilibrium distribution.\nExamples of random walk Monte Carlo methods include the following:\nUnlike most of the current MCMC methods that ignore the previous trials, using a new algorithm the MCMC algorithm is able to use the previous steps and generate the next candidate. This training-based algorithm is able to speed-up the MCMC algorithm by an order of magnitude.[10]\nInteracting MCMC methodologies are a class of mean field particle methods for obtaining random samples from a sequence of probability distributions with an increasing level of sampling complexity.[11] These probabilistic models include path space state models with increasing time horizon, posterior distributions w.r.t. sequence of partial observations, increasing constraint level sets for conditional distributions, decreasing temperature schedules associated with some Boltzmann-Gibbs distributions, and many others. In principle, any MCMC sampler can be turned into an interacting MCMC sampler. These interacting MCMC samplers can be interpreted as a way to run in parallel a sequence of MCMC samplers. For instance, interacting simulated annealing algorithms are based on independent Metropolis-Hastings moves interacting sequentially with a selection-resampling type mechanism. In contrast to traditional MCMC methods, the precision parameter of this class of interacting MCMC samplers is only related to the number of interacting MCMC samplers. These advanced particle methodologies belong to the class of Feynman-Kac particle models,[12][13] also called Sequential Monte Carlo or particle filter methods in Bayesian inference and signal processing communities.[14] Interacting MCMC methods can also be interpreted as a mutation-selection genetic particle algorithm with MCMC mutations.\nMarkov Chain quasi-Monte Carlo (MCQMC)[15][16] The advantage of low-discrepancy sequences in lieu of random numbers for simple independent Monte Carlo sampling is well known.[17] This procedure, known as Quasi-Monte Carlo method (QMC),[18] yields an integration error that decays at a superior rate to that obtained by IID sampling, by the Koksma-Hlawka inequality. Empirically it allows the reduction of both estimation error and convergence time by an order of magnitude.[citation needed]\nMore sophisticated methods use various ways of reducing the correlation between successive samples. These algorithms may be harder to implement, but they usually exhibit faster convergence (i.e. fewer steps for an accurate result).\nExamples of non-random walk MCMC methods include the following:\nUsually it is not hard to construct a Markov chain with the desired properties. The more difficult problem is to determine how many steps are needed to converge to the stationary distribution within an acceptable error.[21] A good chain will have rapid mixing: the stationary distribution is reached quickly starting from an arbitrary position. A standard empirical method to assess convergence is to run several independent simulated Markov chains and check that the ratio of inter-chain to intra-chain variances for all the parameters sampled is close to 1.[21][22]\nTypically, MCMC sampling can only approximate the target distribution, as there is always some residual effect of the starting position. More sophisticated MCMC-based algorithms such as coupling from the past can produce exact samples, at the cost of additional computation and an unbounded (though finite in expectation) running time.\nMany random walk Monte Carlo methods move around the equilibrium distribution in relatively small steps, with no tendency for the steps to proceed in the same direction. These methods are easy to implement and analyze, but unfortunately it can take a long time for the walker to explore all of the space. The walker will often double back and cover ground already covered.\nSeveral software programs provide MCMC sampling capabilities, for example:", 
    "dbpedia_url": "http://dbpedia.org/resource/Markov_chain_Monte_Carlo", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Markov_chain_Monte_Carlo\n"
}