{
    "about": "In signal processing, a matched filter is obtained by correlating a known signal, or template, with an unknown signal to detect the presence of the template in the unknown signal.[1][2] This is equivalent to convolving the unknown signal with a conjugated time-reversed version of the template. The matched filter is the optimal linear filter for maximizing the signal to noise ratio (SNR) in the presence of additive stochastic noise. Matched filters are commonly used in radar, in which a known signal is sent out, and the reflected signal is examined for common elements of the out-going signal. Pulse compression is an example of matched filtering. It is so called because impulse response is matched to input pulse signals. Two-dimensional matched filters are commonly used in image processing, e.g., to improve SNR for X-ray. Matched filtering is a demodulation technique with LTI (linear time invariant) filters to maximize SNR.[3] It was originally also known as a North filter.[4]", 
    "name": "Matched Filter", 
    "classification": "Signal Processing", 
    "full_text": "In signal processing, a matched filter is obtained by correlating a known signal, or template, with an unknown signal to detect the presence of the template in the unknown signal.[1][2] This is equivalent to convolving the unknown signal with a conjugated time-reversed version of the template. The matched filter is the optimal linear filter for maximizing the signal to noise ratio (SNR) in the presence of additive stochastic noise. Matched filters are commonly used in radar, in which a known signal is sent out, and the reflected signal is examined for common elements of the out-going signal. Pulse compression is an example of matched filtering. It is so called because impulse response is matched to input pulse signals. Two-dimensional matched filters are commonly used in image processing, e.g., to improve SNR for X-ray. Matched filtering is a demodulation technique with LTI (linear time invariant) filters to maximize SNR.[3] It was originally also known as a North filter.[4]\n\n\nThe following section derives the matched filter for a discrete-time system. The derivation for a continuous-time system is similar, with summations replaced with integrals.\nThe matched filter is the linear filter, \n\n\n\nh\n\n\n{\\displaystyle h}\n\n, that maximizes the output signal-to-noise ratio.\nThough we most often express filters as the impulse response of convolution systems, as above (see LTI system theory), it is easiest to think of the matched filter in the context of the inner product, which we will see shortly.\nWe can derive the linear filter that maximizes output signal-to-noise ratio by invoking a geometric argument. The intuition behind the matched filter relies on correlating the received signal (a vector) with a filter (another vector) that is parallel with the signal, maximizing the inner product. This enhances the signal. When we consider the additive stochastic noise, we have the additional challenge of minimizing the output due to noise by choosing a filter that is orthogonal to the noise.\nLet us formally define the problem. We seek a filter, \n\n\n\nh\n\n\n{\\displaystyle h}\n\n, such that we maximize the output signal-to-noise ratio, where the output is the inner product of the filter and the observed signal \n\n\n\nx\n\n\n{\\displaystyle x}\n\n.\nOur observed signal consists of the desirable signal \n\n\n\ns\n\n\n{\\displaystyle s}\n\n and additive noise \n\n\n\nv\n\n\n{\\displaystyle v}\n\n:\nLet us define the covariance matrix of the noise, reminding ourselves that this matrix has Hermitian symmetry, a property that will become useful in the derivation:\nwhere \n\n\n\n\nv\n\n\nH\n\n\n\n\n\n{\\displaystyle v^{\\mathrm {H} }}\n\n denotes the conjugate transpose of \n\n\n\nv\n\n\n{\\displaystyle v}\n\n, and \n\n\n\nE\n\n\n{\\displaystyle E}\n\n denotes expectation. Let us call our output, \n\n\n\ny\n\n\n{\\displaystyle y}\n\n, the inner product of our filter and the observed signal such that\nWe now define the signal-to-noise ratio, which is our objective function, to be the ratio of the power of the output due to the desired signal to the power of the output due to the noise:\nWe rewrite the above:\nWe wish to maximize this quantity by choosing \n\n\n\nh\n\n\n{\\displaystyle h}\n\n. Expanding the denominator of our objective function, we have\nNow, our \n\n\n\n\nS\nN\nR\n\n\n\n{\\displaystyle \\mathrm {SNR} }\n\n becomes\nWe will rewrite this expression with some matrix manipulation. The reason for this seemingly counterproductive measure will become evident shortly. Exploiting the Hermitian symmetry of the covariance matrix \n\n\n\n\nR\n\nv\n\n\n\n\n{\\displaystyle R_{v}}\n\n, we can write\nWe would like to find an upper bound on this expression. To do so, we first recognize a form of the Cauchy-Schwarz inequality:\nwhich is to say that the square of the inner product of two vectors can only be as large as the product of the individual inner products of the vectors. This concept returns to the intuition behind the matched filter: this upper bound is achieved when the two vectors \n\n\n\na\n\n\n{\\displaystyle a}\n\n and \n\n\n\nb\n\n\n{\\displaystyle b}\n\n are parallel. We resume our derivation by expressing the upper bound on our \n\n\n\n\nS\nN\nR\n\n\n\n{\\displaystyle \\mathrm {SNR} }\n\n in light of the geometric inequality above:\nOur valiant matrix manipulation has now paid off. We see that the expression for our upper bound can be greatly simplified:\nWe can achieve this upper bound if we choose,\nwhere \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n is an arbitrary real number. To verify this, we plug into our expression for the output \n\n\n\n\nS\nN\nR\n\n\n\n{\\displaystyle \\mathrm {SNR} }\n\n:\nThus, our optimal matched filter is\nWe often choose to normalize the expected value of the power of the filter output due to the noise to unity. That is, we constrain\nThis constraint implies a value of \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n, for which we can solve:\nyielding\ngiving us our normalized filter,\nIf we care to write the impulse response of the filter for the convolution system, it is simply the complex conjugate time reversal of \n\n\n\nh\n\n\n{\\displaystyle h}\n\n.\nThough we have derived the matched filter in discrete time, we can extend the concept to continuous-time systems if we replace \n\n\n\n\nR\n\nv\n\n\n\n\n{\\displaystyle R_{v}}\n\n with the continuous-time autocorrelation function of the noise, assuming a continuous signal \n\n\n\ns\n(\nt\n)\n\n\n{\\displaystyle s(t)}\n\n, continuous noise \n\n\n\nv\n(\nt\n)\n\n\n{\\displaystyle v(t)}\n\n, and a continuous filter \n\n\n\nh\n(\nt\n)\n\n\n{\\displaystyle h(t)}\n\n.\nAlternatively, we may solve for the matched filter by solving our maximization problem with a Lagrangian. Again, the matched filter endeavors to maximize the output signal-to-noise ratio (\n\n\n\n\nS\nN\nR\n\n\n\n{\\displaystyle \\mathrm {SNR} }\n\n) of a filtered deterministic signal in stochastic additive noise. The observed sequence, again, is\nwith the noise covariance matrix,\nThe signal-to-noise ratio is\nEvaluating the expression in the numerator, we have\nand in the denominator,\nThe signal-to-noise ratio becomes\nIf we now constrain the denominator to be 1, the problem of maximizing \n\n\n\n\nS\nN\nR\n\n\n\n{\\displaystyle \\mathrm {SNR} }\n\n is reduced to maximizing the numerator. We can then formulate the problem using a Lagrange multiplier:\nwhich we recognize as a generalized eigenvalue problem\nSince \n\n\n\ns\n\ns\n\n\nH\n\n\n\n\n\n{\\displaystyle ss^{\\mathrm {H} }}\n\n is of unit rank, it has only one nonzero eigenvalue. It can be shown that this eigenvalue equals\nyielding the following optimal matched filter\nThis is the same result found in the previous subsection.\nMatched filtering can also be interpreted as a least squares estimator for the optimal location and scaling of a given model or template. Once again, let the observed sequence be defined as\nwhere \n\n\n\n\nv\n\nk\n\n\n\n\n{\\displaystyle v_{k}}\n\n is uncorrelated zero mean noise. The signal \n\n\n\n\ns\n\nk\n\n\n\n\n{\\displaystyle s_{k}}\n\n is assumed to be a scaled and shifted version of a known model sequence \n\n\n\n\nf\n\nk\n\n\n\n\n{\\displaystyle f_{k}}\n\n:\nWe want to find optimal estimates \n\n\n\n\nj\n\n∗\n\n\n\n\n{\\displaystyle j^{*}}\n\n and \n\n\n\n\nμ\n\n∗\n\n\n\n\n{\\displaystyle \\mu ^{*}}\n\n for the unknown shift \n\n\n\n\nj\n\n0\n\n\n\n\n{\\displaystyle j_{0}}\n\n and scaling \n\n\n\n\nμ\n\n0\n\n\n\n\n{\\displaystyle \\mu _{0}}\n\n by minimizing the least squares residual between the observed sequence \n\n\n\n\nx\n\nk\n\n\n\n\n{\\displaystyle x_{k}}\n\n and a \"probing sequence\" \n\n\n\n\nh\n\nj\n−\nk\n\n\n\n\n{\\displaystyle h_{j-k}}\n\n:\nThe appropriate \n\n\n\n\nh\n\nj\n−\nk\n\n\n\n\n{\\displaystyle h_{j-k}}\n\n will later turn out to be the matched filter, but is as yet unspecified. Expanding \n\n\n\n\nx\n\nk\n\n\n\n\n{\\displaystyle x_{k}}\n\n and the square within the sum yields\nThe first term in brackets is a constant (since the observed signal is given) and has no influence on the optimal solution. The last term has constant expected value because the noise is uncorrelated and has zero mean. We can therefore drop both terms from the optimization. After reversing the sign, we obtain the equivalent optimization problem\nSetting the derivative w.r.t. \n\n\n\nμ\n\n\n{\\displaystyle \\mu }\n\n to zero gives an analytic solution for \n\n\n\n\nμ\n\n∗\n\n\n\n\n{\\displaystyle \\mu ^{*}}\n\n:\nInserting this into our objective function yields a reduced maximization problem for just \n\n\n\n\nj\n\n∗\n\n\n\n\n{\\displaystyle j^{*}}\n\n:\nThe numerator can be upper-bounded by means of the Cauchy-Schwarz inequality:\nThe optimization problem assumes its maximum when equality holds in this expression. According to the properties of the Cauchy-Schwarz inequality, this is only possible when\nfor arbitrary non-zero constants \n\n\n\nν\n\n\n{\\displaystyle \\nu }\n\n or \n\n\n\nκ\n\n\n{\\displaystyle \\kappa }\n\n, and the optimal solution is obtained at \n\n\n\n\nj\n\n∗\n\n\n=\n\nj\n\n0\n\n\n\n\n{\\displaystyle j^{*}=j_{0}}\n\n as desired. Thus, our \"probing sequence\" \n\n\n\n\nh\n\nj\n−\nk\n\n\n\n\n{\\displaystyle h_{j-k}}\n\n must be proportional to the signal model \n\n\n\n\nf\n\nk\n−\n\nj\n\n0\n\n\n\n\n\n\n{\\displaystyle f_{k-j_{0}}}\n\n, and the convenient choice \n\n\n\nκ\n=\n1\n\n\n{\\displaystyle \\kappa =1}\n\n yields the matched filter\nNote that the filter is the mirrored signal model. This ensures that the operation \n\n\n\n\n∑\n\nk\n\n\n\nx\n\nk\n\n\n\nh\n\nj\n−\nk\n\n\n\n\n{\\displaystyle \\sum _{k}x_{k}h_{j-k}}\n\n to be applied in order to find the optimum is indeed the convolution between the observed sequence \n\n\n\n\nx\n\nk\n\n\n\n\n{\\displaystyle x_{k}}\n\n and the matched filter \n\n\n\n\nh\n\nk\n\n\n\n\n{\\displaystyle h_{k}}\n\n. The filtered sequence assumes its maximum at the position where the observed sequence \n\n\n\n\nx\n\nk\n\n\n\n\n{\\displaystyle x_{k}}\n\n best matches (in a least-squares sense) the signal model \n\n\n\n\nf\n\nk\n\n\n\n\n{\\displaystyle f_{k}}\n\n.\nThe matched filter may be derived in a variety of ways,[2] but as a special case of a least squares procedure it may also be interpreted as a maximum likelihood method in the context of a (coloured) Gaussian noise model and the associated Whittle likelihood.[5] If the transmitted signal possessed no unknown parameters (like time-of-arrival, amplitude,...), then the matched filter would, according to the Neyman-Pearson lemma, minimize the error probability. However, since the exact signal generally is determined by unknown parameters that effectively are estimated (or fitted) in the filtering process, the matched filter constitutes a generalized maximum likelihood (test-) statistic.[6] The filtered time series may then be interpreted as (proportional to) the profile likelihood, the maximized conditional likelihood as a function of the time parameter.[7] This implies in particular that the error probability (in the sense of Neyman and Pearson, i.e., concerning maximization of the detection probability for a given false-alarm probability[8]) is not necessarily optimal. What is commonly referred to as the Signal-to-noise ratio (SNR), which is supposed to be maximized by a matched filter, in this context corresponds to \n\n\n\n\n\n2\nlog\n⁡\n(\n\n\nL\n\n\n)\n\n\n\n\n{\\displaystyle {\\sqrt {2\\log({\\mathcal {L}})}}}\n\n, where \n\n\n\n\n\nL\n\n\n\n\n{\\displaystyle {\\mathcal {L}}}\n\n is the (conditionally) maximized likelihood ratio.[7] [nb 1]\nThe construction of the matched filter is based on a known noise spectrum. In reality, however, the noise spectrum is usually estimated from data and hence only known up to a limited precision. For the case of an uncertain spectrum, the matched filter may be generalized to a more robust iterative procedure with favourable properties also in non-Gaussian noise.[7]\nWhen viewed in the frequency domain, it is evident that the matched filter applies the greatest weighting to spectral components exhibiting the greatest signal-to-noise ratio (i.e., large weight where noise is relatively low, and vice versa). In general this requires a non-flat frequency response, but the associated \"distortion\" is no cause for concern in situations such as radar and digital communications, where the original waveform is known and the objective is the detection of this signal against the background noise. On the technical side, the matched filter is a weighted least squares method based on the (heteroscedastic) frequency-domain data (where the \"weights\" are determined via the noise spectrum, see also previous section), or equivalently, a least squares method applied to the whitened data.\nMatched filters are often used in signal detection.[1] As an example, suppose that we wish to judge the distance of an object by reflecting a signal off it. We may choose to transmit a pure-tone sinusoid at 1 Hz. We assume that our received signal is an attenuated and phase-shifted form of the transmitted signal with added noise.\nTo judge the distance of the object, we correlate the received signal with a matched filter, which, in the case of white (uncorrelated) noise, is another pure-tone 1-Hz sinusoid. When the output of the matched filter system exceeds a certain threshold, we conclude with high probability that the received signal has been reflected off the object. Using the speed of propagation and the time that we first observe the reflected signal, we can estimate the distance of the object. If we change the shape of the pulse in a specially-designed way, the signal-to-noise ratio and the distance resolution can be even improved after matched filtering: this is a technique known as pulse compression.\nAdditionally, matched filters can be used in parameter estimation problems (see estimation theory). To return to our previous example, we may desire to estimate the speed of the object, in addition to its position. To exploit the Doppler effect, we would like to estimate the frequency of the received signal. To do so, we may correlate the received signal with several matched filters of sinusoids at varying frequencies. The matched filter with the highest output will reveal, with high probability, the frequency of the reflected signal and help us determine the speed of the object. This method is, in fact, a simple version of the discrete Fourier transform (DFT). The DFT takes an \n\n\n\nN\n\n\n{\\displaystyle N}\n\n-valued complex input and correlates it with \n\n\n\nN\n\n\n{\\displaystyle N}\n\n matched filters, corresponding to complex exponentials at \n\n\n\nN\n\n\n{\\displaystyle N}\n\n different frequencies, to yield \n\n\n\nN\n\n\n{\\displaystyle N}\n\n complex-valued numbers corresponding to the relative amplitudes and phases of the sinusoidal components (see Moving target indication).\nThe matched filter is also used in communications. In the context of a communication system that sends binary messages from the transmitter to the receiver across a noisy channel, a matched filter can be used to detect the transmitted pulses in the noisy received signal.\n\nImagine we want to send the sequence \"0101100100\" coded in non polar Non-return-to-zero (NRZ) through a certain channel.\nMathematically, a sequence in NRZ code can be described as a sequence of unit pulses or shifted rect functions, each pulse being weighted by +1 if the bit is \"1\" and by -1 if the bit is \"0\". Formally, the scaling factor for the \n\n\n\n\nk\n\n\nt\nh\n\n\n\n\n\n{\\displaystyle k^{\\mathrm {th} }}\n\n bit is,\nWe can represent our message, \n\n\n\nM\n(\nt\n)\n\n\n{\\displaystyle M(t)}\n\n, as the sum of shifted unit pulses:\nwhere \n\n\n\nT\n\n\n{\\displaystyle T}\n\n is the time length of one bit.\nThus, the signal to be sent by the transmitter is\n\nIf we model our noisy channel as an AWGN channel, white Gaussian noise is added to the signal. At the receiver end, for a Signal-to-noise ratio of 3 dB, this may look like:\n\nA first glance will not reveal the original transmitted sequence. There is a high power of noise relative to the power of the desired signal (i.e., there is a low signal-to-noise ratio). If the receiver were to sample this signal at the correct moments, the resulting binary message would possibly belie the original transmitted one.\nTo increase our signal-to-noise ratio, we pass the received signal through a matched filter. In this case, the filter should be matched to an NRZ pulse (equivalent to a \"1\" coded in NRZ code). Precisely, the impulse response of the ideal matched filter, assuming white (uncorrelated) noise should be a time-reversed complex-conjugated scaled version of the signal that we are seeking. We choose\nIn this case, due to symmetry, the time-reversed complex conjugate of \n\n\n\nh\n(\nt\n)\n\n\n{\\displaystyle h(t)}\n\n is in fact \n\n\n\nh\n(\nt\n)\n\n\n{\\displaystyle h(t)}\n\n, allowing us to call \n\n\n\nh\n(\nt\n)\n\n\n{\\displaystyle h(t)}\n\n the impulse response of our matched filter convolution system.\nAfter convolving with the correct matched filter, the resulting signal, \n\n\n\n\nM\n\n\nf\ni\nl\nt\ne\nr\ne\nd\n\n\n\n(\nt\n)\n\n\n{\\displaystyle M_{\\mathrm {filtered} }(t)}\n\n is,\nwhere \n\n\n\n∗\n\n\n{\\displaystyle *}\n\n denotes convolution.\n\nWhich can now be safely sampled by the receiver at the correct sampling instants, and compared to an appropriate threshold, resulting in a correct interpretation of the binary message.\n\nMatched filters play a central role in gravitational-wave astronomy.[9] The first observation of gravitational waves was based on large-scale filtering of each detector's output for signals resembling the expected shape, followed by subsequent screening for coincident and coherent triggers between both instruments. False-alarm rates, and with that, the statistical significance of the detection were then assessed using resampling methods.[10] Inference on the astrophysical source parameters was completed using Bayesian methods based on parameterized theoretical models for the signal waveform and (again) on the Whittle likelihood.[11]", 
    "dbpedia_url": "http://dbpedia.org/resource/Matched_filter", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Matched_filter\n"
}