{
    "about": "Matching pursuit (MP) is a sparse approximation algorithm which involves finding the \"best matching\" projections of multidimensional data onto the span of an over-complete (i.e., redundant) dictionary \n\n\n\nD\n\n\n{\\displaystyle D}\n\n. The basic idea is to approximately represent a signal \n\n\n\nf\n\n\n{\\displaystyle f}\n\n from Hilbert space \n\n\n\nH\n\n\n{\\displaystyle H}\n\n as a weighted sum of finitely many functions \n\n\n\n\ng\n\n\nγ\n\nn\n\n\n\n\n\n\n{\\displaystyle g_{\\gamma _{n}}}\n\n (called atoms) taken from \n\n\n\nD\n\n\n{\\displaystyle D}\n\n. An approximation with \n\n\n\nN\n\n\n{\\displaystyle N}\n\n atoms has the form", 
    "name": "Matching Pursuit", 
    "classification": "Signal Processing", 
    "full_text": "Matching pursuit (MP) is a sparse approximation algorithm which involves finding the \"best matching\" projections of multidimensional data onto the span of an over-complete (i.e., redundant) dictionary \n\n\n\nD\n\n\n{\\displaystyle D}\n\n. The basic idea is to approximately represent a signal \n\n\n\nf\n\n\n{\\displaystyle f}\n\n from Hilbert space \n\n\n\nH\n\n\n{\\displaystyle H}\n\n as a weighted sum of finitely many functions \n\n\n\n\ng\n\n\nγ\n\nn\n\n\n\n\n\n\n{\\displaystyle g_{\\gamma _{n}}}\n\n (called atoms) taken from \n\n\n\nD\n\n\n{\\displaystyle D}\n\n. An approximation with \n\n\n\nN\n\n\n{\\displaystyle N}\n\n atoms has the form\nwhere \n\n\n\n\na\n\nn\n\n\n\n\n{\\displaystyle a_{n}}\n\n is the scalar weighting factor (amplitude) for the atom \n\n\n\n\ng\n\n\nγ\n\nn\n\n\n\n\n∈\nD\n\n\n{\\displaystyle g_{\\gamma _{n}}\\in D}\n\n. Normally, not every atom in \n\n\n\nD\n\n\n{\\displaystyle D}\n\n will be used in this sum. Instead, matching pursuit chooses the atoms one at a time in order to maximally (greedily) reduce the approximation error. This is achieved by finding the atom that has the biggest inner product with the signal (assuming the atoms are normalized), subtracting from the signal an approximation that uses only that one atom, and repeating the process until the signal is satisfactorily decomposed, i.e., the norm of the residual is small, where the residual after calculating \n\n\n\n\nγ\n\nN\n\n\n\n\n{\\displaystyle \\gamma _{N}}\n\n and \n\n\n\n\na\n\nN\n\n\n\n\n{\\displaystyle a_{N}}\n\n is denoted by\nIf \n\n\n\n\nR\n\nn\n\n\n\n\n{\\displaystyle R_{n}}\n\n converges quickly to zero, then only a few atoms are needed to get a good approximation to \n\n\n\nf\n\n\n{\\displaystyle f}\n\n. Such sparse representations are desirable for signal coding and compression. More precisely, the sparsity problem that matching pursuit is intended to approximately solve is\nwith \n\n\n\n∥\nx\n\n∥\n\n0\n\n\n\n\n{\\displaystyle \\|x\\|_{0}}\n\n the \n\n\n\n\nL\n\n0\n\n\n\n\n{\\displaystyle L_{0}}\n\n pseudo-norm (i.e. the number of nonzero elements of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n). In the previous notation, the nonzero entries of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n are \n\n\n\n\nx\n\n\nγ\n\nn\n\n\n\n\n=\n\na\n\nn\n\n\n\n\n{\\displaystyle x_{\\gamma _{n}}=a_{n}}\n\n, and the \n\n\n\n\nγ\n\nn\n\n\n\n\n{\\displaystyle \\gamma _{n}}\n\nth column of the matrix \n\n\n\nD\n\n\n{\\displaystyle D}\n\n is \n\n\n\n\ng\n\n\nγ\n\nn\n\n\n\n\n\n\n{\\displaystyle g_{\\gamma _{n}}}\n\n. Solving the sparsity problem exactly is NP-hard, which is why approximation methods like MP are used.\nFor comparison, consider the Fourier series representation of a signal - this can be described in the terms given above, where the dictionary is built from sinusoidal basis functions (the smallest possible complete dictionary). The main disadvantage of Fourier analysis in signal processing is that it extracts only global features of signals and does not adapt to analysed signals \n\n\n\nf\n\n\n{\\displaystyle f}\n\n. By taking an extremely redundant dictionary we can look in it for functions that best match a signal \n\n\n\nf\n\n\n{\\displaystyle f}\n\n.\n\n\nIf \n\n\n\nD\n\n\n{\\displaystyle D}\n\n contains a large number of vectors, searching for the most sparse representation of \n\n\n\nf\n\n\n{\\displaystyle f}\n\n is computationally unacceptable for practical applications. In 1993 Mallat and Zhang[1] proposed a greedy solution that they named \"Matching Pursuit.\" The algorithm iteratively generates for any signal \n\n\n\nf\n\n\n{\\displaystyle f}\n\n and any dictionary \n\n\n\nD\n\n\n{\\displaystyle D}\n\n a sorted list of atom indices and weighting scalars which represent the sub-optimal solution to the problem of sparse signal representation.\nThe concept of matching pursuit in signal processing is related to statistical projection pursuit, in which \"interesting\" projections were found; ones that deviate more from a normal distribution are considered to be more interesting.\nMatching pursuit has been applied to signal, image and video coding,[2][3] shape representation and recognition,[4] 3D objects coding,[5] and in interdisciplinary applications like structural health monitoring.[6] It has been shown that it performs better than DCT based coding for low bit rates in both efficiency of coding and quality of image.[7] The main problem with matching pursuit is the computational complexity of the encoder. In the basic version of an algorithm, the large dictionary has to be searched at each iteration. Improvements include the use of approximate dictionary representations and suboptimal ways of choosing the best match at each iteration (atom extraction).[8] The matching pursuit algorithm is used in MP/SOFT, a method of simulating quantum dynamics.[9]\nMP is also used in dictionary learning.[10] In this algorithm, atoms are learned from a database and not chosen among generic dictionaries.\nA popular extension of Matching Pursuit (MP) is its orthogonal version: Orthogonal Matching Pursuit[11][12] (OMP). The main difference from MP is that after every step, all the coefficients extracted so far are updated, by computing the orthogonal projection of the signal onto the set of atoms selected so far. This can lead to better results than standard MP, but requires more computation.\nExtensions such as Multichannel MP[13] and Multichannel OMP[14] allow to process multicomponents signals.\nMatching pursuit is related to the field of compressed sensing and has been extended by researchers in that community. Notable extensions are Orthogonal Matching Pursuit (OMP),[15] Stagewise OMP (StOMP),[16] compressive sampling matching pursuit (CoSaMP),[17] Generalized OMP (gOMP),[18] and Multipath Matching Pursuit (MMP).[19]", 
    "dbpedia_url": "http://dbpedia.org/resource/Matching_pursuit", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Matching_pursuit\n"
}