{
    "about": "In mathematics, particularly in linear algebra and applications, matrix analysis is the study of matrices and their algebraic properties.[1] Some particular topics out of many include; operations defined on matrices (such as matrix addition, matrix multiplication and operations derived from these), functions of matrices (such as matrix exponentiation and matrix logarithm, and even sines and cosines etc. of matrices),[2] and the eigenvalues of matrices (eigendecomposition of a matrix, eigenvalue perturbation theory).", 
    "name": "Matrix Analysis", 
    "classification": "Numerical Analysis", 
    "full_text": "In mathematics, particularly in linear algebra and applications, matrix analysis is the study of matrices and their algebraic properties.[1] Some particular topics out of many include; operations defined on matrices (such as matrix addition, matrix multiplication and operations derived from these), functions of matrices (such as matrix exponentiation and matrix logarithm, and even sines and cosines etc. of matrices),[2] and the eigenvalues of matrices (eigendecomposition of a matrix, eigenvalue perturbation theory).\n\n\nThe set of all m×n matrices over a number field F denoted in this article Mmn(F) form a vector space. Examples of F include the set of integers ℤ, the real numbers ℝ, and set of complex numbers ℂ. The spaces Mmn(F) and Mpq(F) are different spaces if m and p are unequal, and if n and q are unequal; for instance M32(F) ≠ M23(F). Two m×n matrices A and B in Mmn(F) can be added together to form another matrix in the space Mmn(F):\nand multiplied by a α in F, to obtain another matrix in Mmn(F):\nCombining these two properties, a linear combination of matrices A and B are in Mmn(F) is another matrix in Mmn(F):\nwhere α and β are numbers in F.\nAny matrix can be expressed as a linear combination of basis matrices, which play the role of the basis vectors for the matrix space. For example, for the set of 2×2 matrices over the field of real numbers, M22(ℝ), one legitimate basis set of matrices is:\nbecause any 2×2 matrix can be expressed as:\nwhere a, b, c,d are all real numbers. This idea applies to other fields and matrices of higher dimensions.\nThe determinant of a square matrix is an important property. The determinant indicates if a matrix is invertible (i.e. the inverse of a matrix exists when the determinant is nonzero). Determinants are used for finding eigenvalues of matrices (see below), and for solving a system of linear equations (see Cramer's rule).\nAn n×n matrix A has eigenvectors x and eigenvalues λ defined by the relation:\nIn words, the matrix multiplication of A followed by an eigenvector x (here an n-dimensional column matrix), is the same as multiplying the eigenvector by the eigenvalue. For an n×n matrix, there are n eigenvalues. The eigenvalues are the roots of the characteristic polynomial:\nwhere I is the n×n identity matrix.\nRoots of polynomials, in this context the eigenvalues, can all be different, or some may be equal (in which case eigenvalue has multiplicity, the number of times an eigenvalue occurs). After solving for the eigenvalues, the eigenvectors corresponding to the eigenvalues can be found by the defining equation.\nTwo n×n matrices A and B are similar if they are related by a similarity transformation:\nThe matrix P is called a similarity matrix, and is necessarily invertible.\nLU decomposition splits a matrix into a matrix product of an upper triangular matrix and a lower triangle matrix.\nSince matrices form vector spaces, one can form axioms (analogous to those of vectors) to define a \"size\" of a particular matrix. The norm of a matrix is a positive real number.\nFor all matrices A and B in Mmn(F), and all numbers α in F, a matrix norm, delimited by double vertical bars || ... ||, fulfills:[note 1]\nThe Frobenius norm is analogous to the dot product of Euclidean vectors; multiply matrix elements entry-wise, add up the results, then take the positive square root:\nIt is defined for matrices of any dimension (i.e. no restriction to square matrices).\nMatrix elements are not restricted to constant numbers, they can be mathematical variables.\nA functions of a matrix takes in a matrix, and return something else (a number, vector, matrix, etc...).\nA matrix valued function takes in something (a number, vector, matrix, etc...) and returns a matrix.", 
    "dbpedia_url": "http://dbpedia.org/resource/Matrix_analysis", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Matrix_analysis\n"
}