{
    "about": "Mean field particle methods are a broad class of interacting type Monte Carlo algorithms for simulating from a sequence of probability distributions satisfying a nonlinear evolution equation[1][2][3][4] These flows of probability measures can always be interpreted as the distributions of the random states of a Markov process whose transition probabilities depends on the distributions of the current random states.[1][2] A natural way to simulate these sophisticated nonlinear Markov processes is to sample a large number of copies of the process, replacing in the evolution equation the unknown distributions of the random states by the sampled empirical measures. In contrast with traditional Monte Carlo and Markov chain Monte Carlo methods these mean field particle techniques rely on sequential interacting samples. The terminology mean field reflects the fact that each of the samples (a.k.a. particles, individuals, walkers, agents, creatures, or phenotypes) interacts with the empirical measures of the process. When the size of the system tends to infinity, these random empirical measures converge to the deterministic distribution of the random states of the nonlinear Markov chain, so that the statistical interaction between particles vanishes. In other words, starting with a chaotic configuration based on independent copies of initial state of the nonlinear Markov chain model, the chaos propagates at any time horizon as the size the system tends to infinity; that is, finite blocks of particles reduces to independent copies of the nonlinear Markov process. This result is called the propagation of chaos property.[5][6][7] The terminology \"propagation of chaos\" originated with the work of Mark Kac in 1976 on a colliding mean field kinetic gas model[8]", 
    "name": "Mean Field Particle Methods", 
    "classification": "Numerical Analysis", 
    "full_text": "Mean field particle methods are a broad class of interacting type Monte Carlo algorithms for simulating from a sequence of probability distributions satisfying a nonlinear evolution equation[1][2][3][4] These flows of probability measures can always be interpreted as the distributions of the random states of a Markov process whose transition probabilities depends on the distributions of the current random states.[1][2] A natural way to simulate these sophisticated nonlinear Markov processes is to sample a large number of copies of the process, replacing in the evolution equation the unknown distributions of the random states by the sampled empirical measures. In contrast with traditional Monte Carlo and Markov chain Monte Carlo methods these mean field particle techniques rely on sequential interacting samples. The terminology mean field reflects the fact that each of the samples (a.k.a. particles, individuals, walkers, agents, creatures, or phenotypes) interacts with the empirical measures of the process. When the size of the system tends to infinity, these random empirical measures converge to the deterministic distribution of the random states of the nonlinear Markov chain, so that the statistical interaction between particles vanishes. In other words, starting with a chaotic configuration based on independent copies of initial state of the nonlinear Markov chain model, the chaos propagates at any time horizon as the size the system tends to infinity; that is, finite blocks of particles reduces to independent copies of the nonlinear Markov process. This result is called the propagation of chaos property.[5][6][7] The terminology \"propagation of chaos\" originated with the work of Mark Kac in 1976 on a colliding mean field kinetic gas model[8]\n\n\nThe theory of mean field interacting particle models had certainly started by the mid-1960s, with the work of Henry P. McKean Jr. on Markov interpretations of a class of nonlinear parabolic partial differential equations arising in fluid mechanics.[5][9] The mathematical foundations of these classes of models were developed from the mid-1980s to the mid-1990s by several mathematicians, including Werner Braun, Klaus Hepp,[10] Karl Oelschläger,[11][12][13] Gérard Ben Arous and Marc Brunaud,[14] Donald Dawson, Jean Vaillancourt[15] and Jürgen Gärtner,[16][17] Christian Léonard,[18] Sylvie Méléard, Sylvie Roelly,[6] Alain-Sol Sznitman[7][19] and Hiroshi Tanaka[20] for diffusion type models; F. Alberto Grünbaum,[21] Tokuzo Shiga, Hiroshi Tanaka,[22] Sylvie Méléard and Carl Graham[23][24][25] for general classes of interacting jump-diffusion processes.\nWe also quote an earlier pioneering article by Theodore E. Harris and Herman Kahn, published in 1951, using mean field but heuristic-like genetic methods for estimating particle transmission energies.[26] Mean field genetic type particle methods are also used as heuristic natural search algorithms (a.k.a. metaheuristic) in evolutionary computing. The origins of these mean field computational techniques can be traced to 1950 and 1954 with the work of Alan Turing on genetic type mutation-selection learning machines[27] and the articles by Nils Aall Barricelli at the Institute for Advanced Study in Princeton, New Jersey.[28][29] The Australian geneticist Alex Fraser also published in 1957 a series of papers on the genetic type simulation of artificial selection of organisms.[30]\nQuantum Monte Carlo, and more specifically Diffusion Monte Carlo methods can also be interpreted as a mean field particle approximation of Feynman-Kac path integrals.[3][4][31][32][33][34][35] The origins of Quantum Monte Carlo methods are often attributed to Enrico Fermi and Robert Richtmyer who developed in 1948 a mean field particle interpretation of neutron-chain reactions,[36] but the first heuristic-like and genetic type particle algorithm (a.k.a. Resampled or Reconfiguration Monte Carlo methods) for estimating ground state energies of quantum systems (in reduced matrix models) is due to Jack H. Hetherington in 1984[35] In molecular chemistry, the use of genetic heuristic-like particle methods (a.k.a. pruning and enrichment strategies) can be traced back to 1955 with the seminal work of Marshall. N. Rosenbluth and Arianna. W. Rosenbluth.[37]\nThe first pioneering articles on the applications of these heuristic-like particle methods in nonlinear filtering problems were the independent studies of Neil Gordon, David Salmon and Adrian Smith (bootstrap filter),[38] Genshiro Kitagawa (Monte Carlo filter) ,[39] and the one by Himilcon Carvalho, Pierre Del Moral, André Monin and Gérard Salut[40] published in the 1990s. The term interacting \"particle filters\" was first coined in 1996 by Del Moral.[41] Particle filters were also developed in signal processing in the early 1989-1992 by P. Del Moral, J.C. Noyer, G. Rigal, and G. Salut in the LAAS-CNRS in a series of restricted and classified research reports with STCAN (Service Technique des Constructions et Armes Navales), the IT company DIGILOG, and the LAAS-CNRS (the Laboratory for Analysis and Architecture of Systems) on RADAR/SONAR and GPS signal processing problems.[42][43][44][45][46][47]\nThe foundations and the first rigorous analysis on the convergence of genetic type models and mean field Feynman-Kac particle methods are due to Pierre Del Moral[48][49] in 1996. Branching type particle methods with varying population sizes were also developed in the end of the 1990s by Dan Crisan, Jessica Gaines and Terry Lyons,[50][51][52] and by Dan Crisan, Pierre Del Moral and Terry Lyons.[53] The first uniform convergence results with respect to the time parameter for mean field particle models were developed in the end of the 1990s by Pierre Del Moral and Alice Guionnet[54][55] for interacting jump type processes, and by Florent Malrieu for nonlinear diffusion type processes.[56]\nNew classes of mean field particle simulation techniques for Feynman-Kac path-integration problems includes genealogical tree based models,[2][3][57] backward particle models,[2][58] adaptive mean field particle models,[59] island type particle models,[60][61] and particle Markov chain Monte Carlo methods[62][63]\nIn physics, and more particularly in statistical mechanics, these nonlinear evolution equations are often used to describe the statistical behavior of microscopic interacting particles in a fluid or in some condensed matter. In this context, the random evolution of a virtual fluid or a gas particle is represented by McKean-Vlasov diffusion processes, reaction–diffusion systems, or Boltzmann type collision processes.[11][12][13][25][64] As its name indicates, the mean field particle model represents the collective behavior of microscopic particles weakly interacting with their occupation measures. The macroscopic behavior of these many-body particle systems is encapsulated in the limiting model obtained when the size of the population tends to infinity. Boltzmann equations represent the macroscopic evolution of colliding particles in rarefied gases, while McKean Vlasov diffusions represent the macroscopic behavior of fluid particles and granular gases.\nIn computational physics and more specifically in quantum mechanics, the ground state energies of quantum systems is associated with the top of the spectrum of Schrödinger's operators. The Schrödinger equation is the quantum mechanics version of the Newton's second law of motion of classical mechanics (the mass times the acceleration is the sum of the forces). This equation represents the wave function (a.k.a. the quantum state) evolution of some physical system, including molecular, atomic of subatomic systems, as well as macroscopic systems like the universe.[65] The solution of the imaginary time Schrödinger equation (a.k.a. the heat equation) is given by a Feynman-Kac distribution associated with a free evolution Markov process (often represented by Brownian motions) in the set of electronic or macromolecular configurations and some potential energy function. The long time behavior of these nonlinear semigroups is related to top eigenvalues and ground state energies of Schrödinger's operators.[3][32][33][34][35][66] The genetic type mean field interpretation of these Feynman-Kac models are termed Resample Monte Carlo, or Diffusion Monte Carlo methods. These branching type evolutionary algorithms are based on mutation and selection transitions. During the mutation transition, the walkers evolve randomly and independently in a potential energy landscape on particle configurations. The mean field selection process (a.k.a. quantum teleportation, population reconfiguration, resampled transition) is associated with a fitness function that reflects the particle absorption in an energy well. Configurations with low relative energy are more likely to duplicate. In molecular chemistry, and statistical physics Mean field particle methods are also used to sample Boltzmann-Gibbs measures associated with some cooling schedule, and to compute their normalizing constants (a.k.a. free energies, or partition functions).[2][67][68][69]\nIn computational biology, and more specifically in population genetics, spatial branching processes with competitive selection and migration mechanisms can also represented by mean field genetic type population dynamics models.[4][70] The first moments of the occupation measures of a spatial branching process are given by Feynman-Kac distribution flows.[71][72] The mean field genetic type approximation of these flows offers a fixed population size interpretation of these branching processes.[2][3][70] Extinction probabilities can be interpreted as absorption probabilities of some Markov process evolving in some absorbing environment. These absorption models are represented by Feynman-Kac models.[73][74][75][76] The long time behavior of these processes conditioned on non-extinction can be expressed in an equivalent way by quasi-invariant measures, Yaglom limits,[77] or invariant measures of nonlinear normalized Feynman-Kac flows.[2][3][54][55][66][78]\nIn computer sciences, and more particularly in artificial intelligence these mean field type genetic algorithms are used as random search heuristics that mimic the process of evolution to generate useful solutions to complex optimization problems.[79][80][81] These stochastic search algorithms belongs to the class of Evolutionary models. The idea is to propagate a population of feasible candidate solutions using mutation and selection mechanisms. The mean field interaction between the individuals is encapsulated in the selection and the cross-over mechanisms.\nIn mean field games and multi-agent interacting systems theories, mean field particle processes are used to represent the collective behavior of complex systems with interacting individuals.[82][83][84][85][86][87][88][89] In this context, the mean field interaction is encapsulated in the decision process of interacting agents. The limiting model as the number of agents tends to infinity is sometimes called the continuum model of agents[90]\nIn information theory, and more specifically in statistical machine learning and signal processing, mean field particle methods are used to sample sequentially from the conditional distributions of some random process with respect to a sequence of observations or a cascade of rare events.[2][3][70][91] In discrete time nonlinear filtering problems, the conditional distributions of the random states of a signal given partial and noisy observations satisfy a nonlinear updating-prediction evolution equation. The updating step is given by Bayes' rule, and the prediction step is a Chapman-Kolmogorov transport equation. The mean field particle interpretation of these nonlinear filtering equations is a genetic type selection-mutation particle algorithm[48] During the mutation step, the particles evolve independently of one another according to the Markov transitions of the signal . During the selection stage, particles with small relative likelihood values are killed, while the ones with high relative values are multiplied.[92][93] These mean field particle techniques are also used to solve multiple-object tracking problems, and more specifically to estimate association measures[2][70][70][94]\nThe continuous time version of these particle models are mean field Moran type particle interpretations of the robust optimal filter evolution equations or the Kushner-Stratonotich stochastic partial differential equation.[4][31][93] These genetic type mean field particle algorithms also termed Particle Filters and Sequential Monte Carlo methods are extensively and routinely used in operation research and statistical inference .[95][96][97] The term \"particle filters\" was first coined in 1996 by Del Moral,[41] and the term \"sequential Monte Carlo\" by Liu and Chen in 1998. Subset simulation and Monte Carlo splitting[98] techniques are particular instances of genetic particle schemes and Feynman-Kac particle models equipped with Markov chain Monte Carlo mutation transitions[67][99][100]\nTo motivate the mean field simulation algorithm we start with S a finite or countable state space and let P(S) denote the set of all probability measures on S. Consider a sequence of probability distributions \n\n\n\n(\n\nη\n\n0\n\n\n,\n\nη\n\n1\n\n\n,\n⋯\n)\n\n\n{\\displaystyle (\\eta _{0},\\eta _{1},\\cdots )}\n\n on S satisfying an evolution equation:\n\n\n\n\n\nη\n\nn\n+\n1\n\n\n=\nΦ\n(\n\nη\n\nn\n\n\n)\n\n\n{\\displaystyle \\eta _{n+1}=\\Phi (\\eta _{n})}\n\n\n\n \n \n \n \n(1)\nfor some, possibly nonlinear, mapping \n\n\n\nΦ\n:\nP\n(\nS\n)\n→\nP\n(\nS\n)\n.\n\n\n{\\displaystyle \\Phi :P(S)\\to P(S).}\n\n These distributions are given by vectors\nthat satisfy:\nTherefore, \n\n\n\nΦ\n\n\n{\\displaystyle \\Phi }\n\n is a mapping from the \n\n\n\n(\ns\n−\n1\n)\n\n\n{\\displaystyle (s-1)}\n\n-unit simplex into itself, where s stands for the cardinality of the set S. When s is too large, solving equation (1) is intractable or computationally very costly. One natural way to approximate these evolution equations is to reduce sequentially the state space using a mean field particle model. One of the simplest mean field simulation scheme is defined by the Markov chain\non the product space \n\n\n\n\nS\n\nN\n\n\n\n\n{\\displaystyle S^{N}}\n\n, starting with N independent random variables with probability distribution \n\n\n\n\nη\n\n0\n\n\n\n\n{\\displaystyle \\eta _{0}}\n\n and elementary transitions\nwith the empirical measure\nwhere \n\n\n\n\n1\n\nx\n\n\n\n\n{\\displaystyle 1_{x}}\n\n is the indicator function of the state x.\nIn other words, given \n\n\n\n\nξ\n\nn\n\n\n(\nN\n)\n\n\n\n\n{\\displaystyle \\xi _{n}^{(N)}}\n\n the samples \n\n\n\n\nξ\n\nn\n+\n1\n\n\n(\nN\n)\n\n\n\n\n{\\displaystyle \\xi _{n+1}^{(N)}}\n\n are independent random variables with probability distribution \n\n\n\nΦ\n\n(\n\nη\n\nn\n\n\nN\n\n\n)\n\n\n\n{\\displaystyle \\Phi \\left(\\eta _{n}^{N}\\right)}\n\n. The rationale behind this mean field simulation technique is the following: We expect that when \n\n\n\n\nη\n\nn\n\n\nN\n\n\n\n\n{\\displaystyle \\eta _{n}^{N}}\n\n is a good approximation of \n\n\n\n\nη\n\nn\n\n\n\n\n{\\displaystyle \\eta _{n}}\n\n, then \n\n\n\nΦ\n\n(\n\nη\n\nn\n\n\nN\n\n\n)\n\n\n\n{\\displaystyle \\Phi \\left(\\eta _{n}^{N}\\right)}\n\n is an approximation of \n\n\n\nΦ\n\n(\n\nη\n\nn\n\n\n)\n\n=\n\nη\n\nn\n+\n1\n\n\n\n\n{\\displaystyle \\Phi \\left(\\eta _{n}\\right)=\\eta _{n+1}}\n\n. Thus, since \n\n\n\n\nη\n\nn\n+\n1\n\n\nN\n\n\n\n\n{\\displaystyle \\eta _{n+1}^{N}}\n\n is the empirical measure of N conditionally independent random variables with common probability distribution \n\n\n\nΦ\n\n(\n\nη\n\nn\n\n\nN\n\n\n)\n\n\n\n{\\displaystyle \\Phi \\left(\\eta _{n}^{N}\\right)}\n\n, we expect \n\n\n\n\nη\n\nn\n+\n1\n\n\nN\n\n\n\n\n{\\displaystyle \\eta _{n+1}^{N}}\n\n to be a good approximation of \n\n\n\n\nη\n\nn\n+\n1\n\n\n\n\n{\\displaystyle \\eta _{n+1}}\n\n.\nAnother strategy is to find a collection\nof stochastic matrices indexed by \n\n\n\n\nη\n\nn\n\n\n∈\nP\n(\nS\n)\n\n\n{\\displaystyle \\eta _{n}\\in P(S)}\n\n such that\n\n\n\n\n\n∑\n\nx\n∈\nS\n\n\n\nη\n\nn\n\n\n(\nx\n)\n\nK\n\n\nη\n\nn\n\n\n\n\n(\nx\n,\ny\n)\n=\nΦ\n(\n\nη\n\nn\n\n\n)\n(\ny\n)\n=\n\nη\n\nn\n+\n1\n\n\n(\ny\n)\n\n\n{\\displaystyle \\sum _{x\\in S}\\eta _{n}(x)K_{\\eta _{n}}(x,y)=\\Phi (\\eta _{n})(y)=\\eta _{n+1}(y)}\n\n\n\n \n \n \n \n(2)\nThis formula allows us to interpret the sequence \n\n\n\n(\n\nη\n\n0\n\n\n,\n\nη\n\n1\n\n\n,\n⋯\n)\n\n\n{\\displaystyle (\\eta _{0},\\eta _{1},\\cdots )}\n\n as the probability distributions of the random states \n\n\n\n\n(\n\n\n\nX\n¯\n\n\n\n0\n\n\n,\n\n\n\nX\n¯\n\n\n\n1\n\n\n,\n⋯\n)\n\n\n\n{\\displaystyle \\left({\\overline {X}}_{0},{\\overline {X}}_{1},\\cdots \\right)}\n\n of the nonlinear Markov chain model with elementary transitions\nA collection of Markov transitions \n\n\n\n\nK\n\n\nη\n\nn\n\n\n\n\n\n\n{\\displaystyle K_{\\eta _{n}}}\n\n satisfying the equation (1) is called a McKean interpretation of the sequence of measures \n\n\n\n\nη\n\nn\n\n\n\n\n{\\displaystyle \\eta _{n}}\n\n. The mean field particle interpretation of (2) is now defined by the Markov chain\non the product space \n\n\n\n\nS\n\nN\n\n\n\n\n{\\displaystyle S^{N}}\n\n, starting with N independent random copies of \n\n\n\n\nX\n\n0\n\n\n\n\n{\\displaystyle X_{0}}\n\n and elementary transitions\nwith the empirical measure\nUnder some weak regularity conditions[2] on the mapping \n\n\n\nΦ\n\n\n{\\displaystyle \\Phi }\n\n for any function \n\n\n\nf\n:\nS\n→\n\nR\n\n\n\n{\\displaystyle f:S\\to \\mathbf {R} }\n\n, we have the almost sure convergence\nThese nonlinear Markov processes and their mean field particle interpretation can be extended to time non homogeneous models on general measurable state spaces.[2]\nTo illustrate the abstract models presented above, we consider a stochastic matrix \n\n\n\nM\n=\n(\nM\n(\nx\n,\ny\n)\n\n)\n\nx\n,\ny\n∈\nS\n\n\n\n\n{\\displaystyle M=(M(x,y))_{x,y\\in S}}\n\n and some function \n\n\n\nG\n:\nS\n→\n(\n0\n,\n1\n)\n\n\n{\\displaystyle G:S\\to (0,1)}\n\n. We associate with these two objects the mapping\nand the Boltzmann-Gibbs measures \n\n\n\n\nΨ\n\nG\n\n\n(\n\nη\n\nn\n\n\n)\n(\nx\n)\n\n\n{\\displaystyle \\Psi _{G}(\\eta _{n})(x)}\n\n defined by\nWe denote by \n\n\n\n\nK\n\n\nη\n\nn\n\n\n\n\n=\n\n\n(\n\nK\n\n\nη\n\nn\n\n\n\n\n(\nx\n,\ny\n)\n)\n\n\nx\n,\ny\n∈\nS\n\n\n\n\n{\\displaystyle K_{\\eta _{n}}=\\left(K_{\\eta _{n}}(x,y)\\right)_{x,y\\in S}}\n\n the collection of stochastic matrices indexed by \n\n\n\n\nη\n\nn\n\n\n∈\nP\n(\nS\n)\n\n\n{\\displaystyle \\eta _{n}\\in P(S)}\n\n given by\nfor some parameter \n\n\n\nϵ\n∈\n[\n0\n,\n1\n]\n\n\n{\\displaystyle \\epsilon \\in [0,1]}\n\n. It is readily checked that the equation (2) is satisfied. In addition, we can also show (cf. for instance[3]) that the solution of (1) is given by the Feynman-Kac formula\nwith a Markov chain \n\n\n\n\nX\n\nn\n\n\n\n\n{\\displaystyle X_{n}}\n\n with initial distribution \n\n\n\n\nη\n\n0\n\n\n\n\n{\\displaystyle \\eta _{0}}\n\n and Markov transition M.\nFor any function \n\n\n\nf\n:\nS\n→\n\nR\n\n\n\n{\\displaystyle f:S\\to \\mathbf {R} }\n\n we have\nIf \n\n\n\nG\n(\nx\n)\n=\n1\n\n\n{\\displaystyle G(x)=1}\n\n is the unit function and \n\n\n\nϵ\n=\n1\n\n\n{\\displaystyle \\epsilon =1}\n\n, then we have\nAnd the equation (2) reduces to the Chapman-Kolmogorov equation\nThe mean field particle interpretation of this Feynman-Kac model is defined by sampling sequentially N conditionally independent random variables \n\n\n\n\nξ\n\nn\n+\n1\n\n\n(\nN\n,\ni\n)\n\n\n\n\n{\\displaystyle \\xi _{n+1}^{(N,i)}}\n\n with probability distribution\nIn other words, with a probability \n\n\n\nϵ\nG\n\n(\n\nξ\n\nn\n\n\n(\nN\n,\ni\n)\n\n\n)\n\n\n\n{\\displaystyle \\epsilon G\\left(\\xi _{n}^{(N,i)}\\right)}\n\n the particle \n\n\n\n\nξ\n\nn\n\n\n(\nN\n,\ni\n)\n\n\n\n\n{\\displaystyle \\xi _{n}^{(N,i)}}\n\n evolves to a new state \n\n\n\n\nξ\n\nn\n+\n1\n\n\n(\nN\n,\ni\n)\n\n\n=\ny\n\n\n{\\displaystyle \\xi _{n+1}^{(N,i)}=y}\n\n randomly chosen with the probability distribution \n\n\n\nM\n\n(\n\nξ\n\nn\n\n\n(\nN\n,\ni\n)\n\n\n,\ny\n)\n\n\n\n{\\displaystyle M\\left(\\xi _{n}^{(N,i)},y\\right)}\n\n; otherwise, \n\n\n\n\nξ\n\nn\n\n\n(\nN\n,\ni\n)\n\n\n\n\n{\\displaystyle \\xi _{n}^{(N,i)}}\n\n jumps to a new location \n\n\n\n\nξ\n\nn\n\n\n(\nN\n,\nj\n)\n\n\n\n\n{\\displaystyle \\xi _{n}^{(N,j)}}\n\n randomly chosen with a probability proportional to \n\n\n\nG\n\n(\n\nξ\n\nn\n\n\n(\nN\n,\nj\n)\n\n\n)\n\n\n\n{\\displaystyle G\\left(\\xi _{n}^{(N,j)}\\right)}\n\n and evolves to a new state \n\n\n\n\nξ\n\nn\n+\n1\n\n\n(\nN\n,\ni\n)\n\n\n=\ny\n\n\n{\\displaystyle \\xi _{n+1}^{(N,i)}=y}\n\n randomly chosen with the probability distribution \n\n\n\nM\n\n(\n\nξ\n\nn\n\n\n(\nN\n,\nj\n)\n\n\n,\ny\n)\n\n.\n\n\n{\\displaystyle M\\left(\\xi _{n}^{(N,j)},y\\right).}\n\n If \n\n\n\nG\n(\nx\n)\n=\n1\n\n\n{\\displaystyle G(x)=1}\n\n is the unit function and \n\n\n\nϵ\n=\n1\n\n\n{\\displaystyle \\epsilon =1}\n\n, the interaction between the particle vanishes and the particle model reduces to a sequence of independent copies of the Markov chain \n\n\n\n\nX\n\nn\n\n\n\n\n{\\displaystyle X_{n}}\n\n. When \n\n\n\nϵ\n=\n0\n\n\n{\\displaystyle \\epsilon =0}\n\n the mean field particle model described above reduces to a simple mutation-selection genetic algorithm with fitness function G and mutation transition M. These nonlinear Markov chain models and their mean field particle interpretation can be extended to time non homogeneous models on general measurable state spaces (including transition states, path spaces and random excursion spaces) and continuous time models.[1][2][3]\nWe consider a sequence of real valued random variables \n\n\n\n\n(\n\n\n\nX\n¯\n\n\n\n0\n\n\n,\n\n\n\nX\n¯\n\n\n\n1\n\n\n,\n⋯\n)\n\n\n\n{\\displaystyle \\left({\\overline {X}}_{0},{\\overline {X}}_{1},\\cdots \\right)}\n\n defined sequentially by the equations\n\n\n\n\n\n\n\nX\n¯\n\n\n\nn\n+\n1\n\n\n=\nE\n\n(\na\n\n(\n\n\n\nX\n¯\n\n\n\nn\n\n\n)\n\n)\n\nb\n\n(\n\n\n\nX\n¯\n\n\n\nn\n\n\n)\n\n+\nc\n\n(\n\n\n\nX\n¯\n\n\n\nn\n\n\n)\n\n+\nσ\n\nW\n\nn\n\n\n\n\n{\\displaystyle {\\overline {X}}_{n+1}=E\\left(a\\left({\\overline {X}}_{n}\\right)\\right)b\\left({\\overline {X}}_{n}\\right)+c\\left({\\overline {X}}_{n}\\right)+\\sigma W_{n}}\n\n\n\n \n \n \n \n(3)\nwith a collection \n\n\n\n\nW\n\nn\n\n\n\n\n{\\displaystyle W_{n}}\n\n of independent standard Gaussian random variables, a positive parameter σ, some functions \n\n\n\na\n,\nb\n,\nc\n:\n\nR\n\n→\n\nR\n\n,\n\n\n{\\displaystyle a,b,c:\\mathbf {R} \\to \\mathbf {R} ,}\n\n and some standard Gaussian initial random state \n\n\n\n\n\n\nX\n¯\n\n\n\n0\n\n\n\n\n{\\displaystyle {\\overline {X}}_{0}}\n\n. We let \n\n\n\n\nη\n\nn\n\n\n\n\n{\\displaystyle \\eta _{n}}\n\n be the probability distribution of the random state \n\n\n\n\n\n\nX\n¯\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\overline {X}}_{n}}\n\n; that is, for any bounded measurable function f, we have\nwith\nThe integral is the Lebesgue integral, and dx stands for an infinitesimal neighborhood of the state x. The Markov transition of the chain is given for any bounded measurable functions f by the formula\nwith\nUsing the tower property of conditional expectations we prove that the probability distributions \n\n\n\n\nη\n\nn\n\n\n\n\n{\\displaystyle \\eta _{n}}\n\n satisfy the nonlinear equation\nfor any bounded measurable functions f. This equation is sometimes written in the more synthetic form\nThe mean field particle interpretation of this model is defined by the Markov chain\non the product space \n\n\n\n\n\nR\n\n\nN\n\n\n\n\n{\\displaystyle \\mathbf {R} ^{N}}\n\n by\nwhere\nstand for N independent copies of \n\n\n\n\n\n\nX\n¯\n\n\n\n0\n\n\n\n\n{\\displaystyle {\\overline {X}}_{0}}\n\n and \n\n\n\n\nW\n\nn\n\n\n;\nn\n⩾\n1\n,\n\n\n{\\displaystyle W_{n};n\\geqslant 1,}\n\n respectively. For regular models (for instance for bounded Lipschitz functions a, b, c) we have the almost sure convergence\nwith the empirical measure\nfor any bounded measurable functions f (cf. for instance [2]). In the above display, \n\n\n\n\nδ\n\nx\n\n\n\n\n{\\displaystyle \\delta _{x}}\n\n stands for the Dirac measure at the state x.\nWe consider a standard Brownian motion \n\n\n\n\n\n\nW\n¯\n\n\n\n\nt\n\nn\n\n\n\n\n\n\n{\\displaystyle {\\overline {W}}_{t_{n}}}\n\n (a.k.a. Wiener Process) evaluated on a time mesh sequence \n\n\n\n\nt\n\n0\n\n\n=\n0\n<\n\nt\n\n1\n\n\n<\n⋯\n<\n\nt\n\nn\n\n\n<\n⋯\n\n\n{\\displaystyle t_{0}=0<t_{1}<\\cdots <t_{n}<\\cdots }\n\n with a given time step \n\n\n\n\nt\n\nn\n\n\n−\n\nt\n\nn\n−\n1\n\n\n=\nh\n\n\n{\\displaystyle t_{n}-t_{n-1}=h}\n\n. We choose \n\n\n\nc\n(\nx\n)\n=\nx\n\n\n{\\displaystyle c(x)=x}\n\n in equation (1), we replace \n\n\n\nb\n(\nx\n)\n\n\n{\\displaystyle b(x)}\n\n and σ by \n\n\n\nb\n(\nx\n)\n×\nh\n\n\n{\\displaystyle b(x)\\times h}\n\n and \n\n\n\nσ\n×\n\n\nh\n\n\n\n\n{\\displaystyle \\sigma \\times {\\sqrt {h}}}\n\n, and we write \n\n\n\n\n\n\nX\n¯\n\n\n\n\nt\n\nn\n\n\n\n\n\n\n{\\displaystyle {\\overline {X}}_{t_{n}}}\n\n instead of \n\n\n\n\n\n\nX\n¯\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\overline {X}}_{n}}\n\n the values of the random states evaluated at the time step \n\n\n\n\nt\n\nn\n\n\n.\n\n\n{\\displaystyle t_{n}.}\n\n Recalling that \n\n\n\n\n(\n\n\n\nW\n¯\n\n\n\n\nt\n\nn\n+\n1\n\n\n\n\n−\n\n\n\nW\n¯\n\n\n\n\nt\n\nn\n\n\n\n\n)\n\n\n\n{\\displaystyle \\left({\\overline {W}}_{t_{n+1}}-{\\overline {W}}_{t_{n}}\\right)}\n\n are independent centered Gaussian random variables with variance \n\n\n\n\nt\n\nn\n\n\n−\n\nt\n\nn\n−\n1\n\n\n=\nh\n,\n\n\n{\\displaystyle t_{n}-t_{n-1}=h,}\n\n the resulting equation can be rewritten in the following form\n\n\n\n\n\n\n\nX\n¯\n\n\n\n\nt\n\nn\n+\n1\n\n\n\n\n−\n\n\n\nX\n¯\n\n\n\n\nt\n\nn\n\n\n\n\n=\nE\n\n(\na\n\n(\n\n\n\nX\n¯\n\n\n\n\nt\n\nn\n\n\n\n\n)\n\n)\n\nb\n(\n\n\n\nX\n¯\n\n\n\n\nt\n\nn\n\n\n\n\n)\nh\n+\nσ\n\n(\n\n\n\nW\n¯\n\n\n\n\nt\n\nn\n+\n1\n\n\n\n\n−\n\n\n\nW\n¯\n\n\n\n\nt\n\nn\n\n\n\n\n)\n\n\n\n{\\displaystyle {\\overline {X}}_{t_{n+1}}-{\\overline {X}}_{t_{n}}=E\\left(a\\left({\\overline {X}}_{t_{n}}\\right)\\right)b({\\overline {X}}_{t_{n}})h+\\sigma \\left({\\overline {W}}_{t_{n+1}}-{\\overline {W}}_{t_{n}}\\right)}\n\n\n\n \n \n \n \n(4)\nWhen h → 0, the above equation converge to the nonlinear diffusion process\nThe mean field continuous time model associated with these nonlinear diffusions is the (interacting) diffusion process \n\n\n\n\nξ\n\nt\n\n\n(\nN\n)\n\n\n=\n\n\n(\n\nξ\n\nt\n\n\n(\nN\n,\ni\n)\n\n\n)\n\n\n1\n⩽\ni\n⩽\nN\n\n\n\n\n{\\displaystyle \\xi _{t}^{(N)}=\\left(\\xi _{t}^{(N,i)}\\right)_{1\\leqslant i\\leqslant N}}\n\n on the product space \n\n\n\n\n\nR\n\n\nN\n\n\n\n\n{\\displaystyle \\mathbf {R} ^{N}}\n\n defined by\nwhere\nare N independent copies of \n\n\n\n\n\n\nX\n¯\n\n\n\n0\n\n\n\n\n{\\displaystyle {\\overline {X}}_{0}}\n\n and \n\n\n\n\n\n\nW\n¯\n\n\n\nt\n\n\n.\n\n\n{\\displaystyle {\\overline {W}}_{t}.}\n\n For regular models (for instance for bounded Lipschitz functions a, b) we have the almost sure convergence\nwith \n\n\n\n\nη\n\nt\n\n\n=\n\nLaw\n\n\n(\n\n\n\nX\n¯\n\n\n\nt\n\n\n)\n\n,\n\n\n{\\displaystyle \\eta _{t}={\\text{Law}}\\left({\\overline {X}}_{t}\\right),}\n\n and the empirical measure\nfor any bounded measurable functions f (cf. for instance.[7]). These nonlinear Markov processes and their mean field particle interpretation can be extended to interacting jump-diffusion processes[1][2][23][25]", 
    "dbpedia_url": "http://dbpedia.org/resource/Mean_field_particle_methods", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Mean_field_particle_methods\n"
}