{
    "about": "A media processor, mostly used as an image / video processor, is a microprocessor-based system-on-a-chip which is designed to deal with digital streaming data in real-time (e.g. display refresh) rates. These devices can also be considered a class of digital signal processors (DSPs).", 
    "name": "Media Processor", 
    "classification": "Digital Signal Processing", 
    "full_text": "A media processor, mostly used as an image / video processor, is a microprocessor-based system-on-a-chip which is designed to deal with digital streaming data in real-time (e.g. display refresh) rates. These devices can also be considered a class of digital signal processors (DSPs).\nUnlike graphics processing units (GPUs), which are used for computer displays, media processors are targeted at digital televisions and set-top boxes.\nThe streaming digital media classes include:\nSuch SOCs are composed of:\nThe microprocessor might have these optimizations:\nPrevious to media processors, these streaming media datatypes were processed using fixed-function, hardwired ASICs, which could not be updated in the field. This was a big disadvantage when any of the media standards were changed. Since media processors are software programmed devices, the processing done on them could be updated with new software releases. This allowed new generations of systems to be created without hardware redesign. For set-top boxes this even allows for the possibility of in-the-field upgrade by downloading of new software through cable or satellite networks.\nCompanies that pioneered the idea of media processors (and created the marketing term of media processor) included:\nConsumer electronics companies have successfully dominated this market by designing their own media processors and integrating them into their video products. Companies such as Philips, Samsung, Matsushita, Fujitsu, Mitsubishi have their own in-house media processor devices.\nNewer generations of such devices now use various forms of multiprocessing—multiple CPUs or DSPs, in order to deal with the vastly increased computational needs when dealing with high definition television signals.", 
    "dbpedia_url": "http://dbpedia.org/resource/Media_processor", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Media_processor\n"
}