{
    "about": "Mehrotra's predictor–corrector method in optimization is an implementation of interior point methods. It was proposed in 1989 by Sanjay Mehrotra.[1]", 
    "name": "Mehrotra Predictor–Corrector Method", 
    "classification": "Optimization Algorithms And Methods", 
    "full_text": "Mehrotra's predictor–corrector method in optimization is an implementation of interior point methods. It was proposed in 1989 by Sanjay Mehrotra.[1]\nThe method is based on the fact that at each iteration of an interior point algorithm it is necessary to compute the Cholesky decomposition (factorization) of a large matrix to find the search direction. The factorization step is the most computationally expensive step in the algorithm. Therefore it makes sense to use the same decomposition more than once before recomputing it.\nAt each iteration of the algorithm, Mehrotra's predictor–corrector method uses the same Cholesky decomposition to find two different directions: a predictor and a corrector.\nThe idea is to first compute an optimizing search direction based on a first order term (predictor). The step size that can be taken in this direction is used to evaluate how much centrality correction is needed. Then, a corrector term is computed: this contains both a centrality term and a second order term.\nThe complete search direction is the sum of the predictor direction and the corrector direction.\nAlthough there is no theoretical complexity bound on it yet, Mehrotra's predictor–corrector method is widely used in practice.[2] Its corrector step uses the same Cholesky decomposition found during the predictor step in an effective way, and thus it is only marginally more expensive than a standard interior point algorithm. However, the additional overhead per iteration is usually paid off by a reduction in the number of iterations needed to reach an optimal solution. It also appears to converge very fast when close to the optimum.\nPotra, Florian A.; Stephen J. Wright (2000). \"Interior-point methods\". Journal of Computational and Applied Mathematics. 124 (1–2): 281–302. doi:10.1016/S0377-0427(00)00433-7. \n", 
    "dbpedia_url": "http://dbpedia.org/resource/Mehrotra_predictor–corrector_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Mehrotra_predictor–corrector_method\n"
}