{
    "about": "Melomics (derived from \"genomics of melodies\") is a computational system for the automatic composition of music (with no human intervention), based on bioinspired algorithms.[1]", 
    "name": "Melomics", 
    "classification": "Evolutionary Algorithms", 
    "full_text": "Melomics (derived from \"genomics of melodies\") is a computational system for the automatic composition of music (with no human intervention), based on bioinspired algorithms.[1]\n\n\nMelomics applies an evolutionary approach to music composition, i.e., music pieces are obtained by simulated evolution. These themes compete to better adapt to a proper fitness function, generally grounded on formal and aesthetic criteria. The Melomics system encodes each theme in a genome, and the entire population of music pieces undergoes evo-devo dynamics (i.e., pieces read-out mimicking a complex embryological development process).[2][3][4][5] The system is fully autonomous: once programmed, it composes music without human intervention.\nThis technology has been transferred to industry as an academic spin-off, Melomics Media, which has provided and reprogrammed a new computer cluster that created a huge collection of popular music. The results of this evolutionary computation are being stored in Melomics' site,[6] which nowadays constitutes a vast repository of music content. A differentiating feature is that pieces are available in three types of formats: playable (MP3), editable (MIDI and MusicXML) and readable (score in PDF).\nThe Melomics computational system includes two computer clusters: Melomics109 and Iamus, dedicated to popular and artistic music, respectively.[2][7]\nMelomics109 is cluster programmed and integrated in the Melomics system.[8] Its first product is a vast repository of popular music compositions (roughly 1 billion), covering all essential styles. In addition to MP3, all songs are available in editable formats (MIDI);[9] and music is licensed under CC0, meaning that it is freely downloadable.[8][10]\n0music is the first album published by Melomics109, which is available in MP3 and MIDI formats, under CC0 license.\nIt has been argued that, by making such amount of editable, original and royalty-free music accessible to people, Melomics may accelerate the process of commoditization of music, and change the way music is composed and consumed in the future.[1][9][10]\nIn the first stages of the development of the Melomics system, Iamus composed Opus one (on October 15, 2010), arguably the first fragment of professional contemporary classical music ever composed by a computer in its own style, rather than attempting to emulate the style of existing composers. The first full composition (also in contemporary classic style), Hello World!, premiered exactly one year after the creation of Opus one, on October 15, 2011. Four later works premiered on July 2, 2012, and were broadcast live[11] from the School of Computer Science at Universidad de Málaga[12] as part of the events included in the Alan Turing year. The compositions performed at this event were later recorded by the London Symphony Orchestra, creating Iamus’ eponymous first album, which New Scientist reported as the \"first complete album to be composed solely by a computer and recorded by human musicians.\"[13]\nCommenting on the quality and authenticity of the music, Stephen Smoliar, critic of classical music at The San Francisco Examiner, commented \"What is primary is the act of making the music itself engaged by the performers and how the listener responds to what those performers do... what is most interesting about the documents generated by Iamus is their capacity to challenge the creative talents of performing musicians\".[14]\nMelomics' empathic music has been tested in a number of therapeutic clinical trials,[15][16][17][18] evidencing positive effects in reducing fear of heights, acute stress and pain perception. One of the studies resulted in a reduction of almost two thirds of pain perception in children's prick test, as compared to the standard procedure.[18] Some of these experiments made use of mobile free apps to adapt music to daily activity,[19] like jogging,[20] or commuting,[21] but also for therapeutic use, like lessen stress before an exam,[22] for chronic pain,[23] insomnia,[24] and to help children to initiate sleep.[25]\nThe way Melomics can adapt music in real-time to the physiological evolution of the listener, and to music branding has also been reported.[10][26]", 
    "dbpedia_url": "http://dbpedia.org/resource/Melomics", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Melomics\n"
}