{
    "about": "The Mersenne Twister is a pseudorandom number generator (PRNG). It is by far the most widely used general-purpose PRNG.[1] Its name derives from the fact that its period length is chosen to be a Mersenne prime.", 
    "name": "Mersenne Twister", 
    "classification": "Pseudorandom Number Generators", 
    "full_text": "The Mersenne Twister is a pseudorandom number generator (PRNG). It is by far the most widely used general-purpose PRNG.[1] Its name derives from the fact that its period length is chosen to be a Mersenne prime.\nThe Mersenne Twister was developed in 1997 by Makoto Matsumoto (ja) (松本 眞?) and Takuji Nishimura (西村 拓士?).[2] It was designed specifically to rectify most of the flaws found in older PRNGs. It was the first PRNG to provide fast generation of high-quality pseudorandom integers.\nThe most commonly used version of the Mersenne Twister algorithm is based on the Mersenne prime 219937−1. The standard implementation of that, MT19937, uses a 32-bit word length. There is another implementation that uses a 64-bit word length, MT19937-64; it generates a different sequence.\n\n\nThe Mersenne Twister is the default PRNG for the following software systems:\nMicrosoft Visual C++,[3] Microsoft Excel,[4] GAUSS,[5] GLib,[6] GNU Multiple Precision Arithmetic Library,[7] GNU Octave,[8] GNU Scientific Library,[9] gretl,[10] IDL,[11] Julia,[12] CMU Common Lisp,[13] Embeddable Common Lisp,[14] Steel Bank Common Lisp,[15] Maple,[16] MATLAB,[17] Free Pascal,[18] PHP,[19] Python,[20][21] R,[22] Ruby,[23] SageMath,[24] Scilab,[25] Stata.[26] It is also available in Apache Commons,[27] in standard C++ (since C++11),[28][29] and in Mathematica.[30] Add-on implementations are provided in many program libraries, including the Boost C++ Libraries,[31] the CUDA Library,[32] and the NAG Numerical Library.[33]\nThe Mersenne Twister is one of two PRNGs in SPSS: the other generator is kept only for compatibility with older programs, and the Mersenne Twister is stated to be \"more reliable\".[34] The Mersenne Twister is similarly one of the PRNGs in SAS: the other generators are older and deprecated.[35]\nThe commonly used version of Mersenne Twister, MT19937, which produces a sequence of 32-bit integers, has the following desirable properties:\nThe large state space comes with a performance cost: the 2.5 KiB state buffer will place a load on the memory caches. In 2011, Saito & Matsumoto proposed a version of the Mersenne Twister to address this issue. The tiny version, TinyMT, uses just 127 bits of state space.[37]\nBy today's standards, the Mersenne Twister is somewhat slow,[vague][citation needed] unless the SFMT implementation is used (see section below).\nIt passes most, but not all, of the stringent TestU01 randomness tests.[38] Because it is based on simple linear (xor) operations, it fails tests based on linear complexity after relatively few bits of output, despite its extremely large state.[citation needed] Passing the output through a simple hash function can remedy this weakness.\nMultiple Mersenne Twister instances that differ only in seed value (but not other parameters) are not generally appropriate for Monte-Carlo simulations that require independent random number generators, though there exists a method for choosing multiple sets of parameter values.[39][40]\nIt can take a long time to start generating output that passes randomness tests, if the initial state is highly non-random—particularly if the initial state has many zeros. A consequence of this is that two instances of the generator, started with initial states that are almost the same, will usually output nearly the same sequence for many iterations, before eventually diverging. The 2002 update to the MT algorithm has improved initialization, so that beginning with such a state is very unlikely.[41]\nA pseudorandom sequence xi of w-bit integers of period P is said to be k-distributed to v-bit accuracy if the following holds.\nThe algorithm in its native form is not cryptographically secure. The reason is that observing a sufficient number of iterations (624 in the case of MT19937, since this is the size of the state vector from which future iterations are produced) allows one to predict all future iterations.\nA pair of cryptographic stream ciphers based on output from the Mersenne Twister has been proposed by Matsumoto, Nishimura, and co-authors. The authors claim speeds 1.5 to 2 times faster than Advanced Encryption Standard in counter mode.[42]\nAn alternative generator, WELL (\"Well Equidistributed Long-period Linear\"), offers quicker recovery, and equal randomness, and nearly equal speed.[43] Marsaglia's xorshift generators and variants are the fastest in this class.[44]\nFor a w-bit word length, the Mersenne Twister generates integers in the range [0, 2w−1].\nThe Mersenne Twister algorithm is based on a matrix linear recurrence over a finite binary field F2. The algorithm is a twisted generalised feedback shift register[45] (twisted GFSR, or TGFSR) of rational normal form (TGFSR(R)), with state bit reflection and tempering. The basic idea is to define a series \n\n\n\n\nx\n\ni\n\n\n\n\n{\\displaystyle x_{i}}\n\n through a simple recurrence relation, and then output numbers of the form \n\n\n\n\nx\n\ni\n\n\nT\n\n\n{\\displaystyle x_{i}T}\n\n, where \n\n\n\nT\n\n\n{\\displaystyle T}\n\n is an invertible F2 matrix called a tempering matrix.\nThe general algorithm is characterized by the following quantities (some of these explanations make sense only after reading the rest of the algorithm):\nwith the restriction that 2nw − r − 1 is a Mersenne prime. This choice simplifies the primitivity test and k-distribution test that are needed in the parameter search.\nThe series x is defined as a series of w-bit quantities with the recurrence relation:\nwhere \n\n\n\n∣\n∣\n\n\n{\\displaystyle \\mid \\mid }\n\n denotes concatenation of bit vectors (with upper bits on the left), \n\n\n\n⊕\n\n\n{\\displaystyle \\oplus }\n\n the bitwise exclusive or (XOR), \n\n\n\n\n\n\nx\n\nk\n\n\n\n\nu\n\n\n\n\n{\\displaystyle {x_{k}}^{u}}\n\n means the upper \n\n\n\nw\n−\nr\n\n\n{\\displaystyle w-r}\n\n bits of \n\n\n\n\nx\n\nk\n\n\n\n\n{\\displaystyle x_{k}}\n\n, and \n\n\n\n\nx\n\nk\n+\n1\n\n\nl\n\n\n\n\n{\\displaystyle x_{k+1}^{l}}\n\n means the lower \n\n\n\nr\n\n\n{\\displaystyle r}\n\n bits of \n\n\n\n\nx\n\nk\n+\n1\n\n\n\n\n{\\displaystyle x_{k+1}}\n\n. The twist transformation A is defined in rational normal form as:\n\n\n\n\nA\n=\n\n\n(\n\n\n\n0\n\n\n\nI\n\nw\n−\n1\n\n\n\n\n\n\n\na\n\nw\n−\n1\n\n\n\n\n(\n\na\n\nw\n−\n2\n\n\n,\n…\n,\n\na\n\n0\n\n\n)\n\n\n\n)\n\n\n\n\n{\\displaystyle A={\\begin{pmatrix}0&I_{w-1}\\\\a_{w-1}&(a_{w-2},\\ldots ,a_{0})\\end{pmatrix}}}\n\n\nwith In − 1 as the (n − 1) × (n − 1) identity matrix. The rational normal form has the benefit that multiplication by A can be efficiently expressed as: (remember that here matrix multiplication is being done in F2, and therefore bitwise XOR takes the place of addition)\n\n\n\n\n\nx\n\nA\n=\n\n\n{\n\n\n\n\nx\n\n≫\n1\n\n\n\nx\n\n0\n\n\n=\n0\n\n\n\n\n(\n\nx\n\n≫\n1\n)\n⊕\n\na\n\n\n\n\nx\n\n0\n\n\n=\n1\n\n\n\n\n\n\n\n\n{\\displaystyle {\\boldsymbol {x}}A={\\begin{cases}{\\boldsymbol {x}}\\gg 1&x_{0}=0\\\\({\\boldsymbol {x}}\\gg 1)\\oplus {\\boldsymbol {a}}&x_{0}=1\\end{cases}}}\n\n\nwhere x0 is the lowest order bit of x.\nAs like TGFSR(R), the Mersenne Twister is cascaded with a tempering transform to compensate for the reduced dimensionality of equidistribution (because of the choice of A being in the rational normal form). Note that this is equivalent to using the matrix A where A = T−1AT for T an invertible matrix, and therefore the analysis of characteristic polynomial mentioned below still holds.\nAs with A, we choose a tempering transform to be easily computable, and so do not actually construct T itself. The tempering is defined in the case of Mersenne Twister as\nwhere x is the next value from the series, y a temporary intermediate value, z the value returned from the algorithm, with <<, >> as the bitwise left and right shifts, and & as the bitwise and. The first and last transforms are added in order to improve lower-bit equidistribution. From the property of TGFSR, \n\n\n\ns\n+\nt\n≥\n⌊\nw\n\n/\n\n2\n⌋\n−\n1\n\n\n{\\displaystyle s+t\\geq \\lfloor w/2\\rfloor -1}\n\n is required to reach the upper bound of equidistribution for the upper bits.\nThe coefficients for MT19937 are:\nNote that 32-bit implementations of the Mersenne Twister generally have d = FFFFFFFF16. As a result, the d is occasionally omitted from the algorithm description, since the bitwise and with d in that case has no effect.\nThe coefficients for MT19937-64 are:[46]\nAs should be apparent from the above description, the state needed for a Mersenne Twister implementation is an array of n values of w bits each. To initialize the array, a w-bit seed value is used to supply x0 through xn − 1 by setting x0 to the seed value and thereafter setting\nfor i from 1 to n-1. The first value the algorithm then generates is based on xn, not based on x0. The constant f forms another parameter to the generator, though not part of the algorithm proper. The value for f for MT19937 is 1812433253 and for MT19937-64 is 6364136223846793005.[47]\nIn order to achieve the 2nw − r − 1 theoretical upper limit of the period in a TGFSR, φB(t) must be a primitive polynomial, φB(t) being the characteristic polynomial of\n\n\n\n\nB\n=\n\n\n(\n\n\n\n0\n\n\n\nI\n\nw\n\n\n\n\n⋯\n\n\n0\n\n\n0\n\n\n\n\n⋮\n\n\n\n\n\n\n\n\n\nI\n\nw\n\n\n\n\n⋮\n\n\n⋱\n\n\n⋮\n\n\n⋮\n\n\n\n\n⋮\n\n\n\n\n\n\n\n\n0\n\n\n0\n\n\n⋯\n\n\n\nI\n\nw\n\n\n\n\n0\n\n\n\n\n0\n\n\n0\n\n\n⋯\n\n\n0\n\n\n\nI\n\nw\n−\nr\n\n\n\n\n\n\nS\n\n\n0\n\n\n⋯\n\n\n0\n\n\n0\n\n\n\n)\n\n\n\n\n\n\n\n\n\n\n\n\n←\nm\n\n-th row\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n{\\displaystyle B={\\begin{pmatrix}0&I_{w}&\\cdots &0&0\\\\\\vdots &&&&\\\\I_{w}&\\vdots &\\ddots &\\vdots &\\vdots \\\\\\vdots &&&&\\\\0&0&\\cdots &I_{w}&0\\\\0&0&\\cdots &0&I_{w-r}\\\\S&0&\\cdots &0&0\\end{pmatrix}}{\\begin{matrix}\\\\\\\\\\leftarrow m{\\hbox{-th row}}\\\\\\\\\\\\\\\\\\end{matrix}}}\n\n\n\n\n\n\nS\n=\n\n\n(\n\n\n\n0\n\n\n\nI\n\nr\n\n\n\n\n\n\n\nI\n\nw\n−\nr\n\n\n\n\n0\n\n\n\n)\n\n\nA\n\n\n{\\displaystyle S={\\begin{pmatrix}0&I_{r}\\\\I_{w-r}&0\\end{pmatrix}}A}\n\n\nThe twist transformation improves the classical GFSR with the following key properties:\nThe following piece of pseudocode implements the general Mersenne Twister algorithm. The constants w, n, m, r, a, u, d, s, b, t, c, l, and f are as in the algorithm description above. It is assumed that int represents a type sufficient to hold values with w bits:\nThis python implementation hard-codes the constants for MT19937:\nThen MT19937(seed).extract_number() returns the random number, where seed is the initial seed.\nThis C# implementation hard-codes the constants for MT19937-64:\nSimple 32-bit C/C++ implementation (tested using GCC for ARM):\nThis Haskell implementation is optimized for readability and uses an inefficient list representation of the state array \n\n\n\n\nx\n\ni\n\n\n,\n…\n,\n\nx\n\ni\n+\nn\n−\n1\n\n\n\n\n{\\displaystyle x_{i},\\ldots ,x_{i+n-1}}\n\n:\nSFMT, the single instruction, multiple data-oriented fast Mersenne Twister, is a variant of Mersenne Twister, introduced in 2006,[49] designed to be fast when it runs on 128-bit SIMD.\nIntel SSE2 and PowerPC AltiVec are supported by SFMT. It is also used for games with the Cell BE in the PlayStation 3.[51]\nMTGP is a variant of Mersenne Twister optimised for graphics processing units published by Mutsuo Saito and Makoto Matsumoto.[52] The basic linear recurrence operations are extended from MT and parameters are chosen to allow many threads to compute the recursion in parallel, while sharing their state space to reduce memory load. The paper claims improved equidistribution over MT and performance on a high specification GPU (Nvidia GTX260 with 192 cores) of 4.7 ms for 5×107 random 32-bit integers.", 
    "dbpedia_url": "http://dbpedia.org/resource/Mersenne_Twister", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Mersenne_Twister\n"
}