{
    "about": "In scientific computation and simulation, the method of fundamental solutions (MFS) is getting a growing attention. The method is essentially based on the fundamental solution of a partial differential equation of interest as its basis function. The MFS was developed to overcome the major drawbacks in the boundary element method (BEM) which also uses the fundamental solution to satisfy the governing equation. Consequently, both the MFS and the BEM are of a boundary discretization numerical technique and reduce the computational complexity by one dimensionality and have particular edge over the domain-type numerical techniques such as the finite element and finite volume methods on the solution of infinite domain, thin-walled structures, and inverse problems.", 
    "name": "Method Of Fundamental Solutions", 
    "classification": "Numerical Analysis", 
    "full_text": "In scientific computation and simulation, the method of fundamental solutions (MFS) is getting a growing attention. The method is essentially based on the fundamental solution of a partial differential equation of interest as its basis function. The MFS was developed to overcome the major drawbacks in the boundary element method (BEM) which also uses the fundamental solution to satisfy the governing equation. Consequently, both the MFS and the BEM are of a boundary discretization numerical technique and reduce the computational complexity by one dimensionality and have particular edge over the domain-type numerical techniques such as the finite element and finite volume methods on the solution of infinite domain, thin-walled structures, and inverse problems.\nIn contrast to the BEM, the MFS avoids the numerical integration of singular fundamental solution and is an inherent meshfree method. The method, however, is compromised by requiring a controversial fictitious boundary outside the physical domain to circumvent the singularity of fundamental solution, which has seriously restricted its applicability to real-world problems. But nevertheless the MFS has been found very competitive to some application areas such as infinite domain problems.\nThe MFS is also known by quite a few different names in the literature. Among these are the charge simulation method, the superposition method, the desingularized method, the indirect boundary element method, and the virtual boundary element method, just to name a few.\n\n\nConsider a partial differential equation governing certain type of problems\nwhere \n\n\n\nL\n\n\n{\\displaystyle L}\n\n is the differential partial operator, \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n represents the computational domain, \n\n\n\n∂\n\nΩ\n\nD\n\n\n\n\n{\\displaystyle \\partial \\Omega _{D}}\n\n and \n\n\n\n∂\n\nΩ\n\nN\n\n\n\n\n{\\displaystyle \\partial \\Omega _{N}}\n\n denote the Dirichlet and Neumann boundary, respectively, \n\n\n\n∂\n\nΩ\n\nD\n\n\n∪\n∂\n\nΩ\n\nN\n\n\n=\n∂\nΩ\n\n\n{\\displaystyle \\partial \\Omega _{D}\\cup \\partial \\Omega _{N}=\\partial \\Omega }\n\n and \n\n\n\n∂\n\nΩ\n\nD\n\n\n∩\n∂\n\nΩ\n\nN\n\n\n=\n∅\n\n\n{\\displaystyle \\partial \\Omega _{D}\\cap \\partial \\Omega _{N}=\\varnothing }\n\n.\nThe MFS employs the fundamental solution of the operator as its basis function to represent the approximation of unknown function u as follows\nwhere \n\n\n\n\nr\n\ni\n\n\n=\n\n∥\n\n(\nx\n,\ny\n)\n\n−\n\n(\ns\n\nx\n\ni\n\n\n,\ns\n\ny\n\ni\n\n\n)\n\n∥\n\n\n\n{\\displaystyle r_{i}=\\left\\|\\left(x,y\\right)-\\left(sx_{i},sy_{i}\\right)\\right\\|}\n\n denotes the Euclidean distance between collocation points \n\n\n\n\n(\nx\n,\ny\n)\n\n\n\n{\\displaystyle \\left(x,y\\right)}\n\n and source points \n\n\n\n\n(\ns\n\nx\n\ni\n\n\n,\ns\n\ny\n\ni\n\n\n)\n\n\n\n{\\displaystyle \\left(sx_{i},sy_{i}\\right)}\n\n, \n\n\n\nϕ\n\n(\n⋅\n)\n\n\n\n{\\displaystyle \\phi \\left(\\cdot \\right)}\n\n is the fundamental solution which satisfies\nwhere \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n denotes Dirac delta function, and \n\n\n\n\n\n\nα\n\n\ni\n\n\n\n\n\n{\\displaystyle {{\\alpha }_{i}}}\n\n are the unknown coefficients.\nWith the source points located outside the physical domain, the MFS avoid the fundamental solution singularity. Substituting the approximation into boundary condition yields the following matrix equation\nwhere \n\n\n\n\n(\n\nx\n\ni\n\n\n,\n\ny\n\ni\n\n\n)\n\n\n\n{\\displaystyle \\left(x_{i},y_{i}\\right)}\n\n and \n\n\n\n\n(\n\nx\n\nk\n\n\n,\n\ny\n\nk\n\n\n)\n\n\n\n{\\displaystyle \\left(x_{k},y_{k}\\right)}\n\n denote the collocation points, respectively, on Dirichlet and Neumann boundaries. The unknown coefficients \n\n\n\n\nα\n\ni\n\n\n\n\n{\\displaystyle \\alpha _{i}}\n\n can uniquely be determined by the above algebraic equation. And then we can evaluate numerical solution at any location in physical domain.\nThe ideas behind the MFS have been around for a few decades and were developed primarily by V. D. Kupradze and M. A. Alexidze in the late 1950s and early 1960s.[1] However, the method was proposed as a computational technique much later by R. Mathon and R. L. Johnston in the late 1970s,[2] followed by a number of papers by Mathon, Johnston and Graeme Fairweather with applications. Slowly but surely the MFS becomes a useful tool for the solution of a large variety of physical and engineering problems.[3][4][5][6]\nA major obstacle was overcome when, in the 1990s, M. A. Golberg and C. S. Chen extended the MFS to deal with inhomogeneous equations and time-dependent problems.[7][8] Recent developments indicate that the MFS can be used to solve partial differential equations with variable coefficients.[9] The MFS has proved particularly effective for certain classes of problems such as inverse,[10] unbounded domain, and free-boundary problems.[11]\nSome new techniques have recently been developed to cure the fictitious boundary problem in the MFS, such as the boundary knot method, singular boundary method, and regularized meshless method.", 
    "dbpedia_url": "http://dbpedia.org/resource/Method_of_fundamental_solutions", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Method_of_fundamental_solutions\n"
}