{
    "about": "Microarray analysis techniques are used in interpreting the data generated from experiments on DNA, RNA, and protein microarrays, which allow researchers to investigate the expression state of a large number of genes - in many cases, an organism's entire genome - in a single experiment.[citation needed] Such experiments can generate very large volumes of data, allowing researchers to assess the overall state of a cell or organism. These large data amount can be difficult to analyze, especially in the absence of good gene annotation.", 
    "name": "Microarray Analysis Techniques", 
    "classification": "Bioinformatics Algorithms", 
    "full_text": "Microarray analysis techniques are used in interpreting the data generated from experiments on DNA, RNA, and protein microarrays, which allow researchers to investigate the expression state of a large number of genes - in many cases, an organism's entire genome - in a single experiment.[citation needed] Such experiments can generate very large volumes of data, allowing researchers to assess the overall state of a cell or organism. These large data amount can be difficult to analyze, especially in the absence of good gene annotation.\n\n\nMicroarray data analysis involves several distinct steps, as outlined below. Changing any one of the steps will change the outcome of the analysis, so the MAQC Project[1] was created to identify a set of standard strategies. Companies exist that use the MAQC protocols to perform a complete analysis.[2]\nMost microarray manufacturers, such as Affymetrix and Agilent,[3] provide commercial data analysis software with microarray equipment such as plate readers.\nDepending on the type of array, signal related to nonspecific binding of the fluorophore can be subtracted to achieve better results. One approach involves subtracting the average signal intensity of the area between spots. A variety of tools for background correction and further analysis are available from TIGR,[4] Agilent (GeneSpring),[5] and Ocimum Bio Solutions (Genowiz).[6]\nEntire arrays may have obvious flaws detectable by visual inspection, pairwise comparisons to arrays in the same experimental group, or by analysis of RNA degradation.[7] Results may improve by removing these arrays from the analysis entirely.\nVisual identification of local artifacts, such as printing or washing defects, may likewise suggest the removal of individual spots. This can take a substantial amount of time depending on the quality of array manufacture. In addition, some procedures call for the elimination of all spots with an expression value below a certain intensity threshold.\nComparing two different arrays, or two different samples hybridized to the same array generally involves making adjustments for systematic errors introduced by differences in procedures and dye intensity effects. Dye normalization for two color arrays is often achieved by local regression. LIMMA provides a set of tools for background correction and scaling, as well as an option to average on-slide duplicate spots.[8] A common method for evaluating how well normalized an array is, is to plot an MA plot of the data.\nRaw Affy data contains about twenty probes for the same RNA target. Half of these are \"mismatch spots\", which do not precisely match the target sequence. These can theoretically measure the amount of nonspecific binding for a given target. Robust Multi-array Average (RMA) [9] is a normalization approach that does not take advantage of these mismatch spots, but still must summarize the perfect matches through median polish.[10] The median polish algorithm, although robust, behaves differently depending on the number of samples analyzed.[11] Quantile normalization, also part of RMA, is one sensible approach to normalize a batch of arrays in order to make further comparisons meaningful.\nThe current Affymetrix MAS5 algorithm, which uses both perfect match and mismatch probes, continues to enjoy popularity and do well in head to head tests.[12]\nFactor Analysis for Robust Microarray Summarization (FARMS)[13] is a model-based technique for summarizing array data at perfect match probe level. It is based on a factor analysis model for which a Bayesian maximum a posteriori method optimizes the model parameters under the assumption of Gaussian measurement noise. According to the Affycomp benchmark[14] FARMS outperformed all other summarizations methods with respect to sensitivity and specificity.\nMany strategies exist to identify which array probes show an unusual level of over expression or under expression. The simplest one is to call \"significant\" any probe that differs by an average of at least twofold between treatment groups. More sophisticated approaches are often related to t-tests or other mechanisms that take both effect size and variability into account. Curiously, the p-values associated with particular genes do not reproduce well between replicate experiments, and lists generated by straight fold change perform much better.[15][16] This represents an extremely important observation, since the point of performing experiments has to do with predicting general behavior. The MAQC group recommends using a fold change assessment plus a non-stringent p-value cutoff, further pointing out that changes in the background correction and scaling process have only a minimal impact on the rank order of fold change differences, but a substantial impact on p-values.\nCommercial systems for gene network analysis such as Ingenuity[17] and Pathway studio[18] create visual representations of differentially expressed genes based on current scientific literature. Non-commercial tools such as FunRich,[19] GenMAPP and Moksiskaan also aid in organizing and visualizing gene network data procured from one or several microarray experiments. A wide variety of microarray analysis tools are available through Bioconductor written in the R programming language. The frequently cited SAM Excel module and other microarray tools[20] are available through Stanford University. Another set is available from Harvard and MIT.[21]\nSpecialized software tools for statistical analysis to determine the extent of over- or under-expression of a gene in a microarray experiment relative to a reference state have also been developed to aid in identifying genes or gene sets associated with particular phenotypes. One such method of analysis, known as Gene Set Enrichment Analysis (GSEA), uses a Kolmogorov-Smirnov-style statistic to identify groups of genes that are regulated together.[22] This third-party statistics package offers the user information on the genes or gene sets of interest, including links to entries in databases such as NCBI's GenBank and curated databases such as Biocarta[23] and Gene Ontology. Protein complex enrichment analysis tool (COMPLEAT) provides similar enrichment analysis at the level of protein complexes.[24] The tool can identify the dynamic protein complex regulation under different condition or time points. Related system, PAINT[25] and SCOPE[26] performs a statistical analysis on gene promoter regions, identifying over and under representation of previously identified transcription factor response elements. Another statistical analysis tool is Rank Sum Statistics for Gene Set Collections (RssGsc), which uses rank sum probability distribution functions to find gene sets that explain experimental data.[27] A further approach is contextual meta-analysis, i.e. finding out how a gene cluster responds to a variety of experimental contexts. Genevestigator is a public tool to perform contextual meta-analysis across contexts such as anatomical parts, stages of development, and response to diseases, chemicals, stresses, and neoplasms.", 
    "dbpedia_url": "http://dbpedia.org/resource/Microarray_analysis_techniques", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Microarray_analysis_techniques\n"
}