{
    "about": "In statistics and signal processing, a minimum mean square error (MMSE) estimator is an estimation method which minimizes the mean square error (MSE), which is a common measure of estimator quality, of the fitted values of a dependent variable. In the Bayesian setting, the term MMSE more specifically refers to estimation with quadratic loss function. In such case, the MMSE estimator is given by the posterior mean of the parameter to be estimated. Since the posterior mean is cumbersome to calculate, the form of the MMSE estimator is usually constrained to be within a certain class of functions. Linear MMSE estimators are a popular choice since they are easy to use, calculate, and very versatile. It has given rise to many popular estimators such as the Wiener-Kolmogorov filter and Kalman filter.", 
    "name": "Minimum Mean Square Error", 
    "classification": "Signal Processing", 
    "full_text": "In statistics and signal processing, a minimum mean square error (MMSE) estimator is an estimation method which minimizes the mean square error (MSE), which is a common measure of estimator quality, of the fitted values of a dependent variable. In the Bayesian setting, the term MMSE more specifically refers to estimation with quadratic loss function. In such case, the MMSE estimator is given by the posterior mean of the parameter to be estimated. Since the posterior mean is cumbersome to calculate, the form of the MMSE estimator is usually constrained to be within a certain class of functions. Linear MMSE estimators are a popular choice since they are easy to use, calculate, and very versatile. It has given rise to many popular estimators such as the Wiener-Kolmogorov filter and Kalman filter.\n\n\nThe term MMSE more specifically refers to estimation in a Bayesian setting with quadratic cost function. The basic idea behind the Bayesian approach to estimation stems from practical situations where we often have some prior information about the parameter to be estimated. For instance, we may have prior information about the range that the parameter can assume; or we may have an old estimate of the parameter that we want to modify when a new observation is made available; or the statistics of an actual random signal such as speech. This is in contrast to the non-Bayesian approach like minimum-variance unbiased estimator (MVUE) where absolutely nothing is assumed to be known about the parameter in advance and which does not account for such situations. In the Bayesian approach, such prior information is captured by the prior probability density function of the parameters; and based directly on Bayes theorem, it allows us to make better posterior estimates as more observations become available. Thus unlike non-Bayesian approach where parameters of interest are assumed to be deterministic, but unknown constants, the Bayesian estimator seeks to estimate a parameter that is itself a random variable. Furthermore, Bayesian estimation can also deal with situations where the sequence of observations are not necessarily independent. Thus Bayesian estimation provides yet another alternative to the MVUE. This is useful when the MVUE does not exist or cannot be found.\nLet \n\n\n\nx\n\n\n{\\displaystyle x}\n\n be a \n\n\n\nn\n×\n1\n\n\n{\\displaystyle n\\times 1}\n\n hidden random vector variable, and let \n\n\n\ny\n\n\n{\\displaystyle y}\n\n be a \n\n\n\nm\n×\n1\n\n\n{\\displaystyle m\\times 1}\n\n known random vector variable (the measurement or observation), both of them not necessarily of the same dimension. An estimator \n\n\n\n\n\n\nx\n^\n\n\n\n(\ny\n)\n\n\n{\\displaystyle {\\hat {x}}(y)}\n\n of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is any function of the measurement \n\n\n\ny\n\n\n{\\displaystyle y}\n\n. The estimation error vector is given by \n\n\n\ne\n=\n\n\n\nx\n^\n\n\n\n−\nx\n\n\n{\\displaystyle e={\\hat {x}}-x}\n\n and its mean squared error (MSE) is given by the trace of error covariance matrix\nwhere the expectation \n\n\n\n\nE\n\n\n\n{\\displaystyle \\mathrm {E} }\n\n is taken over both \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\ny\n\n\n{\\displaystyle y}\n\n. When \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is a scalar variable, the MSE expression simplifies to \n\n\n\n\nE\n\n\n{\n(\n\n\n\nx\n^\n\n\n\n−\nx\n\n)\n\n2\n\n\n}\n\n\n\n{\\displaystyle \\mathrm {E} \\left\\{({\\hat {x}}-x)^{2}\\right\\}}\n\n. Note that MSE can equivalently be defined in other ways, since\nThe MMSE estimator is then defined as the estimator achieving minimal MSE:\nIn many cases, it is not possible to determine the analytical expression of the MMSE estimator. Two basic numerical approaches to obtain the MMSE estimate depends on either finding the conditional expectation \n\n\n\n\nE\n\n{\nx\n\n|\n\ny\n}\n\n\n{\\displaystyle \\mathrm {E} \\{x|y\\}}\n\n or finding the minima of MSE. Direct numerical evaluation of the conditional expectation is computationally expensive, since they often require multidimensional integration usually done via Monte Carlo methods. Another computational approach is to directly seek the minima of the MSE using techniques such as the gradient descent methods; but this method still requires the evaluation of expectation. While these numerical methods have been fruitful, a closed form expression for the MMSE estimator is nevertheless possible if we are willing to make some compromises.\nOne possibility is to abandon the full optimality requirements and seek a technique minimizing the MSE within a particular class of estimators, such as the class of linear estimators. Thus we postulate that the conditional expectation of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n given \n\n\n\ny\n\n\n{\\displaystyle y}\n\n is a simple linear function of \n\n\n\ny\n\n\n{\\displaystyle y}\n\n, \n\n\n\n\nE\n\n{\nx\n\n|\n\ny\n}\n=\nW\ny\n+\nb\n\n\n{\\displaystyle \\mathrm {E} \\{x|y\\}=Wy+b}\n\n, where the measurement \n\n\n\ny\n\n\n{\\displaystyle y}\n\n is a random vector, \n\n\n\nW\n\n\n{\\displaystyle W}\n\n is a matrix and \n\n\n\nb\n\n\n{\\displaystyle b}\n\n is a vector. This can be seen as the first order Taylor approximation of \n\n\n\n\nE\n\n{\nx\n\n|\n\ny\n}\n\n\n{\\displaystyle \\mathrm {E} \\{x|y\\}}\n\n. The linear MMSE estimator is the estimator achieving minimum MSE among all estimators of such form. That is, it solves the following the optimization problem:\nOne advantage of such linear MMSE estimator is that it is not necessary to explicitly calculate the posterior probability density function of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n. Such linear estimator only depends on the first two moments of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\ny\n\n\n{\\displaystyle y}\n\n. So although it may be convenient to assume that \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\ny\n\n\n{\\displaystyle y}\n\n are jointly Gaussian, it is not necessary to make this assumption, so long as the assumed distribution has well defined first and second moments. The form of the linear estimator does not depend on the type of the assumed underlying distribution.\nThe expression for optimal \n\n\n\nb\n\n\n{\\displaystyle b}\n\n and \n\n\n\nW\n\n\n{\\displaystyle W}\n\n is given by\nwhere \n\n\n\n\n\n\nx\n¯\n\n\n\n=\n\nE\n\n{\nx\n}\n\n\n{\\displaystyle {\\bar {x}}=\\mathrm {E} \\{x\\}}\n\n, \n\n\n\n\n\n\ny\n¯\n\n\n\n=\n\nE\n\n{\ny\n}\n,\n\n\n{\\displaystyle {\\bar {y}}=\\mathrm {E} \\{y\\},}\n\n the \n\n\n\n\nC\n\nX\nY\n\n\n\n\n{\\displaystyle C_{XY}}\n\n is cross-covariance matrix between \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\ny\n\n\n{\\displaystyle y}\n\n, the \n\n\n\n\nC\n\nY\n\n\n\n\n{\\displaystyle C_{Y}}\n\n is auto-covariance matrix of \n\n\n\ny\n\n\n{\\displaystyle y}\n\n.\nThus the expression for linear MMSE estimator, its mean, and its auto-covariance is given by\nwhere the \n\n\n\n\nC\n\nY\nX\n\n\n\n\n{\\displaystyle C_{YX}}\n\n is cross-covariance matrix between \n\n\n\ny\n\n\n{\\displaystyle y}\n\n and \n\n\n\nx\n\n\n{\\displaystyle x}\n\n.\nLastly, the error covariance and minimum mean square error achievable by such estimator is\nFor the special case when both \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\ny\n\n\n{\\displaystyle y}\n\n are scalars, the above relations simplify to\nLet us have the optimal linear MMSE estimator given as \n\n\n\n\n\n\nx\n^\n\n\n\n=\nW\ny\n+\nb\n\n\n{\\displaystyle {\\hat {x}}=Wy+b}\n\n, where we are required to find the expression for \n\n\n\nW\n\n\n{\\displaystyle W}\n\n and \n\n\n\nb\n\n\n{\\displaystyle b}\n\n. It is required that the MMSE estimator be unbiased. This means,\nPlugging the expression for \n\n\n\n\n\n\nx\n^\n\n\n\n\n\n{\\displaystyle {\\hat {x}}}\n\n in above, we get\nwhere \n\n\n\n\n\n\nx\n¯\n\n\n\n=\n\nE\n\n{\nx\n}\n\n\n{\\displaystyle {\\bar {x}}=\\mathrm {E} \\{x\\}}\n\n and \n\n\n\n\n\n\ny\n¯\n\n\n\n=\n\nE\n\n{\ny\n}\n\n\n{\\displaystyle {\\bar {y}}=\\mathrm {E} \\{y\\}}\n\n. Thus we can re-write the estimator as\nand the expression for estimation error becomes\nFrom the orthogonality principle, we can have \n\n\n\n\nE\n\n{\n(\n\n\n\nx\n^\n\n\n\n−\nx\n)\n(\ny\n−\n\n\n\ny\n¯\n\n\n\n\n)\n\nT\n\n\n}\n=\n0\n\n\n{\\displaystyle \\mathrm {E} \\{({\\hat {x}}-x)(y-{\\bar {y}})^{T}\\}=0}\n\n, where we take \n\n\n\ng\n(\ny\n)\n=\ny\n−\n\n\n\ny\n¯\n\n\n\n\n\n{\\displaystyle g(y)=y-{\\bar {y}}}\n\n. Here the left hand side term is\nWhen equated to zero, we obtain the desired expression for \n\n\n\nW\n\n\n{\\displaystyle W}\n\n as\nThe \n\n\n\n\nC\n\nX\nY\n\n\n\n\n{\\displaystyle C_{XY}}\n\n is cross-covariance matrix between X and Y, and \n\n\n\n\nC\n\nY\n\n\n\n\n{\\displaystyle C_{Y}}\n\n is auto-covariance matrix of Y. Since \n\n\n\n\nC\n\nX\nY\n\n\n=\n\nC\n\nY\nX\n\n\nT\n\n\n\n\n{\\displaystyle C_{XY}=C_{YX}^{T}}\n\n, the expression can also be re-written in terms of \n\n\n\n\nC\n\nY\nX\n\n\n\n\n{\\displaystyle C_{YX}}\n\n as\nThus the full expression for the linear MMSE estimator is\nSince the estimate \n\n\n\n\n\n\nx\n^\n\n\n\n\n\n{\\displaystyle {\\hat {x}}}\n\n is itself a random variable with \n\n\n\n\nE\n\n{\n\n\n\nx\n^\n\n\n\n}\n=\n\n\n\nx\n¯\n\n\n\n\n\n{\\displaystyle \\mathrm {E} \\{{\\hat {x}}\\}={\\bar {x}}}\n\n, we can also obtain its auto-covariance as\nPutting the expression for \n\n\n\nW\n\n\n{\\displaystyle W}\n\n and \n\n\n\n\nW\n\nT\n\n\n\n\n{\\displaystyle W^{T}}\n\n, we get\nLastly, the covariance of linear MMSE estimation error will then be given by\nThe first term in the third line is zero due to the orthogonality principle. Since \n\n\n\nW\n=\n\nC\n\nX\nY\n\n\n\nC\n\nY\n\n\n−\n1\n\n\n\n\n{\\displaystyle W=C_{XY}C_{Y}^{-1}}\n\n, we can re-write \n\n\n\n\nC\n\ne\n\n\n\n\n{\\displaystyle C_{e}}\n\n in terms of covariance matrices as\nThis we can recognize to be the same as \n\n\n\n\nC\n\ne\n\n\n=\n\nC\n\nX\n\n\n−\n\nC\n\n\n\nX\n^\n\n\n\n\n.\n\n\n{\\displaystyle C_{e}=C_{X}-C_{\\hat {X}}.}\n\n Thus the minimum mean square error achievable by such a linear estimator is\nStandard method like Gauss elimination can be used to solve the matrix equation for \n\n\n\nW\n\n\n{\\displaystyle W}\n\n. A more numerically stable method is provided by QR decomposition method. Since the matrix \n\n\n\n\nC\n\nY\n\n\n\n\n{\\displaystyle C_{Y}}\n\n is a symmetric positive definite matrix, \n\n\n\nW\n\n\n{\\displaystyle W}\n\n can be solved twice as fast with the Cholesky decomposition, while for large sparse systems conjugate gradient method is more effective. Levinson recursion is a fast method when \n\n\n\n\nC\n\nY\n\n\n\n\n{\\displaystyle C_{Y}}\n\n is also a Toeplitz matrix. This can happen when \n\n\n\ny\n\n\n{\\displaystyle y}\n\n is a wide sense stationary process. In such stationary cases, these estimators are also referred to as Wiener-Kolmogorov filters.\nLet us further model the underlying process of observation as a linear process: \n\n\n\ny\n=\nA\nx\n+\nz\n\n\n{\\displaystyle y=Ax+z}\n\n, where \n\n\n\nA\n\n\n{\\displaystyle A}\n\n is a known matrix and \n\n\n\nz\n\n\n{\\displaystyle z}\n\n is random noise vector with the mean \n\n\n\n\nE\n\n{\nz\n}\n=\n0\n\n\n{\\displaystyle \\mathrm {E} \\{z\\}=0}\n\n and cross-covariance \n\n\n\n\nC\n\nX\nZ\n\n\n=\n0\n\n\n{\\displaystyle C_{XZ}=0}\n\n. Here the required mean and the covariance matrices will be\nThus the expression for the linear MMSE estimator matrix \n\n\n\nW\n\n\n{\\displaystyle W}\n\n further modifies to\nPutting everything into the expression for \n\n\n\n\n\n\nx\n^\n\n\n\n\n\n{\\displaystyle {\\hat {x}}}\n\n, we get\nLastly, the error covariance is\nThe significant difference between the estimation problem treated above and those of least squares and Gauss-Markov estimate is that the number of observations m, (i.e. the dimension of \n\n\n\ny\n\n\n{\\displaystyle y}\n\n) need not be at least as large as the number of unknowns, n, (i.e. the dimension of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n). The estimate for the linear observation process exists so long as the m-by-m matrix \n\n\n\n(\nA\n\nC\n\nX\n\n\n\nA\n\nT\n\n\n+\n\nC\n\nZ\n\n\n\n)\n\n−\n1\n\n\n\n\n{\\displaystyle (AC_{X}A^{T}+C_{Z})^{-1}}\n\n exists; this is the case for any m if, for instance, \n\n\n\n\nC\n\nZ\n\n\n\n\n{\\displaystyle C_{Z}}\n\n is positive definite. Physically the reason for this property is that since \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is now a random variable, it is possible to form a meaningful estimate (namely its mean) even with no measurements. Every new measurement simply provides additional information which may modify our original estimate. Another feature of this estimate is that for m < n, there need be no measurement error. Thus, we may have \n\n\n\n\nC\n\nZ\n\n\n=\n0\n\n\n{\\displaystyle C_{Z}=0}\n\n, because as long as \n\n\n\nA\n\nC\n\nX\n\n\n\nA\n\nT\n\n\n\n\n{\\displaystyle AC_{X}A^{T}}\n\n is positive definite, the estimate still exists. Lastly, this technique can handle cases where the noise is correlated.\nAn alternative form of expression can be obtained by using the matrix identity\nwhich can be established by post-multiplying by \n\n\n\n(\nA\n\nC\n\nX\n\n\n\nA\n\nT\n\n\n+\n\nC\n\nZ\n\n\n)\n\n\n{\\displaystyle (AC_{X}A^{T}+C_{Z})}\n\n and pre-multiplying by \n\n\n\n(\n\nA\n\nT\n\n\n\nC\n\nZ\n\n\n−\n1\n\n\nA\n+\n\nC\n\nX\n\n\n−\n1\n\n\n)\n,\n\n\n{\\displaystyle (A^{T}C_{Z}^{-1}A+C_{X}^{-1}),}\n\n to obtain\nand\nSince \n\n\n\nW\n\n\n{\\displaystyle W}\n\n can now be written in terms of \n\n\n\n\nC\n\ne\n\n\n\n\n{\\displaystyle C_{e}}\n\n as \n\n\n\nW\n=\n\nC\n\ne\n\n\n\nA\n\nT\n\n\n\nC\n\nZ\n\n\n−\n1\n\n\n\n\n{\\displaystyle W=C_{e}A^{T}C_{Z}^{-1}}\n\n, we get a simplified expression for \n\n\n\n\n\n\nx\n^\n\n\n\n\n\n{\\displaystyle {\\hat {x}}}\n\n as\nIn this form the above expression can be easily compared with weighed least square and Gauss-Markov estimate. In particular, when \n\n\n\n\nC\n\nX\n\n\n−\n1\n\n\n=\n0\n\n\n{\\displaystyle C_{X}^{-1}=0}\n\n, corresponding to infinite variance of the apriori information concerning \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, the result \n\n\n\nW\n=\n(\n\nA\n\nT\n\n\n\nC\n\nZ\n\n\n−\n1\n\n\nA\n\n)\n\n−\n1\n\n\n\nA\n\nT\n\n\n\nC\n\nZ\n\n\n−\n1\n\n\n\n\n{\\displaystyle W=(A^{T}C_{Z}^{-1}A)^{-1}A^{T}C_{Z}^{-1}}\n\n is identical to the weighed linear least square estimate with \n\n\n\n\nC\n\nZ\n\n\n−\n1\n\n\n\n\n{\\displaystyle C_{Z}^{-1}}\n\n as the weight matrix. Moreover, if the components of \n\n\n\nz\n\n\n{\\displaystyle z}\n\n are uncorrelated and have equal variance such that \n\n\n\n\nC\n\nZ\n\n\n=\n\nσ\n\n2\n\n\nI\n,\n\n\n{\\displaystyle C_{Z}=\\sigma ^{2}I,}\n\n where \n\n\n\nI\n\n\n{\\displaystyle I}\n\n is an identity matrix, then \n\n\n\nW\n=\n(\n\nA\n\nT\n\n\nA\n\n)\n\n−\n1\n\n\n\nA\n\nT\n\n\n\n\n{\\displaystyle W=(A^{T}A)^{-1}A^{T}}\n\n is identical to the ordinary least square estimate.\nIn many real-time application, observational data is not available in a single batch. Instead the observations are made in a sequence. A naive application of previous formulas would have us discard an old estimate and recompute a new estimate as fresh data is made available. But then we lose all information provided by the old observation. When the observations are scalar quantities, one possible way of avoiding such re-computation is to first concatenate the entire sequence of observations and then apply the standard estimation formula as done in Example 2. But this can be very tedious because as the number of observation increases so does the size of the matrices that need to be inverted and multiplied grow. Also, this method is difficult to extend to the case of vector observations. Another approach to estimation from sequential observations is to simply update an old estimate as additional data becomes available, leading to finer estimates. Thus a recursive method is desired where the new measurements can modify the old estimates. Implicit in these discussions is the assumption that the statistical properties of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n does not change with time. In other words, \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is stationary.\nFor sequential estimation, if we have an estimate \n\n\n\n\n\n\n\nx\n^\n\n\n\n\n1\n\n\n\n\n{\\displaystyle {\\hat {x}}_{1}}\n\n based on measurements generating space \n\n\n\n\nY\n\n1\n\n\n\n\n{\\displaystyle Y_{1}}\n\n, then after receiving another set of measurements, we should subtract out from these measurements that part that could be anticipated from the result of the first measurements. In other words, the updating must be based on that part of the new data which is orthogonal to the old data.\nSuppose an optimal estimate \n\n\n\n\n\n\n\nx\n^\n\n\n\n\n1\n\n\n\n\n{\\displaystyle {\\hat {x}}_{1}}\n\n has been formed on the basis of past measurements and that error covariance matrix is \n\n\n\n\nC\n\n\ne\n\n1\n\n\n\n\n\n\n{\\displaystyle C_{e_{1}}}\n\n. For linear observation processes the best estimate of \n\n\n\ny\n\n\n{\\displaystyle y}\n\n based on past observation, and hence old estimate \n\n\n\n\n\n\n\nx\n^\n\n\n\n\n1\n\n\n\n\n{\\displaystyle {\\hat {x}}_{1}}\n\n, is \n\n\n\n\n\n\ny\n^\n\n\n\n=\nA\n\n\n\n\nx\n^\n\n\n\n\n1\n\n\n\n\n{\\displaystyle {\\hat {y}}=A{\\hat {x}}_{1}}\n\n. Subtracting \n\n\n\n\n\n\ny\n^\n\n\n\n\n\n{\\displaystyle {\\hat {y}}}\n\n from \n\n\n\ny\n\n\n{\\displaystyle y}\n\n, we obtain\nThe new estimate based on additional data is now\nwhere \n\n\n\n\nC\n\nX\n\n\n\nY\n~\n\n\n\n\n\n\n\n{\\displaystyle C_{X{\\tilde {Y}}}}\n\n is the cross-covariance between \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\n\n\n\ny\n~\n\n\n\n\n\n{\\displaystyle {\\tilde {y}}}\n\n and \n\n\n\n\nC\n\n\n\nY\n~\n\n\n\n\n\n\n{\\displaystyle C_{\\tilde {Y}}}\n\n is the auto-covariance of \n\n\n\n\n\n\ny\n~\n\n\n\n.\n\n\n{\\displaystyle {\\tilde {y}}.}\n\n\nUsing the fact that \n\n\n\n\nE\n\n{\n\n\n\ny\n~\n\n\n\n}\n=\n0\n\n\n{\\displaystyle \\mathrm {E} \\{{\\tilde {y}}\\}=0}\n\n and \n\n\n\nx\n=\n\n\n\n\nx\n^\n\n\n\n\n1\n\n\n+\n\ne\n\n1\n\n\n\n\n{\\displaystyle x={\\hat {x}}_{1}+e_{1}}\n\n, we can obtain the covariance matrices in terms of error covariance as\nPutting everything together, we have the new estimate as\nand the new error covariance as\nThe repeated use of the above two equations as more observations become available lead to recursive estimation techniques. The expressions can be more compactly written as\nThe matrix \n\n\n\nK\n\n\n{\\displaystyle K}\n\n is often referred to as the gain factor. The repetition of these three steps as more data becomes available leads to an iterative estimation algorithm. The generalization of this idea to non-stationary cases gives rise to the Kalman filter.\nAs an important special case, an easy to use recursive expression can be derived when at each m-th time instant the underlying linear observation process yields a scalar such that \n\n\n\n\ny\n\nm\n\n\n=\n\na\n\nm\n\n\nT\n\n\n\nx\n\nm\n\n\n+\n\nz\n\nm\n\n\n\n\n{\\displaystyle y_{m}=a_{m}^{T}x_{m}+z_{m}}\n\n, where \n\n\n\n\na\n\nm\n\n\nT\n\n\n\n\n{\\displaystyle a_{m}^{T}}\n\n is 1-by-n known row vector whose values can change with time, \n\n\n\n\nx\n\nm\n\n\n\n\n{\\displaystyle x_{m}}\n\n is n-by-1 random column vector to be estimated, and \n\n\n\n\nz\n\nm\n\n\n\n\n{\\displaystyle z_{m}}\n\n is scalar noise term with variance \n\n\n\n\nσ\n\nm\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{m}^{2}}\n\n. After (m+1)-th observation, the direct use of above recursive equations give the expression for the estimate \n\n\n\n\n\n\n\nx\n^\n\n\n\n\nm\n+\n1\n\n\n\n\n{\\displaystyle {\\hat {x}}_{m+1}}\n\n as:\nwhere \n\n\n\n\ny\n\nm\n+\n1\n\n\n\n\n{\\displaystyle y_{m+1}}\n\n is the new scalar observation and the gain factor \n\n\n\n\nk\n\nm\n+\n1\n\n\n\n\n{\\displaystyle k_{m+1}}\n\n is n-by-1 column vector given by\nThe \n\n\n\n(\n\nC\n\ne\n\n\n\n)\n\nm\n+\n1\n\n\n\n\n{\\displaystyle (C_{e})_{m+1}}\n\n is n-by-n error covariance matrix given by\nHere no matrix inversion is required. Also the gain factor \n\n\n\n\nk\n\nm\n+\n1\n\n\n\n\n{\\displaystyle k_{m+1}}\n\n depends on our confidence in the new data sample, as measured by the noise variance, versus that in the previous data. The initial values of \n\n\n\n\n\n\nx\n^\n\n\n\n\n\n{\\displaystyle {\\hat {x}}}\n\n and \n\n\n\n\nC\n\ne\n\n\n\n\n{\\displaystyle C_{e}}\n\n are taken to be the mean and covariance of the aprior probability density function of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n.\nThis important special case has also given rise to many other iterative methods (or adaptive filters), such as the least mean squares filter and recursive least squares filter, that directly solves the original MSE optimization problem using gradient descent methods. These methods bypass the need for covariance matrices.\nWe shall take a linear prediction problem as an example. Let a linear combination of observed scalar random variables \n\n\n\n\nz\n\n1\n\n\n,\n\nz\n\n2\n\n\n\n\n{\\displaystyle z_{1},z_{2}}\n\n and \n\n\n\n\nz\n\n3\n\n\n\n\n{\\displaystyle z_{3}}\n\n be used to estimate another future scalar random variable \n\n\n\n\nz\n\n4\n\n\n\n\n{\\displaystyle z_{4}}\n\n such that \n\n\n\n\n\n\n\nz\n^\n\n\n\n\n4\n\n\n=\n\n∑\n\ni\n=\n1\n\n\n3\n\n\n\nw\n\ni\n\n\n\nz\n\ni\n\n\n\n\n{\\displaystyle {\\hat {z}}_{4}=\\sum _{i=1}^{3}w_{i}z_{i}}\n\n. If the random variables \n\n\n\nz\n=\n[\n\nz\n\n1\n\n\n,\n\nz\n\n2\n\n\n,\n\nz\n\n3\n\n\n,\n\nz\n\n4\n\n\n\n]\n\nT\n\n\n\n\n{\\displaystyle z=[z_{1},z_{2},z_{3},z_{4}]^{T}}\n\n are real Gaussian random variables with zero mean and its covariance matrix given by\nthen our task is to find the coefficients \n\n\n\n\nw\n\ni\n\n\n\n\n{\\displaystyle w_{i}}\n\n such that it will yield an optimal linear estimate \n\n\n\n\n\n\n\nz\n^\n\n\n\n\n4\n\n\n\n\n{\\displaystyle {\\hat {z}}_{4}}\n\n.\nIn terms of the terminology developed in the previous sections, for this problem we have the observation vector \n\n\n\ny\n=\n[\n\nz\n\n1\n\n\n,\n\nz\n\n2\n\n\n,\n\nz\n\n3\n\n\n\n]\n\nT\n\n\n\n\n{\\displaystyle y=[z_{1},z_{2},z_{3}]^{T}}\n\n, the estimator matrix \n\n\n\nW\n=\n[\n\nw\n\n1\n\n\n,\n\nw\n\n2\n\n\n,\n\nw\n\n3\n\n\n]\n\n\n{\\displaystyle W=[w_{1},w_{2},w_{3}]}\n\n as a row vector, and the estimated variable \n\n\n\nx\n=\n\nz\n\n4\n\n\n\n\n{\\displaystyle x=z_{4}}\n\n as a scalar quantity. The autocorrelation matrix \n\n\n\n\nC\n\nY\n\n\n\n\n{\\displaystyle C_{Y}}\n\n is defined as\nThe cross correlation matrix \n\n\n\n\nC\n\nY\nX\n\n\n\n\n{\\displaystyle C_{YX}}\n\n is defined as\nWe now solve the equation \n\n\n\n\nC\n\nY\n\n\n\nW\n\nT\n\n\n=\n\nC\n\nY\nX\n\n\n\n\n{\\displaystyle C_{Y}W^{T}=C_{YX}}\n\n by inverting \n\n\n\n\nC\n\nY\n\n\n\n\n{\\displaystyle C_{Y}}\n\n and pre-multiplying to get\nSo we have \n\n\n\n\nw\n\n1\n\n\n=\n2.57\n,\n\n\n{\\displaystyle w_{1}=2.57,}\n\n \n\n\n\n\nw\n\n2\n\n\n=\n−\n.142\n,\n\n\n{\\displaystyle w_{2}=-.142,}\n\n and \n\n\n\n\nw\n\n3\n\n\n=\n.5714\n\n\n{\\displaystyle w_{3}=.5714}\n\n as the optimal coefficients for \n\n\n\n\n\n\n\nz\n^\n\n\n\n\n4\n\n\n\n\n{\\displaystyle {\\hat {z}}_{4}}\n\n. Computing the minimum mean square error then gives \n\n\n\n\n\n∥\ne\n∥\n\n\nmin\n\n\n2\n\n\n=\n\nE\n\n[\n\nz\n\n4\n\n\n\nz\n\n4\n\n\n]\n−\nW\n\nC\n\nY\nX\n\n\n=\n15\n−\nW\n\nC\n\nY\nX\n\n\n=\n.2857\n\n\n{\\displaystyle \\left\\Vert e\\right\\Vert _{\\min }^{2}=\\mathrm {E} [z_{4}z_{4}]-WC_{YX}=15-WC_{YX}=.2857}\n\n.[2] Note that it is not necessary to obtain an explicit matrix inverse of \n\n\n\n\nC\n\nY\n\n\n\n\n{\\displaystyle C_{Y}}\n\n to compute the value of \n\n\n\nW\n\n\n{\\displaystyle W}\n\n. The matrix equation can be solved by well known methods such as Gauss elimination method. A shorter, non-numerical example can be found in orthogonality principle.\nConsider a vector \n\n\n\ny\n\n\n{\\displaystyle y}\n\n formed by taking \n\n\n\nN\n\n\n{\\displaystyle N}\n\n observations of a fixed but unknown scalar parameter \n\n\n\nx\n\n\n{\\displaystyle x}\n\n disturbed by white Gaussian noise. We can describe the process by a linear equation \n\n\n\ny\n=\n1\nx\n+\nz\n\n\n{\\displaystyle y=1x+z}\n\n, where \n\n\n\n1\n=\n[\n1\n,\n1\n,\n…\n,\n1\n\n]\n\nT\n\n\n\n\n{\\displaystyle 1=[1,1,\\ldots ,1]^{T}}\n\n. Depending on context it will be clear if \n\n\n\n1\n\n\n{\\displaystyle 1}\n\n represents a scalar or a vector. Suppose that we know \n\n\n\n[\n−\n\nx\n\n0\n\n\n,\n\nx\n\n0\n\n\n]\n\n\n{\\displaystyle [-x_{0},x_{0}]}\n\n to be the range within which the value of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is going to fall in. We can model our uncertainty of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n by an aprior uniform distribution over an interval \n\n\n\n[\n−\n\nx\n\n0\n\n\n,\n\nx\n\n0\n\n\n]\n\n\n{\\displaystyle [-x_{0},x_{0}]}\n\n, and thus \n\n\n\nx\n\n\n{\\displaystyle x}\n\n will have variance of \n\n\n\n\nσ\n\nX\n\n\n2\n\n\n=\n\nx\n\n0\n\n\n2\n\n\n\n/\n\n3.\n\n\n{\\displaystyle \\sigma _{X}^{2}=x_{0}^{2}/3.}\n\n. Let the noise vector \n\n\n\nz\n\n\n{\\displaystyle z}\n\n be normally distributed as \n\n\n\nN\n(\n0\n,\n\nσ\n\nZ\n\n\n2\n\n\nI\n)\n\n\n{\\displaystyle N(0,\\sigma _{Z}^{2}I)}\n\n where \n\n\n\nI\n\n\n{\\displaystyle I}\n\n is an identity matrix. Also \n\n\n\nx\n\n\n{\\displaystyle x}\n\n and \n\n\n\nz\n\n\n{\\displaystyle z}\n\n are independent and \n\n\n\n\nC\n\nX\nZ\n\n\n=\n0\n\n\n{\\displaystyle C_{XZ}=0}\n\n. It is easy to see that\nThus, the linear MMSE estimator is given by\nWe can simplify the expression by using the alternative form for \n\n\n\nW\n\n\n{\\displaystyle W}\n\n as\nwhere for \n\n\n\ny\n=\n[\n\ny\n\n1\n\n\n,\n\ny\n\n2\n\n\n,\n…\n,\n\ny\n\nN\n\n\n\n]\n\nT\n\n\n\n\n{\\displaystyle y=[y_{1},y_{2},\\ldots ,y_{N}]^{T}}\n\n we have \n\n\n\n\n\n\ny\n¯\n\n\n\n=\n\n\n\n\n1\n\nT\n\n\ny\n\nN\n\n\n=\n\n\n\n\n∑\n\ni\n=\n1\n\n\nN\n\n\n\ny\n\ni\n\n\n\nN\n\n\n.\n\n\n{\\displaystyle {\\bar {y}}={\\frac {1^{T}y}{N}}={\\frac {\\sum _{i=1}^{N}y_{i}}{N}}.}\n\n\nSimilarly, the variance of the estimator is\nThus the MMSE of this linear estimator is\nFor very large \n\n\n\nN\n\n\n{\\displaystyle N}\n\n, we see that the MMSE estimator of a scalar with uniform aprior distribution can be approximated by the arithmetic average of all the observed data\nwhile the variance will be unaffected by data \n\n\n\n\nσ\n\n\n\nX\n^\n\n\n\n\n2\n\n\n=\n\nσ\n\nX\n\n\n2\n\n\n,\n\n\n{\\displaystyle \\sigma _{\\hat {X}}^{2}=\\sigma _{X}^{2},}\n\n and the LMMSE of the estimate will tend to zero.\nHowever, the estimator is suboptimal since it is constrained to be linear. Had the random variable \n\n\n\nx\n\n\n{\\displaystyle x}\n\n also been Gaussian, then the estimator would have been optimal. Notice, that the form of the estimator will remain unchanged, regardless of the apriori distribution of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, so long as the mean and variance of these distributions are the same.\nConsider a variation of the above example: Two candidates are standing for an election. Let the fraction of votes that a candidate will receive on an election day be \n\n\n\nx\n∈\n[\n0\n,\n1\n]\n.\n\n\n{\\displaystyle x\\in [0,1].}\n\n Thus the fraction of votes the other candidate will receive will be \n\n\n\n1\n−\nx\n.\n\n\n{\\displaystyle 1-x.}\n\n We shall take \n\n\n\nx\n\n\n{\\displaystyle x}\n\n as a random variable with a uniform prior distribution over \n\n\n\n[\n0\n,\n1\n]\n\n\n{\\displaystyle [0,1]}\n\n so that its mean is \n\n\n\n\n\n\nx\n¯\n\n\n\n=\n1\n\n/\n\n2\n\n\n{\\displaystyle {\\bar {x}}=1/2}\n\n and variance is \n\n\n\n\nσ\n\nX\n\n\n2\n\n\n=\n1\n\n/\n\n12.\n\n\n{\\displaystyle \\sigma _{X}^{2}=1/12.}\n\n A few weeks before the election, two independent public opinion polls were conducted by two different pollsters. The first poll revealed that the candidate is likely to get \n\n\n\n\ny\n\n1\n\n\n\n\n{\\displaystyle y_{1}}\n\n fraction of votes. Since some error is always present due to finite sampling and the particular polling methodology adopted, the first pollster declares their estimate to have an error \n\n\n\n\nz\n\n1\n\n\n\n\n{\\displaystyle z_{1}}\n\n with zero mean and variance \n\n\n\n\nσ\n\n\nZ\n\n1\n\n\n\n\n2\n\n\n.\n\n\n{\\displaystyle \\sigma _{Z_{1}}^{2}.}\n\n Similarly, the second pollster declares their estimate to be \n\n\n\n\ny\n\n2\n\n\n\n\n{\\displaystyle y_{2}}\n\n with an error \n\n\n\n\nz\n\n2\n\n\n\n\n{\\displaystyle z_{2}}\n\n with zero mean and variance \n\n\n\n\nσ\n\n\nZ\n\n2\n\n\n\n\n2\n\n\n.\n\n\n{\\displaystyle \\sigma _{Z_{2}}^{2}.}\n\n Note that except for the mean and variance of the error, the error distribution is unspecified. How should the two polls be combined to obtain the voting prediction for the given candidate?\nAs with previous example, we have\nHere both the \n\n\n\n\nE\n\n{\n\ny\n\n1\n\n\n}\n=\n\nE\n\n{\n\ny\n\n2\n\n\n}\n=\n\n\n\nx\n¯\n\n\n\n=\n1\n\n/\n\n2\n\n\n{\\displaystyle \\mathrm {E} \\{y_{1}\\}=\\mathrm {E} \\{y_{2}\\}={\\bar {x}}=1/2}\n\n. Thus we can obtain the LMMSE estimate as the linear combination of \n\n\n\n\ny\n\n1\n\n\n\n\n{\\displaystyle y_{1}}\n\n and \n\n\n\n\ny\n\n2\n\n\n\n\n{\\displaystyle y_{2}}\n\n as\nwhere the weights are given by\nHere since the denominator term is constant, the poll with lower error is given higher weight in order to predict the election outcome. Lastly, the variance of the prediction is given by\nwhich makes \n\n\n\n\nσ\n\n\n\nX\n^\n\n\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{\\hat {X}}^{2}}\n\n smaller than \n\n\n\n\nσ\n\nX\n\n\n2\n\n\n.\n\n\n{\\displaystyle \\sigma _{X}^{2}.}\n\n\nIn general, if we have \n\n\n\nN\n\n\n{\\displaystyle N}\n\n pollsters, then the weight for i-th pollster is given by \n\n\n\n\nw\n\ni\n\n\n=\n\n\n\n1\n\n/\n\n\nσ\n\n\nZ\n\ni\n\n\n\n\n2\n\n\n\n\n\n∑\n\ni\n=\n1\n\n\nN\n\n\n1\n\n/\n\n\nσ\n\n\nZ\n\ni\n\n\n\n\n2\n\n\n+\n1\n\n/\n\n\nσ\n\nX\n\n\n2\n\n\n\n\n\n\n\n{\\displaystyle w_{i}={\\frac {1/\\sigma _{Z_{i}}^{2}}{\\sum _{i=1}^{N}1/\\sigma _{Z_{i}}^{2}+1/\\sigma _{X}^{2}}}}\n\n\nSuppose that a musician is playing an instrument and that the sound is received by two microphones, each of them located at two different places. Let the attenuation of sound due to distance at each microphone be \n\n\n\n\na\n\n1\n\n\n\n\n{\\displaystyle a_{1}}\n\n and \n\n\n\n\na\n\n2\n\n\n\n\n{\\displaystyle a_{2}}\n\n, which are assumed to be known constants. Similarly, let the noise at each microphone be \n\n\n\n\nz\n\n1\n\n\n\n\n{\\displaystyle z_{1}}\n\n and \n\n\n\n\nz\n\n2\n\n\n\n\n{\\displaystyle z_{2}}\n\n, each with zero mean and variances \n\n\n\n\nσ\n\n\nZ\n\n1\n\n\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{Z_{1}}^{2}}\n\n and \n\n\n\n\nσ\n\n\nZ\n\n2\n\n\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{Z_{2}}^{2}}\n\n respectively. Let \n\n\n\nx\n\n\n{\\displaystyle x}\n\n denote the sound produced by the musician, which is a random variable with zero mean and variance \n\n\n\n\nσ\n\nX\n\n\n2\n\n\n.\n\n\n{\\displaystyle \\sigma _{X}^{2}.}\n\n How should the recorded music from these two microphones be combined, after being synced with each other?\nWe can model the sound received by each microphone as\nHere both the \n\n\n\n\nE\n\n{\n\ny\n\n1\n\n\n}\n=\n\nE\n\n{\n\ny\n\n2\n\n\n}\n=\n0\n\n\n{\\displaystyle \\mathrm {E} \\{y_{1}\\}=\\mathrm {E} \\{y_{2}\\}=0}\n\n. Thus, we can combine the two sounds as\nwhere the i-th weight is given as", 
    "dbpedia_url": "http://dbpedia.org/resource/Minimum_mean_square_error", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Minimum_mean_square_error\n"
}