{
    "about": "In control theory and signal processing, a linear, time-invariant system is said to be minimum-phase if the system and its inverse are causal and stable.[1][2]", 
    "name": "Minimum Phase", 
    "classification": "Digital Signal Processing", 
    "full_text": "In control theory and signal processing, a linear, time-invariant system is said to be minimum-phase if the system and its inverse are causal and stable.[1][2]\nFor example, a discrete-time system with rational transfer function \n\n\n\nH\n(\nz\n)\n\n\n{\\displaystyle H(z)}\n\n can only satisfy causality and stability requirements if all of its poles are inside the unit circle. However, we are free to choose whether the zeros of the system are inside or outside the unit circle. A system with rational transfer function is minimum-phase if all its zeros are also inside the unit circle. Insight is given below as to why this system is called minimum-phase.\n\n\nA system \n\n\n\n\nH\n\n\n\n{\\displaystyle \\mathbb {H} }\n\n is invertible if we can uniquely determine its input from its output. I.e., we can find a system \n\n\n\n\n\nH\n\n\ni\nn\nv\n\n\n\n\n{\\displaystyle \\mathbb {H} _{inv}}\n\n such that if we apply \n\n\n\n\nH\n\n\n\n{\\displaystyle \\mathbb {H} }\n\n followed by \n\n\n\n\n\nH\n\n\ni\nn\nv\n\n\n\n\n{\\displaystyle \\mathbb {H} _{inv}}\n\n, we obtain the identity system \n\n\n\n\nI\n\n\n\n{\\displaystyle \\mathbb {I} }\n\n. (See Inverse matrix for a finite-dimensional analog). I.e.,\nSuppose that \n\n\n\n\n\n\nx\n~\n\n\n\n\n\n{\\displaystyle {\\tilde {x}}}\n\n is input to system \n\n\n\n\nH\n\n\n\n{\\displaystyle \\mathbb {H} }\n\n and gives output \n\n\n\n\n\n\ny\n~\n\n\n\n\n\n{\\displaystyle {\\tilde {y}}}\n\n.\nApplying the inverse system \n\n\n\n\n\nH\n\n\ni\nn\nv\n\n\n\n\n{\\displaystyle \\mathbb {H} _{inv}}\n\n to \n\n\n\n\n\n\ny\n~\n\n\n\n\n\n{\\displaystyle {\\tilde {y}}}\n\n gives the following.\nSo we see that the inverse system \n\n\n\n\n\nH\n\n\ni\nn\nv\n\n\n\n\n{\\displaystyle \\mathbb {H} _{inv}}\n\n allows us to determine uniquely the input \n\n\n\n\n\n\nx\n~\n\n\n\n\n\n{\\displaystyle {\\tilde {x}}}\n\n from the output \n\n\n\n\n\n\ny\n~\n\n\n\n\n\n{\\displaystyle {\\tilde {y}}}\n\n.\nSuppose that the system \n\n\n\n\nH\n\n\n\n{\\displaystyle \\mathbb {H} }\n\n is a discrete-time, linear, time-invariant (LTI) system described by the impulse response \n\n\n\nh\n(\nn\n)\n\n\n{\\displaystyle h(n)}\n\n for n in Z. Additionally, suppose \n\n\n\n\n\nH\n\n\ni\nn\nv\n\n\n\n\n{\\displaystyle \\mathbb {H} _{inv}}\n\n has impulse response \n\n\n\n\nh\n\ni\nn\nv\n\n\n(\nn\n)\n\n\n{\\displaystyle h_{inv}(n)}\n\n. The cascade of two LTI systems is a convolution. In this case, the above relation is the following:\nwhere \n\n\n\nδ\n(\nn\n)\n\n\n{\\displaystyle \\delta (n)}\n\n is the Kronecker delta or the identity system in the discrete-time case. Note that this inverse system \n\n\n\n\n\nH\n\n\ni\nn\nv\n\n\n\n\n{\\displaystyle \\mathbb {H} _{inv}}\n\n need not be unique.\nWhen we impose the constraints of causality and stability, the inverse system is unique; and the system \n\n\n\n\nH\n\n\n\n{\\displaystyle \\mathbb {H} }\n\n and its inverse \n\n\n\n\n\nH\n\n\ni\nn\nv\n\n\n\n\n{\\displaystyle \\mathbb {H} _{inv}}\n\n are called minimum-phase. The causality and stability constraints in the discrete-time case are the following (for time-invariant systems where h is the system's impulse response):\nand\nand\nSee the article on stability for the analogous conditions for the continuous-time case.\nPerforming frequency analysis for the discrete-time case will provide some insight. The time-domain equation is the following.\nApplying the Z-transform gives the following relation in the z-domain.\nFrom this relation, we realize that\nFor simplicity, we consider only the case of a rational transfer function H (z). Causality and stability imply that all poles of H (z) must be strictly inside the unit circle (See stability). Suppose\nwhere A (z) and D (z) are polynomial in z. Causality and stability imply that the poles – the roots of D (z) – must be strictly inside the unit circle. We also know that\nSo, causality and stability for \n\n\n\n\nH\n\ni\nn\nv\n\n\n(\nz\n)\n\n\n{\\displaystyle H_{inv}(z)}\n\n imply that its poles – the roots of A (z) – must be inside the unit circle. These two constraints imply that both the zeros and the poles of a minimum phase system must be strictly inside the unit circle.\nAnalysis for the continuous-time case proceeds in a similar manner except that we use the Laplace transform for frequency analysis. The time-domain equation is the following.\nwhere \n\n\n\nδ\n(\nt\n)\n\n\n{\\displaystyle \\delta (t)}\n\n is the Dirac delta function. The Dirac delta function is the identity operator in the continuous-time case because of the sifting property with any signal x (t).\nApplying the Laplace transform gives the following relation in the s-plane.\nFrom this relation, we realize that\nAgain, for simplicity, we consider only the case of a rational transfer function H(s). Causality and stability imply that all poles of H (s) must be strictly inside the left-half s-plane (See stability). Suppose\nwhere A (s) and D (s) are polynomial in s. Causality and stability imply that the poles – the roots of D (s) – must be inside the left-half s-plane. We also know that\nSo, causality and stability for \n\n\n\n\nH\n\ni\nn\nv\n\n\n(\ns\n)\n\n\n{\\displaystyle H_{inv}(s)}\n\n imply that its poles – the roots of A (s) – must be strictly inside the left-half s-plane. These two constraints imply that both the zeros and the poles of a minimum phase system must be strictly inside the left-half s-plane.\nA minimum-phase system, whether discrete-time or continuous-time, has an additional useful property that the natural logarithm of the magnitude of the frequency response (the \"gain\" measured in nepers which is proportional to dB) is related to the phase angle of the frequency response (measured in radians) by the Hilbert transform. That is, in the continuous-time case, let\nbe the complex frequency response of system H(s). Then, only for a minimum-phase system, the phase response of H(s) is related to the gain by\nand, inversely,\nStated more compactly, let\nwhere \n\n\n\nα\n(\nω\n)\n\n\n{\\displaystyle \\alpha (\\omega )}\n\n and \n\n\n\nϕ\n(\nω\n)\n\n\n{\\displaystyle \\phi (\\omega )}\n\n are real functions of a real variable. Then\nand\nThe Hilbert transform operator is defined to be\nAn equivalent corresponding relationship is also true for discrete-time minimum-phase systems.\nFor all causal and stable systems that have the same magnitude response, the minimum phase system has its energy concentrated near the start of the impulse response. i.e., it minimizes the following function which we can think of as the delay of energy in the impulse response.\nFor all causal and stable systems that have the same magnitude response, the minimum phase system has the minimum group delay. The following proof illustrates this idea of minimum group delay.\nSuppose we consider one zero \n\n\n\na\n\n\n{\\displaystyle a}\n\n of the transfer function \n\n\n\nH\n(\nz\n)\n\n\n{\\displaystyle H(z)}\n\n. Let's place this zero \n\n\n\na\n\n\n{\\displaystyle a}\n\n inside the unit circle (\n\n\n\n\n|\na\n|\n\n<\n1\n\n\n{\\displaystyle \\left|a\\right|<1}\n\n) and see how the group delay is affected.\nSince the zero \n\n\n\na\n\n\n{\\displaystyle a}\n\n contributes the factor \n\n\n\n1\n−\na\n\nz\n\n−\n1\n\n\n\n\n{\\displaystyle 1-az^{-1}}\n\n to the transfer function, the phase contributed by this term is the following.\n\n\n\n\n\nϕ\n\na\n\n\n(\nω\n)\n\n\n{\\displaystyle \\phi _{a}(\\omega )}\n\n contributes the following to the group delay.\nThe denominator and \n\n\n\n\nθ\n\na\n\n\n\n\n{\\displaystyle \\theta _{a}}\n\n are invariant to reflecting the zero \n\n\n\na\n\n\n{\\displaystyle a}\n\n outside of the unit circle, i.e., replacing \n\n\n\na\n\n\n{\\displaystyle a}\n\n with \n\n\n\n(\n\na\n\n−\n1\n\n\n\n)\n\n∗\n\n\n\n\n{\\displaystyle (a^{-1})^{*}}\n\n. However, by reflecting \n\n\n\na\n\n\n{\\displaystyle a}\n\n outside of the unit circle, we increase the magnitude of \n\n\n\n\n|\na\n|\n\n\n\n{\\displaystyle \\left|a\\right|}\n\n in the numerator. Thus, having \n\n\n\na\n\n\n{\\displaystyle a}\n\n inside the unit circle minimizes the group delay contributed by the factor \n\n\n\n1\n−\na\n\nz\n\n−\n1\n\n\n\n\n{\\displaystyle 1-az^{-1}}\n\n. We can extend this result to the general case of more than one zero since the phase of the multiplicative factors of the form \n\n\n\n1\n−\n\na\n\ni\n\n\n\nz\n\n−\n1\n\n\n\n\n{\\displaystyle 1-a_{i}z^{-1}}\n\n is additive. I.e., for a transfer function with \n\n\n\nN\n\n\n{\\displaystyle N}\n\n zeros,\nSo, a minimum phase system with all zeros inside the unit circle minimizes the group delay since the group delay of each individual zero is minimized.\n\nSystems that are causal and stable whose inverses are causal and unstable are known as non-minimum-phase systems. A given non-minimum phase system will have a greater phase contribution than the minimum-phase system with the equivalent magnitude response.\nA maximum-phase system is the opposite of a minimum phase system. A causal and stable LTI system is a maximum-phase system if its inverse is causal and unstable.[dubious – discuss] That is,\nSuch a system is called a maximum-phase system because it has the maximum group delay of the set of systems that have the same magnitude response. In this set of equal-magnitude-response systems, the maximum phase system will have maximum energy delay.\nFor example, the two continuous-time LTI systems described by the transfer functions\nhave equivalent magnitude responses; however, the second system has a much larger contribution to the phase shift. Hence, in this set, the second system is the maximum-phase system and the first system is the minimum-phase system.\nA mixed-phase system has some of its zeros inside the unit circle and has others outside the unit circle. Thus, its group delay is neither minimum or maximum but somewhere between the group delay of the minimum and maximum phase equivalent system.\nFor example, the continuous-time LTI system described by transfer function\nis stable and causal; however, it has zeros on both the left- and right-hand sides of the complex plane. Hence, it is a mixed-phase system.\nA linear-phase system has constant group delay. Non-trivial linear phase or nearly linear phase systems are also mixed phase.", 
    "dbpedia_url": "http://dbpedia.org/resource/Minimum_phase", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Minimum_phase\n"
}