{
    "about": "Mobilegeddon is a name given by webmasters and web-developers to Google's algorithm update of April 21, 2015. The main effect of this update is to give priority to web sites that display well on smartphones and other mobile devices. The change does not affect searches made from a desktop computer or a laptop.[1]", 
    "name": "Mobilegeddon", 
    "classification": "Search Algorithms", 
    "full_text": "Mobilegeddon is a name given by webmasters and web-developers to Google's algorithm update of April 21, 2015. The main effect of this update is to give priority to web sites that display well on smartphones and other mobile devices. The change does not affect searches made from a desktop computer or a laptop.[1]\nGoogle announced its intention to make the change in February 2015.[2] The Economist found the timing \"awkward\" because they said \"It comes less than a week after the European Union accused the firm...\" of anti-competitive behaviors.[3] In addition to their announcement, Google published an article on their Google Developers page to help webmasters with the transition titled \"Mobile Friendly Sites\".[4] Google claims the transition to mobile-friendly sites was to improve user-experience, stating \"the desktop version of a site might be difficult to view and use on a mobile device.\"[4]\nThe protologism is a blend word of \"mobile\" and \"Armageddon\" because the change \"could cause massive disruption to page rankings.\"[5] But, writing for Forbes, Robert Hof says that concerns about the change were \"overblown\" in part because \"Google is providing a test to see if sites look good on smartphones\".[6]\nSearch engine results pages on smartphones now show URLs in \"breadcrumb\" format, as opposed to the previous explicit format.[7]\nBased on their data set, software company Searchmetrics found that the average loss of rankings for the non-mobile friendly sites measured was 0.21 positions on average.[8] Content marketing company BrightEdge has tracked over 20,000 URLs since the update, and is reporting a 21% decrease in non mobile-friendly URLs on the first 3 pages of search results.[9] According to Peter J. Meyers it was “nothing to write home about”.[10]", 
    "dbpedia_url": "http://dbpedia.org/resource/Mobilegeddon", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Mobilegeddon\n"
}