{
    "about": "A Modified Wigner distribution function is a variation of the Wigner distribution function (WD) with reduced or removed cross-terms.", 
    "name": "Modified Wigner Distribution Function", 
    "classification": "Signal Processing", 
    "full_text": "A Modified Wigner distribution function is a variation of the Wigner distribution function (WD) with reduced or removed cross-terms.\nThe Wigner distribution (WD) was first proposed for corrections to classical statistical mechanics in 1932 by Eugene Wigner. The Wigner distribution function, or Wigner–Ville distribution (WVD) for analytic signals, also has applications in time frequency analysis. The Wigner distribution gives better auto term localisation compared to the smeared out spectrogram (SP). However, when applied to a signal with multi frequency components, cross terms appear due to its quadratic nature. Several methods have been proposed to reduce the cross terms. For example, in 1994 L. Stankovic proposed a novel technique, now mostly referred to as S-method, resulting in the reduction or removal of cross terms. The concept of the S-method is a combination between the spectrogram and the Pseudo Wigner Distribution (PWD), the windowed version of the WD.\nThe original WD, the spectrogram, and the modified WDs all belong to the Cohen's class of bilinear time-frequency representations :\nwhere \n\n\n\nΠ\n\n(\nt\n,\nf\n)\n\n\n\n{\\displaystyle \\Pi \\left(t,f\\right)}\n\n is Cohen's kernel function, which is often a low-pass function, and normally serves to mask out the interference in the original Wigner representation.\nCohen's kernel function : \n\n\n\nΠ\n(\nt\n,\nf\n)\n=\n\nδ\n\n(\n0\n,\n0\n)\n\n\n(\nt\n,\nf\n)\n\n\n{\\displaystyle \\Pi (t,f)=\\delta _{(0,0)}(t,f)}\n\n\nwhere \n\n\n\nS\n\nT\n\nx\n\n\n\n\n{\\displaystyle ST_{x}}\n\n is the short-time Fourier transform of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n.\nCohen's kernel function : \n\n\n\nΠ\n(\nt\n,\nf\n)\n=\n\nW\n\nh\n\n\n(\nt\n,\nf\n)\n\n\n{\\displaystyle \\Pi (t,f)=W_{h}(t,f)}\n\n which is the WD of the window function itself. This can be verified by applying the convolution property of the Wigner distribution function.\nThe spectrogram cannot produce interference since it is a positive-valued quadratic distribution.\nCohen's kernel function : \n\n\n\nΠ\n(\nt\n,\nf\n)\n=\n\nδ\n\n0\n\n\n(\nt\n)\n\n\nW\n\nh\n\n\n(\nt\n,\nf\n)\n\n\n{\\displaystyle \\Pi (t,f)=\\delta _{0}(t)\\,W_{h}(t,f)}\n\n which is concentred on the frequency axis.\nNote that the pseudo Wigner can also be written as the Fourier transform of the “spectral-correlation” of the STFT\nIn the pseudo Wigner the time windowing acts as a frequency direction smoothing. Therefore, it suppresses the Wigner distribution interference components that oscillate in the frequency direction. Time direction smoothing can be implemented by a time-convolution of the PWD with a lowpass function \n\n\n\nq\n\n\n{\\displaystyle q}\n\n :\nCohen's kernel function : \n\n\n\nΠ\n(\nt\n,\nf\n)\n=\nq\n(\nt\n)\n\nW\n(\nf\n)\n\n\n{\\displaystyle \\Pi (t,f)=q(t)\\,W(f)}\n\n where \n\n\n\nW\n\n\n{\\displaystyle W}\n\n is the Fourier transform of the window \n\n\n\nw\n\n\n{\\displaystyle w}\n\n.\nThus the kernel corresponding to the smoothed pseudo Wigner distribution has a separable form. Note that even if the SPWD and the S-Method both smoothes the WD in the time domain, they are not equivalent in general.\nCohen's kernel function : \n\n\n\nΠ\n(\nt\n,\nf\n)\n=\ng\n(\nt\n)\n\n\nW\n\nh\n\n\n(\nt\n,\nf\n)\n\n\n{\\displaystyle \\Pi (t,f)=g(t)\\,W_{h}(t,f)}\n\n\nThe S-method limits the range of the integral of the PWD with a low-pass windowing function \n\n\n\ng\n(\nt\n)\n\n\n{\\displaystyle g(t)}\n\n of Fourier transform \n\n\n\nG\n(\nf\n)\n\n\n{\\displaystyle G(f)}\n\n. This results in the cross-term removal, without blurring the auto-terms that are well-concentred along the frequency axis. The S-method strikes a balance in smoothing between the pseudo-Wigner distribution \n\n\n\nP\n\nW\n\nx\n\n\n\n\n{\\displaystyle PW_{x}}\n\n [\n\n\n\ng\n(\nt\n)\n=\n1\n\n\n{\\displaystyle g(t)=1}\n\n] and the power spectrogram \n\n\n\nS\n\nP\n\nx\n\n\n\n\n{\\displaystyle SP_{x}}\n\n [\n\n\n\ng\n(\nt\n)\n=\n\nδ\n\n0\n\n\n(\nt\n)\n\n\n{\\displaystyle g(t)=\\delta _{0}(t)}\n\n].\nNote that in the original 1994 paper, Stankovic defines the S-methode with a modulated version of the short-time Fourier transform :\nwhere\nEven in this case we still have", 
    "dbpedia_url": "http://dbpedia.org/resource/Modified_Wigner_distribution_function", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Modified_Wigner_distribution_function\n"
}