{
    "about": "MoFEM (Mesh Orientated Finite Element Method) is an open source finite element analysis code developed and maintained at the University of Glasgow. MoFEM is tailored for the solution of multi-physics problems with arbitrary levels of approximation, different levels of mesh refinement and optimised for high-performance computing. MoFEM is the blend of the Boost (C++ libraries) MultiIndex containers, MOAB (Mesh Oriented Database) and PETSc (Portable, Extensible Toolkit for Scientific Computation). MoFEM is developed in C++ and it is open-source software under the GNU Lesser General Public License (GPL).", 
    "name": "Mofem Joseph", 
    "classification": "Computational Physics", 
    "full_text": "MoFEM (Mesh Orientated Finite Element Method) is an open source finite element analysis code developed and maintained at the University of Glasgow. MoFEM is tailored for the solution of multi-physics problems with arbitrary levels of approximation, different levels of mesh refinement and optimised for high-performance computing. MoFEM is the blend of the Boost (C++ libraries) MultiIndex containers, MOAB (Mesh Oriented Database) and PETSc (Portable, Extensible Toolkit for Scientific Computation). MoFEM is developed in C++ and it is open-source software under the GNU Lesser General Public License (GPL).\n\n\nBuilding a scientific simulation environment for finite element methods is a complicated task. The longest part of finite element code development is in dealing with technical problems related to software implementation, rather than resolving the underlying physics that the code is intended to tackle.\nThe demand for accurate solutions of increasingly complicated real-world problems means that the underlying data structures also become increasingly complicated. This is particularly evident with multi-physics, hp-adaptivity, and/or evolving geometries (e.g. crack propagation). Established commercial software is often limited in this respect, or can be relatively slow to adopt new innovations. Working around these problems has been the main motivation for the development of MoFEM, recognising that it is increasingly necessary for engineers, scientists and mathematicians to carry out calculations using several mesh refinements, different approximation orders, multiple degrees of freedom and/or different scales.\nMoFEM evolved from YAFEMS (2008), a general and open source finite element code developed at the University of Glasgow.\nIn 2013 YAFEMS was re-written from scratch and named MoFEM. MoFEM was initiated by two projects. EPSRC founded a project for Providing Confidence in Durable Composites (DURACOMP) [1] in a consortium of three institutions: University of Warwick, University of Glasgow, Newcastle University and several industrial partners. The second project was funded by IAA-EPSRC: Simulation of fracture in nuclear graphite: from academic setting to commercial application [2] and EDF Energy.\nMoFEM is free, open source software, released under the GNU Lesser General Public License as published by the Free Software Foundation.[7]", 
    "dbpedia_url": "http://dbpedia.org/resource/MoFEM_JosePH", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/MoFEM_JosePH\n"
}