{
    "about": "Monte Carlo in statistical physics refers to the application of the Monte Carlo method to problems in statistical physics, or statistical mechanics.", 
    "name": "Monte Carlo Method In Statistical Physics", 
    "classification": "Computational Physics", 
    "full_text": "Monte Carlo in statistical physics refers to the application of the Monte Carlo method to problems in statistical physics, or statistical mechanics.\n\n\nThe general motivation to use the Monte Carlo method in statistical physics is to evaluate a multivariable integral. The typical problem begins with a system for which the Hamiltonian is known, it is at a given temperature and it follows the Boltzmann statistics. To obtain the mean value of some macroscopic variable, say A, the general approach is to compute, over all the phase space, PS for simplicity, the mean value of A using the Boltzmann distribution:\n\n\n\n\n⟨\nA\n⟩\n=\n\n∫\n\nP\nS\n\n\n\nA\n\n\n\nr\n→\n\n\n\n\n\n\n\ne\n\n−\nβ\n\nE\n\n\n\nr\n→\n\n\n\n\n\n\nZ\n\n\nd\n\n\n\nr\n→\n\n\n\n\n\n{\\displaystyle \\langle A\\rangle =\\int _{PS}A_{\\vec {r}}{\\frac {e^{-\\beta E_{\\vec {r}}}}{Z}}d{\\vec {r}}}\n\n.\nwhere \n\n\n\nE\n(\n\n\n\nr\n→\n\n\n\n)\n=\n\nE\n\n\n\nr\n→\n\n\n\n\n\n\n{\\displaystyle E({\\vec {r}})=E_{\\vec {r}}}\n\n is the energy of the system for a given state defined by \n\n\n\n\n\n\nr\n→\n\n\n\n\n\n{\\displaystyle {\\vec {r}}}\n\n - a vector with all the degrees of freedom (for instance, for a mechanical system, \n\n\n\n\n\n\nr\n→\n\n\n\n=\n\n(\n\n\n\nq\n→\n\n\n\n,\n\n\n\np\n→\n\n\n\n)\n\n\n\n{\\displaystyle {\\vec {r}}=\\left({\\vec {q}},{\\vec {p}}\\right)}\n\n), \n\n\n\nβ\n≡\n1\n\n/\n\n\nk\n\nb\n\n\nT\n\n\n{\\displaystyle \\beta \\equiv 1/k_{b}T}\n\n and\n\n\n\n\nZ\n=\n\n∫\n\nP\nS\n\n\n\ne\n\n−\nβ\n\nE\n\n\n\nr\n→\n\n\n\n\n\n\nd\n\n\n\nr\n→\n\n\n\n\n\n{\\displaystyle Z=\\int _{PS}e^{-\\beta E_{\\vec {r}}}d{\\vec {r}}}\n\n\nis the partition function.\nOne possible approach to solve this multivariable integral is to exactly enumerate all possible configurations of the system, and calculate averages at will. This is done in exactly solvable systems, and in simulations of simple systems with few particles. In realistic systems, on the other hand, an exact enumeration can be difficult or impossible to implement.\nFor those systems, the Monte Carlo integration (and not to be confused with Monte Carlo method, which is used to simulate molecular chains) is generally employed. The main motivation for its use is the fact that, with the Monte Carlo integration, the error goes as \n\n\n\n1\n\n/\n\n\n\nN\n\n\n\n\n{\\displaystyle 1/{\\sqrt {N}}}\n\n, independently of the dimension of the integral. Another important concept related to the Monte Carlo integration is the importance sampling, a technique that improves the computational time of the simulation.\nIn the following sections, the general implementation of the Monte Carlo integration for solving this kind of problems is discussed.\nAn estimation, under Monte Carlo integration, of an integral defined as\n\n\n\n\n⟨\nA\n⟩\n=\n\n∫\n\nP\nS\n\n\n\nA\n\n\n\nr\n→\n\n\n\n\n\ne\n\n−\nβ\n\nE\n\n\n\nr\n→\n\n\n\n\n\n\nd\n\n\n\nr\n→\n\n\n\n\n/\n\nZ\n\n\n{\\displaystyle \\langle A\\rangle =\\int _{PS}A_{\\vec {r}}e^{-\\beta E_{\\vec {r}}}d{\\vec {r}}/Z}\n\n\nis\n\n\n\n\n⟨\nA\n⟩\n≃\n\n\n1\nN\n\n\n\n∑\n\ni\n=\n1\n\n\nN\n\n\n\nA\n\n\n\n\n\nr\n→\n\n\n\n\ni\n\n\n\n\n\ne\n\n−\nβ\n\nE\n\n\n\n\n\nr\n→\n\n\n\n\ni\n\n\n\n\n\n\n\n/\n\nZ\n\n\n{\\displaystyle \\langle A\\rangle \\simeq {\\frac {1}{N}}\\sum _{i=1}^{N}A_{{\\vec {r}}_{i}}e^{-\\beta E_{{\\vec {r}}_{i}}}/Z}\n\n\nwhere \n\n\n\n\n\n\n\nr\n→\n\n\n\n\ni\n\n\n\n\n{\\displaystyle {\\vec {r}}_{i}}\n\n are uniformly obtained from all the phase space (PS) and N is the number of sampling points (or function evaluations).\nFrom all the phase space, some zones of it are generally more important to the mean of the variable \n\n\n\nA\n\n\n{\\displaystyle A}\n\n than others. In particular, those that have the value of \n\n\n\n\ne\n\n−\nβ\n\nE\n\n\n\n\n\nr\n→\n\n\n\n\ni\n\n\n\n\n\n\n\n\n{\\displaystyle e^{-\\beta E_{{\\vec {r}}_{i}}}}\n\n sufficiently high when compared to the rest of the energy spectra are the most relevant for the integral. Using this fact, the natural question to ask is: is it possible to choose, with more frequency, the states that are known to be more relevant to the integral? The answer is yes, using the importance sampling technique.\nLets assume \n\n\n\np\n(\n\n\n\nr\n→\n\n\n\n)\n\n\n{\\displaystyle p({\\vec {r}})}\n\n is a distribution that chooses the states that are known to be more relevant to the integral.\nThe mean value of \n\n\n\nA\n\n\n{\\displaystyle A}\n\n can be rewritten as\n\n\n\n\n⟨\nA\n⟩\n=\n\n∫\n\nP\nS\n\n\n\np\n\n−\n1\n\n\n(\n\n\n\nr\n→\n\n\n\n)\n\n\n\nA\n\n\n\nr\n→\n\n\n\n\n\n\np\n\n−\n1\n\n\n(\n\n\n\nr\n→\n\n\n\n)\n\n\n\n\ne\n\n−\nβ\n\nE\n\n\n\nr\n→\n\n\n\n\n\n\n\n/\n\nZ\nd\n\n\n\nr\n→\n\n\n\n=\n\n∫\n\nP\nS\n\n\n\np\n\n−\n1\n\n\n(\n\n\n\nr\n→\n\n\n\n)\n\nA\n\n\n\nr\n→\n\n\n\n\n∗\n\n\n\ne\n\n−\nβ\n\nE\n\n\n\nr\n→\n\n\n\n\n\n\n\n/\n\nZ\nd\n\n\n\nr\n→\n\n\n\n\n\n{\\displaystyle \\langle A\\rangle =\\int _{PS}p^{-1}({\\vec {r}}){\\frac {A_{\\vec {r}}}{p^{-1}({\\vec {r}})}}e^{-\\beta E_{\\vec {r}}}/Zd{\\vec {r}}=\\int _{PS}p^{-1}({\\vec {r}})A_{\\vec {r}}^{*}e^{-\\beta E_{\\vec {r}}}/Zd{\\vec {r}}}\n\n,\nwhere \n\n\n\n\nA\n\n\n\nr\n→\n\n\n\n\n∗\n\n\n\n\n{\\displaystyle A_{\\vec {r}}^{*}}\n\n are the sampled values taking into account the importance probability \n\n\n\np\n(\n\n\n\nr\n→\n\n\n\n)\n\n\n{\\displaystyle p({\\vec {r}})}\n\n. This integral can be estimated by\n\n\n\n\n⟨\nA\n⟩\n≃\n\n\n1\nN\n\n\n\n∑\n\ni\n=\n1\n\n\nN\n\n\n\np\n\n−\n1\n\n\n(\n\n\n\n\nr\n→\n\n\n\n\ni\n\n\n)\n\nA\n\n\n\n\n\nr\n→\n\n\n\n\ni\n\n\n\n\n∗\n\n\n\ne\n\n−\nβ\n\nE\n\n\n\n\n\nr\n→\n\n\n\n\ni\n\n\n\n\n\n\n\n/\n\nZ\n\n\n{\\displaystyle \\langle A\\rangle \\simeq {\\frac {1}{N}}\\sum _{i=1}^{N}p^{-1}({\\vec {r}}_{i})A_{{\\vec {r}}_{i}}^{*}e^{-\\beta E_{{\\vec {r}}_{i}}}/Z}\n\n\nwhere \n\n\n\n\n\n\n\nr\n→\n\n\n\n\ni\n\n\n\n\n{\\displaystyle {\\vec {r}}_{i}}\n\n are now randomly generated using the \n\n\n\np\n(\n\n\n\nr\n→\n\n\n\n)\n\n\n{\\displaystyle p({\\vec {r}})}\n\n distribution. Since most of the times it is not easy to find a way of generating states with a given distribution, the Metropolis algorithm must be used.\nBecause it is known that the most likely states are those that maximize the Boltzmann distribution, a good distribution, \n\n\n\np\n(\n\n\n\nr\n→\n\n\n\n)\n\n\n{\\displaystyle p({\\vec {r}})}\n\n, to choose for the importance sampling is the Boltzmann distribution or canonic distribution. Let\n\n\n\n\np\n(\n\n\n\nr\n→\n\n\n\n)\n=\n\n\n\ne\n\n−\nβ\n\nE\n\n\n\nr\n→\n\n\n\n\n\n\nZ\n\n\n\n\n{\\displaystyle p({\\vec {r}})={\\frac {e^{-\\beta E_{\\vec {r}}}}{Z}}}\n\n\nbe the distribution to use. Substituting on the previous sum,\n\n\n\n\n⟨\nA\n⟩\n≃\n\n\n1\nN\n\n\n\n∑\n\ni\n=\n1\n\n\nN\n\n\n\nA\n\n\n\n\n\nr\n→\n\n\n\n\ni\n\n\n\n\n∗\n\n\n\n\n{\\displaystyle \\langle A\\rangle \\simeq {\\frac {1}{N}}\\sum _{i=1}^{N}A_{{\\vec {r}}_{i}}^{*}}\n\n.\nSo, the procedure to obtain a mean value of a given variable, using metropolis algorithm, with the canonical distribution, is to use the Metropolis algorithm to generate states given by the distribution \n\n\n\np\n(\n\n\n\nr\n→\n\n\n\n)\n\n\n{\\displaystyle p({\\vec {r}})}\n\n and perform means over \n\n\n\n\nA\n\n\n\nr\n→\n\n\n\n\n∗\n\n\n\n\n{\\displaystyle A_{\\vec {r}}^{*}}\n\n.\nOne important issue must be considered when using the metropolis algorithm with the canonical distribution: when performing a given measure, i.e. realization of \n\n\n\n\n\n\n\nr\n→\n\n\n\n\ni\n\n\n\n\n{\\displaystyle {\\vec {r}}_{i}}\n\n, one must ensure that that realization is not correlated with the previous state of the system (otherwise the states are not being \"randomly\" generated). On systems with relevant energy gaps, this is the major drawback of the use of the canonical distribution because the time needed to the system de-correlate from the previous state can tend to infinity.\nAs stated before, micro-canonical approach has a major drawback, which becomes relevant in most of the systems that use Monte Carlo Integration. For those systems with \"rough energy landscapes\", the multicanonic approach can be used.\nThe multicanonic approach uses a different choice for importance sampling:\n\n\n\n\np\n(\n\n\n\nr\n→\n\n\n\n)\n=\n\n\n1\n\nΩ\n(\n\nE\n\n\n\nr\n→\n\n\n\n\n)\n\n\n\n\n\n{\\displaystyle p({\\vec {r}})={\\frac {1}{\\Omega (E_{\\vec {r}})}}}\n\n\nwhere \n\n\n\nΩ\n(\nE\n)\n\n\n{\\displaystyle \\Omega (E)}\n\n is the density of states of the system. The major advantage of this choice is that the energy histogram is flat, i.e. the generated states are equally distributed on energy. This means that, when using the Metropolis algorithm, the simulation doesn't see the \"rough energy landscape\", because every energy is treated equally.\nThe major drawback of this choice is the fact that, on most systems, \n\n\n\nΩ\n(\nE\n)\n\n\n{\\displaystyle \\Omega (E)}\n\n is unknown. To overcome this, the Wang and Landau algorithm is normally used to obtain the DOS during the simulation. Note that after the DOS is known, the mean values of every variable can be calculated for every temperature, since the generation of states does not depend on \n\n\n\nβ\n\n\n{\\displaystyle \\beta }\n\n.\nOn this section, the implementation will focus on the Ising model. Lets consider a two-dimensional spin network, with L spins (lattice sites) on each side. There are naturally \n\n\n\nN\n=\n\nL\n\n2\n\n\n\n\n{\\displaystyle N=L^{2}}\n\n spins, and so, the phase space is discrete and is characterized by N spins, \n\n\n\n\n\n\nr\n→\n\n\n\n=\n(\n\nσ\n\n1\n\n\n,\n\nσ\n\n2\n\n\n,\n.\n.\n.\n,\n\nσ\n\nN\n\n\n)\n\n\n{\\displaystyle {\\vec {r}}=(\\sigma _{1},\\sigma _{2},...,\\sigma _{N})}\n\n where \n\n\n\n\nσ\n\ni\n\n\n∈\n{\n−\n1\n,\n1\n}\n\n\n{\\displaystyle \\sigma _{i}\\in \\{-1,1\\}}\n\n is the spin of each lattice site. The system's energy is given by \n\n\n\nE\n(\n\n\n\nr\n→\n\n\n\n)\n=\n\n∑\n\ni\n=\n1\n\n\nN\n\n\n\n∑\n\nj\n∈\nv\ni\n\nz\n\ni\n\n\n\n\n(\n1\n−\n\nJ\n\ni\nj\n\n\n\nσ\n\ni\n\n\n\nσ\n\nj\n\n\n)\n\n\n{\\displaystyle E({\\vec {r}})=\\sum _{i=1}^{N}\\sum _{j\\in viz_{i}}(1-J_{ij}\\sigma _{i}\\sigma _{j})}\n\n, where \n\n\n\nv\ni\n\nz\n\ni\n\n\n\n\n{\\displaystyle viz_{i}}\n\n are the set of first neighborhood spins of i and J is the interaction matrix (for a ferromagnetic ising model, J is the identity matrix). The problem is stated.\nOn this example, the objective is to obtain \n\n\n\n⟨\nM\n⟩\n\n\n{\\displaystyle \\langle M\\rangle }\n\n and \n\n\n\n⟨\n\nM\n\n2\n\n\n⟩\n\n\n{\\displaystyle \\langle M^{2}\\rangle }\n\n (for instance, to obtain the magnetic susceptibility of the system) since it is straightforward to generalize to other observables. According to the definition, \n\n\n\nM\n(\n\n\n\nr\n→\n\n\n\n)\n=\n\n∑\n\ni\n=\n1\n\n\nN\n\n\n\nσ\n\ni\n\n\n\n\n{\\displaystyle M({\\vec {r}})=\\sum _{i=1}^{N}\\sigma _{i}}\n\n.\nFirst, the system must be initialized: let \n\n\n\nβ\n=\n1\n\n/\n\n\nk\n\nb\n\n\nT\n\n\n{\\displaystyle \\beta =1/k_{b}T}\n\n be the system's Boltzmann temperature and initialize the system with an initial state (which can be anything since the final result should not depend on it).\nWith micro-canonic choice, the metropolis method must be employed. Because there is no right way of choosing which state is to be picked, one can particularize and choose to try to flip one spin at the time. This choice is usually called single spin flip. The following steps are to be made to perform a single measurement.\nstep 1: generate a state that follows the \n\n\n\np\n(\n\n\n\nr\n→\n\n\n\n)\n\n\n{\\displaystyle p({\\vec {r}})}\n\n distribution:\nstep 1.1: Perform TT times the following iteration:\nstep 1.1.1: pick a lattice site at random (with probability 1/N), which will be called i, with spin \n\n\n\n\nσ\n\ni\n\n\n\n\n{\\displaystyle \\sigma _{i}}\n\n.\nstep 1.1.2: pick a random number \n\n\n\nα\n∈\n[\n0\n,\n1\n]\n\n\n{\\displaystyle \\alpha \\in [0,1]}\n\n.\nstep 1.1.3: calculate the energy change of trying to flip the spin i:\n\n\n\n\nΔ\nE\n=\n2\n\nσ\n\ni\n\n\n\n∑\n\nj\n∈\nv\ni\n\nz\n\ni\n\n\n\n\n\nσ\n\nj\n\n\n\n\n{\\displaystyle \\Delta E=2\\sigma _{i}\\sum _{j\\in viz_{i}}\\sigma _{j}}\n\n\nand its magnetization change: \n\n\n\nΔ\nM\n=\n−\n2\n\nσ\n\ni\n\n\n\n\n{\\displaystyle \\Delta M=-2\\sigma _{i}}\n\n\nstep 1.1.4: if \n\n\n\nα\n<\nmin\n(\n1\n,\n\ne\n\n−\nβ\nΔ\nE\n\n\n)\n\n\n{\\displaystyle \\alpha <\\min(1,e^{-\\beta \\Delta E})}\n\n, flip the spin (\n\n\n\n\nσ\n\ni\n\n\n=\n−\n\nσ\n\ni\n\n\n\n\n{\\displaystyle \\sigma _{i}=-\\sigma _{i}}\n\n ), otherwise, don't.\nstep 1.1.5: update the several macroscopic variables in case the spin flipped: \n\n\n\nE\n=\nE\n+\nΔ\nE\n\n\n{\\displaystyle E=E+\\Delta E}\n\n, \n\n\n\nM\n=\nM\n+\nΔ\nM\n\n\n{\\displaystyle M=M+\\Delta M}\n\n\nafter TT times, the system is considered to be not correlated from its previous state, which means that, at this moment, the probability of the system to be on a given state follows the Boltzmann distribution, which is the objective proposed by this method.\nstep 2 -> perform the measurement:\nstep 2.1: save, on an histogram, the values of M and M^2.\nAs a final note, one should note that TT is not easy to estimate because it is not easy to say when the system is de-correlated from the previous state. To surpass this point, one generally do not use a fixed TT, but TT as a tunneling time. One tunneling time is defined as the number of steps 1. the system needs to make to go from the minimum of its energy to the maximum of its energy and return.\nA major drawback of this method with the single spin flip choice in systems like Ising model is that the tunneling time scales as a power law as \n\n\n\n\nN\n\n2\n+\nz\n\n\n\n\n{\\displaystyle N^{2+z}}\n\n where z is greater than 0.5, phenomenon known as critical slowing down.\nThe method thus neglects dynamics, which can be a major drawback, or a great advantage. Indeed, the method can only be applied to static quantities, but the freedom to choose moves makes the method very flexible. An additional advantage is that some systems, such as the Ising model, lack a dynamical description and are only defined by an energy prescription; for these the Monte Carlo approach is the only one feasible.\nThe great success of this method in statistical mechanics has led to various generalizations such as the method of simulated annealing for optimization, in which a fictitious temperature is introduced and then gradually lowered.", 
    "dbpedia_url": "http://dbpedia.org/resource/Monte_Carlo_method_in_statistical_physics", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Monte_Carlo_method_in_statistical_physics\n"
}