{
    "about": "In applied statistics, the Morris method for global sensitivity analysis is a so-called one-step-at-a-time method (OAT), meaning that in each run only one input parameter is given a new value. It facilitates a global sensitivity analysis by making a number r of local changes at different points x(1 → r) of the possible range of input values.", 
    "name": "Morris Method", 
    "classification": "Computational Physics", 
    "full_text": "In applied statistics, the Morris method for global sensitivity analysis is a so-called one-step-at-a-time method (OAT), meaning that in each run only one input parameter is given a new value. It facilitates a global sensitivity analysis by making a number r of local changes at different points x(1 → r) of the possible range of input values.\n\n\nThe finite distribution of elementary effects associated with the ith input factor, is obtained by randomly sampling different x from Ω, and is denoted by Fi[1]\nIn the original work of Morris the two sensitivity measures proposed were respectively the mean, µ, and the standard deviation, σ, of Fi. However, choosing Morris has the drawback that, if the distribution, Fi , contains negative elements, which occurs when the model is non-monotonic, when computing the mean some effects may cancel each other out. Thus, the measure µ on its own is not reliable for ranking factors in order of importance. It is necessary to consider at the same time the values of µ and σ, as a factor with elementary effects of different signs (that cancel each other out) would have a low value of µ but a considerable value of σ that avoids underestimating the factors The screening exercise importance.[1]\nIf the distribution, Fi, contains negative elements, which occurs when the model is non-monotonic, when computing the mean some effects may cancel each other out.When the goal is to rank factors in order of importance by making use of a single sensitivity measure, scientific advice is to use µ∗,which by making use of the absolute value, avoids the occurrence of effects of opposite signs.[1]\nIn Revised Morris method µ* is used to detect input factors with an important overall influence on the output. σ is used to detect factors involved in interaction with other factors or whose effect is non-linear.[1]\nThe method starts by sampling a set of start values within the defined ranges of possible values for all input variables and calculating the subsequent model outcome. The second step changes the values for one variable (all other inputs remaining at their start values) and calculates the resulting change in model outcome compared to the first run. Next, the values for another variable are changed (the previous variable is kept at its changed value and all other ones kept at their start values) and the resulting change in model outcome compared to the second run is calculated. This goes on until all input variables are changed. This procedure is repeated r times (where r is usually taken between 5 and 15), each time with a different set of start values, which leads to a number of r(k + 1) runs, where k is the number of input variables. Such number is very efficient compared to more demanding methods for sensitivity analysis.[1]\nA sensitivity analysis method widely used to screen factors in models of large dimensionality is the design proposed by Morris.[2] The Morris method deals efficiently with models containing hundreds of input factors without relying on strict assumptions about the model, such as for instance additivity or monotonicity of the model input-output relationship. The Morris method is simple to understand and implement, and its results are easily interpreted. Furthermore, it is economic in the sense that it requires a number of model evaluations that is linear in the number of model factors. The method can be regarded as global as the final measure is obtained by averaging a number of local measures (the elementary effects), computed at different points of the input space.[3]", 
    "dbpedia_url": "http://dbpedia.org/resource/Morris_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Morris_method\n"
}