{
    "about": "The Movable cellular automaton (MCA) method is a method in computational solid mechanics based on the discrete concept. It provides advantages both of classical cellular automaton and discrete element methods. Important advantage of the МСА method is a possibility of direct simulation of materials fracture including damage generation, crack propagation, fragmentation and mass mixing. It is difficult to simulate these processes by means of continuum mechanics methods (For example: finite element method, finite difference method, etc.), so some new concepts like peridynamics are required. Discrete element method is very effective to simulate granular materials, but mutual forces among movable cellular automata provides simulating solids behavior. If size of automaton will be close to zero then MCA behavior becomes like classical continuum mechanics methods.", 
    "name": "Movable Cellular Automaton", 
    "classification": "Numerical Analysis", 
    "full_text": "The Movable cellular automaton (MCA) method is a method in computational solid mechanics based on the discrete concept. It provides advantages both of classical cellular automaton and discrete element methods. Important advantage of the МСА method is a possibility of direct simulation of materials fracture including damage generation, crack propagation, fragmentation and mass mixing. It is difficult to simulate these processes by means of continuum mechanics methods (For example: finite element method, finite difference method, etc.), so some new concepts like peridynamics are required. Discrete element method is very effective to simulate granular materials, but mutual forces among movable cellular automata provides simulating solids behavior. If size of automaton will be close to zero then MCA behavior becomes like classical continuum mechanics methods.\n\n\nIn framework of the MCA approach an object under modeling is considered as a set of interacting elements/automata. The dynamics of the set of automata are defined by their mutual forces and rules for their relationships. This system exists and operates in time and space. Its evolution in time and space is governed by the equations of motion. The mutual forces and rules for inter-elements relationships are defined by the function of the automaton response. This function has to be specified for each automaton. Due to mobility of automata the following new parameters of cellular automata have to be included into consideration: Ri – radius-vector of automaton; Vi – velocity of automaton; ωi – rotation velocity of automaton; θi – rotation vector of automaton; mi – mass of automaton; Ji – moment of inertia of automaton.\nThe new concept of the MCA method is based on the introducing of the state of the pair of automata (relation of interacting pairs of automata) in addition to the conventional one – the state of a separate automaton. Note that the introduction of this definition allows to go from the static net concept to the concept of neighbours. As a result of this, the automata have the ability to change their neighbors by switching the states (relationships) of the pairs.\nThe introducing of new type of states leads to new parameter to use it as criteria for switching relationships. It is defined as an automaton overlapping parameters hij. So the relationship of the cellular automata is characterised by the value of their overlapping.\n \nThe initial structure is formed by setting up certain relationships among each pair of neighboring elements.\nIn contrast to the classical cellular automaton method in the MCA method not only a single automaton but also a relationship of pair of automata can be switched. According with the bistable automata concept there are two types of the pair states (relationships):\nSo the changing of the state of pair relationships is controlled by relative movements of the automata and the media formed by such pairs can be considered as bistable media.\nThe evolution of MCA media is described by the following equations of motion for translation:\nHere mi is the mass of automaton i, pij is central force acting between automata i and j, C(ij,ik) is certain coefficient associated with transferring the h parameter from pair ij to pair ik, ψ(αij,ik) is angle between directions ij and ik.\nDue to finite size of movable automata the rotation effects have to be taken into account. The equations of motion for rotation can be written as follows:\nHere Θij is the angle of relative rotation (it is a switching parameter like hij for translation), qij is the distance from center of automaton i to contact point of automaton j (moment arm), τij is the pair tangential interaction, S(ij,ik) is certain coefficient associated with transferring the Θ parameter from one pair to other (it is similar to C(ij,ik) from the equation for translation).\nIt should be noted that these equations are completely similar to the equations of motion for the many–particle approach.\nTranslation of the pair automata The dimensionless deformation parameter for translation of the i j automata pair can be presented as:\nIn this case:\nwhere Δt time step, Vnij – relative velocity.\nRotation of the pair automata can be calculated by analogy with the last translation relationships.\nThe εij parameter is used as a measure of deformation of automaton i under its interaction with automaton j. Where qij – is a distance from the center of automaton i to its contact point with automaton j; Ri = di/2 (di – is the size of automaton i).\nAs an example the titanium specimen under cyclic loading (tension – compression) is considered. The loading diagram is shown in the next figure:\nDue to mobility of each automaton the MCA method allows to take into account directly such actions as:\nUsing boundary conditions of different types (fixed, elastic, viscous-elastic, etc.) it is possible to imitate different properties of surrounding medium, containing the simulated system. It is possible to model different modes of mechanical loading (tension, compression, shear strain, etc.) by setting up additional conditions at the boundaries.", 
    "dbpedia_url": "http://dbpedia.org/resource/Movable_cellular_automaton", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Movable_cellular_automaton\n"
}