{
    "about": "MUSIC (MUltiple SIgnal Classification) is an algorithm used for frequency estimation[1] and emitter location.[2]", 
    "name": "Multiple Signal Classification", 
    "classification": "Digital Signal Processing", 
    "full_text": "MUSIC (MUltiple SIgnal Classification) is an algorithm used for frequency estimation[1] and emitter location.[2]\n\n\nIn many practical signal processing problems, the objective is to estimate from measurements a set of constant parameters upon which the received signals depend. There have been several approaches to such problems including the so-called maximum likelihood (ML) method of Capon (1969) and Burg's maximum entropy (ME) method. Although often successful and widely used, these methods have certain fundamental limitations (especially bias and sensitivity in parameter estimates), largely because they use an incorrect model (e.g., AR rather than special ARMA) of the measurements. Pisarenko (1973) was one of the first to exploit the structure of the data model, doing so in the context of estimation of parameters of complex sinusoids in additive noise using a covariance approach. Schmidt (1977), while working at ESL (now part of Northrop Grumman) and independently Bienvenu (1979) were the first to correctly exploit the measurement model in the case of sensor arrays of arbitrary form. Schmidt, in particular, accomplished this by first deriving a complete geometric solution in the absence of noise, then cleverly extending the geometric concepts to obtain a reasonable approximate solution in the presence of noise. The resulting algorithm was called MUSIC (MUltiple SIgnal Classification) and has been widely studied. In a detailed evaluation based on thousands of simulations, the Massachusetts Institute of Technology's Lincoln Laboratory concluded that, among currently accepted high-resolution algorithms, MUSIC was the most promising and a leading candidate for further study and actual hardware implementation. However, although the performance advantages of MUSIC are substantial, they are achieved at a cost in computation (searching over parameter space) and storage (of array calibration data).[3]\nMUSIC estimates the frequency content of a signal or autocorrelation matrix using an eigenspace method. This method assumes that a signal, \n\n\n\nx\n(\nn\n)\n\n\n{\\displaystyle x(n)}\n\n, consists of \n\n\n\np\n\n\n{\\displaystyle p}\n\n complex exponentials in the presence of Gaussian white noise. Given an \n\n\n\nM\n×\nM\n\n\n{\\displaystyle M\\times M}\n\n autocorrelation matrix, \n\n\n\n\n\nR\n\n\nx\n\n\n\n\n{\\displaystyle \\mathbf {R} _{x}}\n\n, if the eigenvalues are sorted in decreasing order, the eigenvectors corresponding to the \n\n\n\np\n\n\n{\\displaystyle p}\n\n largest eigenvalues (i.e. directions of largest variability) span the signal subspace. The remaining \n\n\n\nM\n−\np\n\n\n{\\displaystyle M-p}\n\n eigenvectors span the orthogonal space, where there is only noise. Note that for \n\n\n\nM\n=\np\n+\n1\n\n\n{\\displaystyle M=p+1}\n\n, MUSIC is identical to Pisarenko harmonic decomposition. The general idea is to use averaging to improve the performance of the Pisarenko estimator.\nThe frequency estimation function for MUSIC is\nwhere \n\n\n\n\n\nv\n\n\ni\n\n\n\n\n{\\displaystyle \\mathbf {v} _{i}}\n\n are the noise eigenvectors and\nThe locations of the \n\n\n\np\n\n\n{\\displaystyle p}\n\n largest peaks of the estimation function give the frequency estimates for the \n\n\n\np\n\n\n{\\displaystyle p}\n\n signal components.\nMUSIC is a generalization and computationalization of Pisarenko's method. In Pisarenko, only a single eigenvector is used and taken to be a set of autoregressive coefficients, whose zeros can be found analytically or with polynomial root finding algorithms. In contrast, MUSIC assumes that several such functions have been added together, so zeros may not be present. Instead there are local minima, which can be located by computationally searching the estimation function for peaks.\nMUSIC outperforms simple methods such as picking peaks of DFT spectra in the presence of noise, when the number of components is known in advance, because it exploits knowledge of this number to ignore the noise in its final report.\nUnlike DFT, it is able to estimate frequencies with accuracy higher than one sample, because its estimation function can be evaluated for any frequency, not just those of DFT bins. This is a form of superresolution.\nIts chief disadvantage is that it requires the number of components to be known in advance, so the original method cannot be used in more general cases. Methods exist for estimating the number of source components purely from statistical properties of the autocorrelation matrix. See, e.g. [4]\nMUSIC was originated by R. O. Schmidt in 1979 as an improvement to Pisarenko's method.\nA modified version of MUSIC, denoted as Time-Reversal MUSIC (TR-MUSIC) has been recently applied to computational time-reversal imaging.[5][6]", 
    "dbpedia_url": "http://dbpedia.org/resource/Multiple_signal_classification", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Multiple_signal_classification\n"
}