{
    "about": "The multiphase particle-in-cell method (MP-PIC) is a numerical method for modeling particle-fluid and particle-particle interactions in a computational fluid dynamics (CFD) calculation. The MP-PIC method achieves greater stability than its particle-in-cell predecessor by simultaneously treating the solid particles as computational particles and as a continuum. In the MP-PIC approach, the particle properties are mapped from the Lagrangian coordinates to an Eulerian grid through the use of interpolation functions. After evaluation of the continuum derivative terms, the particle properties are mapped back to the individual particles.[1] This method has proven to be stable in dense particle flows (>5% by volume), computationally efficient,[2] and physically accurate.[3] This has allowed the MP-PIC method to be used as particle-flow solver for the simulation of industrial-scale chemical processes involving particle-fluid flows.", 
    "classification": "Computational Physics", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Multiphase_particle-in-cell_method\n", 
    "full_text": "The multiphase particle-in-cell method (MP-PIC) is a numerical method for modeling particle-fluid and particle-particle interactions in a computational fluid dynamics (CFD) calculation. The MP-PIC method achieves greater stability than its particle-in-cell predecessor by simultaneously treating the solid particles as computational particles and as a continuum. In the MP-PIC approach, the particle properties are mapped from the Lagrangian coordinates to an Eulerian grid through the use of interpolation functions. After evaluation of the continuum derivative terms, the particle properties are mapped back to the individual particles.[1] This method has proven to be stable in dense particle flows (>5% by volume), computationally efficient,[2] and physically accurate.[3] This has allowed the MP-PIC method to be used as particle-flow solver for the simulation of industrial-scale chemical processes involving particle-fluid flows.\n\n\nThe multiphase particle-in-cell (MP-PIC) method was originally developed for a one-dimensional case in the mid-1990s by P.J. O'Rourke (Los Alamos National Laboratory),[1] who also coined the term MP-PIC. Subsequent extension of the method to two-dimensions was performed by D.M. Snider and O'Rourke.[4] By 2001, D.M. Snider had extended the MP-PIC method to full three-dimensions.[2] Currently, the MP-PIC method is used in commercial software for the simulation of particle-fluid systems.\nThe MP-PIC method is described by the governing equations, interpolation operators, and the particle stress model.\nThe multiphase particle-in-cell method assumes an incompressible fluid phase with the corresponding continuity equation,\nwhere the \n\n\n\n\nθ\n\nf\n\n\n\n\n\n{\\displaystyle \\theta _{f}\\;}\n\n is the fluid volume fraction and \n\n\n\n\n\n\nu\n\n\n\nf\n\n\n\n\n\n{\\displaystyle {\\mathbf {u}}_{f}\\;}\n\n is the fluid velocity. Momentum transport is given by a variation of the Navier-Stokes equations where \n\n\n\n\nρ\n\nf\n\n\n\n\n\n{\\displaystyle \\rho _{f}\\;}\n\n is the fluid density, \n\n\n\np\n\n\n\n{\\displaystyle p\\;}\n\n is the fluid pressure, and \n\n\n\n\n\ng\n\n\n\n\n\n{\\displaystyle {\\mathbf {g}}\\;}\n\n is the body force vector (gravity).\nThe laminar fluid viscosity terms, not included in the fluid momentum equation, can be included if necessary but will have a negligible effect on dense particle flow. In the MP-PIC method, the fluid motion is coupled with the particle motion through \n\n\n\n\n\nF\n\n\n\n\n\n{\\displaystyle {\\mathbf {F}}\\;}\n\n, the rate of momentum exchange per volume between the fluid and particle phases. The fluid phase equations are solved using a finite volume approach.\nThe particle phase is described by a probability distribution function (PDF), \n\n\n\nϕ\n\n(\n\n\nx\n\n\n,\n\n\n\nu\n\n\n\nf\n\n\n,\n\nρ\n\np\n\n\n,\n\nΩ\n\np\n\n\n,\nt\n)\n\n;\n\n\n{\\displaystyle \\phi \\left({\\mathbf {x}},{\\mathbf {u}}_{f},\\rho _{p},\\Omega _{p},t\\right);}\n\n which indicates the likelihood of finding a particle with a velocity \n\n\n\n\n\n\nu\n\n\n\nf\n\n\n\n\n\n{\\displaystyle {\\mathbf {u}}_{f}\\;}\n\n, particle density \n\n\n\n\nρ\n\np\n\n\n\n\n\n{\\displaystyle \\rho _{p}\\;}\n\n, particle volume \n\n\n\n\nΩ\n\np\n\n\n\n\n\n{\\displaystyle \\Omega _{p}\\;}\n\n at location \n\n\n\n\n\nx\n\n\n\n\n\n{\\displaystyle {\\mathbf {x}}\\;}\n\n and time \n\n\n\nt\n\n\n\n{\\displaystyle t\\;}\n\n. The particle PDF changes in time as described by\nwhere \n\n\n\n\n\nA\n\n\n\n\n\n{\\displaystyle {\\mathbf {A}}\\;}\n\n is the particle acceleration.\nA numerical solution of the particle phase is obtained by dividing the distribution into a finite number of \"computational particles\" that each represent a number of real particles with identical mass density, volume, velocity and location. At each time step, the velocity and location of each computational particle are updated using a discretized form of the above equations. The use of computational particles allows for a significant reduction in computational requirements with a negligible impact on accuracy under many conditions. The use of the computational particle in the Multiphase Particle-in-Cell method allows a full particle size distribution (PSD) to be modeled within the system as well as the modeling of polydisperse solids.[5]\nThe following local particle properties are determined from integrating the particle probability distribution function:\nThe particle phase is coupled to the fluid phase through the particle acceleration term, \n\n\n\n\n\nA\n\n\n\n\n\n{\\displaystyle {\\mathbf {A}}\\;}\n\n, defined as\nIn the acceleration term, \n\n\n\n\nD\n\np\n\n\n\n\n\n{\\displaystyle D_{p}\\;}\n\n is determined from the particle drag model and \n\n\n\nτ\n\n\n\n{\\displaystyle \\tau \\;}\n\n is determined from the interparticle stress model.\nThe momentum of the fluid phase is coupled to the particle phase through the rate of momentum exchange, \n\n\n\n\n\nF\n\n\n\n\n\n{\\displaystyle {\\mathbf {F}}\\;}\n\n. This is defined from the particle population distribution as\nThe transfer of particle properties between the Lagrangian particle space and the Eulerian grid is performed using linear interpolation functions. Assuming a rectilinear grid consisting of rectangular cuboid cells, the scalar particle properties are interpolated to the cell centers while the vector properties are interpolated to cell faces. In three dimensions, tri-linear interpolation functions and definitions for the products and gradients of interpolated properties are provided by Snider for three-dimensional models.[2]\nThe effects of particle packing are modeled in the MP-PIC method with the use of a function of particle stress. Snider (2001) has suggested calculating the particle stress \n\n\n\nτ\n\n\n\n{\\displaystyle \\tau \\;}\n\n, as\nwhere \n\n\n\n\nθ\n\nc\np\n\n\n\n\n\n{\\displaystyle \\theta _{cp}\\;}\n\n is the close-pack volume fraction and \n\n\n\nβ\n\n\n\n{\\displaystyle \\beta \\;}\n\n, \n\n\n\n\nP\n\ns\n\n\n\n\n\n{\\displaystyle P_{s}\\;}\n\n, and \n\n\n\nϵ\n\n\n\n{\\displaystyle \\epsilon \\;}\n\n are constants.", 
    "name": "Multiphase Particle In Cell Method"
}