{
    "about": "In digital signal processing, multidimensional sampling is the process of converting a function of a multidimensional variable into a discrete collection of values of the function measured on a discrete set of points. This article presents the basic result due to Petersen and Middleton[1] on conditions for perfectly reconstructing a wavenumber-limited function from its measurements on a discrete lattice of points. This result, also known as the Petersen–Middleton theorem, is a generalization of the Nyquist–Shannon sampling theorem for sampling one-dimensional band-limited functions to higher-dimensional Euclidean spaces.", 
    "name": "Multidimensional Sampling", 
    "classification": "Digital Signal Processing", 
    "full_text": "In digital signal processing, multidimensional sampling is the process of converting a function of a multidimensional variable into a discrete collection of values of the function measured on a discrete set of points. This article presents the basic result due to Petersen and Middleton[1] on conditions for perfectly reconstructing a wavenumber-limited function from its measurements on a discrete lattice of points. This result, also known as the Petersen–Middleton theorem, is a generalization of the Nyquist–Shannon sampling theorem for sampling one-dimensional band-limited functions to higher-dimensional Euclidean spaces.\nIn essence, the Petersen–Middleton theorem shows that a wavenumber-limited function can be perfectly reconstructed from its values on an infinite lattice of points, provided the lattice is fine enough. The theorem provides conditions on the lattice under which perfect reconstruction is possible.\nAs with the Nyquist–Shannon sampling theorem, this theorem also assumes an idealization of any real-world situation, as it only applies to functions that are sampled over an infinitude of points. Perfect reconstruction is mathematically possible for the idealized model but only an approximation for real-world functions and sampling techniques, albeit in practice often a very good one.\n\n\nThe concept of a bandlimited function in one dimension can be generalized to the notion of a wavenumber-limited function in higher dimensions. Recall that the Fourier transform of an integrable function \n\n\n\nf\n(\n⋅\n)\n\n\n{\\displaystyle f(\\cdot )}\n\n on n-dimensional Euclidean space is defined as:\nwhere x and ξ are n-dimensional vectors, and \n\n\n\n⟨\nx\n,\nξ\n⟩\n\n\n{\\displaystyle \\langle x,\\xi \\rangle }\n\n is the inner product of the vectors. The function \n\n\n\nf\n(\n⋅\n)\n\n\n{\\displaystyle f(\\cdot )}\n\n is said to be wavenumber-limited to a set \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n if the Fourier transform satisfies \n\n\n\n\n\n\nf\n^\n\n\n\n(\nξ\n)\n=\n0\n\n\n{\\displaystyle {\\hat {f}}(\\xi )=0}\n\n for \n\n\n\nξ\n∉\nΩ\n\n\n{\\displaystyle \\xi \\notin \\Omega }\n\n.\nSimilarly, the configuration of uniformly spaced sampling points in one-dimension can be generalized to a lattice in higher dimensions. A lattice is a collection of points \n\n\n\nΛ\n⊂\n\nℜ\n\nn\n\n\n\n\n{\\displaystyle \\Lambda \\subset \\Re ^{n}}\n\n of the form \n\n\n\nΛ\n=\n\n{\n\n∑\n\ni\n=\n1\n\n\nn\n\n\n\na\n\ni\n\n\n\nv\n\ni\n\n\n\n\n|\n\n\n\na\n\ni\n\n\n∈\n\n\nZ\n\n\n}\n\n\n\n{\\displaystyle \\Lambda =\\left\\{\\sum _{i=1}^{n}a_{i}v_{i}\\;|\\;a_{i}\\in {\\mathbb {Z}}\\right\\}}\n\n where {v1, ..., vn} is a basis for \n\n\n\n\nℜ\n\nn\n\n\n\n\n{\\displaystyle \\Re ^{n}}\n\n. The reciprocal lattice \n\n\n\nΓ\n\n\n{\\displaystyle \\Gamma }\n\n corresponding to \n\n\n\nΛ\n\n\n{\\displaystyle \\Lambda }\n\n is defined by\nwhere the vectors \n\n\n\n\nu\n\ni\n\n\n\n\n{\\displaystyle u_{i}}\n\n are chosen to satisfy \n\n\n\n⟨\n\nu\n\ni\n\n\n,\n\nv\n\nj\n\n\n⟩\n=\n\nδ\n\ni\nj\n\n\n\n\n{\\displaystyle \\langle u_{i},v_{j}\\rangle =\\delta _{ij}}\n\n. That is, if the vectors \n\n\n\n\nu\n\ni\n\n\n\n\n{\\displaystyle u_{i}}\n\n form columns of a matrix \n\n\n\nA\n\n\n{\\displaystyle A}\n\n and \n\n\n\n\nv\n\ni\n\n\n\n\n{\\displaystyle v_{i}}\n\n the columns of a matrix \n\n\n\nB\n\n\n{\\displaystyle B}\n\n, then \n\n\n\nA\n=\n\nB\n\n−\nT\n\n\n\n\n{\\displaystyle A=B^{-T}}\n\n. An example of a sampling lattice in two dimensional space is a hexagonal lattice depicted in Figure 1. The corresponding reciprocal lattice is shown in Figure 2. The reciprocal lattice of a square lattice in two dimensions is another square lattice. In three dimensional space the reciprocal lattice of a face-centered cubic (FCC) lattice is a hexagonal close-packed (HCP) lattice or a body centered cubic (BCC) lattice.\nLet \n\n\n\nΛ\n\n\n{\\displaystyle \\Lambda }\n\n denote a lattice in \n\n\n\n\nℜ\n\nn\n\n\n\n\n{\\displaystyle \\Re ^{n}}\n\n and \n\n\n\nΓ\n\n\n{\\displaystyle \\Gamma }\n\n the corresponding reciprocal lattice. The theorem of Petersen and Middleton[1] states that a function \n\n\n\nf\n(\n⋅\n)\n\n\n{\\displaystyle f(\\cdot )}\n\n that is wavenumber-limited to a set \n\n\n\nΩ\n⊂\n\nℜ\n\nn\n\n\n\n\n{\\displaystyle \\Omega \\subset \\Re ^{n}}\n\n can be exactly reconstructed from its measurements on \n\n\n\nΛ\n\n\n{\\displaystyle \\Lambda }\n\n provided that the set \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n does not overlap with any of its shifted versions \n\n\n\nΩ\n+\nx\n\n\n{\\displaystyle \\Omega +x}\n\n where the shift x is any nonzero element of the reciprocal lattice \n\n\n\nΓ\n\n\n{\\displaystyle \\Gamma }\n\n. In other words, \n\n\n\nf\n(\n⋅\n)\n\n\n{\\displaystyle f(\\cdot )}\n\n can be exactly reconstructed from its measurements on \n\n\n\nΛ\n\n\n{\\displaystyle \\Lambda }\n\n provided that \n\n\n\nΩ\n∩\n{\nx\n+\ny\n:\ny\n∈\nΩ\n}\n=\nϕ\n\n\n{\\displaystyle \\Omega \\cap \\{x+y:y\\in \\Omega \\}=\\phi }\n\n for all \n\n\n\nx\n∈\nΓ\n∖\n{\n0\n}\n\n\n{\\displaystyle x\\in \\Gamma \\setminus \\{0\\}}\n\n.\nThe generalization of the Poisson summation formula to higher dimensions [2] can be used to show that the samples, \n\n\n\n{\nf\n(\nx\n)\n:\nx\n∈\nΛ\n}\n\n\n{\\displaystyle \\{f(x):x\\in \\Lambda \\}}\n\n, of the function \n\n\n\nf\n(\n⋅\n)\n\n\n{\\displaystyle f(\\cdot )}\n\n on the lattice \n\n\n\nΛ\n\n\n{\\displaystyle \\Lambda }\n\n are sufficient to create a periodic summation of the function \n\n\n\n\n\n\nf\n^\n\n\n\n(\n⋅\n)\n\n\n{\\displaystyle {\\hat {f}}(\\cdot )}\n\n. The result is:\n\n\n\n\n\n\n\n\nf\n^\n\n\n\n\ns\n\n\n(\nξ\n)\n \n\n\n\n\n=\n\n\n\nd\ne\nf\n\n\n\n\n\n\n∑\n\ny\n∈\nΓ\n\n\n\n\n\nf\n^\n\n\n\n\n(\nξ\n−\ny\n)\n\n=\n\n∑\n\nx\n∈\nΛ\n\n\n\n|\n\nΛ\n\n|\n\nf\n(\nx\n)\n \n\ne\n\n−\ni\n2\nπ\n⟨\nx\n,\nξ\n⟩\n\n\n,\n\n\n{\\displaystyle {\\hat {f}}_{s}(\\xi )\\ {\\stackrel {\\mathrm {def} }{=}}\\sum _{y\\in \\Gamma }{\\hat {f}}\\left(\\xi -y\\right)=\\sum _{x\\in \\Lambda }|\\Lambda |f(x)\\ e^{-i2\\pi \\langle x,\\xi \\rangle },}\n\n\n\n \n \n \n \n(Eq.1)\nwhere \n\n\n\n\n|\n\nΛ\n\n|\n\n\n\n{\\displaystyle |\\Lambda |}\n\n represents the volume of the parallelepiped formed by the vectors {v1, ..., vn}. This periodic function is often referred to as the sampled spectrum and can be interpreted as the analogue of the discrete-time Fourier transform (DTFT) in higher dimensions. If the original wavenumber-limited spectrum \n\n\n\n\n\n\nf\n^\n\n\n\n(\n⋅\n)\n\n\n{\\displaystyle {\\hat {f}}(\\cdot )}\n\n is supported on the set \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n then the function \n\n\n\n\n\n\n\nf\n^\n\n\n\n\ns\n\n\n(\n⋅\n)\n\n\n{\\displaystyle {\\hat {f}}_{s}(\\cdot )}\n\n is supported on periodic repetitions of \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n shifted by points on the reciprocal lattice \n\n\n\nΓ\n\n\n{\\displaystyle \\Gamma }\n\n. If the conditions of the Petersen-Middleton theorem are met, then the function \n\n\n\n\n\n\n\nf\n^\n\n\n\n\ns\n\n\n(\nξ\n)\n\n\n{\\displaystyle {\\hat {f}}_{s}(\\xi )}\n\n is equal to \n\n\n\n\n\n\nf\n^\n\n\n\n(\nξ\n)\n\n\n{\\displaystyle {\\hat {f}}(\\xi )}\n\n for all \n\n\n\nξ\n∈\nΩ\n\n\n{\\displaystyle \\xi \\in \\Omega }\n\n, and hence the original field can be exactly reconstructed from the samples. In this case the reconstructed field matches the original field and can be expressed in terms of the samples as\n\n\n\n\nf\n(\nx\n)\n=\n\n∑\n\ny\n∈\nΛ\n\n\n\n|\n\nΛ\n\n|\n\nf\n(\ny\n)\n\n\n\n\nχ\nˇ\n\n\n\n\nΩ\n\n\n(\ny\n−\nx\n)\n\n\n{\\displaystyle f(x)=\\sum _{y\\in \\Lambda }|\\Lambda |f(y){\\check {\\chi }}_{\\Omega }(y-x)}\n\n,\n\n \n \n \n \n(Eq.2)\nwhere \n\n\n\n\n\n\n\nχ\nˇ\n\n\n\n\nΩ\n\n\n(\n⋅\n)\n\n\n{\\displaystyle {\\check {\\chi }}_{\\Omega }(\\cdot )}\n\n is the inverse Fourier transform of the characteristic function of the set \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n. This interpolation formula is the higher-dimensional equivalent of the Whittaker–Shannon interpolation formula.\nAs an example suppose that \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n is a circular disc. Figure 3 illustrates the support of \n\n\n\n\n\n\n\nf\n^\n\n\n\n\ns\n\n\n(\n⋅\n)\n\n\n{\\displaystyle {\\hat {f}}_{s}(\\cdot )}\n\n when the conditions of the Petersen-Middleton theorem are met. We see that the spectral repetitions do not overlap and hence the original spectrum can be exactly recovered.\nThe theorem gives conditions on sampling lattices for perfect reconstruction of the sampled. If the lattices are not fine enough to satisfy the Petersen-Middleton condition, then the field cannot be reconstructed exactly from the samples in general. In this case we say that the samples may be aliased. Again, consider the example in which \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n is a circular disc. If the Petersen-Middleton conditions do not hold, the support of the sampled spectrum will be as shown in Figure 4. In this case the spectral repetitions overlap leading to aliasing in the reconstruction.\nA simple illustration of aliasing can be obtained by studying low-resolution images. A gray-scale image can be interpreted as a function in two-dimensional space. An example of aliasing is shown in the images of brick patterns in Figure 5. The image shows the effects of aliasing when the sampling theorem's condition is not satisfied. If the lattice of pixels is not fine enough for the scene, aliasing occurs as evidenced by the appearance of the Moiré pattern in the image obtained. The image in Figure 6 is obtained when a smoothened version of the scene is sampled with the same lattice. In this case the conditions of the theorem are satisfied and no aliasing occurs.\nOne of the objects of interest in designing a sampling scheme for wavenumber-limited fields is to identify the configuration of points that leads to the minimum sampling density, i.e., the density of sampling points per unit spatial volume in \n\n\n\n\nℜ\n\nn\n\n\n\n\n{\\displaystyle \\Re ^{n}}\n\n. Typically the cost for taking and storing the measurements is proportional to the sampling density employed. Often in practice, the natural approach to sample two-dimensional fields is to sample it at points on a rectangular lattice. However, this is not always the ideal choice in terms of the sampling density. The theorem of Petersen and Middleton can be used to identify the optimal lattice for sampling fields that are wavenumber-limited to a given set \n\n\n\nΩ\n⊂\n\nℜ\n\nd\n\n\n\n\n{\\displaystyle \\Omega \\subset \\Re ^{d}}\n\n. For example, it can be shown that the lattice in \n\n\n\n\nℜ\n\n2\n\n\n\n\n{\\displaystyle \\Re ^{2}}\n\n with minimum spatial density of points that admits perfect reconstructions of fields wavenumber-limited to a circular disc in \n\n\n\n\nℜ\n\n2\n\n\n\n\n{\\displaystyle \\Re ^{2}}\n\n is the hexagonal lattice.[3] As a consequence, hexagonal lattices are preferred for sampling isotropic fields in \n\n\n\n\nℜ\n\n2\n\n\n\n\n{\\displaystyle \\Re ^{2}}\n\n.\nOptimal sampling lattices have been studied in higher dimensions.[4] Generally, optimal sphere packing lattices are ideal for sampling smooth stochastic processes while optimal sphere covering lattices[5] are ideal for sampling rough stochastic processes.\nSince optimal lattices, in general, are non-separable, designing interpolation and reconstruction filters requires non-tensor-product (i.e., non-separable) filter design mechanisms. Box splines provide a flexible framework for designing such non-separable reconstruction FIR filters that can be geometrically tailored for each lattice.[6][7] Hex-splines[8] are the generalization of B-splines for 2-D hexagonal lattices. Similarly, in 3-D and higher dimensions, Voronoi splines[9] provide a generalization of B-splines that can be used to design non-separable FIR filters which are geometrically tailored for any lattice, including optimal lattices.\nExplicit construction of ideal low-pass filters (i.e., sinc functions) generalized to optimal lattices is possible by studying the geometric properties of Brillouin zones (i.e., \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n in above) of these lattices (which are zonotopes).[10] This approach provides a closed-form explicit representation of \n\n\n\n\n\n\n\nχ\nˇ\n\n\n\n\nΩ\n\n\n(\n⋅\n)\n\n\n{\\displaystyle {\\check {\\chi }}_{\\Omega }(\\cdot )}\n\n for general lattices, including optimal sampling lattices. This construction provides a generalization of the Lanczos filter in 1-D to the multidimensional setting for optimal lattices.[10]\nThe Petersen–Middleton theorem is useful in designing efficient sensor placement strategies in applications involving measurement of spatial phenomena such as seismic surveys, environment monitoring and spatial audio-field measurements.", 
    "dbpedia_url": "http://dbpedia.org/resource/Multidimensional_sampling", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Multidimensional_sampling\n"
}