{
    "about": "Multigrid (MG) methods in numerical analysis are algorithms for solving differential equations using a hierarchy of discretizations. They are an example of a class of techniques called multiresolution methods, very useful in problems exhibiting multiple scales of behavior. For example, many basic relaxation methods exhibit different rates of convergence for short- and long-wavelength components, suggesting these different scales be treated differently, as in a Fourier analysis approach to multigrid.[1] MG methods can be used as solvers as well as preconditioners.", 
    "name": "Multigrid Method", 
    "classification": "Numerical Analysis", 
    "full_text": "Multigrid (MG) methods in numerical analysis are algorithms for solving differential equations using a hierarchy of discretizations. They are an example of a class of techniques called multiresolution methods, very useful in problems exhibiting multiple scales of behavior. For example, many basic relaxation methods exhibit different rates of convergence for short- and long-wavelength components, suggesting these different scales be treated differently, as in a Fourier analysis approach to multigrid.[1] MG methods can be used as solvers as well as preconditioners.\nThe main idea of multigrid is to accelerate the convergence of a basic iterative method (known as relaxation, which generally reduces short-wavelength error) by a global correction of the fine grid solution approximation from time to time, accomplished by solving a coarse problem. The coarse problem, while cheaper to solve, is similar to the fine grid problem in that it also has short- and long-wavelength errors. It can also be solved by a combination of relaxation and appeal to still coarser grids. This recursive process is repeated until a grid is reached where the cost of direct solution there is negligible compared to the cost of one relaxation sweep on the fine grid. This multigrid cycle typically reduces all error components by a fixed amount bounded well below one, independent of the fine grid mesh size. The typical application for multigrid is in the numerical solution of elliptic partial differential equations in two or more dimensions.[2]\nMultigrid methods can be applied in combination with any of the common discretization techniques. For example, the finite element method may be recast as a multigrid method.[3] In these cases, multigrid methods are among the fastest solution techniques known today. In contrast to other methods, multigrid methods are general in that they can treat arbitrary regions and boundary conditions. They do not depend on the separability of the equations or other special properties of the equation. They have also been widely used for more-complicated non-symmetric and nonlinear systems of equations, like the Lamé equations of elasticity or the Navier-Stokes equations.[4]\n\n\nThere are many variations of multigrid algorithms, but the common features are that a hierarchy of discretizations (grids) is considered. The important steps are:[5][6]\nThis approach has the advantage over other methods that it often scales linearly with the number of discrete nodes used. In other words, it can solve these problems to a given accuracy in a number of operations that is proportional to the number of unknowns.\nAssume that one has a differential equation which can be solved approximately (with a given accuracy) on a grid \n\n\n\ni\n\n\n{\\displaystyle i}\n\n with a given grid point density \n\n\n\n\nN\n\ni\n\n\n\n\n{\\displaystyle N_{i}}\n\n. Assume furthermore that a solution on any grid \n\n\n\n\nN\n\ni\n\n\n\n\n{\\displaystyle N_{i}}\n\n may be obtained with a given effort \n\n\n\n\nW\n\ni\n\n\n=\nρ\nK\n\nN\n\ni\n\n\n\n\n{\\displaystyle W_{i}=\\rho KN_{i}}\n\n from a solution on a coarser grid \n\n\n\ni\n+\n1\n\n\n{\\displaystyle i+1}\n\n. Here, \n\n\n\nρ\n=\n\nN\n\ni\n+\n1\n\n\n\n/\n\n\nN\n\ni\n\n\n<\n1\n\n\n{\\displaystyle \\rho =N_{i+1}/N_{i}<1}\n\n is the ratio of grid points on \"neighboring\" grids and is assumed to be constant throughout the grid hierarchy, and \n\n\n\nK\n\n\n{\\displaystyle K}\n\n is some constant modeling the effort of computing the result for one grid point.\nThe following recurrence relation is then obtained for the effort of obtaining the solution on grid \n\n\n\nk\n\n\n{\\displaystyle k}\n\n:\nAnd in particular, we find for the finest grid \n\n\n\n\nN\n\n1\n\n\n\n\n{\\displaystyle N_{1}}\n\n that\nCombining these two expressions (and using \n\n\n\n\nN\n\nk\n\n\n=\n\nρ\n\nk\n−\n1\n\n\n\nN\n\n1\n\n\n\n\n{\\displaystyle N_{k}=\\rho ^{k-1}N_{1}}\n\n) gives\nUsing the geometric series, we then find (for finite \n\n\n\nn\n\n\n{\\displaystyle n}\n\n)\nthat is, a solution may be obtained in \n\n\n\nO\n(\nN\n)\n\n\n{\\displaystyle O(N)}\n\n time.\nA multigrid method with an intentionally reduced tolerance can be used as an efficient preconditioner for an external iterative solver.[citation needed] The solution may still be obtained in \n\n\n\nO\n(\nN\n)\n\n\n{\\displaystyle O(N)}\n\n time as well as in the case where the multigrid method is used as a solver. Multigrid preconditioning is used in practice even for linear systems, typically with one cycle per iteration.[citation needed] Its main advantage versus a purely multigrid solver is particularly clear for nonlinear problems, e.g., eigenvalue problems.\nMultigrid methods can be generalized in many different ways. They can be applied naturally in a time-stepping solution of parabolic partial differential equations, or they can be applied directly to time-dependent partial differential equations.[7] Research on multilevel techniques for hyperbolic partial differential equations is underway.[8] Multigrid methods can also be applied to integral equations, or for problems in statistical physics.[9]\nOther extensions of multigrid methods include techniques where no partial differential equation nor geometrical problem background is used to construct the multilevel hierarchy.[10] Such algebraic multigrid methods (AMG) construct their hierarchy of operators directly from the system matrix. In classical AMG, the levels of the hierarchy are simply subsets of unknowns without any geometric interpretation. (More generally, coarse grid unknowns can be particular linear combinations of fine grid unknowns.) Thus, AMG methods become black-box solvers for certain classes of sparse matrices. AMG is regarded as advantageous mainly where geometric multigrid is too difficult to apply,[11] but is often used simply because it avoids the coding necessary for a true multigrid implementation. While classical AMG was developed first, a related algebraic method is known as smoothed aggregation (SA).\nAnother set of multiresolution methods is based upon wavelets. These wavelet methods can be combined with multigrid methods.[12][13] For example, one use of wavelets is to reformulate the finite element approach in terms of a multilevel method.[14]\nAdaptive multigrid exhibits adaptive mesh refinement, that is, it adjusts the grid as the computation proceeds, in a manner dependent upon the computation itself.[15] The idea is to increase resolution of the grid only in regions of the solution where it is needed.\nMultigrid methods have also been adopted for the solution of initial value problems.[16] Of particular interest here are parallel-in-time multigrid methods:[17] in contrast to classical Runge-Kutta or linear multistep methods, they can offer concurrency in temporal direction. The well known Parareal parallel-in-time integration method can also be reformulated as a two-level multigrid in time.", 
    "dbpedia_url": "http://dbpedia.org/resource/Multigrid_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Multigrid_method\n"
}