{
    "about": "Eb/N0 (the energy per bit to noise power spectral density ratio) is an important parameter in digital communication or data transmission. It is a normalized signal-to-noise ratio (SNR) measure, also known as the \"SNR per bit\". It is especially useful when comparing the bit error rate (BER) performance of different digital modulation schemes without taking bandwidth into account.", 
    "classification": "Signal Processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Eb/N0\n", 
    "full_text": "Eb/N0 (the energy per bit to noise power spectral density ratio) is an important parameter in digital communication or data transmission. It is a normalized signal-to-noise ratio (SNR) measure, also known as the \"SNR per bit\". It is especially useful when comparing the bit error rate (BER) performance of different digital modulation schemes without taking bandwidth into account.\nAs the description implies, Eb is the signal energy associated with each user data bit; it is equal to the signal power divided by the user bit rate (not the channel symbol rate). If signal power is in watts and bit rate is in bits per second, Eb is in units of joules (watt-seconds). N0 is the noise spectral density, the noise power in a 1 Hz bandwidth, measured in watts per hertz or joules. These are the same units as Eb so the ratio Eb/N0 is dimensionless; it is frequently expressed in decibels. Eb/N0 directly indicates the power efficiency of the system without regard to modulation type, error correction coding or signal bandwidth (including any use of spread spectrum). This also avoids any confusion as to which of several definitions of \"bandwidth\" to apply to the signal.\nBut when the signal bandwidth is well defined, Eb/N0 is also equal to the signal-to-noise ratio (SNR) in that bandwidth divided by the \"gross\" link spectral efficiency in (bit/s)/Hz, where the bits in this context again refer to user data bits, irrespective of error correction information and modulation type.[1]\nEb/N0 must be used with care on interference-limited channels since additive white noise (with constant noise density N0) is assumed, and interference is not always noise-like. In spread spectrum systems (e.g., CDMA), the interference is sufficiently noise-like that it can be represented as I0 and added to the thermal noise N0 to produce the overall ratio Eb/(N0+I0).\n\n\nEb/N0 is closely related to the carrier-to-noise ratio (CNR or C/N), i.e. the signal-to-noise ratio (SNR) of the received signal, after the receiver filter but before detection:\nwhere\nThe equivalent expression in logarithmic form (dB):\nCaution: Sometimes, the noise power is denoted by \n\n\n\n\nN\n\n0\n\n\n\n/\n\n2\n\n\n{\\displaystyle N_{0}/2}\n\n when negative frequencies and complex-valued equivalent baseband signals are considered rather than passband signals, and in that case, there will be a 3 dB difference.\nEb/N0 can be seen as a normalized measure of the energy per symbol to noise power spectral density (Es/N0):\nwhere Es is the energy per symbol in joules and \n\n\n\nρ\n\n\n{\\displaystyle \\rho }\n\n is the nominal spectral efficiency in (bit/s)/Hz.[2] Es/N0 is also commonly used in the analysis of digital modulation schemes. The two quotients are related to each other according to the following:\nwhere M is the number of alternative modulation symbols.\nNote that this is the energy per bit, not the energy per information bit.\nEs/N0 can further be expressed as:\nwhere\nThe Shannon–Hartley theorem says that the limit of reliable information rate (data rate exclusive of error-correcting codes) of a channel depends on bandwidth and signal-to-noise ratio according to:\nwhere\nThis equation can be used to establish a bound on Eb/N0 for any system that achieves reliable communication, by considering a gross bit rate R equal to the net bit rate I and therefore an average energy per bit of Eb = S/R, with noise spectral density of N0 = N/B. For this calculation, it is conventional to define a normalized rate Rl = R/2B, a bandwidth utilization parameter of bits per second per half hertz, or bits per dimension (a signal of bandwidth B can be encoded with 2B dimensions, according to the Nyquist–Shannon sampling theorem). Making appropriate substitutions, the Shannon limit is:\nWhich can be solved to get the Shannon-limit bound on Eb/N0:\nWhen the data rate is small compared to the bandwidth, so that Rl is near zero, the bound, sometimes called the ultimate Shannon limit,[3] is:\nwhich corresponds to –1.59 dB.\nNote that this often-quoted limit of -1.59 dB applies only to the theoretical case of infinite bandwidth. The Shannon limit for finite-bandwidth signals is always higher.\nFor any given system of coding and decoding, there exists what is known as a cutoff rate R0, typically corresponding to an Eb/N0 about 2 dB above the Shannon capacity limit.[citation needed]The cutoff rate used to be thought of as the limit on practical error correction codes without an unbounded increase in processing complexity, but has been rendered largely obsolete by the more recent discovery of turbo codes and low-density parity-check (LDPC) codes.", 
    "name": "N0"
}