{
    "about": "The near-far problem or hearability problem is a situation that is common in wireless communication systems, in particular, CDMA. In some signal jamming techniques, the near-far problem is exploited to disrupt communications.", 
    "classification": "Signal Processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Near-far_problem\n", 
    "full_text": "The near-far problem or hearability problem is a situation that is common in wireless communication systems, in particular, CDMA. In some signal jamming techniques, the near-far problem is exploited to disrupt communications.\n\n\nThe near-far problem is a condition in which a receiver captures a strong signal and thereby makes it impossible for the receiver to detect a weaker signal.\nConsider a receiver and two transmitters, one close to the receiver, the other far away. If both transmitters transmit simultaneously and at equal powers, then due to the inverse square law the receiver will receive more power from the nearer transmitter. Since one transmission's signal is the other's noise, the signal-to-noise ratio (SNR) for the farther transmitter is much lower. This makes the farther transmitter more difficult, if not impossible, to understand. If the nearer transmitter transmits a signal that is orders of magnitude higher than the farther transmitter then the SNR for the communication channel. In short, the near-far problem is one of detecting or filtering out a weaker signal amongst stronger signals.\nTo place this problem in more common terms, imagine you are talking to someone 6 meters away. If the two of you are in a quiet, empty room then a conversation is quite easy to hold at normal voice levels. In a loud, crowded bar, it would be impossible to hear the same voice level, and the only solution (for that distance) is for both you and your friend to speak louder. Of course, this increases the overall noise level in the bar, and every other patron has to talk louder too (this is equivalent to power control runaway). Eventually, everyone has to shout to make themselves heard by a person standing right beside them, and it is impossible to communicate with anyone more than half a meter away. (In general, however, a human is very capable of filtering out loud sounds; similar techniques can be deployed in signal processing where suitable criteria for distinguishing between signals can be established, see signal processing and notably adaptive signal processing.)[1]\nTaking this analogy back to wireless communications, the far transmitter would have to drastically increase transmission power which simply may not be possible.\nIn CDMA systems and similar cellular phone-like networks, the problem is commonly solved by dynamic output power adjustment of the transmitters. That is, the closer transmitters use less power so that the SNR for all transmitters at the receiver is roughly the same. This sometimes can have a noticeable impact on battery life, which can be dramatically different depending on distance from the base station. In high-noise situations, however, closer transmitters may boost their output power, which forces distant transmitters to boost their output to maintain a good SNR. Other transmitters react to the rising noise floor by increasing their output. This process continues, and eventually distant transmitters lose their ability to maintain a usable SNR and drop from the network. This process is called power control runaway. This principle may be used to explain why an area with low signal is perfectly usable when the cell isn't heavily loaded, but when load is higher, service quality degrades significantly, sometimes to the point of unusability.\nOther possible solutions to the near-far problem:", 
    "name": "Near Far Problem"
}