{
    "about": "In mathematical optimization, the network simplex algorithm is a graph theoretic specialization of the simplex algorithm. The algorithm is usually formulated in terms of a standard problem, minimum-cost flow problem and can be efficiently solved in polynomial time. The network simplex method works very well in practice, typically 200 to 300 times faster than the simplex method applied to general linear program of same dimensions.[citation needed]", 
    "name": "Network Simplex Algorithm", 
    "classification": "Graph Algorithms", 
    "full_text": "In mathematical optimization, the network simplex algorithm is a graph theoretic specialization of the simplex algorithm. The algorithm is usually formulated in terms of a standard problem, minimum-cost flow problem and can be efficiently solved in polynomial time. The network simplex method works very well in practice, typically 200 to 300 times faster than the simplex method applied to general linear program of same dimensions.[citation needed]\n\n\nFor a long time, the existence of a provably efficient network simplex algorithm was one of the major open problems in complexity theory, even though efficient in practice versions were available. In 1995 Orlin provided the first polynomial algorithm with runtime of \n\n\n\nO\n(\n\nV\n\n2\n\n\nE\nlog\n⁡\n(\nV\nC\n)\n)\n\n\n{\\displaystyle O(V^{2}E\\log(VC))}\n\n where \n\n\n\nC\n\n\n{\\displaystyle C}\n\n is maximum cost of any edges.[1] Later Tarjan improved this to \n\n\n\nO\n(\nV\nE\nlog\n⁡\nV\nlog\n⁡\n(\nV\nC\n)\n)\n\n\n{\\displaystyle O(VE\\log V\\log(VC))}\n\n using dynamic trees in 1997.[2] Strongly polynomial dual network simplex algorithms for the same problem, but with a higher dependence on the numbers of edges and vertices in the graph, have been known for longer.[3]\nThe network simplex method is an adaptation of the bounded variable primal simplex algorithm. The basis is represented as a rooted spanning tree of the underlying network, in which variables are represented by arcs, and the simplex multipliers by node potentials. At each iteration, an entering variable is selected by some pricing strategy, based on the dual multipliers (node potentials), and forms a cycle with the arcs of the tree. The leaving variable is the arc of the cycle with the least augmenting flow. The substitution of entering for leaving arc, and the reconstruction of the tree is called a pivot. When no non-basic arc remains eligible to enter, the optimal solution has been reached.\nThe network simplex algorithm can be used to solve many practical problems including,[4]", 
    "dbpedia_url": "http://dbpedia.org/resource/Network_simplex_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Network_simplex_algorithm\n"
}