{
    "about": "NEWUOA[1] is a numerical optimization algorithm by Michael J. D. Powell. It is also the name of Powell's Fortran 77 implementation of the algorithm.", 
    "name": "Newuoa", 
    "classification": "Optimization Algorithms And Methods", 
    "full_text": "NEWUOA[1] is a numerical optimization algorithm by Michael J. D. Powell. It is also the name of Powell's Fortran 77 implementation of the algorithm.\nNEWUOA solves unconstrained optimization problems without using derivatives, which makes it a derivative-free algorithm. The algorithm is iterative and exploits trust-region technique. On each iteration, the algorithm establishes a model function \n\n\n\n\nQ\n\nk\n\n\n\n\n{\\displaystyle Q_{k}}\n\n by quadratic interpolation and then minimizes \n\n\n\n\nQ\n\nk\n\n\n\n\n{\\displaystyle Q_{k}}\n\n within a trust region.\nOne important feature of NEWUOA algorithm is the least Frobenius norm updating[2] technique. Suppose that the objective function \n\n\n\nf\n\n\n{\\displaystyle f}\n\n has \n\n\n\nn\n\n\n{\\displaystyle n}\n\n variables, and one wants to uniquely determine the quadratic model \n\n\n\n\nQ\n\nk\n\n\n\n\n{\\displaystyle Q_{k}}\n\n by purely interpolating the function values of \n\n\n\nf\n\n\n{\\displaystyle f}\n\n, then it is necessary to evaluate \n\n\n\nf\n\n\n{\\displaystyle f}\n\n at \n\n\n\n(\nn\n+\n1\n)\n(\nn\n+\n2\n)\n\n/\n\n2\n\n\n{\\displaystyle (n+1)(n+2)/2}\n\n points, as a quadratic polynomial of \n\n\n\nn\n\n\n{\\displaystyle n}\n\n variables has this amount of independent coefficients. But this is impractical when \n\n\n\nn\n\n\n{\\displaystyle n}\n\n is large, because the function values are supposed to be expensive in derivative-free optimization. In NEWUOA, the model \n\n\n\n\nQ\n\nk\n\n\n\n\n{\\displaystyle Q_{k}}\n\n interpolates only \n\n\n\nm\n\n\n{\\displaystyle m}\n\n (an integer between \n\n\n\nn\n+\n2\n\n\n{\\displaystyle n+2}\n\n and \n\n\n\n(\nn\n+\n1\n)\n(\nn\n+\n2\n)\n\n/\n\n2\n\n\n{\\displaystyle (n+1)(n+2)/2}\n\n, typically of order \n\n\n\nn\n\n\n{\\displaystyle n}\n\n) function values of \n\n\n\nf\n\n\n{\\displaystyle f}\n\n, and the remaining degrees of freedom are taken up by minimizing the Frobenius norm of \n\n\n\n\n∇\n\n2\n\n\n\nQ\n\nk\n\n\n−\n\n∇\n\n2\n\n\n\nQ\n\nk\n−\n1\n\n\n\n\n{\\displaystyle \\nabla ^{2}Q_{k}-\\nabla ^{2}Q_{k-1}}\n\n. This technique mimics the least-change secant updates[3] for quasi-Newton methods and can be considered as the derivative-free version of PSB update (Powell's symmetric Broyden update).[4]\nTo construct the models, NEWUOA maintains a set of interpolation points throughout the iterations. The update of this set is another feature of NEWUOA.[1]\nNEWUOA algorithm was developed from UOBYQA (Unconstrained Optimization BY Quadratic Approximation).[5][6] A major difference between them is that UOBYQA constructs quadratic models by interpolating the objective function at \n\n\n\n(\nn\n+\n1\n)\n(\nn\n+\n2\n)\n\n/\n\n2\n\n\n{\\displaystyle (n+1)(n+2)/2}\n\n points.\nNEWUOA software was released on December 16, 2004.[7] It can solve unconstrained optimization problems of a few hundreds variables to high precision without using derivatives.[1] In the software, \n\n\n\nm\n\n\n{\\displaystyle m}\n\n is set to \n\n\n\n2\nn\n+\n1\n\n\n{\\displaystyle 2n+1}\n\n by default.[6]\nOther derivative-free optimization algorithms by Powell include COBYLA, UOBYQA, BOBYQA, and LINCOA.[7] BOBYQA and LINCOA are extensions of NEWUOA to bound constrained and linearly constrained optimization respectively.\nPowell did not explain how he coined the name \"NEWUOA\" either in the introducing report[1] nor in the software,[6] although COBYLA, UOBYQA, BOBYQA and LINCOA are all named by acronyms. Probably \"NEWUOA\" means \"NEW Unconstrained Optimization Algorithm\".\nThe NEWUOA software is distributed under The GNU Lesser General Public License (LGPL).[6]", 
    "dbpedia_url": "http://dbpedia.org/resource/NEWUOA", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/NEWUOA\n"
}