{
    "about": "Nominal level is the operating level at which an electronic signal processing device is designed to operate. The electronic circuits that make up such equipment are limited in the maximum signal they can output and the low-level internally generated electronic noise they add to the signal. The difference between the internal noise and the maximum output level is the device's dynamic range. When a signal is chained improperly through many devices, the dynamic range of the signal is reduced. The nominal level is the level that these devices were designed to operate at, for best dynamic range and adequate headroom.", 
    "name": "Nominal Level", 
    "classification": "Signal Processing", 
    "full_text": "Nominal level is the operating level at which an electronic signal processing device is designed to operate. The electronic circuits that make up such equipment are limited in the maximum signal they can output and the low-level internally generated electronic noise they add to the signal. The difference between the internal noise and the maximum output level is the device's dynamic range. When a signal is chained improperly through many devices, the dynamic range of the signal is reduced. The nominal level is the level that these devices were designed to operate at, for best dynamic range and adequate headroom.\nIn audio, a related measurement, signal-to-noise ratio, is usually defined as the difference between the nominal level and the noise floor, leaving the headroom as the difference between nominal and maximum output.[1][2] It is important to realize that the measured level is a time average, meaning that the peaks of audio signals regularly exceed the measured average level. The headroom measurement defines how far the peak levels can stray from the nominal measured level before clipping. The difference between the peaks and the average for a given signal is the crest factor.\nThere is some confusion over the use of the term \"nominal\", which is often used incorrectly to mean \"average or typical\". The relevant definition in this case is \"as per design\"; gain is applied to make the average signal level correspond to the designed, or nominal, level.\n\n\nVU meters are designed to represent the perceived loudness of a passage of music, measuring in volume units. The product is designed so that the best signal quality is obtained when the meter rarely goes above nominal. The markings are often in dB instead of \"VU\", and the reference level is defined in the product's manual. In professional recording and sound reinforcement gear, the nominal level is 0 VU = +4 dBu. In consumer level equipment, the nominal level varies, but some standardize to 0 VU = −10 dBV. The difference between consumer and pro equipment revolves around the cost required to create larger power supplies and output higher levels.[citation needed]\nIn broadcasting equipment, this is termed the Maximum Permitted Level, which is defined by European Broadcasting Union standards. These devices use peak programme meters instead of VU meters, which gives the reading a different meaning.\n\"Mic level\" is sometimes defined as −60 dBV, though levels from microphones vary widely.[3]\nIn video systems, nominal levels are 1 VP-P for synched systems, such as baseband composite video, and 0.7 VP-P for systems without sync.[3][4][5] Note that these levels are measured peak-to-peak, while audio levels are time averages.", 
    "dbpedia_url": "http://dbpedia.org/resource/Nominal_level", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Nominal_level\n"
}