{
    "about": "Non-linear least squares is the form of least squares analysis used to fit a set of m observations with a model that is non-linear in n unknown parameters (m > n). It is used in some forms of nonlinear regression. The basis of the method is to approximate the model by a linear one and to refine the parameters by successive iterations. There are many similarities to linear least squares, but also some significant differences.", 
    "classification": "Numerical Analysis", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Non-linear_least_squares\n", 
    "full_text": "Non-linear least squares is the form of least squares analysis used to fit a set of m observations with a model that is non-linear in n unknown parameters (m > n). It is used in some forms of nonlinear regression. The basis of the method is to approximate the model by a linear one and to refine the parameters by successive iterations. There are many similarities to linear least squares, but also some significant differences.\n\n\nConsider a set of \n\n\n\nm\n\n\n{\\displaystyle m}\n\n data points, \n\n\n\n(\n\nx\n\n1\n\n\n,\n\ny\n\n1\n\n\n)\n,\n(\n\nx\n\n2\n\n\n,\n\ny\n\n2\n\n\n)\n,\n…\n,\n(\n\nx\n\nm\n\n\n,\n\ny\n\nm\n\n\n)\n,\n\n\n{\\displaystyle (x_{1},y_{1}),(x_{2},y_{2}),\\dots ,(x_{m},y_{m}),}\n\n and a curve (model function) \n\n\n\ny\n=\nf\n(\nx\n,\n\nβ\n\n)\n,\n\n\n{\\displaystyle y=f(x,{\\boldsymbol {\\beta }}),}\n\n that in addition to the variable \n\n\n\nx\n\n\n{\\displaystyle x}\n\n also depends on \n\n\n\nn\n\n\n{\\displaystyle n}\n\n parameters, \n\n\n\n\nβ\n\n=\n(\n\nβ\n\n1\n\n\n,\n\nβ\n\n2\n\n\n,\n…\n,\n\nβ\n\nn\n\n\n)\n,\n\n\n{\\displaystyle {\\boldsymbol {\\beta }}=(\\beta _{1},\\beta _{2},\\dots ,\\beta _{n}),}\n\n with \n\n\n\nm\n≥\nn\n.\n\n\n{\\displaystyle m\\geq n.}\n\n It is desired to find the vector \n\n\n\n\nβ\n\n\n\n{\\displaystyle {\\boldsymbol {\\beta }}}\n\n of parameters such that the curve fits best the given data in the least squares sense, that is, the sum of squares\nis minimized, where the residuals (errors) ri are given by\nfor \n\n\n\ni\n=\n1\n,\n2\n,\n…\n,\nm\n.\n\n\n{\\displaystyle i=1,2,\\dots ,m.}\n\n\nThe minimum value of S occurs when the gradient is zero. Since the model contains n parameters there are n gradient equations:\nIn a nonlinear system, the derivatives \n\n\n\n\n\n\n∂\n\nr\n\ni\n\n\n\n\n∂\n\nβ\n\nj\n\n\n\n\n\n\n\n{\\displaystyle {\\frac {\\partial r_{i}}{\\partial \\beta _{j}}}}\n\n are functions of both the independent variable and the parameters, so these gradient equations do not have a closed solution. Instead, initial values must be chosen for the parameters. Then, the parameters are refined iteratively, that is, the values are obtained by successive approximation,\nHere, k is an iteration number and the vector of increments, \n\n\n\nΔ\n\nβ\n\n\n\n\n{\\displaystyle \\Delta {\\boldsymbol {\\beta }}\\,}\n\n is known as the shift vector. At each iteration the model is linearized by approximation to a first-order Taylor series expansion about \n\n\n\n\n\nβ\n\n\nk\n\n\n\n\n\n{\\displaystyle {\\boldsymbol {\\beta }}^{k}\\!}\n\n\nThe Jacobian, J, is a function of constants, the independent variable and the parameters, so it changes from one iteration to the next. Thus, in terms of the linearized model, \n\n\n\n\n\n\n∂\n\nr\n\ni\n\n\n\n\n∂\n\nβ\n\nj\n\n\n\n\n\n=\n−\n\nJ\n\ni\nj\n\n\n\n\n{\\displaystyle {\\frac {\\partial r_{i}}{\\partial \\beta _{j}}}=-J_{ij}}\n\n and the residuals are given by\nSubstituting these expressions into the gradient equations, they become\nwhich, on rearrangement, become n simultaneous linear equations, the normal equations\nThe normal equations are written in matrix notation as\nWhen the observations are not equally reliable, a weighted sum of squares may be minimized,\nEach element of the diagonal weight matrix W should, ideally, be equal to the reciprocal of the error variance of the measurement.[1] The normal equations are then\nThese equations form the basis for the Gauss–Newton algorithm for a non-linear least squares problem.\nIn linear least squares the objective function, S, is a quadratic function of the parameters.\nWhen there is only one parameter the graph of S with respect to that parameter will be a parabola. With two or more parameters the contours of S with respect to any pair of parameters will be concentric ellipses (assuming that the normal equations matrix \n\n\n\n\n\nX\n\nT\n\n\nW\nX\n\n\n\n{\\displaystyle \\mathbf {X^{T}WX} }\n\n is positive definite). The minimum parameter values are to be found at the centre of the ellipses. The geometry of the general objective function can be described as paraboloid elliptical. In NLLSQ the objective function is quadratic with respect to the parameters only in a region close to its minimum value, where the truncated Taylor series is a good approximation to the model.\nThe more the parameter values differ from their optimal values, the more the contours deviate from elliptical shape. A consequence of this is that initial parameter estimates should be as close as practicable to their (unknown!) optimal values. It also explains how divergence can come about as the Gauss–Newton algorithm is convergent only when the objective function is approximately quadratic in the parameters.\nProblems of ill-conditioning and divergence can be ameliorated by finding initial parameter estimates that are near to the optimal values. A good way to do this is by computer simulation. Both the observed and calculated data are displayed on a screen. The parameters of the model are adjusted by hand until the agreement between observed and calculated data is reasonably good. Although this will be a subjective judgment, it is sufficient to find a good starting point for the non-linear refinement. Initial parameter estimates can be created using transformations or linearizations. Better still evolutionary algorithms such as the Stochastic Funnel Algorithm can lead to the convex basin of attraction that surrounds the optimal parameter estimates. Hybrid algorithms that use randomization and elitism, followed by Newton methods have been shown to be useful and computationally efficient.\nAny method among the ones described below can be applied to find a solution.\nThe common sense criterion for convergence is that the sum of squares does not decrease from one iteration to the next. However this criterion is often difficult to implement in practice, for various reasons. A useful convergence criterion is\nThe value 0.0001 is somewhat arbitrary and may need to be changed. In particular it may need to be increased when experimental errors are large. An alternative criterion is\nAgain, the numerical value is somewhat arbitrary; 0.001 is equivalent to specifying that each parameter should be refined to 0.1% precision. This is reasonable when it is less than the largest relative standard deviation on the parameters.\nThere are models for which it is either very difficult or even impossible to derive analytical expressions for the elements of the Jacobian. Then, the numerical approximation\nis obtained by calculation of \n\n\n\nf\n(\n\nx\n\ni\n\n\n,\n\nβ\n\n)\n\n\n\n{\\displaystyle f(x_{i},{\\boldsymbol {\\beta }})\\,}\n\n for \n\n\n\n\nβ\n\nj\n\n\n\n\n\n{\\displaystyle \\beta _{j}\\,}\n\n and \n\n\n\n\nβ\n\nj\n\n\n+\nδ\n\nβ\n\nj\n\n\n\n\n\n{\\displaystyle \\beta _{j}+\\delta \\beta _{j}\\,}\n\n. The increment,\n\n\n\nδ\n\nβ\n\nj\n\n\n\n\n\n{\\displaystyle \\delta \\beta _{j}\\,}\n\n, size should be chosen so the numerical derivative is not subject to approximation error by being too large, or round-off error by being too small.\nSome information is given in the corresponding section on the linear least squares page.\nMultiple minima can occur in a variety of circumstances some of which are:\nwhere \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n is the height, \n\n\n\nγ\n\n\n{\\displaystyle \\gamma }\n\n is the position and \n\n\n\nβ\n\n\n{\\displaystyle \\beta }\n\n is the half-width at half height, there are two solutions for the half-width, \n\n\n\n\n\n\nβ\n^\n\n\n\n\n\n{\\displaystyle {\\hat {\\beta }}}\n\n and \n\n\n\n−\n\n\n\nβ\n^\n\n\n\n\n\n{\\displaystyle -{\\hat {\\beta }}}\n\n which give the same optimal value for the objective function.\nNot all multiple minima have equal values of the objective function. False minima, also known as local minima, occur when the objective function value is greater than its value at the so-called global minimum. To be certain that the minimum found is the global minimum, the refinement should be started with widely differing initial values of the parameters. When the same minimum is found regardless of starting point, it is likely to be the global minimum.\nWhen multiple minima exist there is an important consequence: the objective function will have a maximum value somewhere between two minima. The normal equations matrix is not positive definite at a maximum in the objective function, as the gradient is zero and no unique direction of descent exists. Refinement from a point (a set of parameter values) close to a maximum will be ill-conditioned and should be avoided as a starting point. For example, when fitting a Lorentzian the normal equations matrix is not positive definite when the half-width of the band is zero.[2]\nA non-linear model can sometimes be transformed into a linear one. For example, when the model is a simple exponential function,\nit can be transformed into a linear model by taking logarithms.\nGraphically this corresponds to working on a semi-log plot. The sum of squares becomes\nThis procedure should be avoided unless the errors are multiplicative and log-normally distributed because it can give misleading results. This comes from the fact that whatever the experimental errors on y might be, the errors on log y are different. Therefore, when the transformed sum of squares is minimized different results will be obtained both for the parameter values and their calculated standard deviations. However, with multiplicative errors that are log-normally distributed, this procedure gives unbiased and consistent parameter estimates.\nAnother example is furnished by Michaelis–Menten kinetics, used to determine two parameters \n\n\n\n\nV\n\nmax\n\n\n\n\n{\\displaystyle V_{\\max }}\n\n and \n\n\n\n\nK\n\nm\n\n\n\n\n{\\displaystyle K_{m}}\n\n:\nThe Lineweaver–Burk plot\nof \n\n\n\n\n\n1\nv\n\n\n\n\n{\\displaystyle {\\frac {1}{v}}}\n\n against \n\n\n\n\n\n1\n\n[\nS\n]\n\n\n\n\n\n{\\displaystyle {\\frac {1}{[S]}}}\n\n is linear in the parameters \n\n\n\n\n\n1\n\nV\n\nmax\n\n\n\n\n\n\n{\\displaystyle {\\frac {1}{V_{\\max }}}}\n\n and \n\n\n\n\n\n\nK\n\nm\n\n\n\nV\n\nmax\n\n\n\n\n\n\n{\\displaystyle {\\frac {K_{m}}{V_{\\max }}}}\n\n, but very sensitive to data error and strongly biased toward fitting the data in a particular range of the independent variable \n\n\n\n[\nS\n]\n\n\n{\\displaystyle [S]}\n\n.\nThe normal equations\nmay be solved for \n\n\n\nΔ\n\nβ\n\n\n\n{\\displaystyle \\Delta {\\boldsymbol {\\beta }}}\n\n by Cholesky decomposition, as described in linear least squares. The parameters are updated iteratively\nwhere k is an iteration number. While this method may be adequate for simple models, it will fail if divergence occurs. Therefore, protection against divergence is essential.\nIf divergence occurs, a simple expedient is to reduce the length of the shift vector, \n\n\n\n\nΔ\nβ\n\n\n\n{\\displaystyle \\mathbf {\\Delta \\beta } }\n\n, by a fraction, f\nFor example, the length of the shift vector may be successively halved until the new value of the objective function is less than its value at the last iteration. The fraction, f could be optimized by a line search.[3] As each trial value of f requires the objective function to be re-calculated it is not worth optimizing its value too stringently.\nWhen using shift-cutting, the direction of the shift vector remains unchanged. This limits the applicability of the method to situations where the direction of the shift vector is not very different from what it would be if the objective function were approximately quadratic in the parameters, \n\n\n\n\n\nβ\n\n\nk\n\n\n.\n\n\n{\\displaystyle {\\boldsymbol {\\beta }}^{k}.}\n\n\nIf divergence occurs and the direction of the shift vector is so far from its \"ideal\" direction that shift-cutting is not very effective, that is, the fraction, f required to avoid divergence is very small, the direction must be changed. This can be achieved by using the Marquardt parameter.[4] In this method the normal equations are modified\nwhere \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n is the Marquardt parameter and I is an identity matrix. Increasing the value of \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n has the effect of changing both the direction and the length of the shift vector. The shift vector is rotated towards the direction of steepest descent\n\n\n\n\n\n\nJ\n\nT\n\n\nW\n \nΔ\ny\n\n\n\n{\\displaystyle \\mathbf {J^{T}W\\ \\Delta y} }\n\n is the steepest descent vector. So, when \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n becomes very large, the shift vector becomes a small fraction of the steepest descent vector.\nVarious strategies have been proposed for the determination of the Marquardt parameter. As with shift-cutting, it is wasteful to optimize this parameter too stringently. Rather, once a value has been found that brings about a reduction in the value of the objective function, that value of the parameter is carried to the next iteration, reduced if possible, or increased if need be. When reducing the value of the Marquardt parameter, there is a cut-off value below which it is safe to set it to zero, that is, to continue with the unmodified Gauss–Newton method. The cut-off value may be set equal to the smallest singular value of the Jacobian.[5] A bound for this value is given by \n\n\n\n1\n\n/\n\n\ntrace\n\n\n\n\n(\n\nJ\n\nT\n\n\nW\nJ\n)\n\n\n−\n1\n\n\n\n\n\n{\\displaystyle 1/{\\mbox{trace}}\\mathbf {\\left(J^{T}WJ\\right)^{-1}} }\n\n.[6]\nThe minimum in the sum of squares can be found by a method that does not involve forming the normal equations. The residuals with the linearized model can be written as\nThe Jacobian is subjected to an orthogonal decomposition; the QR decomposition will serve to illustrate the process.\nwhere Q is an orthogonal \n\n\n\nm\n×\nm\n\n\n{\\displaystyle m\\times m}\n\n matrix and R is an \n\n\n\nm\n×\nn\n\n\n{\\displaystyle m\\times n}\n\n matrix which is partitioned into an \n\n\n\nn\n×\nn\n\n\n{\\displaystyle n\\times n}\n\n block, \n\n\n\n\n\nR\n\n\nn\n\n\n\n\n{\\displaystyle \\mathbf {R} _{n}}\n\n, and a \n\n\n\n(\nm\n−\nn\n)\n×\nn\n\n\n{\\displaystyle (m-n)\\times n}\n\n zero block. \n\n\n\n\n\nR\n\n\nn\n\n\n\n\n{\\displaystyle \\mathbf {R} _{n}}\n\n is upper triangular.\nThe residual vector is left-multiplied by \n\n\n\n\n\nQ\n\n\nT\n\n\n\n\n{\\displaystyle \\mathbf {Q} ^{T}}\n\n.\nThis has no effect on the sum of squares since \n\n\n\nS\n=\n\n\nr\n\nT\n\n\nQ\n\nQ\n\nT\n\n\nr\n=\n\nr\n\nT\n\n\nr\n\n\n\n{\\displaystyle S=\\mathbf {r^{T}QQ^{T}r=r^{T}r} }\n\n because Q is orthogonal The minimum value of S is attained when the upper block is zero. Therefore, the shift vector is found by solving\nThese equations are easily solved as R is upper triangular.\nA variant of the method of orthogonal decomposition involves singular value decomposition, in which R is diagonalized by further orthogonal transformations.\nwhere \n\n\n\n\nU\n\n\n\n{\\displaystyle \\mathbf {U} }\n\n is orthogonal, \n\n\n\n\nΣ\n\n\n\n{\\displaystyle {\\boldsymbol {\\Sigma }}}\n\n is a diagonal matrix of singular values and \n\n\n\n\nV\n\n\n\n{\\displaystyle \\mathbf {V} }\n\n is the orthogonal matrix of the eigenvectors of \n\n\n\n\n\nJ\n\nT\n\n\nJ\n\n\n\n{\\displaystyle \\mathbf {J^{T}J} }\n\n or equivalently the right singular vectors of \n\n\n\n\nJ\n\n\n\n{\\displaystyle \\mathbf {J} }\n\n. In this case the shift vector is given by\nThe relative simplicity of this expression is very useful in theoretical analysis of non-linear least squares. The application of singular value decomposition is discussed in detail in Lawson and Hanson.[5]\nThere are many examples in the scientific literature where different methods have been used for non-linear data-fitting problems.\nDirect search methods depend on evaluations of the objective function at a variety of parameter values and do not use derivatives at all. They offer alternatives to the use of numerical derivatives in the Gauss–Newton method and gradient methods.\nMore detailed descriptions of these, and other, methods are available, in Numerical Recipes, together with computer code in various languages.", 
    "name": "Non Linear Least Squares"
}