{
    "about": "Nonstandard finite difference schemes is a general set of methods in numerical analysis that gives numerical solutions to differential equations by constructing a discrete model. The general rules for such schemes are not precisely known.[1] [2]", 
    "name": "Nonstandard Finite Difference Scheme", 
    "classification": "Numerical Analysis", 
    "full_text": "Nonstandard finite difference schemes is a general set of methods in numerical analysis that gives numerical solutions to differential equations by constructing a discrete model. The general rules for such schemes are not precisely known.[1] [2]\nA finite difference (FD) model of a differential equation (DE) can be formed by simply replacing the derivatives with FD approximations. But this is a naive \"translation.\" If we literally translate from English to Japanese by making a one-to-one correspondence between words, the original meaning is often lost. Similarly the naive FD model of a DE can be very different from the original DE, because the FD model is a difference equation with solutions that may be quite different from solutions of the DE. For a more technical definition see Mickens 2000.[1]\nA nonstandard (NS) finite difference model, is a free and more accurate \"translation\" of a differential equation. For example, a parameter (call it v) in the DE may take another value u in the NS-FD model.\nAs an example let us model the wave equation,\nThe naive finite difference model, which we now call the standard (S) FD model is found by approximating the derivatives with FD approximations. The central second order FD approximation of the first derivative is\nApplying the above FD approximation to \n\n\n\n\nf\n′\n\n(\nx\n)\n\n\n{\\displaystyle f'(x)}\n\n, we can derive the FD approximation for \n\n\n\n\nf\n″\n\n(\nx\n)\n\n\n{\\displaystyle f''(x)}\n\n,\nwhere we have introduced the shortcut \n\n\n\n\n\nd\n\n\nx\n\n\nf\n(\nx\n)\n=\nf\n(\nx\n+\nΔ\nx\n\n/\n\n2\n)\n−\nf\n(\nx\n−\nΔ\nx\n\n/\n\n2\n)\n\n\n{\\displaystyle {\\text{d}}_{x}f(x)=f(x+\\Delta x/2)-f(x-\\Delta x/2)}\n\n for simplicity such that \n\n\n\n\n\nd\n\n\nx\n\n\n\n\n\n\n2\n\n\nf\n(\nx\n)\n=\nf\n(\nx\n+\nΔ\nx\n)\n+\nf\n(\nx\n−\nΔ\nx\n)\n−\n2\nf\n(\nx\n)\n\n\n{\\displaystyle {\\text{d}}_{x}{}^{2}f(x)=f(x+\\Delta x)+f(x-\\Delta x)-2f(x)}\n\n which can be check by applying \n\n\n\n\n\nd\n\n\nx\n\n\n\n\n{\\displaystyle {\\text{d}}_{x}}\n\n on \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n twice. Approximating both derivatives in the wave equation, leads to the S-FD model,\nIf you insert the solution \n\n\n\nϕ\n(\nx\n,\nt\n)\n=\n\ne\n\ni\n(\nk\nx\n−\nω\nt\n)\n\n\n\n\n{\\displaystyle \\phi (x,t)=e^{i(kx-\\omega t)}}\n\n of the wave equation (with \n\n\n\nω\n\n/\n\nk\n=\nv\n\n\n{\\displaystyle \\omega /k=v}\n\n)into the S-FD model you find that\nIn general \n\n\n\nϵ\n≠\n0\n\n\n{\\displaystyle \\epsilon \\neq 0}\n\n because the solution of the FD approximation to the wave equation is not the same as the wave equation itself.\nTo construct a NS-FD model which has the same solution as the wave equation, put a free parameter, call it u, in place of \n\n\n\nv\nΔ\nt\n\n/\n\nΔ\nx\n\n\n{\\displaystyle v\\Delta t/\\Delta x}\n\n and try to find a value of u which makes \n\n\n\nϵ\n=\n0\n\n\n{\\displaystyle \\epsilon =0}\n\n. It turns out that this value of u is\nThus an exact nonstandard finite difference model of the wave equation is\nFurther details and extensions of to two and three dimensions as well as to Maxwell's equations can be found in Cole 2002. [2]", 
    "dbpedia_url": "http://dbpedia.org/resource/Nonstandard_finite_difference_scheme", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Nonstandard_finite_difference_scheme\n"
}