{
    "about": "Nonuniform sampling is a branch of sampling theory involving results related to the Nyquist–Shannon sampling theorem. Nonuniform sampling is based on Lagrange interpolation and the relationship between itself and the (uniform) sampling theorem. Nonuniform sampling is a generalisation of the Whittaker–Shannon–Kotelnikov (WSK) sampling theorem.", 
    "name": "Nonuniform Sampling", 
    "classification": "Digital Signal Processing", 
    "full_text": "Nonuniform sampling is a branch of sampling theory involving results related to the Nyquist–Shannon sampling theorem. Nonuniform sampling is based on Lagrange interpolation and the relationship between itself and the (uniform) sampling theorem. Nonuniform sampling is a generalisation of the Whittaker–Shannon–Kotelnikov (WSK) sampling theorem.\nThe sampling theory of Shannon can be generalized for the case of nonuniform samples, that is, samples not taken equally spaced in time. The Shannon sampling theory for non-uniform sampling states that a band-limited signal can be perfectly reconstructed from its samples if the average sampling rate satisfies the Nyquist condition.[1] Therefore, although uniformly spaced samples may result in easier reconstruction algorithms, it is not a necessary condition for perfect reconstruction.\nThe general theory for non-baseband and nonuniform samples was developed in 1967 by Henry Landau.[2] He proved that the average sampling rate (uniform or otherwise) must be twice the occupied bandwidth of the signal, assuming it is a priori known what portion of the spectrum was occupied. In the late 1990s, this work was partially extended to cover signals for which the amount of occupied bandwidth was known, but the actual occupied portion of the spectrum was unknown.[3] In the 2000s, a complete theory was developed (see the section Beyond Nyquist below) using compressed sensing. In particular, the theory, using signal processing language, is described in this 2009 paper.[4] They show, among other things, that if the frequency locations are unknown, then it is necessary to sample at least at twice the Nyquist criteria; in other words, you must pay at least a factor of 2 for not knowing the location of the spectrum. Note that minimum sampling requirements do not necessarily guarantee numerical stability.\n\n\nFor a given function, it is possible to construct a polynomial of degree n which has the same value with the function at n + 1 points.[5]\nLet the n + 1 points to be \n\n\n\n\nz\n\n0\n\n\n,\n\nz\n\n1\n\n\n,\n…\n,\n\nz\n\nn\n\n\n\n\n{\\displaystyle z_{0},z_{1},\\ldots ,z_{n}}\n\n, and the n + 1 values to be \n\n\n\n\nw\n\n0\n\n\n,\n\nw\n\n1\n\n\n,\n…\n,\n\nw\n\nn\n\n\n\n\n{\\displaystyle w_{0},w_{1},\\ldots ,w_{n}}\n\n.\nIn this way, there exists a unique polynomial \n\n\n\n\np\n\nn\n\n\n(\nz\n)\n\n\n{\\displaystyle p_{n}(z)}\n\n such that\nFurthermore, it is possible to simplify the representation of \n\n\n\n\np\n\nn\n\n\n(\nz\n)\n\n\n{\\displaystyle p_{n}(z)}\n\n using the interpolating polynomials of Lagrange interpolation:\nFrom the above equation:\nAs a result,\nTo make the polynomial form more useful:\nIn that way, the Lagrange Interpolation Formula appears:\nNote that if \n\n\n\nf\n(\n\nz\n\nj\n\n\n)\n=\n\np\n\nn\n\n\n(\n\nz\n\nj\n\n\n)\n,\nj\n=\n0\n,\n1\n,\n…\n,\nn\n,\n\n\n{\\displaystyle f(z_{j})=p_{n}(z_{j}),j=0,1,\\ldots ,n,}\n\n, then the above formula becomes:\nWhittaker tried to extend the Lagrange Interpolation from polynomials to entire functions. He showed that it is possible to construct the entire function[9]\nwhich has the same value with \n\n\n\nf\n(\nz\n)\n\n\n{\\displaystyle f(z)}\n\n at the points \n\n\n\n\nz\n\nn\n\n\n=\na\n+\nn\nW\n\n\n{\\displaystyle z_{n}=a+nW}\n\n\n\nMoreover, \n\n\n\n\nC\n\nf\n\n\n(\nz\n)\n\n\n{\\displaystyle C_{f}(z)}\n\n can be written in a similar form of the last equation in previous section:\n\nWhen a = 0 and W = 1, then the above equation becomes almost the same as WSK theorem:[10]\nIf a function f can be represented in the form\nthen f can be reconstructed from its samples as following:\nFor a sequence \n\n\n\n{\n\nt\n\nk\n\n\n\n}\n\nk\n∈\n\nZ\n\n\n\n\n\n{\\displaystyle \\{t_{k}\\}_{k\\in \\mathbb {Z} }}\n\n satisfying[11]\nthen\nThe above is called the Paley–Wiener–Levinson theorem, which generalize WSK sampling theorem from uniform samples to non uniform samples. Both of them can reconstruct a band-limited signal from those samples, respectively.", 
    "dbpedia_url": "http://dbpedia.org/resource/Nonuniform_sampling", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Nonuniform_sampling\n"
}