{
    "about": "The principal nth root \n\n\n\n\n\nA\n\nn\n\n\n\n\n\n{\\displaystyle {\\sqrt[{n}]{A}}}\n\n of a positive real number A, is the positive real solution of the equation", 
    "name": "Nth Root Algorithm", 
    "classification": "Root-Finding Algorithms", 
    "full_text": "The principal nth root \n\n\n\n\n\nA\n\nn\n\n\n\n\n\n{\\displaystyle {\\sqrt[{n}]{A}}}\n\n of a positive real number A, is the positive real solution of the equation\n(for integer n there are n distinct complex solutions to this equation if \n\n\n\nA\n>\n0\n\n\n{\\displaystyle A>0}\n\n, but only one is positive and real).\nThere is a very fast-converging nth root algorithm for finding \n\n\n\n\n\nA\n\nn\n\n\n\n\n\n{\\displaystyle {\\sqrt[{n}]{A}}}\n\n:\nA special case is the familiar square-root algorithm. By setting n = 2, the iteration rule in step 2 becomes the square root iteration rule:\nSeveral different derivations of this algorithm are possible. One derivation shows it is a special case of Newton's method (also called the Newton-Raphson method) for finding zeros of a function \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n beginning with an initial guess. Although Newton's method is iterative, meaning it approaches the solution through a series of increasingly accurate guesses, it converges very quickly. The rate of convergence is quadratic, meaning roughly that the number of bits of accuracy doubles on each iteration (so improving a guess from 1 bit to 64 bits of precision requires only 6 iterations). For this reason, this algorithm is often used in computers as a very fast method to calculate square roots.\nFor large n, the nth root algorithm is somewhat less efficient since it requires the computation of \n\n\n\n\nx\n\nk\n\n\nn\n−\n1\n\n\n\n\n{\\displaystyle x_{k}^{n-1}}\n\n at each step, but can be efficiently implemented with a good exponentiation algorithm.\nNewton's method is a method for finding a zero of a function f(x). The general iteration scheme is:\nThe nth root problem can be viewed as searching for a zero of the function\nSo the derivative is\nand the iteration rule is\nleading to the general nth root algorithm.", 
    "dbpedia_url": "http://dbpedia.org/resource/Nth_root_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Nth_root_algorithm\n"
}