{
    "about": "In numerical analysis, numerical differentiation describes algorithms for estimating the derivative of a mathematical function or function subroutine using values of the function and perhaps other knowledge about the function.", 
    "name": "Numerical Differentiation", 
    "classification": "Numerical Analysis", 
    "full_text": "In numerical analysis, numerical differentiation describes algorithms for estimating the derivative of a mathematical function or function subroutine using values of the function and perhaps other knowledge about the function.\n\n\nThe simplest method is to use finite difference approximations.\nA simple two-point estimation is to compute the slope of a nearby secant line through the points (x,f(x)) and (x+h,f(x+h)).[1] Choosing a small number h, h represents a small change in x, and it can be either positive or negative. The slope of this line is\nThis expression is Newton's difference quotient (also known as a first-order divided difference.)\nThe slope of this secant line differs from the slope of the tangent line by an amount that is approximately proportional to h. As h approaches zero, the slope of the secant line approaches the slope of the tangent line. Therefore, the true derivative of f at x is the limit of the value of the difference quotient as the secant lines get closer and closer to being a tangent line:\nSince immediately substituting 0 for h results in division by zero, calculating the derivative directly can be unintuitive.\nEquivalently, the slope could be estimated by employing positions (x - h) and x.\nAnother two-point formula is to compute the slope of a nearby secant line through the points (x-h,f(x-h)) and (x+h,f(x+h)). The slope of this line is\nThis formula is known as the symmetric difference quotient. In this case the first-order errors cancel, so the slope of these secant lines differ from the slope of the tangent line by an amount that is approximately proportional to \n\n\n\n\nh\n\n2\n\n\n\n\n{\\displaystyle h^{2}}\n\n. Hence for small values of h this is a more accurate approximation to the tangent line than the one-sided estimation. Note however that although the slope is being computed at x, the value of the function at x is not involved.\nThe estimation error is given by:\nwhere \n\n\n\nc\n\n\n{\\displaystyle c}\n\n is some point between \n\n\n\nx\n−\nh\n\n\n{\\displaystyle x-h}\n\n and \n\n\n\nx\n+\nh\n\n\n{\\displaystyle x+h}\n\n. This error does not include the rounding error due to numbers being represented and calculations being performed in limited precision.\nThe symmetric difference quotient is employed as the method of approximating the derivative in a number of calculators, including TI-82, TI-83, TI-84, TI-85 all of which use this method with h=0.001.[2][3]\nDespite their practical popularity, finite difference formulas like the above two have been harshly criticized by some researchers, in particular by proponents of automatic differentiation.[4][why?] because their simplicity must be set against the fact that their accuracy is low - in rough terms, calculations in six digit precision will produce a slope of only three-digit precision whereas evaluating a function that calculates the slope may still deliver nearly six-digit precision. For example, given f(x) = x2, calculating the slope from 2x will give near full precision, whereas the finite difference approximation will have difficulties as described below.\nAn important consideration in practice when the function is calculated using floating point arithmetic is how small a value of h to choose. If chosen too small, the subtraction will yield a large rounding error. In fact all the finite difference formulae are ill-conditioned[5] and due to cancellation will produce a value of zero if h is small enough. [6] If too large, the calculation of the slope of the secant line will be more accurately calculated, but the estimate of the slope of the tangent by using the secant could be worse.\nA choice for h which is small without producing a large rounding error is \n\n\n\n\n\nε\n\n\nx\n\n\n{\\displaystyle {\\sqrt {\\varepsilon }}x}\n\n (though not when x = 0!) where the machine epsilon ε is typically of the order 2.2×10−16. [7] A formula for h that balances the rounding error against the secant error for optimum accuracy is\n\n\n\n\nh\n=\n2\n\n\nε\n\n|\n\n\n\n\nf\n(\nx\n)\n\n\n\nf\n″\n\n(\nx\n)\n\n\n\n\n|\n\n\n\n\n\n{\\displaystyle h=2{\\sqrt {\\varepsilon |{f(x) \\over f''(x)}|}}}\n\n [8] (though not when f\"(x) = 0) and to employ it will require knowledge of the function.\nThis epsilon is for double precision (64-bit) variables: such calculations in single precision are rarely useful. The resulting value is unlikely to be a \"round\" number in binary, so it is important to realise that although x is a machine-representable number, x + h almost certainly will not be. This means that x + h will be changed (via rounding or truncation) to a nearby machine-representable number, with the consequence that (x + h) - x will not equal h; the two function evaluations will not be exactly h apart. In this regard, since most decimal fractions are recurring sequences in binary (just as 1/3 is in decimal) a seemingly round step such as h = 0.1 will not be a round number in binary; it is 0.000110011001100... A possible approach is as follows:\nHowever, with computers, compiler optimization facilities may fail to attend to the details of actual computer arithmetic, and instead apply the axioms of mathematics to deduce that dx and h are the same. With C and similar languages, a directive that xph is a volatile variable will prevent this.\nHigher-order methods for approximating the derivative, as well as methods for higher derivatives exist.\nGiven below is the five point method for the first derivative (five-point stencil in one dimension).[9]\nwhere \n\n\n\nc\n∈\n[\nx\n−\n2\nh\n,\nx\n+\n2\nh\n]\n\n\n{\\displaystyle c\\in [x-2h,x+2h]}\n\n.\nFor other stencil configurations and derivative orders, the Finite Difference Coefficients Calculator is a tool which can be used to generate derivative approximation methods for any stencil with any derivative order (provided a solution exists).\nDifferential quadrature is the approximation of derivatives by using weighted sums of function values.[10][11] The name is in analogy with quadrature meaning Numerical integration where weighted sums are used in methods such as Simpson's method or the Trapezium rule. There are various methods for determining the weight coefficients. Differential quadrature is used to solve partial differential equations.\nThe classical finite difference approximations for numerical differentiation are ill-conditioned. However, if \n\n\n\nf\n\n\n{\\displaystyle f}\n\n is a holomorphic function, real-valued on the real line, which can be evaluated at points in the complex plane near \n\n\n\nx\n\n\n{\\displaystyle x}\n\n then there are stable methods. For example,[6] the first derivative can be calculated by the complex-step derivative formula:[12]\nThe above formula is only valid for calculating a first-order derivative. A generalization of the above for calculating derivatives of any order derivatives employ multicomplex numbers, resulting in multicomplex derivatives.[13]\nIn general, derivatives of any order can be calculated using Cauchy's integral formula:\nwhere the integration is done numerically.\nUsing complex variables for numerical differentiation was started by Lyness and Moler in 1967.[14] A method based on numerical inversion of a complex Laplace transform was developed by Abate and Dubner.[15] An algorithm which can be used without requiring knowledge about the method or the character of the function was developed by Fornberg.[5]", 
    "dbpedia_url": "http://dbpedia.org/resource/Numerical_differentiation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Numerical_differentiation\n"
}