{
    "about": "Numerical continuation is a method of computing approximate solutions of a system of parameterized nonlinear equations,", 
    "name": "Numerical Continuation", 
    "classification": "Numerical Analysis", 
    "full_text": "Numerical continuation is a method of computing approximate solutions of a system of parameterized nonlinear equations,\nThe parameter \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n is usually a real scalar, and the solution an n-vector. For a fixed parameter value \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n, \n\n\n\nF\n(\n∗\n,\nλ\n)\n\n\n{\\displaystyle F(\\ast ,\\lambda )}\n\n maps Euclidean n-space into itself.\nOften the original mapping \n\n\n\nF\n\n\n{\\displaystyle F}\n\n is from a Banach space into itself, and the Euclidean n-space is a finite-dimensional approximation to the Banach space.\nA steady state, or fixed point, of a parameterized family of flows or maps are of this form, and by discretizing trajectories of a flow or iterating a map, periodic orbits and heteroclinic orbits can also be posed as a solution of \n\n\n\nF\n=\n0\n\n\n{\\displaystyle F=0}\n\n.\n\n\nIn some nonlinear systems, parameters are explicit. In others they are implicit, and the system of nonlinear equations is written\nwhere \n\n\n\n\nu\n\n\n\n{\\displaystyle \\mathbf {u} }\n\n is an n-vector, and its image \n\n\n\nF\n(\n\nu\n\n)\n\n\n{\\displaystyle F(\\mathbf {u} )}\n\n is an n-1 vector.\nThis formulation, without an explicit parameter space is not usually suitable for the formulations in the following sections, because they refer to parameterized autonomous nonlinear dynamical systems of the form:\nHowever, in an algebraic system there is no distinction between unknowns \n\n\n\n\nu\n\n\n\n{\\displaystyle \\mathbf {u} }\n\n and the parameters.\nA periodic motion is a closed curve in phase space. That is, for some period \n\n\n\nT\n\n\n{\\displaystyle T}\n\n.\nThe textbook example of a periodic motion is the undamped pendulum.\nIf the phase space is periodic in one or more coordinates, say \n\n\n\n\nu\n\n(\nt\n)\n=\n\nu\n\n(\nt\n+\nΩ\n)\n\n\n{\\displaystyle \\mathbf {u} (t)=\\mathbf {u} (t+\\Omega )}\n\n, with \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n a vector, then there is a second kind of periodic motions defined by\nHere \n\n\n\nN\n\n\n{\\displaystyle N}\n\n is a diagonal matrix of integers that serves as an index of these periodic motions of the second kind.\n\nThe first step in writing an implicit system for a periodic motion is to move the period \n\n\n\nT\n\n\n{\\displaystyle T}\n\n from the boundary conditions to the ODE:\nThe second step is to add an additional equation, a phase constraint, that can be thought of as determining the period. This is necessary because any solution of the above boundary value problem can be shifted in time by an arbitrary amount (time does not appear in the defining equations—the dynamical system is called autonomous).\nThere are several choices for the phase constraint. If \n\n\n\n\n\nu\n\n\n0\n\n\n(\nt\n)\n\n\n{\\displaystyle \\mathbf {u} _{0}(t)}\n\n is a known periodic orbit at a parameter value \n\n\n\n\nλ\n\n0\n\n\n\n\n{\\displaystyle \\lambda _{0}}\n\n near \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n, then, Poincaré used\nwhich states that \n\n\n\n\nu\n\n\n\n{\\displaystyle \\mathbf {u} }\n\n lies in a plane which is orthogonal to the tangent vector of the closed curve. This plane is called a Poincaré section.\n\nFor a general problem a better phase constraint is an integral constraint introduced by Eusebius Doedel, which chooses the phase so that the distance between the known and unknown orbits is minimized:\n\nA solution component \n\n\n\nΓ\n(\n\n\nu\n\n\n0\n\n\n,\n\nλ\n\n0\n\n\n)\n\n\n{\\displaystyle \\Gamma (\\mathbf {u} _{0},\\lambda _{0})}\n\n of the nonlinear system \n\n\n\nF\n\n\n{\\displaystyle F}\n\n is a set of points \n\n\n\n(\n\nu\n\n,\nλ\n)\n\n\n{\\displaystyle (\\mathbf {u} ,\\lambda )}\n\n which satisfy \n\n\n\nF\n(\n\nu\n\n,\nλ\n)\n=\n0\n\n\n{\\displaystyle F(\\mathbf {u} ,\\lambda )=0}\n\n and are connected to the initial solution \n\n\n\n(\n\n\nu\n\n\n0\n\n\n,\n\nλ\n\n0\n\n\n)\n\n\n{\\displaystyle (\\mathbf {u} _{0},\\lambda _{0})}\n\n by a path of solutions \n\n\n\n(\n\nu\n\n(\ns\n)\n,\nλ\n(\ns\n)\n)\n\n\n{\\displaystyle (\\mathbf {u} (s),\\lambda (s))}\n\n for which \n\n\n\n(\n\nu\n\n(\n0\n)\n,\nλ\n(\n0\n)\n)\n=\n(\n\n\nu\n\n\n0\n\n\n,\n\nλ\n\n0\n\n\n)\n,\n\n(\n\nu\n\n(\n1\n)\n,\nλ\n(\n1\n)\n)\n=\n(\n\nu\n\n,\nλ\n)\n\n\n{\\displaystyle (\\mathbf {u} (0),\\lambda (0))=(\\mathbf {u} _{0},\\lambda _{0}),\\,(\\mathbf {u} (1),\\lambda (1))=(\\mathbf {u} ,\\lambda )}\n\n\nand \n\n\n\nF\n(\n\nu\n\n(\ns\n)\n,\nλ\n(\ns\n)\n)\n=\n0\n\n\n{\\displaystyle F(\\mathbf {u} (s),\\lambda (s))=0}\n\n.\n\nThis figure shows two solution components, one red and the other blue. Note that these two components may be connected outside the region of interest.\nA numerical continuation is an algorithm which takes as input a system of parametrized nonlinear equations and an initial solution \n\n\n\n(\n\n\nu\n\n\n0\n\n\n,\n\nλ\n\n0\n\n\n)\n\n\n{\\displaystyle (\\mathbf {u} _{0},\\lambda _{0})}\n\n, \n\n\n\nF\n(\n\n\nu\n\n\n0\n\n\n,\n\nλ\n\n0\n\n\n)\n=\n0\n\n\n{\\displaystyle F(\\mathbf {u} _{0},\\lambda _{0})=0}\n\n, and produces a set of points on the solution component \n\n\n\nΓ\n(\n\n\nu\n\n\n0\n\n\n,\n\nλ\n\n0\n\n\n)\n\n\n{\\displaystyle \\Gamma (\\mathbf {u} _{0},\\lambda _{0})}\n\n.\nA regular point of \n\n\n\nF\n\n\n{\\displaystyle F}\n\n is a point \n\n\n\n(\n\nu\n\n,\nλ\n)\n\n\n{\\displaystyle (\\mathbf {u} ,\\lambda )}\n\n at which the Jacobian of \n\n\n\nF\n\n\n{\\displaystyle F}\n\n is full rank \n\n\n\n(\nn\n)\n\n\n{\\displaystyle (n)}\n\n.\nNear a regular point the solution component is an isolated curve passing through the regular point (the implicit function theorem). In the figure above the point \n\n\n\n(\n\n\nu\n\n\n0\n\n\n,\n\nλ\n\n0\n\n\n)\n\n\n{\\displaystyle (\\mathbf {u} _{0},\\lambda _{0})}\n\n is a regular point.\nA singular point of \n\n\n\nF\n\n\n{\\displaystyle F}\n\n is a point \n\n\n\n(\n\nu\n\n,\nλ\n)\n\n\n{\\displaystyle (\\mathbf {u} ,\\lambda )}\n\n at which the Jacobian of F is not full rank.\nNear a singular point the solution component may not be an isolated curve passing through the regular point. The local structure is determined by higher derivatives of \n\n\n\nF\n\n\n{\\displaystyle F}\n\n. In the figure above the point where the two blue curves cross is a singular point.\nIn general solution components \n\n\n\nΓ\n\n\n{\\displaystyle \\Gamma }\n\n are branched curves. The branch points are singular points. Finding the solution curves leaving a singular point is called branch switching, and uses techniques from bifurcation theory (singularity theory, catastrophe theory).\nFor finite-dimensional systems (as defined above) the Lyapunov-Schmidt decomposition may be used to produce two systems to which the Implicit Function Theorem applies. The Lyapunov-Schmidt decomposition uses the restriction of the system to the complement of the null space of the Jacobian and the range of the Jacobian.\nIf the columns of the matrix \n\n\n\nΦ\n\n\n{\\displaystyle \\Phi }\n\n are an orthonormal basis for the null space of \n\n\n\nJ\n=\n\n[\n\n\n\n\n\nF\n\nx\n\n\n\n\n\nF\n\nλ\n\n\n\n\n\n\n]\n\n\n\n\n{\\displaystyle J=\\left[{\\begin{array}{cc}F_{x}&F_{\\lambda }\\\\\\end{array}}\\right]\\,}\n\n and the columns of the matrix \n\n\n\nΨ\n\n\n{\\displaystyle \\Psi }\n\n are an orthonormal basis for the left null space of \n\n\n\nJ\n\n\n{\\displaystyle J}\n\n, then the system \n\n\n\nF\n(\nx\n,\nλ\n)\n=\n0\n\n\n{\\displaystyle F(x,\\lambda )=0}\n\n can be rewritten as \n\n\n\n\n[\n\n\n\n\n(\nI\n−\nΨ\n\nΨ\n\nT\n\n\n)\nF\n(\nx\n+\nΦ\nξ\n+\nη\n)\n\n\n\n\n\nΨ\n\nT\n\n\nF\n(\nx\n+\nΦ\nξ\n+\nη\n)\n\n\n\n\n]\n\n=\n0\n,\n\n\n{\\displaystyle \\left[{\\begin{array}{l}(I-\\Psi \\Psi ^{T})F(x+\\Phi \\xi +\\eta )\\\\\\Psi ^{T}F(x+\\Phi \\xi +\\eta )\\\\\\end{array}}\\right]=0,}\n\n where \n\n\n\nη\n\n\n{\\displaystyle \\eta }\n\n is in the complement of the null space of \n\n\n\nJ\n\n\n{\\displaystyle J}\n\n \n\n\n\n(\n\nΦ\n\nT\n\n\n\nη\n=\n0\n)\n\n\n{\\displaystyle (\\Phi ^{T}\\,\\eta =0)}\n\n.\nIn the first equation, which is parametrized by the null space of the Jacobian (\n\n\n\nξ\n\n\n{\\displaystyle \\xi }\n\n), the Jacobian with respect to \n\n\n\nη\n\n\n{\\displaystyle \\eta }\n\n is non-singular. So the implicit function theorem states that there is a mapping \n\n\n\nη\n(\nξ\n)\n\n\n{\\displaystyle \\eta (\\xi )}\n\n such that \n\n\n\nη\n(\n0\n)\n=\n0\n\n\n{\\displaystyle \\eta (0)=0}\n\n and \n\n\n\n(\nI\n−\nΨ\n\nΨ\n\nT\n\n\n)\nF\n(\nx\n+\nΦ\nξ\n+\nη\n(\nξ\n)\n)\n=\n0\n)\n\n\n{\\displaystyle (I-\\Psi \\Psi ^{T})F(x+\\Phi \\xi +\\eta (\\xi ))=0)}\n\n. The second equation (with \n\n\n\nη\n(\nξ\n)\n\n\n{\\displaystyle \\eta (\\xi )}\n\n substituted) is called the bifurcation equation (though it may be a system of equations).\nThe bifurcation equation has a Taylor expansion which lacks the constant and linear terms. By scaling the equations and the null space of the Jacobian of the original system a system can be found with non-singular Jacobian. The constant term in the Taylor series of the scaled bifurcation equation is called the algebraic bifurcation equation, and the implicit function theorem applied the bifurcation equations states that for each isolated solution of the algebraic bifurcation equation there is a branch of solutions of the original problem which passes through the singular point.\nAnother type of singular point is a turning point bifurcation, or saddle-node bifurcation, where the direction of the parameter \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n reverses as the curve is followed. The red curve in the figure above illustrates a turning point.\nMost methods of solution of nonlinear systems of equations are iterative methods. For a particular parameter value \n\n\n\n\nλ\n\n0\n\n\n\n\n{\\displaystyle \\lambda _{0}}\n\n a mapping is repeatedly applied to an initial guess \n\n\n\n\n\nu\n\n\n0\n\n\n\n\n{\\displaystyle \\mathbf {u} _{0}}\n\n. If the method converges, and is consistent, then in the limit the iteration approaches a solution of \n\n\n\nF\n(\n\nu\n\n,\n\nλ\n\n0\n\n\n)\n=\n0\n\n\n{\\displaystyle F(\\mathbf {u} ,\\lambda _{0})=0}\n\n.\nNatural parameter continuation is a very simple adaptation of the iterative solver to a parametrized problem. The solution at one value of \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n is used as the initial guess for the solution at \n\n\n\nλ\n+\nΔ\nλ\n\n\n{\\displaystyle \\lambda +\\Delta \\lambda }\n\n. With \n\n\n\nΔ\nλ\n\n\n{\\displaystyle \\Delta \\lambda }\n\n sufficiently small the iteration applied to the initial guess should converge.\n\nOne advantage of natural parameter continuation is that it uses the solution method for the problem as a black box. All that is required is that an initial solution can be given (some solvers used to always start at a fixed initial guess). There has been a lot of work in the area of large scale continuation on applying more sophisticated algorithms to black box solvers (see e.g. LOCA).\nHowever, natural parameter continuation fails at turning points, where the branch of solutions turns round. So for problems with turning points, a more sophisticated method such as pseudo-arclength continuation must be used (see below).\nSimplicial Continuation, or Piecewise Linear Continuation (Allgower and Georg) is based on three basic results.\nThe first is\nThe second result is:\nPlease see the article on piecewise linear continuation for details.\nWith these two operations this continuation algorithm is easy to state (although of course an efficient implementation requires a more sophisticated approach. See [B1]). An initial simplex is assumed to be given, from a reference simplicial decomposition of IR^n. The initial simplex must have at least one face which contains a zero of the unique linear interpolant on that face. The other faces of the simplex are then tested, and typically there will be one additional face with an interior zero. The initial simplex is then replaced by the simplex which lies across either face containing zero, and the process is repeated.\n\nReferences: Allgower and Georg [B1] provides a crisp, clear description of the algotihm.\nThis method is based on the observation that the \"ideal\" parameterization of a curve is arclength. Pseudo-arclength is an approximation of the arclength in the tangent space of the curve. The resulting modified natural continuation method makes a step in pseudo-arclength (rather than \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n). The iterative solver is required to find a point at the given pseudo-arclength, which requires appending an additional constraint (the pseudo-arclength constraint) to the n by n+1 Jacobian. It produces a square Jacobian, and if the stepsize is sufficiently small the modified Jacobian is full rank.\nPseudo-arclength continuation was independently developed by Edward Riks and Gerald Wempner for finite element applications in the late 1960s, and published in journals in the early 1970s by H.B. Keller. A detailed account of these early developments is provided in the textbook by M. A. Crisfield: Nonlinear Finite Element Analysis of Solids and Structures, Vol 1: Basic Concepts, Wiley, 1991. Crisfield was one of the most active developers of this class of methods, which are by now standard procedures of commercial nonlinear finite element programs.\n\nThe algorithm is a predictor-corrector method. The prediction step finds the point (in IR^(n+1) ) which is a step \n\n\n\nΔ\ns\n\n\n{\\displaystyle \\Delta s}\n\n along the tangent vector at the current pointer. The corrector is usually Newton's method, or some variant, to solve the nonlinear system\n\n\n\n\n\n\n\n\nF\n(\nu\n,\nλ\n)\n=\n0\n\n\n\n\n\n\n\n\nu\n˙\n\n\n\n\n0\n\n\n∗\n\n\n(\nu\n−\n\nu\n\n0\n\n\n)\n+\n\n\n\n\nλ\n˙\n\n\n\n\n0\n\n\n(\nλ\n−\n\nλ\n\n0\n\n\n)\n=\nΔ\ns\n\n\n\n\n\n\n\n{\\displaystyle {\\begin{array}{l}F(u,\\lambda )=0\\\\{\\dot {u}}_{0}^{*}(u-u_{0})+{\\dot {\\lambda }}_{0}(\\lambda -\\lambda _{0})=\\Delta s\\\\\\end{array}}\\,}\n\n\nwhere \n\n\n\n(\n\n\n\n\nu\n˙\n\n\n\n\n0\n\n\n,\n\n\n\n\nλ\n˙\n\n\n\n\n0\n\n\n)\n\n\n\n{\\displaystyle ({\\dot {u}}_{0},{\\dot {\\lambda }}_{0})\\,}\n\n is the tangent vector at \n\n\n\n(\n\nu\n\n0\n\n\n,\n\nλ\n\n0\n\n\n)\n\n\n\n{\\displaystyle (u_{0},\\lambda _{0})\\,}\n\n. The Jacobian of this system is the bordered matrix\n\n\n\n\n\n[\n\n\n\n\n\nF\n\nu\n\n\n\n\n\nF\n\nλ\n\n\n\n\n\n\n\n\n\n\nu\n˙\n\n\n\n\n∗\n\n\n\n\n\n\n\nλ\n˙\n\n\n\n\n\n\n\n]\n\n\n\n\n{\\displaystyle \\left[{\\begin{array}{cc}F_{u}&F_{\\lambda }\\\\{\\dot {u}}^{*}&{\\dot {\\lambda }}\\\\\\end{array}}\\right]\\,}\n\n\nAt regular points, where the unmodified Jacobian is full rank, the tangent vector spans the null space of the top row of this new Jacobian. Appending the tangent vector as the last row can be seen as determining the coefficient of the null vector in the general solution of the Newton system (particular solution plus an arbitrary multiple of the null vector).\nThis method is a variant of pseudo-arclength continuation. Instead of using the tangent at the initial point in the arclength constraint, the tangent at the current solution is used. This is equivalent to using the pseudo-inverse of the Jacobian in Newton's method, and allows longer steps to be made. [B17]\nThe parameter \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n in the algorithms described above is a real scalar. Most physical and design problems generally have many more than one parameter. Higher-dimensional continuation refers to the case when \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n is a k-vector.\nThe same terminology applies. A regular solution is a solution at which the Jacobian is full rank \n\n\n\n(\nn\n)\n\n\n{\\displaystyle (n)}\n\n. A singular solution is a solution at which the Jacobian is less than full rank.\nA regular solution lies on a k-dimensional surface, which can be parameterized by a point in the tangent space (the null space of the Jacobian). This is again a straightforward application of the Implicit Function Theorem.\nNumerical continuation techniques have found a great degree of acceptance in the study of chaotic dynamical systems and various other systems which belong to the realm of catastrophe theory. The reason for such usage stems from the fact that various non-linear dynamical systems behave in a deterministic and predictable manner within a range of parameters which are included in the equations of the system. However, for a certain parameter value the system starts behaving chaotically and hence it become necessary to follow the parameter in order to be able to decipher the occurrences of when the system starts being non-predictable, and what exactly (theoretically) makes the system become unstable.\nAnalysis of parameter continuation can lead to more insights about stable/critical point bifurcations. Study of saddle-node, transcritical, pitch-fork, period doubling, Hopf, secondary Hopf (Neimark) bifurcations of stable solutions allows for a theoretical discussion of the circumstances and occurrences which arise at the critical points. Parameter continuation also gives a more dependable system to analyze a dynamical system as it is more stable than more interactive, time-stepped numerical solutions. Especially in cases where the dynamical system is prone to blow-up at certain parameter values (or combination of values for multiple parameters).\nIt is extremely insightful as to the presence of stable solutions (attracting or repelling) in the study of Nonlinear Partial Differential Equations where times stepping in the form of the Crank Nicolson algorithm is extremely time consuming as well as unstable in cases of nonlinear growth of the dependent variables in the system. The study of turbulence is another field where the Numerical Continuation techniques have been used to study the advent of turbulence in a system starting at low Reynolds numbers. Also, research using these techniques has provided the possibility of finding stable manifolds and bifurcations to invariant-tori in the case of the restricted three body problem in Newtonian gravity and have also given interesting and deep insights into the behaviour of systems such as the Lorenz equations.\n(Under Construction) See also The SIAM Activity Group on Dynamical Systems' list http://www.dynamicalsystems.org/sw/sw/\nThis problem, of finding the points which F maps into the origin appears in computer graphics as the problems of drawing contour maps (n=2), or isosurface(n=3). The contour with value h is the set of all solution components of F-h=0\n[B1] \"Introduction to Numerical Continuation Methods\", Eugene L. Allgower and Kurt Georg, SIAM Classics in Applied Mathematics 45. 2003.\n[B2] \"Numerical Methods for Bifurcations of Dynamical Equilibria\", Willy J. F. Govaerts, SIAM 2000.\n[B3] \"Lyapunov-Schmidt Methods in Nonlinear Analysis and Applications\", Nikolay Sidorov, Boris Loginov, Aleksandr Sinitsyn, and Michail Falaleev, Kluwer Academic Publishers, 2002.\n[B4] \"Methods of Bifurcation Theory\", Shui-Nee Chow and Jack K. Hale, Springer-Verlag 1982.\n[B5] \"Elements of Applied Bifurcation Theory\", Yuri A. Kunetsov, Springer-Verlag Applied Mathematical Sciences 112, 1995.\n[B6] \"Nonlinear Oscillations, Dynamical Systems, and Bifurcations of Vector Fields\", John Guckenheimer and Philip Holmes, Springer-Verlag Applied Mathematical Sciences 42, 1983.\n[B7] \"Elementary Stability and Bifurcation Theory\", Gerard Iooss and Daniel D. Joseph, Springer-Verlag Undergraduate Texts in Mathematics, 1980.\n[B8] \"Singularity Theory and an Introduction to Catastrophe Theory\", Yung-Chen Lu, Springer-Verlag, 1976.\n[B9] \"Global Bifurcations and Chaos, Analytic Methods\", S. Wiggins, Springer-Verlag Applied Mathematical Sciences 73, 1988.\n[B10] \"Singularities and Groups in Bifurcation Theory, volume I\", Martin Golubitsky and David G. Schaeffer, Springer-Verlag Applied Mathematical Sciences 51, 1985.\n[B11] \"Singularities and Groups in Bifurcation Theory, volume II\", Martin Golubitsky, Ian Stewart and David G. Schaeffer, Springer-Verlag Applied Mathematical Sciences 69, 1988.\n[B12] \"Solving Polynomial Systems Using Continuation for Engineering and Scientific Problems\", Alexander Morgan, Prentice-Hall, Englewood Cliffs, N.J. 1987.\n[B13] \"Pathways to Solutions, Fixed Points and Equilibria\", C. B. Garcia and W. I. Zangwill, Prentice-Hall, 1981.\n[B14] \"The Implicit Function Theorem: History, Theory and Applications\", Steven G. Krantz and Harold R. Parks, Birkhauser, 2002.\n[B15] \"Nonlinear Functional Analysis\", J. T. Schwartz, Gordon and Breach Science Publishers, Notes on Mathematics and its Applications, 1969.\n[B16] \"Topics in Nonlinear Functional Analysis\", Louis Nirenberg (notes by Ralph A. Artino), AMS Courant Lecture Notes in Mathematics 6, 1974.\n[B17] \"Newton Methods for Nonlinear Problems -- Affine Invariance and Adaptive Algorithms\", P. Deuflhard, Series Computational Mathematics 35, Springer, 2006.\n[A1] \"An Algorithm for Piecewise Linear Approximation of Implicitly Defined Two-Dimensional Surfaces\", Eugene L. Allgower and Stefan Gnutzmann, SIAM Journal on Numerical Analysis, Volume 24, Number 2, 452—469, 1987.\n[A2] \"Simplicial and Continuation Methods for Approximations, Fixed Points and Solutions to Systems of Equations\", E. L. Allgower and K. Georg, SIAM Review, Volume 22, 28—85, 1980.\n[A3] \"An Algorithm for Piecewise-Linear Approximation of an Implicitly Defined Manifold\", Eugene L. Allgower and Phillip H. Schmidt, SIAM Journal on Numerical Analysis, Volume 22, Number 2, 322—346, April 1985.\n[A4] \"Contour Tracing by Piecewise Linear Approximations\", David P. Dobkin, Silvio V. F. Levy, William P. Thurston and Allan R. Wilks, ACM Transactions on Graphics, 9(4) 389-423, 1990.\n[A5] \"Numerical Solution of Bifurcation and Nonlinear Eigenvalue Problems\", H. B. Keller, in \"Applications of Bifurcation Theory\", P. Rabinowitz ed., Academic Press, 1977.\n[A6] \"A Locally Parameterized Continuation Process\", W.C. Rheinboldt and J.V. Burkardt, ACM Transactions on Mathematical Software, Volume 9, 236—246, 1983.\n[A7] \"Nonlinear Numerics\" E. Doedel, International Journal of Bifurcation and Chaos, 7(9):2127-2143, 1997.\n[A8] \"Nonlinear Computation\", R. Seydel, International Journal of Bifurcation and Chaos, 7(9):2105-2126, 1997.\n[A9] \"On a Moving Frame Algorithm and the Triangulation of Equilibrium Manifolds\", W.C. Rheinboldt, In T. Kuper, R. Seydel, and H. Troger eds. \"ISNM79: Bifurcation: Analysis, Algorithms, Applications\", pages 256-267. Birkhauser, 1987.\n[A10] \"On the Computation of Multi-Dimensional Solution Manifolds of Parameterized Equations\", W.C. Rheinboldt, Numerishe Mathematik, 53, 1988, pages 165-181.\n[A11] \"On the Simplicial Approximation of Implicitly Defined Two-Dimensional Manifolds\", M. L. Brodzik and W.C. Rheinboldt, Computers and Mathematics with Applications, 28(9): 9-21, 1994.\n[A12] \"The Computation of Simplicial Approximations of Implicitly Defined p-Manifolds\", M. L. Brodzik, Computers and Mathematics with Applications, 36(6):93-113, 1998.\n[A13] \"New Algorithm for Two-Dimensional Numerical Continuation\", R. Melville and D. S. Mackey, Computers and Mathematics with Applications, 30(1):31-46, 1995.\n[A14] \"Multiple Parameter Continuation: Computing Implicitly Defined k-manifolds\", M. E. Henderson, IJBC 12[3]:451-76, 2003.\n[A15] \"MANPACK: a set of algorithms for computations on implicitly defined manifolds\", W. C. Rheinboldt, Comput. Math. Applic. 27 pages 15–9, 1996.\n[A16] \"CANDYS/QA - A Software System For Qualitative Analysis Of Nonlinear Dynamical Systems\", Feudel, U. and W. Jansen, Int. J. Bifurcation and Chaos, vol. 2 no. 4, pp. 773–794, World Scientific, 1992.", 
    "dbpedia_url": "http://dbpedia.org/resource/Numerical_continuation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Numerical_continuation\n"
}