{
    "about": "A Nyquist plot is a parametric plot of a frequency response used in automatic control and signal processing. The most common use of Nyquist plots is for assessing the stability of a system with feedback. In Cartesian coordinates, the real part of the transfer function is plotted on the X axis. The imaginary part is plotted on the Y axis. The frequency is swept as a parameter, resulting in a plot per frequency. Alternatively, in polar coordinates, the gain of the transfer function is plotted as the radial coordinate, while the phase of the transfer function is plotted as the angular coordinate. The Nyquist plot is named after Harry Nyquist, a former engineer at Bell Laboratories.", 
    "name": "Nyquist Plot", 
    "classification": "Signal Processing", 
    "full_text": "A Nyquist plot is a parametric plot of a frequency response used in automatic control and signal processing. The most common use of Nyquist plots is for assessing the stability of a system with feedback. In Cartesian coordinates, the real part of the transfer function is plotted on the X axis. The imaginary part is plotted on the Y axis. The frequency is swept as a parameter, resulting in a plot per frequency. Alternatively, in polar coordinates, the gain of the transfer function is plotted as the radial coordinate, while the phase of the transfer function is plotted as the angular coordinate. The Nyquist plot is named after Harry Nyquist, a former engineer at Bell Laboratories.\n\n\nAssessment of the stability of a closed-loop negative feedback system is done by applying the Nyquist stability criterion to the Nyquist plot of the open-loop system (i.e. the same system without its feedback loop). This method is easily applicable even for systems with delays and other non-rational transfer functions, which may appear difficult to analyze by means of other methods. Stability is determined by looking at the number of encirclements of the point at (-1,0). The range of gains over which the system will be stable can be determined by looking at crossings of the real axis.\nThe Nyquist plot can provide some information about the shape of the transfer function. For instance, the plot provides information on the difference between the number of poles and zeros of the transfer function[1] by the angle at which the curve approaches the origin.\nWhen drawn by hand, a cartoon version of the Nyquist plot is sometimes used, which shows the linearity of the curve, but where coordinates are distorted to show more detail in regions of interest. When plotted computationally, one needs to be careful to cover all frequencies of interest. This typically means that the parameter is swept logarithmically, in order to cover a wide range of values.", 
    "dbpedia_url": "http://dbpedia.org/resource/Nyquist_plot", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Nyquist_plot\n"
}