{
    "about": "In numerical analysis, the Nyström method[1] or quadrature method seeks the numerical solution of an integral equation by replacing the integral with a representative weighted sum. The continuous problem is broken into \n\n\n\nn\n\n\n{\\displaystyle n}\n\n discrete intervals, quadrature or numerical integration determines the weights and locations of representative points for the integral. The discrete problem to be solved is now a system of linear equations with n equations and n unknowns.", 
    "name": "NyströM Method", 
    "classification": "Numerical Analysis", 
    "full_text": "In numerical analysis, the Nyström method[1] or quadrature method seeks the numerical solution of an integral equation by replacing the integral with a representative weighted sum. The continuous problem is broken into \n\n\n\nn\n\n\n{\\displaystyle n}\n\n discrete intervals, quadrature or numerical integration determines the weights and locations of representative points for the integral. The discrete problem to be solved is now a system of linear equations with n equations and n unknowns.\nFrom the n solved points the function value at other points is interpolated consistent with the chosen quadrature method. Depending on the original problem and the choice of quadrature the problem may be ill-conditioned.\nSince the linear equations require \n\n\n\nO\n(\n\nn\n\n3\n\n\n)\n\n\n{\\displaystyle O(n^{3})}\n\n operations to solve, hence high-order quadrature rules perform better because low-order quadrature rules require large \n\n\n\nn\n\n\n{\\displaystyle n}\n\n for a given accuracy. Gaussian quadrature is normally a good choice for smooth, non-singular problems.\n\n\nApplying this to the inhomogeneous Fredholm equation of the second kind\nresults in\nThe most important step of the Nyström method is sampling, because different sampled landmark points give different approximations of the original matrix.\nUniform sampling without replacement: is the most used approach for this purpose, where every point has the same probability of being included in the sample.\nMSSS is an non-uniform sampling approach that considers both the variance and the similarity of the data distribution in its sampling data, which approximately maximizes the determinant of the reduced similarity matrix that represents the mutual similarities between sampled data points. It is shown in[2] that this approach increase the speed of the clustering on large datasets.", 
    "dbpedia_url": "http://dbpedia.org/resource/Nyström_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Nyström_method\n"
}