{
    "about": "The odds-algorithm is a mathematical method for computing optimal strategies for a class of problems that belong to the domain of optimal stopping problems. Their solution follows from the odds-strategy, and the importance of the odds-strategy lies in its optimality, as explained below. This was used to devise betting strategies called martingales.", 
    "name": "Odds Algorithm", 
    "classification": "Statistical Algorithms", 
    "full_text": "The odds-algorithm is a mathematical method for computing optimal strategies for a class of problems that belong to the domain of optimal stopping problems. Their solution follows from the odds-strategy, and the importance of the odds-strategy lies in its optimality, as explained below. This was used to devise betting strategies called martingales.\nThe odds-algorithm applies to a class of problems called last-success-problems. Formally, the objective in these problems is to maximize the probability of identifying in a sequence of sequentially observed independent events the last event satisfying a specific criterion (a \"specific event\"). This identification must be done at the time of observation. No revisiting of preceding observations is permitted. Usually, a specific event is defined by the decision maker as an event that is of true interest in the view of \"stopping\" to take a well-defined action. Such problems are encountered in several situations.\n\n\nTwo different situations exemplify the interest in maximizing the probability to stop on a last specific event.\nConsider a sequence of n independent events. Associate with this sequence another sequence \n\n\n\n\nI\n\n1\n\n\n,\n\n\nI\n\n2\n\n\n,\n\n…\n,\n\n\nI\n\nn\n\n\n\n\n{\\displaystyle I_{1},\\,I_{2},\\,\\dots ,\\,I_{n}}\n\n with values 1 or 0. Here \n\n\n\n\n\nI\n\nk\n\n\n=\n1\n\n\n{\\displaystyle \\,I_{k}=1}\n\n stands for the event that the kth observation is interesting (as defined by the decision maker), and \n\n\n\n\n\nI\n\nk\n\n\n=\n0\n\n\n{\\displaystyle \\,I_{k}=0}\n\n for non-interesting. Let \n\n\n\n\n\np\n\nk\n\n\n=\nP\n(\n\n\nI\n\nk\n\n\n\n=\n1\n)\n\n\n{\\displaystyle \\,p_{k}=P(\\,I_{k}\\,=1)}\n\n be the probability that the kth event is interesting. Further let \n\n\n\n\n\nq\n\nk\n\n\n=\n\n1\n−\n\np\n\nk\n\n\n\n\n{\\displaystyle \\,q_{k}=\\,1-p_{k}}\n\n and \n\n\n\n\n\nr\n\nk\n\n\n=\n\np\n\nk\n\n\n\n/\n\n\nq\n\nk\n\n\n\n\n{\\displaystyle \\,r_{k}=p_{k}/q_{k}}\n\n. Note that \n\n\n\n\n\nr\n\nk\n\n\n\n\n{\\displaystyle \\,r_{k}}\n\n represents the odds of the kth event turning out to be interesting, explaining the name of the odds-algorithm.\nThe odds-algorithm sums up the odds in reverse order\nuntil this sum reaches or exceeds the value 1 for the first time. If this happens at index s, it saves s and the corresponding sum\nIf the sum of the odds does not reach 1, it sets s = 1. At the same time it computes\nThe output is\nThe odds-strategy is the rule to observe the events one after the other and to stop on the first interesting event from index s onwards (if any), where s is the stopping threshold of output a.\nThe importance of the odds-strategy, and hence of the odds-algorithm, lies in the following odds-theorem.\nThe odds-theorem states that\nThe odds-algorithm computes the optimal strategy and the optimal win probability at the same time. Also, the number of operations of the odds-algorithm is (sub)linear in n. Hence no quicker algorithm can possibly exist for all sequences, so that the odds-algorithm is, at the same time, optimal as an algorithm.\nF. T. Bruss (2000) devised the odds algorithm, and coined its name. It is also known as Bruss-algorithm (strategy). Free implementations can be found on the web.\nApplications reach from medical questions in clinical trials over sales problems, secretary problems, portfolio selection, (one-way) search strategies, trajectory problems and the parking problem to problems in on-line maintenance and others.\nThere exists, in the same spirit, an Odds-Theorem for continuous-time arrival processes with independent increments such as the Poisson process (Bruss (2000)). In some cases, the odds are not necessarily known in advance (as in Example 2 above) so that the application of the odds-algorithm is not directly possible. In this case each step can use sequential estimates of the odds. This is meaningful, if the number of unknown parameters is not large compared with the number n of observations. The question of optimality is then more complicated, however, and requires additional studies. Generalizations of the odds-algorithm allow for different rewards for failing to stop and wrong stops as well as replacing independence assumptions by weaker ones (Ferguson (2008)).\nBruss and Paindaveine (2000) discussed a problem of selecting the last \n\n\n\nk\n\n\n{\\displaystyle k}\n\n successes. Tamaki (2010) proved a multiplicative odds theorem which deals with a problem of stopping at any of the last \n\n\n\nk\n\n\n{\\displaystyle k}\n\n successes.", 
    "dbpedia_url": "http://dbpedia.org/resource/Odds_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Odds_algorithm\n"
}