{
    "about": "In computational complexity theory, a branch of computer science, the Max/min CSP/Ones classification theorems state necessary and sufficient conditions that determine the complexity classes of problems about satisfying a subset S of boolean relations.[1] They are similar to Schaefer's dichotomy theorem, which classifies the complexity of satisfying finite sets of relations; however, the Max/min CSP/Ones classification theorems give information about the complexity of approximating an optimal solution to a problem defined by S.", 
    "classification": "Approximation Algorithms", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Max/min_CSP/Ones_classification_theorems\n", 
    "full_text": "In computational complexity theory, a branch of computer science, the Max/min CSP/Ones classification theorems state necessary and sufficient conditions that determine the complexity classes of problems about satisfying a subset S of boolean relations.[1] They are similar to Schaefer's dichotomy theorem, which classifies the complexity of satisfying finite sets of relations; however, the Max/min CSP/Ones classification theorems give information about the complexity of approximating an optimal solution to a problem defined by S.\nGiven a set S of clauses, the Max constraint satisfaction problem (CSP) is to find the maximum number of satisfiable (possibly weighted) clauses in S. Similarly, the Min CSP problem is to minimize this number of clauses. The Max Ones problem is to maximize the number of boolean variables in S that are set to 1 when all clauses are satisfied, and the Min Ones problem is to minimize this number.[2]\nWhen using the classifications below, the problem's complexity class is determined by the topmost classification that it satisfies.\n\n\nWe define for brevity some terms here, which are used in the classifications below.\nThe following conditions comprise the classification theorem for Max CSP problems. [1]\nThe following conditions comprise the classification theorem for Max Ones problems. [1]\nThe following conditions comprise the classification theorem for Min CSP problems. [1]\nThe following conditions comprise the classification theorem for Min Ones problems. [1]", 
    "name": "Ones Classification Theorems"
}