{
    "about": "Musical \"outboard equipment\" or \"gear\" is used to alter how a musical instrument sounds. Outboard, (external effects units) can be used either during a live performance or in the recording studio. These are separate from the effects that may be applied by using a mixing console or a digital audio workstation. Some outboard effects units and digital signal processing (DSP) boxes commonly found in a studio are:", 
    "name": "Outboard Gear", 
    "classification": "Digital Signal Processing", 
    "full_text": "Musical \"outboard equipment\" or \"gear\" is used to alter how a musical instrument sounds. Outboard, (external effects units) can be used either during a live performance or in the recording studio. These are separate from the effects that may be applied by using a mixing console or a digital audio workstation. Some outboard effects units and digital signal processing (DSP) boxes commonly found in a studio are:\n\n\nThe term \"outboard\" was originally used to describe a piece of audio equipment that existed outside of a studio or venue's primary analog mixing board. Today, analog effects are also considered \"outboard\" when used in conjunction with console-free computer-based digital recording systems.[3]\nFamous examples include UREI's analog dynamic range compressors, such as the LA-2A and 1176, early multi-effects units like those made by Eventide, and physical or digital reverb processors invented by EMT and Lexicon.\nSome units either introduce a reverberation (echo) effect, or some kind of pitch transformation or \"colouration\" of the singers voice. Digital units have been designed that can compress or expand the duration of sound, these alter the speed of length of the original sound.\nThe invention of the MIDI interfaced electronic keyboard has seen a leap forward in the way that the sound of musical instruments is produced on stage or in the recording studio. The modern keyboard produces digital signals when the keys are depressed, these signals are processed by external effects units to reproduce original digitally sampled instrument sounds, such as a classical piano or string and wind instrument. This allows the user of such a device to reproduce the sound of virtually any instrument.[4]\nThe term outboard can be considered \"out of board\" or \"not inside the board\". When recording engineers / live sound technicians needed an external processor that was not a part of their mixing surface they would go \"Outboard\".", 
    "dbpedia_url": "http://dbpedia.org/resource/Outboard_gear", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Outboard_gear\n"
}