{
    "about": "In complex analysis, a Padé table is an array, possibly of infinite extent, of the rational Padé approximants", 
    "name": "Padé Table", 
    "classification": "Numerical Analysis", 
    "full_text": "In complex analysis, a Padé table is an array, possibly of infinite extent, of the rational Padé approximants\nto a given complex formal power series. Certain sequences of approximants lying within a Padé table can often be shown to correspond with successive convergents of a continued fraction representation of a holomorphic or meromorphic function.\n\n\nAlthough earlier mathematicians had obtained sporadic results involving sequences of rational approximations to transcendental functions, Frobenius (in 1881) was apparently the first to organize the approximants in the form of a table. Henri Padé further expanded this notion in his doctoral thesis Sur la representation approchee d'une fonction par des fractions rationelles, in 1892. Over the ensuing 16 years Padé published 28 additional papers exploring the properties of his table, and relating the table to analytic continued fractions.[1]\nModern interest in Padé tables was revived by H. S. Wall and Oskar Perron, who were primarily interested in the connections between the tables and certain classes of continued fractions. Daniel Shanks and Peter Wynn published influential papers about 1955, and W. B. Gragg obtained far-reaching convergence results during the '70s. More recently, the widespread use of electronic computers has stimulated a great deal of additional interest in the subject.[2]\nA function f(z) is represented by a formal power series:\nwhere c0 ≠ 0, by convention. The (m, n)th entry[3] Rm, n in the Padé table for f(z) is then given by\nwhere Pm(z) and Qn(z) are polynomials of degrees not more than m and n, respectively. The coefficients {ai} and {bi} can always be found by considering the expression\nand equating coefficients of like powers of z up through m + n. For the coefficients of powers m + 1 to m + n, the right hand side is 0 and the resulting system of linear equations contains a homogeneous system of n equations in the n + 1 unknowns bi, and so admits of infinitely many solutions each of which determines a possible Qn. Pm is then easily found by equating the first m coefficients of the equation above. However, it can be shown that, due to cancellation, the generated rational functions Rm, n are all the same, so that the (m, n)th entry in the Padé table is unique.[2] Alternatively, we may require that b0 = 1, thus putting the table in a standard form.\nAlthough the entries in the Padé table can always be generated by solving this system of equations, that approach is computationally expensive. Usage of the Padé table has been extended to meromorphic functions by newer, timesaving methods such as the epsilon algorithm.[4]\nBecause of the way the (m, n)th approximant is constructed, the difference\nis a power series whose first term is of degree no less than\nIf the first term of that difference is of degree\nthen the rational function Rm, n occupies\ncells in the Padé table, from position (m, n) through position (m+r, n+r), inclusive. In other words, if the same rational function appears more than once in the table, that rational function occupies a square block of cells within the table. This result is known as the block theorem.\nIf a particular rational function occurs exactly once in the Padé table, it is called a normal approximant to f(z). If every entry in the complete Padé table is normal, the table itself is said to be normal. Normal Padé approximants can be characterized using determinants of the coefficients cn in the Taylor series expansion of f(z), as follows. Define the (m, n)th determinant by\nwith Dm,0 = 1, Dm,1 = cm, and ck = 0 for k < 0. Then\nOne of the most important forms in which an analytic continued fraction can appear is as a regular C-fraction, which is a continued fraction of the form\nwhere the ai ≠ 0 are complex constants, and z is a complex variable.\nThere is an intimate connection between regular C-fractions and Padé tables with normal approximants along the main diagonal: the \"stairstep\" sequence of Padé approximants R0,0, R1,0, R1,1, R2,1, R2,2, … is normal if and only if that sequence coincides with the successive convergents of a regular C-fraction. In other words, if the Padé table is normal along the main diagonal, it can be used to construct a regular C-fraction, and if a regular C-fraction representation for the function f(z) exists, then the main diagonal of the Padé table representing f(z) is normal.[2]\nHere is an example of a Padé table, for the exponential function.\nSeveral interesting features are immediately apparent.\nThe procedure used to derive Gauss's continued fraction can be applied to a certain confluent hypergeometric series to derive the following C-fraction expansion for the exponential function, valid throughout the entire complex plane:\nBy applying the fundamental recurrence formulas one may easily verify that the successive convergents of this C-fraction are the stairstep sequence of Padé approximants R0,0, R1,0, R1,1, … Interestingly, in this particular case a closely related continued fraction can be obtained from the identity\nthat continued fraction looks like this:\nThis fraction's successive convergents also appear in the Padé table, and form the sequence R0,0, R0,1, R1,1, R1,2, R2,2, …\nA formal Newton series L is of the form\nwhere the sequence {βk} of points in the complex plane is known as the set of interpolation points. A sequence of rational approximants Rm,n can be formed for such a series L in a manner entirely analogous to the procedure described above, and the approximants can be arranged in a Newton-Padé table. It has been shown[6] that some \"staircase\" sequences in the Newton-Padé table correspond with the successive convergents of a Thiele-type continued fraction, which is of the form\nMathematicians have also constructed two-point Padé tables by considering two series, one in powers of z, the other in powers of 1/z, which alternately represent the function f(z) in a neighborhood of zero and in a neighborhood of infinity.[2]", 
    "dbpedia_url": "http://dbpedia.org/resource/Padé_table", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Padé_table\n"
}