{
    "about": "In mathematics a Padé approximant is the \"best\" approximation of a function by a rational function of given order – under this technique, the approximant's power series agrees with the power series of the function it is approximating. The technique was developed around 1890 by Henri Padé, but goes back to Georg Frobenius who introduced the idea and investigated the features of rational approximations of power series.", 
    "name": "Padé Approximant", 
    "classification": "Numerical Analysis", 
    "full_text": "In mathematics a Padé approximant is the \"best\" approximation of a function by a rational function of given order – under this technique, the approximant's power series agrees with the power series of the function it is approximating. The technique was developed around 1890 by Henri Padé, but goes back to Georg Frobenius who introduced the idea and investigated the features of rational approximations of power series.\nThe Padé approximant often gives better approximation of the function than truncating its Taylor series, and it may still work where the Taylor series does not converge. For these reasons Padé approximants are used extensively in computer calculations. They have also been used as auxiliary functions in Diophantine approximation and transcendental number theory, though for sharp results ad hoc methods, in some sense inspired by the Padé theory, typically replace them.\n\n\nGiven a function f and two integers m ≥ 0 and n ≥ 1, the Padé approximant of order [m/n] is the rational function\nwhich agrees with f(x) to the highest possible order, which amounts to\nEquivalently, if R(x) is expanded in a Maclaurin series (Taylor series at 0), its first m + n terms would cancel the first m + n terms of f(x), and as such:\nThe Padé approximant is unique for given m and n, that is, the coefficients \n\n\n\n\na\n\n0\n\n\n,\n\na\n\n1\n\n\n,\n…\n,\n\na\n\nm\n\n\n,\n\nb\n\n1\n\n\n,\n…\n,\n\nb\n\nn\n\n\n\n\n{\\displaystyle a_{0},a_{1},\\dots ,a_{m},b_{1},\\dots ,b_{n}}\n\n can be uniquely determined. It is for reasons of uniqueness that the zero-th order term at the denominator of R(x) was chosen to be 1, otherwise the numerator and denominator of R(x) would have been unique only up to multiplication by a constant.\nThe Padé approximant defined above is also denoted as\nFor given x, Padé approximants can be computed by Wynn's epsilon algorithm[1] and also other sequence transformations[2] from the partial sums\nof the Taylor series of f, i.e., we have\nf can also be a formal power series, and, hence, Padé approximants can also be applied to the summation of divergent series.\nOne way to compute a Padé approximant is via the extended Euclidean algorithm for the polynomial gcd.[3] The relation\nis equivalent to the existence of some factor K(x) such that\nwhich can be interpreted as the Bézout identity of one step in the computation of the extended gcd of the polynomials \n\n\n\n\nT\n\nm\n+\nn\n\n\n(\nx\n)\n\n\n{\\displaystyle T_{m+n}(x)}\n\n and \n\n\n\n\nx\n\nm\n+\nn\n+\n1\n\n\n\n\n{\\displaystyle x^{m+n+1}}\n\n.\nTo recapitulate: to compute the gcd of two polynomials p and q, one computes via long division the remainder sequence\nk = 1, 2, 3, ... with \n\n\n\ndeg\n⁡\n\nr\n\nk\n+\n1\n\n\n<\ndeg\n⁡\n\nr\n\nk\n\n\n\n\n\n{\\displaystyle \\deg r_{k+1}<\\deg r_{k}\\,}\n\n, until \n\n\n\n\nr\n\nk\n+\n1\n\n\n=\n0\n\n\n{\\displaystyle r_{k+1}=0}\n\n. For the Bézout identities of the extended gcd one computes simultaneously the two polynomial sequences\nto obtain in each step the Bézout identity\nFor the [m/n] approximant, one thus carries out the extended euclidean algorithm for\nand stops it at the last instant that \n\n\n\n\nv\n\nk\n\n\n\n\n{\\displaystyle v_{k}}\n\n has degree n or smaller.\nThen the polynomials \n\n\n\nP\n=\n\nr\n\nk\n\n\n,\n\nQ\n=\n\nv\n\nk\n\n\n\n\n{\\displaystyle P=r_{k},\\;Q=v_{k}}\n\n give the [m/n] Padé approximant. If one were to compute all steps of the extended gcd computation, one would obtain an anti-diagonal of the Pade table.\nTo study the resummation of a divergent series, say\nit can be useful to introduce the Padé or simply rational zeta function as\nwhere\nis the Padé approximation of order (m, n) of the function f(x). The zeta regularization value at s = 0 is taken to be the sum of the divergent series.\nThe functional equation for this Padé zeta function is\nwhere aj and bj are the coefficients in the Padé approximation. The subscript '0' means that the Padé is of order [0/0] and hence, we have the Riemann zeta function.\nPadé approximants can be used to extract critical points and exponents of functions. In thermodynamics, if a function f(x) behaves in a non-analytic way near a point x = r like \n\n\n\nf\n(\nx\n)\n∼\n\n|\n\nx\n−\nr\n\n\n|\n\n\np\n\n\n\n\n{\\displaystyle f(x)\\sim |x-r|^{p}}\n\n, one calls x = r a critical point and p the associated critical exponent of f. If sufficient terms of the series expansion of f are known, one can approximately extract the critical points and the critical exponents from respectively the poles and residues of the Padé approximants \n\n\n\n[\nn\n\n/\n\nn\n+\n1\n\n]\n\ng\n\n\n(\nx\n)\n\n\n{\\displaystyle [n/n+1]_{g}(x)}\n\n where \n\n\n\ng\n=\n\n\n\nf\n′\n\nf\n\n\n\n\n{\\displaystyle g={\\frac {f'}{f}}}\n\n.\nA Padé approximant approximates a function in one variable. An approximant in two variables is called a Chisholm approximant (after J. S. Chisholm), in multiple variables a Canterbury approximant (after Graves-Morris at the University of Kent).", 
    "dbpedia_url": "http://dbpedia.org/resource/Padé_approximant", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Padé_approximant\n"
}