{
    "about": "In numerical analysis, pairwise summation, also called cascade summation, is a technique to sum a sequence of finite-precision floating-point numbers that substantially reduces the accumulated round-off error compared to naively accumulating the sum in sequence.[1] Although there are other techniques such as Kahan summation that typically have even smaller round-off errors, pairwise summation is nearly as good (differing only by a logarithmic factor) while having much lower computational cost—it can be implemented so as to have nearly the same cost (and exactly the same number of arithmetic operations) as naive summation.", 
    "name": "Pairwise Summation", 
    "classification": "Numerical Analysis", 
    "full_text": "In numerical analysis, pairwise summation, also called cascade summation, is a technique to sum a sequence of finite-precision floating-point numbers that substantially reduces the accumulated round-off error compared to naively accumulating the sum in sequence.[1] Although there are other techniques such as Kahan summation that typically have even smaller round-off errors, pairwise summation is nearly as good (differing only by a logarithmic factor) while having much lower computational cost—it can be implemented so as to have nearly the same cost (and exactly the same number of arithmetic operations) as naive summation.\nIn particular, pairwise summation of a sequence of n numbers xn works by recursively breaking the sequence into two halves, summing each half, and adding the two sums: a divide and conquer algorithm. Its worst-case roundoff errors grow asymptotically as at most O(ε log n), where ε is the machine precision (assuming a fixed condition number, as discussed below).[1] In comparison, the naive technique of accumulating the sum in sequence (adding each xi one at a time for i = 1, ..., n) has roundoff errors that grow at worst as O(εn).[1] Kahan summation has a worst-case error of roughly O(ε), independent of n, but requires several times more arithmetic operations.[1] If the roundoff errors are random, and in particular have random signs, then they form a random walk and the error growth is reduced to an average of \n\n\n\nO\n(\nε\n\n\nlog\n⁡\nn\n\n\n)\n\n\n{\\displaystyle O(\\varepsilon {\\sqrt {\\log n}})}\n\n for pairwise summation.[2]\nA very similar recursive structure of summation is found in many fast Fourier transform (FFT) algorithms, and is responsible for the same slow roundoff accumulation of those FFTs.[2][3]\nPairwise summation is the default summation algorithm in NumPy[4] and the Julia technical-computing language,[5] where in both cases it was found to have comparable speed to naive summation (thanks to the use of a large base case).\nIn pseudocode, the pairwise summation algorithm for an array x of length n > 0 can be written:\nFor some sufficiently small N, this algorithm switches to a naive loop-based summation as a base case, whose error bound is O(Nε).[6] The entire sum has a worst-case error that grows asymptotically as O(ε log n) for large n, for a given condition number (see below).\nIn an algorithm of this sort (as for divide and conquer algorithms in general[7]), it is desirable to use a larger base case in order to amortize the overhead of the recursion. If N = 1, then there is roughly one recursive subroutine call for every input, but more generally there is one recursive call for (roughly) every N/2 inputs if the recursion stops at exactly n = N. By making N sufficiently large, the overhead of recursion can be made negligible (precisely this technique of a large base case for recursive summation is employed by high-performance FFT implementations[3]).\nRegardless of N, exactly n−1 additions are performed in total, the same as for naive summation, so if the recursion overhead is made negligible then pairwise summation has essentially the same computational cost as for naive summation.\nA variation on this idea is to break the sum into b blocks at each recursive stage, summing each block recursively, and then summing the results, which was dubbed a \"superblock\" algorithm by its proposers.[8] The above pairwise algorithm corresponds to b = 2 for every stage except for the last stage which is b = N.\nSuppose that one is summing n values xi, for i = 1, ..., n. The exact sum is:\n(computed with infinite precision).\nWith pairwise summation for a base case N = 1, one instead obtains \n\n\n\n\nS\n\nn\n\n\n+\n\nE\n\nn\n\n\n\n\n{\\displaystyle S_{n}+E_{n}}\n\n, where the error \n\n\n\n\nE\n\nn\n\n\n\n\n{\\displaystyle E_{n}}\n\n is bounded above by:[1]\nwhere ε is the machine precision of the arithmetic being employed (e.g. ε ≈ 10−16 for standard double precision floating point). Usually, the quantity of interest is the relative error \n\n\n\n\n|\n\n\nE\n\nn\n\n\n\n|\n\n\n/\n\n\n|\n\n\nS\n\nn\n\n\n\n|\n\n\n\n{\\displaystyle |E_{n}|/|S_{n}|}\n\n, which is therefore bounded above by:\nIn the expression for the relative error bound, the fraction (Σ|xi|/|Σxi|) is the condition number of the summation problem. Essentially, the condition number represents the intrinsic sensitivity of the summation problem to errors, regardless of how it is computed.[9] The relative error bound of every (backwards stable) summation method by a fixed algorithm in fixed precision (i.e. not those that use arbitrary-precision arithmetic, nor algorithms whose memory and time requirements change based on the data), is proportional to this condition number.[1] An ill-conditioned summation problem is one in which this ratio is large, and in this case even pairwise summation can have a large relative error. For example, if the summands xi are uncorrelated random numbers with zero mean, the sum is a random walk and the condition number will grow proportional to \n\n\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\sqrt {n}}}\n\n. On the other hand, for random inputs with nonzero mean the condition number asymptotes to a finite constant as \n\n\n\nn\n→\n∞\n\n\n{\\displaystyle n\\to \\infty }\n\n. If the inputs are all non-negative, then the condition number is 1.\nNote that the \n\n\n\n1\n−\nε\n\nlog\n\n2\n\n\n⁡\nn\n\n\n{\\displaystyle 1-\\varepsilon \\log _{2}n}\n\n denominator is effectively 1 in practice, since \n\n\n\nε\n\nlog\n\n2\n\n\n⁡\nn\n\n\n{\\displaystyle \\varepsilon \\log _{2}n}\n\n is much smaller than 1 until n becomes of order 21/ε, which is roughly 101015 in double precision.\nIn comparison, the relative error bound for naive summation (simply adding the numbers in sequence, rounding at each step) grows as \n\n\n\nO\n(\nε\nn\n)\n\n\n{\\displaystyle O(\\varepsilon n)}\n\n multiplied by the condition number.[1] In practice, it is much more likely that the rounding errors have a random sign, with zero mean, so that they form a random walk; in this case, naive summation has a root mean square relative error that grows as \n\n\n\nO\n(\nε\n\n\nn\n\n\n)\n\n\n{\\displaystyle O(\\varepsilon {\\sqrt {n}})}\n\n and pairwise summation as an error that grows as \n\n\n\nO\n(\nε\n\n\nlog\n⁡\nn\n\n\n)\n\n\n{\\displaystyle O(\\varepsilon {\\sqrt {\\log n}})}\n\n on average.[2]", 
    "dbpedia_url": "http://dbpedia.org/resource/Pairwise_summation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Pairwise_summation\n"
}