{
    "about": "Pattern search (PS) is a family of numerical optimization methods that do not require the gradient of the problem to be optimized. Hence PS can be used on functions that are not continuous or differentiable. Such optimization methods are also known as direct-search, derivative-free, or black-box methods.", 
    "name": "Pattern Search (Optimization)", 
    "classification": "Optimization Algorithms And Methods", 
    "full_text": "Pattern search (PS) is a family of numerical optimization methods that do not require the gradient of the problem to be optimized. Hence PS can be used on functions that are not continuous or differentiable. Such optimization methods are also known as direct-search, derivative-free, or black-box methods.\nThe name \"pattern search\" was coined by Hooke and Jeeves.[1] An early and simple PS variant is attributed to Fermi and Metropolis when they worked at the Los Alamos National Laboratory as described by Davidon,[2] who summarized the algorithm as follows:\nThey varied one theoretical parameter at a time by steps of the same magnitude, and when no such increase or decrease in any one parameter further improved the fit to the experimental data, they halved the step size and repeated the process until the steps were deemed sufficiently small.\nA convergent pattern-search method was proposed by Yu, who proved that it converged using the theory of positive bases.[3] Later, Torczon, Lagarias, and coauthors[4][5] used positive-basis techniques to prove the convergence of another pattern-search method on a specific class of functions. Outside of such classes, pattern search is a heuristic that can provide useful approximate solutions for some problems, but can fail on others. Outside of such classes, pattern search is not an iterative method that converges to a solution; indeed, pattern-search methods can converge to non-stationary points on some relatively tame problems.[6][7]", 
    "dbpedia_url": "http://dbpedia.org/resource/Pattern_search_(optimization)", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Pattern_search_(optimization)\n"
}