{
    "about": "\nSimplicial continuation, or piecewise linear continuation (Allgower and Georg),[1][2] is a one-parameter continuation method which is well suited to small to medium embedding spaces. The algorithm has been generalized to compute higher-dimensional manifolds by (Allgower and Gnutzman)[3] and (Allgower and Schmidt).[4]", 
    "name": "Piecewise Linear Continuation", 
    "classification": "Numerical Analysis", 
    "full_text": "\nSimplicial continuation, or piecewise linear continuation (Allgower and Georg),[1][2] is a one-parameter continuation method which is well suited to small to medium embedding spaces. The algorithm has been generalized to compute higher-dimensional manifolds by (Allgower and Gnutzman)[3] and (Allgower and Schmidt).[4]\nThe algorithm for drawing contours is a simplicial continuation algorithm, and since it is easy to visualize, it serves as a good introduction to the algorithm.\n\n\nThe contour plotting problem is to find the zeros (contours) of \n\n\n\nf\n(\nx\n,\ny\n)\n=\n0\n\n\n\n{\\displaystyle f(x,y)=0\\,}\n\n (\n\n\n\nf\n(\n⋅\n)\n\n\n\n{\\displaystyle f(\\cdot )\\,}\n\n a smooth scalar valued function) in the square \n\n\n\n0\n≤\nx\n≤\n1\n,\n0\n≤\ny\n≤\n1\n\n\n\n{\\displaystyle 0\\leq x\\leq 1,0\\leq y\\leq 1\\,}\n\n,\n \nThe square is divided into small triangles, usually by introducing points at the corners of a regular square mesh \n\n\n\ni\n\nh\n\nx\n\n\n≤\nx\n≤\n(\ni\n+\n1\n)\n\nh\n\nx\n\n\n\n\n\n{\\displaystyle ih_{x}\\leq x\\leq (i+1)h_{x}\\,}\n\n, \n\n\n\nj\n\nh\n\ny\n\n\n≤\ny\n≤\n(\nj\n+\n1\n)\n\nh\n\ny\n\n\n\n\n\n{\\displaystyle jh_{y}\\leq y\\leq (j+1)h_{y}\\,}\n\n, making a table of the values of \n\n\n\nf\n(\n\nx\n\ni\n\n\n,\n\ny\n\nj\n\n\n)\n\n\n\n{\\displaystyle f(x_{i},y_{j})\\,}\n\n at each corner \n\n\n\n(\ni\n,\nj\n)\n\n\n\n{\\displaystyle (i,j)\\,}\n\n, and then dividing each square into two triangles. The value of \n\n\n\nf\n(\n\nx\n\ni\n\n\n,\n\ny\n\nj\n\n\n)\n\n\n\n{\\displaystyle f(x_{i},y_{j})\\,}\n\n at the corners of the triangle defines a unique Piecewise Linear interpolant \n\n\n\nl\nf\n(\nx\n,\ny\n)\n\n\n\n{\\displaystyle lf(x,y)\\,}\n\n to \n\n\n\nf\n(\n⋅\n)\n\n\n\n{\\displaystyle f(\\cdot )\\,}\n\n over each triangle. One way of writing this interpolant on the triangle with corners \n\n\n\n(\n\nx\n\n0\n\n\n,\n\ny\n\n0\n\n\n)\n,\n \n(\n\nx\n\n1\n\n\n,\n\ny\n\n1\n\n\n)\n,\n \n(\n\nx\n\n2\n\n\n,\n\ny\n\n2\n\n\n)\n\n\n\n{\\displaystyle (x_{0},y_{0}),~(x_{1},y_{1}),~(x_{2},y_{2})\\,}\n\n is as the set of equations\nThe first four equations can be solved for \n\n\n\n(\ns\n,\nt\n)\n\n\n\n{\\displaystyle (s,t)\\,}\n\n (this maps the original triangle to a right unit triangle), then the remaining equation gives the interpolated value of \n\n\n\nf\n(\n⋅\n)\n\n\n\n{\\displaystyle f(\\cdot )\\,}\n\n. Over the whole mesh of triangles, this piecewise linear interpolant is continuous.\n \nThe contour of the interpolant on an individual triangle is a line segment (it is an interval on the intersection of two planes). The equation for the line can be found, however the points where the line crosses the edges of the triangle are the endpoints of the line segment.\n\nThe contour of the piecewise linear interpolant is a set of curves made up of these line segments. Any point on the edge connecting \n\n\n\n(\n\nx\n\n0\n\n\n,\n\ny\n\n0\n\n\n)\n\n\n\n{\\displaystyle (x_{0},y_{0})\\,}\n\n and \n\n\n\n(\n\nx\n\n1\n\n\n,\n\ny\n\n1\n\n\n)\n\n\n\n{\\displaystyle (x_{1},y_{1})\\,}\n\n can be written as\nwith \n\n\n\nt\n\n\n\n{\\displaystyle t\\,}\n\n in \n\n\n\n(\n0\n,\n1\n)\n\n\n\n{\\displaystyle (0,1)\\,}\n\n, and the linear interpolant over the edge is\nSo setting \n\n\n\nf\n=\n0\n\n\n\n{\\displaystyle f=0\\,}\n\n\nSince this only depends on values on the edge, every triangle which shares this edge will produce the same point, so the contour will be continuous. Each triangle can be tested independently, and if all are checked the entire set of contour curves can be found.\nPiecewise linear continuation is similar to contour plotting (Dobkin, Silvio, Thurston and Wilks),[5] but in higher dimensions. The algorithm is based on the following results:\nAn '(n-1)'-dimensional simplex has n vertices, and the function F assigns an 'n'-vector to each. The simplex is convex, and any point within the simplex is a convex combination of the vertices. That is:\nIf x is in the interior of an (n-1)-dimensional simplex with n vertices \n\n\n\n\nv\n\ni\n\n\n\n\n{\\displaystyle v_{i}}\n\n, then there are positive scalars \n\n\n\n0\n<\n\nα\n\ni\n\n\n\n\n{\\displaystyle 0<\\alpha _{i}}\n\n such that\nIf the vertices of the simplex are linearly independent the non-negative scalars \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n are unique for each point x, and are called the barycentric coordinates of x. They determine the value of the unique interpolant by the formula:\nThere are basically two tests. The one which was first used labels the vertices of the simplex with a vector of signs (+/-) of the coordinates of the vertex. For example the vertex (.5,-.2,1.) would be labelled (+,-,+). A simplex is called completely labelled if there is a vertex whose label begins with a string of \"+\" signs of length 0,1,2,3,4,...n. A completely labelled simplex contains a neighborhood of the origin. This may be surprising, but what underlies this result is that for each coordinate of a completely labelled simplex there is a vector with \"+\" and another with a \"-\". Put another way, the smallest cube with edges parallel to the coordinate axes and which covers the simplex has pairs of faces on opposite sides of 0. (i.e. a \"+\" and a \"-\" for each coordinate).\nThe second approach is called vector labelling. It is based on the barycentric coordindates of the vertices of the simplex. The first step is to find the barycentric coordinates of the origin, and then the test that the simplex contains the origin is simply that all the barycentric coordinates are positive and the sum is less than 1.\nwhere\n\n\n\n\n\n\n\n\nv\n~\n\n\n\n\ni\n\n\n=\n\n{\n\n\n\n\n\nv\n\n1\n\n\n+\n\nv\n\nn\n\n\n−\n\nv\n\n0\n\n\n\n\n\ni\n=\n0\n\n\n\n\n\nv\n\ni\n+\n1\n\n\n+\n\nv\n\ni\n−\n1\n\n\n−\n\nv\n\ni\n\n\n\n\n\n\n\n\n0\n\n\n\n\n\nv\n\nn\n−\n1\n\n\n+\n\nv\n\n0\n\n\n−\n\nv\n\nn\n\n\n\n\n\ni\n=\nn\n\n\n\n\n\n\n\n\n{\\displaystyle {\\tilde {v}}_{i}=\\left\\{{\\begin{array}{lcl}v_{1}+v_{n}-v_{0}&&i=0\\\\v_{i+1}+v_{i-1}-v_{i}&\\qquad \\qquad &0\\\\v_{n-1}+v_{0}-v_{n}&&i=n\\\\\\end{array}}\\right.}\n\n\n \n", 
    "dbpedia_url": "http://dbpedia.org/resource/Piecewise_linear_continuation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Piecewise_linear_continuation\n"
}