{
    "about": "Pitch correction is an electronic effects unit or audio software that changes the intonation (highness or lowness in pitch) of an audio signal so that all pitches will be notes from the equally tempered system (i.e., like the pitches on a piano). Pitch correction devices do this without affecting other aspects of its sound. Pitch correction first detects the pitch of an audio signal (using a live pitch detection algorithm), then calculates the desired change and modifies the audio signal accordingly. The widest use of pitch corrector devices is in Western popular music on vocal lines.", 
    "name": "Pitch Correction", 
    "classification": "Digital Signal Processing", 
    "full_text": "Pitch correction is an electronic effects unit or audio software that changes the intonation (highness or lowness in pitch) of an audio signal so that all pitches will be notes from the equally tempered system (i.e., like the pitches on a piano). Pitch correction devices do this without affecting other aspects of its sound. Pitch correction first detects the pitch of an audio signal (using a live pitch detection algorithm), then calculates the desired change and modifies the audio signal accordingly. The widest use of pitch corrector devices is in Western popular music on vocal lines.\n\n\nPrior to the invention of pitch correction, errors in vocal intonation in recordings could only be corrected by re-recording the entire song (in the early era of recording) or, after the development of multitrack recording, by overdubbing the incorrect vocal pitches by re-recording those specific notes or sections. Prior to the development of electronic pitch correction devices, there was no way to make \"real time\" corrections to a live vocal performance in a concert (although lip-syncing was used in some cases where a performer was not able to sing adequately in live performances).\nPitch correction was relatively uncommon before 1997, when Antares Audio Technology's Auto-Tune Pitch Correcting Plug-In was introduced. This replaced slow studio techniques with a real-time process that could also be used in live performance.[1]\nAuto-Tune is still widely used, as are other pitch-correction algorithms including Celemony's Direct Note Access which allows adjustment of individual notes in a polyphonic audio signal,[2] and Celemony's Melodyne. Pitch correction is now a common feature in digital audio editing software, having first appeared as a Pro Tools plugin and now being found in products such as Apple GarageBand, Apple Logic Pro, Adobe Audition, FL Studio, Digital Performer, and Steinberg Cubase. MorphTune also provides this functionality. It is also available in the form of rackmount hardware, such as the TC-Helicon VoiceOne. There is also a large stompbox pedal that provides pitch correction in a small device that could be used at a show by plugging the vocal microphone into the pedal and then sending the signal to the PA system. A free VST plugin known as GSnap can also be used to get the same effect. In the Linux FOSS community, Autotalent and Zita-AT1 offer this functionality.\nThe most common use of pitch correctors is to fix wrong intonation (tuning) of notes sung by vocalists in popular music sound recordings. The use of pitch correction speeds up the recording process, because singers do not need to keep singing a song or vocal line and re-recording it until the pitches are correct. The pitch correction software can correct any pitch errors in the singing without the need for overdubbing or re-recording.\nWhile pitch correction is most associated with fixing vocal intonation errors, it can also be used to fix intonation in recorded instrumental parts such as violin, cello or trumpet.\nPitch correctors are commonly used in music studios to add the sound of vocal harmony to certain sung words or phrases without re-recording those lines again at the necessary pitches or using backup singers. Depending on the model used, various vocal effects can be added and the better quality devices can be adjusted to allow expression to remain in the music. Some pitch correctors can add vibrato.\nWhile pitch correction devices were initially designed to produce natural-sounding effects, producers discovered that by setting extreme parameter values, unusual effects could be obtained. Pitch correction devices became popular in the late 1990s as a distinctively electronic, vocoder-like voice effect. A notable example of Auto-Tune-based pitch correction is the Cher effect, so named because producer Mark Taylor originated the effect in her 1998 hit song \"Believe\".[3] The effect has been used by composer John Boswell for his Symphony of Science and Symphony of Bang Goes The Theory (a BBC science show) mash-ups. American Rapper T-Pain is known for his skillful use of this effect.\nOne criticism of pitch correction is that it allows recording engineers to create a perfectly in-tune performance from a vocalist who is otherwise not skilled enough to give one, adding a degree of dishonesty to music.[4] This concept was featured in a 2001 episode of The Simpsons, entitled \"New Kids on the Blecch\". In the episode, a cartoon representation of a pitch corrector (labeled \"Studio Magic\") was used to make up for the total lack of singing talent in a manufactured boy band, of which Bart Simpson was a member.\nIn 2003, Allison Moorer began attaching stickers to her 2002 album Miss Fortune reading \"Absolutely no vocal tuning or pitch-correction was used in the making of this record.\" [5]\nA Chicago Tribune report from 2003 stated that \"many successful mainstream artists in most genres of music—perhaps a majority of artists—are using pitch correction\".[6] Timothy Powell, a producer/engineer, stated in 2003 that he is \"even starting to see vocal tuning devices show up in concert settings\"; he states that \"That's more of an ethical dilemma—people pay a premium dollar to see artists and artists want people to see them at their best.\"[6]\nIn 2010, producer Teddy Riley claimed that the processing of Michael Jackson's voice with Melodyne caused fans to question the authenticity of the voice on the posthumous album Michael.[7] Riley claimed that because he did not have a \"final vocal\" from Jackson, Melodyne had to be used \"to make his voice work with the actual music,\" \"to get him in key\" and this resulted in the vibrato sounding \"a little off\" or \"over-processed.\"[7]", 
    "dbpedia_url": "http://dbpedia.org/resource/Pitch_correction", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Pitch_correction\n"
}