{
    "about": "Time stretching is the process of changing the speed or duration of an audio signal without affecting its pitch. Pitch scaling or pitch shifting is the opposite: the process of changing the pitch without affecting the speed. Similar methods can change speed, pitch, or both at once, in a time-varying way.", 
    "classification": "Digital Signal Processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Audio_time-scale/pitch_modification\n", 
    "full_text": "Time stretching is the process of changing the speed or duration of an audio signal without affecting its pitch. Pitch scaling or pitch shifting is the opposite: the process of changing the pitch without affecting the speed. Similar methods can change speed, pitch, or both at once, in a time-varying way.\nThese processes are used, for instance, to match the pitches and tempos of two pre-recorded clips for mixing when the clips cannot be reperformed or resampled. (A drum track containing no pitched instruments could be moderately resampled for tempo without adverse effects, but a pitched track could not). They are also used to create effects such as increasing the range of an instrument (like pitch shifting a guitar down an octave).\n\n\nThe simplest way to change the duration or pitch of a digital audio clip is to resample it. This is a mathematical operation that effectively rebuilds a continuous waveform from its samples and then samples that waveform again at a different rate. When the new samples are played at the original sampling frequency, the audio clip sounds faster or slower. Unfortunately, the frequencies in the sample are always scaled at the same rate as the speed, transposing its perceived pitch up or down in the process. In other words, slowing down the recording lowers the pitch, speeding it up raises the pitch, and using this method the two effects cannot be separated. This is analogous to speeding up or slowing down an analogue recording, like a phonograph record or tape, creating the Chipmunk effect.\nIn order to preserve an audio signal's pitch when stretching or compressing its duration, many TSM procedures follow a frame-based approach.[1] Given an original discrete-time audio signal, this strategy's first step is to split the signal into short analysis frames of fixed length. The analysis frames are spaced by a fixed number of samples, called the analysis hopsize \n\n\n\n\nH\n\na\n\n\n∈\n\nN\n\n\n\n{\\displaystyle H_{a}\\in \\mathbb {N} }\n\n. To achieve the actual time-scale modification, the analysis frames are then temporally relocated to have a synthesis hopsize \n\n\n\n\nH\n\ns\n\n\n∈\n\nN\n\n\n\n{\\displaystyle H_{s}\\in \\mathbb {N} }\n\n. This frame relocation results in a modification of the signal's duration by a stretching factor of \n\n\n\nα\n=\n\nH\n\ns\n\n\n\n/\n\n\nH\n\na\n\n\n\n\n{\\displaystyle \\alpha =H_{s}/H_{a}}\n\n. However, simply superimposing the unmodified analysis frames typically results in undesired artifacts such as phase discontinuities or amplitude fluctuations. To prevent this kind of artifacts, the analysis frames are adapted to form synthesis frames, prior to the reconstruction of the time-scale modified output signal.\nThe strategy of how to derive the synthesis frames from the analysis frames is a key difference among different TSM procedures.\nOne way of stretching the length of a signal without affecting the pitch is to build a phase vocoder after Flanagan, Golden, and Portnoff.\nBasic steps:\nThe phase vocoder handles sinusoid components well, but early implementations introduced considerable smearing on transient (\"beat\") waveforms at all non-integer compression/expansion rates, which renders the results phasey and diffuse. Recent improvements allow better quality results at all compression/expansion ratios but a residual smearing effect still remains.\nThe phase vocoder technique can also be used to perform pitch shifting, chorusing, timbre manipulation, harmonizing, and other unusual modifications, all of which can be changed as a function of time.\nAnother method for time stretching relies on a spectral model of the signal. In this method, peaks are identified in frames using the STFT of the signal, and sinusoidal \"tracks\" are created by connecting peaks in adjacent frames. The tracks are then re-synthesized at a new time scale. This method can yield good results on both polyphonic and percussive material, especially when the signal is separated into sub-bands. However, this method is more computationally demanding than other methods.[citation needed]\nRabiner and Schafer in 1978 put forth an alternate solution that works in the time domain: attempt to find the period (or equivalently the fundamental frequency) of a given section of the wave using some pitch detection algorithm (commonly the peak of the signal's autocorrelation, or sometimes cepstral processing), and crossfade one period into another.\nThis is called time-domain harmonic scaling[4] or the synchronized overlap-add method (SOLA) and performs somewhat faster than the phase vocoder on slower machines but fails when the autocorrelation mis-estimates the period of a signal with complicated harmonics (such as orchestral pieces).\nAdobe Audition (formerly Cool Edit Pro) seems to solve this by looking for the period closest to a center period that the user specifies, which should be an integer multiple of the tempo, and between 30 Hz and the lowest bass frequency.\nThis is much more limited in scope than the phase vocoder based processing, but can be made much less processor intensive, for real-time applications. It provides the most coherent results for single-pitched sounds like voice or musically monophonic instrument recordings.\nHigh-end commercial audio processing packages either combine the two techniques (for example by separating the signal into sinusoid and transient waveforms), or use other techniques based on the wavelet transform, or artificial neural network processing[citation needed], producing the highest-quality time stretching.\nFor the specific case of speech, time stretching can be performed using PSOLA.\nWhile one might expect speeding up to reduce comprehension, Herb Friedman says that \"Experiments have shown that the brain works most efficiently if the information rate through the ears--via speech--is the \"average\" reading rate, which is about 200-300 wpm (words per minute), yet the average rate of speech is in the neighborhood of 100-150 wpm.\" [1]\nSpeeding up audio is seen as the equivalent of \"speed reading\" [2] [3].\nTime stretching is often used to adjust Radio commercials [4] and the audio of Television advertisements [5] to fit exactly into the 30 or 60 seconds available.\nThese techniques can also be used to transpose an audio sample while holding speed or duration constant. This may be accomplished by time stretching and then resampling back to the original length. Alternatively, the frequency of the sinusoids in a sinusoidal model may be altered directly, and the signal reconstructed at the appropriate time scale.\nTransposing can be called frequency scaling or pitch shifting, depending on perspective.\nFor example, one could move the pitch of every note up by a perfect fifth, keeping the tempo the same. One can view this transposition as \"pitch shifting\", \"shifting\" each note up 7 keys on a piano keyboard, or adding a fixed amount on the Mel scale, or adding a fixed amount in linear pitch space. One can view the same transposition as \"frequency scaling\", \"scaling\" (multiplying) the frequency of every note by 3/2.\nMusical transposition preserves the ratios of the harmonic frequencies that determine the sound's timbre, unlike the frequency shift performed by amplitude modulation, which adds a fixed frequency offset to the frequency of every note. (In theory one could perform a literal pitch scaling in which the musical pitch space location is scaled [a higher note would be shifted at a greater interval in linear pitch space than a lower note], but that is highly unusual, and not musical[citation needed]).\nTime domain processing works much better here, as smearing is less noticeable, but scaling vocal samples distorts the formants into a sort of Alvin and the Chipmunks-like effect, which may be desirable or undesirable. A process that preserves the formants and character of a voice involves analyzing the signal with a channel vocoder or LPC vocoder plus any of several pitch detection algorithms and then resynthesizing it at a different fundamental frequency.\nA detailed description of older analog recording techniques for pitch shifting can be found within the Alvin and the Chipmunks entry.", 
    "name": "Pitch Modification"
}