{
    "about": "In mathematics, signal processing and control theory, a pole–zero plot is a graphical representation of a rational transfer function in the complex plane which helps to convey certain properties of the system such as:", 
    "name": "Pole–Zero Plot", 
    "classification": "Signal Processing", 
    "full_text": "In mathematics, signal processing and control theory, a pole–zero plot is a graphical representation of a rational transfer function in the complex plane which helps to convey certain properties of the system such as:\nA pole-zero plot shows the location in the complex plane of the poles and zeros of the transfer function of a dynamic system, such as a controller, compensator, sensor, equalizer, filter, or communications channel. By convention, the poles of the system are indicated in the plot by an X while the zeroes are indicated by a circle or O.\nA pole-zero plot can represent either a continuous-time (CT) or a discrete-time (DT) system. For a CT system, the plane in which the poles and zeros appear is the s plane of the Laplace transform. In this context, the parameter s represents the complex angular frequency, which is the domain of the CT transfer function. For a DT system, the plane is the z plane, where z represents the domain of the Z-transform.\n\n\nIn general, a rational transfer function for a continuous-time LTI system has the form:\nwhere\nEither M or N or both may be zero, but in real systems, it should be the case that \n\n\n\nM\n≤\nN\n\n\n{\\displaystyle M\\leq N}\n\n; otherwise the gain would be unbounded at high frequencies.\nThe region of convergence (ROC) for a given CT transfer function is a half-plane or vertical strip, either of which contains no poles. In general, the ROC is not unique, and the particular ROC in any given case depends on whether the system is causal or anti-causal.\nThe ROC is usually chosen to include the imaginary axis since it is important for most practical systems to have BIBO stability.\nThis system has no (finite) zeros and two poles:\nand\nThe pole-zero plot would be:\n\nNotice that these two poles are complex conjugates, which is the necessary and sufficient condition to have real-valued coefficients in the differential equation representing the system.\nIn general, a rational transfer function for a discrete-time LTI system has the form:\nwhere\nEither M or N or both may be zero.\nThe region of convergence (ROC) for a given DT transfer function is a disk or annulus which contains no poles. In general, the ROC is not unique, and the particular ROC in any given case depends on whether the system is causal or anti-causal.\nThe ROC is usually chosen to include the unit circle since it is important for most practical systems to have BIBO stability.\nIf \n\n\n\nP\n(\nz\n)\n\n\n{\\displaystyle P(z)}\n\n and \n\n\n\nQ\n(\nz\n)\n\n\n{\\displaystyle Q(z)}\n\n are completely factored, their solution can be easily plotted in the z-plane. For example, given the following transfer function:\nThe only (finite) zero is located at: \n\n\n\nz\n=\n−\n2\n\n\n{\\displaystyle z=-2}\n\n, and the two poles are located at: \n\n\n\nz\n=\n±\n\n\nj\n2\n\n\n\n\n{\\displaystyle z=\\pm {\\frac {j}{2}}}\n\n, where j is the imaginary unit.\nThe pole–zero plot would be:\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Pole–zero_plot", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Pole–zero_plot\n"
}