{
    "about": "In mathematics, a polynomial decomposition expresses a polynomial f as the functional composition \n\n\n\ng\n∘\nh\n\n\n{\\displaystyle g\\circ h}\n\n of polynomials g and h, where g and h have degree greater than 1.[1] Algorithms are known for decomposing polynomials in polynomial time.", 
    "name": "Polynomial Decomposition", 
    "classification": "Computer Algebra", 
    "full_text": "In mathematics, a polynomial decomposition expresses a polynomial f as the functional composition \n\n\n\ng\n∘\nh\n\n\n{\\displaystyle g\\circ h}\n\n of polynomials g and h, where g and h have degree greater than 1.[1] Algorithms are known for decomposing polynomials in polynomial time.\nPolynomials which are decomposable in this way are composite polynomials; those which are not are prime or indecomposable polynomials[2] (not to be confused with irreducible polynomials, which cannot be factored into products of polynomials).\n\n\nIn the simplest case, one of the polynomials is a monomial. For example,\ndecomposes into\nsince\nLess trivially,\nA polynomial may have distinct decompositions into indecomposable polynomials where \n\n\n\nf\n=\n\ng\n\n1\n\n\n∘\n\ng\n\n2\n\n\n∘\n⋯\n∘\n\ng\n\nm\n\n\n=\n\nh\n\n1\n\n\n∘\n\nh\n\n2\n\n\n∘\n⋯\n∘\n\nh\n\nn\n\n\n\n\n{\\displaystyle f=g_{1}\\circ g_{2}\\circ \\cdots \\circ g_{m}=h_{1}\\circ h_{2}\\circ \\cdots \\circ h_{n}}\n\n where \n\n\n\n\ng\n\ni\n\n\n≠\n\nh\n\ni\n\n\n\n\n{\\displaystyle g_{i}\\neq h_{i}}\n\n for some \n\n\n\ni\n\n\n{\\displaystyle i}\n\n. The restriction in the definition to polynomials of degree greater than one excludes the infinitely many decompositions possible with linear polynomials.\nJoseph Ritt proved that \n\n\n\nm\n=\nn\n\n\n{\\displaystyle m=n}\n\n, and the degrees of the components are the same, but possibly in different order; this is Ritt's polynomial decomposition theorem.[2][3] For example, \n\n\n\n\nx\n\n2\n\n\n∘\n\nx\n\n3\n\n\n=\n\nx\n\n3\n\n\n∘\n\nx\n\n2\n\n\n\n\n{\\displaystyle x^{2}\\circ x^{3}=x^{3}\\circ x^{2}}\n\n.\nA polynomial decomposition may enable more efficient evaluation of a polynomial. For example,\ncan be calculated with only 3 multiplications using the decomposition, while Horner's method would require 7.\nA polynomial decomposition enables calculation of symbolic roots using radicals, even for some irreducible polynomials. This technique is used in many computer algebra systems.[4] For example, using the decomposition\nthe roots of this irreducible polynomial can be calculated as\nEven in the case of quartic polynomials, where there is an explicit formula for the roots, solving using the decomposition often gives a simpler form. For example, the decomposition\ngives the roots\nbut straightforward application of the quartic formula gives equivalent results but in a form that is difficult to simplify and difficult to understand:\nThe first algorithm for polynomial decomposition was published in 1985,[6] though it had been discovered in 1976[7] and implemented in the Macsyma computer algebra system.[8] That algorithm took worst-case exponential time but worked independently of the characteristic of the underlying field.\nMore recent algorithms ran in polynomial time but with restrictions on the characteristic.[9]\nThe most recent algorithm calculates a decomposition in polynomial time and without restrictions on the characteristic.[10]", 
    "dbpedia_url": "http://dbpedia.org/resource/Polynomial_decomposition", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Polynomial_decomposition\n"
}