{
    "about": "In signal processing, a polyphase matrix is a matrix whose elements are filter masks. It represents a filter bank as it is used in sub-band coders alias discrete wavelet transforms.[1]", 
    "name": "Polyphase Matrix", 
    "classification": "Digital Signal Processing", 
    "full_text": "In signal processing, a polyphase matrix is a matrix whose elements are filter masks. It represents a filter bank as it is used in sub-band coders alias discrete wavelet transforms.[1]\nIf \n\n\n\n\nh\n,\n\ng\n\n\n\n{\\displaystyle \\scriptstyle h,\\,g}\n\n are two filters, then one level the traditional wavelet transform maps an input signal \n\n\n\n\n\na\n\n0\n\n\n\n\n\n{\\displaystyle \\scriptstyle a_{0}}\n\n to two output signals \n\n\n\n\n\na\n\n1\n\n\n,\n\n\nd\n\n1\n\n\n\n\n\n{\\displaystyle \\scriptstyle a_{1},\\,d_{1}}\n\n, each of the half length:\nNote, that the dot means polynomial multiplication; i.e., convolution and \n\n\n\n\n↓\n\n\n\n{\\displaystyle \\scriptstyle \\downarrow }\n\n means downsampling.\nIf the above formula is implemented directly, you will compute values that are subsequently flushed by the down-sampling. You can avoid their computation by splitting the filters and the signal into even and odd indexed values before the wavelet transformation:\nThe arrows \n\n\n\n\n←\n\n\n\n{\\displaystyle \\scriptstyle \\leftarrow }\n\n and \n\n\n\n\n→\n\n\n\n{\\displaystyle \\scriptstyle \\rightarrow }\n\n denote left and right shifting, respectively. They shall have the same precedence like convolution, because they are in fact convolutions with a shifted discrete delta impulse.\nThe wavelet transformation reformulated to the split filters is:\nThis can be written as matrix-vector-multiplication\nThis matrix \n\n\n\n\nP\n\n\n\n{\\displaystyle \\scriptstyle P}\n\n is the polyphase matrix.\nOf course, a polyphase matrix can have any size, it need not to have square shape. That is, the principle scales well to any filterbanks, multiwavelets, wavelet transforms based on fractional refinements.\n\n\nThe representation of sub-band coding by the polyphase matrix is more than about write simplification. It allows the adaptation of many results from matrix theory and module theory. The following properties are explained for a \n\n\n\n\n2\n\n×\n\n2\n\n\n\n{\\displaystyle \\scriptstyle 2\\,\\times \\,2}\n\n matrix, but they scale equally to higher dimensions.\nThe case that a polyphase matrix allows reconstruction of a processed signal from the filtered data, is called perfect reconstruction property. Mathematically this is equivalent to invertibility. According to the theorem of invertibility of a matrix over a ring, the polyphase matrix is invertible if and only if the determinant of the polyphase matrix is a Kronecker delta, which is zero everywhere except for one value.\nBy Cramer's rule the inverse of \n\n\n\n\nP\n\n\n\n{\\displaystyle \\scriptstyle P}\n\n can be given immediately.\nOrthogonality means that the adjoint matrix \n\n\n\n\n\nP\n\n∗\n\n\n\n\n\n{\\displaystyle \\scriptstyle P^{*}}\n\n is also the inverse matrix of \n\n\n\n\nP\n\n\n\n{\\displaystyle \\scriptstyle P}\n\n. The adjoint matrix is the transposed matrix with adjoint filters.\nIt implies, that the Euclidean norm of the input signals is preserved. That is, the according wavelet transform is an isometry.\nThe orthogonality condition\ncan be written out\nFor non-orthogonal polyphase matrices the question arises what Euclidean norms the output can assume. This can be bounded by the help of the operator norm.\nFor the \n\n\n\n\n2\n\n×\n\n2\n\n\n\n{\\displaystyle \\scriptstyle 2\\,\\times \\,2}\n\n polyphase matrix the Euclidean operator norm can be given explicitly using the Frobenius norm \n\n\n\n\n∥\n⋅\n\n∥\n\nF\n\n\n\n\n\n{\\displaystyle \\scriptstyle \\|\\cdot \\|_{F}}\n\n and the z transform \n\n\n\n\nZ\n\n\n\n{\\displaystyle \\scriptstyle Z}\n\n:[2]\nThis is a special case of the \n\n\n\nn\n×\nn\n\n\n{\\displaystyle n\\times n}\n\n matrix where the operator norm can be obtained via z transform and the spectral radius of a matrix or the according spectral norm.\nA signal, where these bounds are assumed can be derived from the eigenvector corresponding to the maximizing and minimizing eigenvalue.\nThe concept of the polyphase matrix allows matrix decomposition. For instance the decomposition into addition matrices leads to the lifting scheme.[3] However, classical matrix decompositions like LU and QR decomposition cannot be applied immediately, because the filters form a ring with respect to convolution, not a field.", 
    "dbpedia_url": "http://dbpedia.org/resource/Polyphase_matrix", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Polyphase_matrix\n"
}