{
    "about": "In numerical analysis, predictor–corrector methods belong to a class of algorithms designed to integrate ordinary differential equations - to find an unknown function that satisfies a given differential equation. All such algorithms proceed in two steps:", 
    "name": "Predictor–Corrector Method", 
    "classification": "Numerical Analysis", 
    "full_text": "In numerical analysis, predictor–corrector methods belong to a class of algorithms designed to integrate ordinary differential equations - to find an unknown function that satisfies a given differential equation. All such algorithms proceed in two steps:\n-- The initial, \"prediction\" step, starts from a function fitted to the function-values and derivative-values at a preceding set of points to extrapolate (\"anticipate\") this function's value at a subsequent, new point.\n-- The next, \"corrector\" step refines the initial approximation by using the predicted value of the function and another method to interpolate that unknown function's value at the same subsequent point.\n\nWhen considering the numerical solution of ordinary differential equations (ODEs), a predictor–corrector method typically uses an explicit method for the predictor step and an implicit method for the corrector step.\nA simple predictor–corrector method (known as Heun's method) can be constructed from the Euler method (an explicit method) and the trapezoidal rule (an implicit method).\nConsider the differential equation\nand denote the step size by \n\n\n\nh\n\n\n{\\displaystyle h}\n\n.\nFirst, the predictor step: starting from the current value \n\n\n\n\ny\n\ni\n\n\n\n\n{\\displaystyle y_{i}}\n\n, calculate an initial guess value \n\n\n\n\n\n\n\ny\n~\n\n\n\n\ni\n+\n1\n\n\n\n\n{\\displaystyle {\\tilde {y}}_{i+1}}\n\n via the Euler method,\nNext, the corrector step: improve the initial guess using trapezoidal rule,\nThat value is used as the next step.\nThere are different variants of a predictor–corrector method, depending on how often the corrector method is applied. The Predict–Evaluate–Correct–Evaluate (PECE) mode refers to the variant in the above example:\nIt is also possible to evaluate the function f only once per step by using the method in Predict–Evaluate–Correct (PEC) mode:\nAdditionally, the corrector step can be repeated in the hope that this achieves an even better approximation to the true solution. If the corrector method is run twice, this yields the PECECE mode:\nThe PECEC mode has one fewer function evaluation. More generally, if the corrector is run k times, the method is in P(EC)k or P(EC)kE mode. If the corrector method is iterated until it converges, this could be called PE(CE)∞.[1]", 
    "dbpedia_url": "http://dbpedia.org/resource/Predictor–corrector_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Predictor–corrector_method\n"
}