{
    "about": "Prefrontal cortex basal ganglia working memory (PBWM) is an algorithm that models working memory in the prefrontal cortex and the basal ganglia.[1] It can be compared to long short-term memory (LSTM) in functionality, but is more biologically explainable.[1][third-party source needed]", 
    "name": "Prefrontal Cortex Basal Ganglia Working Memory", 
    "classification": "Machine Learning Algorithms", 
    "full_text": "Prefrontal cortex basal ganglia working memory (PBWM) is an algorithm that models working memory in the prefrontal cortex and the basal ganglia.[1] It can be compared to long short-term memory (LSTM) in functionality, but is more biologically explainable.[1][third-party source needed]\nIt uses the primary value learned value model to train prefrontal cortex working-memory updating system, based on the biology of the prefrontal cortex and basal ganglia.[2]\nIt is used as part of the Leabra framework and was implemented in Emergent.[when?]\n\n\nThe prefrontal cortex has long been thought to subserve both working memory (the holding of information online for processing) and \"executive\" functions (deciding how to manipulate working memory and perform processing). Although many computational models of working memory have been developed, the mechanistic basis of executive function remains elusive.\nPBWM is a computational model of the prefrontal cortex to control both itself and other brain areas in a strategic, task-appropriate manner. These learning mechanisms are based on subcortical structures in the midbrain, basal ganglia and amygdala, which together form an actor/critic architecture. The critic system learns which prefrontal representations are task-relevant and trains the actor, which in turn provides a dynamic gating mechanism for controlling working memory updating. Computationally, the learning mechanism is designed to simultaneously solve the temporal and structural credit assignment problems.\nThe model's performance compares favorably with standard backpropagation-based temporal learning mechanisms on the challenging 1-2-AX working memory task, and other benchmark working memory tasks.[1][third-party source needed]\nFirst, there are multiple separate stripes (groups of units) in the prefrontal cortex and striatum layers. Each stripe can be independently updated, such that this system can remember several different things at the same time, each with a different \"updating policy\" of when memories are updated and maintained. The active maintenance of the memory is in prefrontal cortex (PFC), and the updating signals (and updating policy more generally) come from the striatum units (a subset of basal ganglia units).[2]\nPVLV provides reinforcement learning signals to train up the dynamic gating system in the basal ganglia.\nThe sensory input is connected to the posterior cortex which is connected to the motor output. The sensory input is also linked to the PVLV system.\nThe posterior cortex form the hidden layers of the input/output mapping. The PFC is connected with the posterior cortex to contextualize this input/output mapping.\nThe PFC (for output gating) has a localist one-to-one representation of the input units for every stripe. Thus, you can look at these PFC representations and see directly what the network is maintaining. The PFC maintains the working memory needed to perform the task.\nThis is the dynamic gating system representing the striatum units of the basal ganglia. Every even-index unit within a stripe represents \"Go\", while the odd-index units represent \"NoGo.\" The Go units cause updating of the PFC, while the NoGo units cause the PFC to maintain its existing memory representation.\nThere are groups of units for every stripe.\nIn the PBWM model in Emergent, the matrices represent the striatum.\nAll of these layers are part of PVLV system. The PVLV system controls the dopaminergic modulation of the basal ganglia (BG). Thus, BG/PVLV form an actor-critic architecture where the PVLV system learns when to update.[citation needed]\nSNrThal represents the substantia nigra pars reticulata (SNr) and the associated area of the thalamus, which produce a competition among the Go/NoGo units within a given stripe and mediates competition using k-winners-take-all dynamics. If there is more overall Go activity in a given stripe, then the associated SNrThal unit gets activated, and it drives updating in PFC. For every stripe, there is one unit in SNrThal.[citation needed]\nVentral tegmental area (VTA) and substantia nigra pars compacta (SNc) are part of the dopamine layer. This layer models midbrain dopamine neurons. They control the dopaminergic modulation of the basal ganglia.[citation needed]", 
    "dbpedia_url": "http://dbpedia.org/resource/Prefrontal_cortex_basal_ganglia_working_memory", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Prefrontal_cortex_basal_ganglia_working_memory\n"
}