{
    "about": "In statistics, propagation of uncertainty (or propagation of error) is the effect of variables' uncertainties (or errors, more specifically random errors) on the uncertainty of a function based on them. When the variables are the values of experimental measurements they have uncertainties due to measurement limitations (e.g., instrument precision) which propagate to the combination of variables in the function.", 
    "name": "Propagation Of Uncertainty", 
    "classification": "Numerical Analysis", 
    "full_text": "In statistics, propagation of uncertainty (or propagation of error) is the effect of variables' uncertainties (or errors, more specifically random errors) on the uncertainty of a function based on them. When the variables are the values of experimental measurements they have uncertainties due to measurement limitations (e.g., instrument precision) which propagate to the combination of variables in the function.\nThe uncertainty u can be expressed in a number of ways. It may be defined by the absolute error Δx. Uncertainties can also be defined by the relative error (Δx)/x, which is usually written as a percentage. Most commonly, the uncertainty on a quantity is quantified in terms of the standard deviation, σ, the positive square root of variance, σ2. The value of a quantity and its error are then expressed as an interval x ± u. If the statistical probability distribution of the variable is known or can be assumed, it is possible to derive confidence limits to describe the region within which the true value of the variable may be found. For example, the 68% confidence limits for a one-dimensional variable belonging to a normal distribution are approximately ± one standard deviation σ from the central value x, which means that the region x ± σ will cover the true value in roughly 68% of cases.\nIf the uncertainties are correlated then covariance must be taken into account. Correlation can arise from two different sources. First, the measurement errors may be correlated. Second, when the underlying values are correlated across a population, the uncertainties in the group averages will be correlated.[1]\n\n\nLet \n\n\n\n{\n\nf\n\nk\n\n\n(\n\nx\n\n1\n\n\n,\n\nx\n\n2\n\n\n,\n…\n,\n\nx\n\nn\n\n\n)\n}\n\n\n{\\displaystyle \\{f_{k}(x_{1},x_{2},\\dots ,x_{n})\\}}\n\n be a set of m functions which are linear combinations of \n\n\n\nn\n\n\n{\\displaystyle n}\n\n variables \n\n\n\n\nx\n\n1\n\n\n,\n\nx\n\n2\n\n\n,\n…\n,\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{1},x_{2},\\dots ,x_{n}}\n\n with combination coefficients \n\n\n\n\nA\n\nk\n1\n\n\n,\n\nA\n\nk\n2\n\n\n,\n…\n,\n\nA\n\nk\nn\n\n\n,\n(\nk\n=\n1\n…\nm\n)\n\n\n{\\displaystyle A_{k1},A_{k2},\\dots ,A_{kn},(k=1\\dots m)}\n\n.\nand let the variance-covariance matrix on x be denoted by \n\n\n\n\n\nΣ\n\nx\n\n\n\n\n\n\n{\\displaystyle \\mathrm {\\Sigma ^{x}} \\,}\n\n.\nThen, the variance-covariance matrix \n\n\n\n\n\nΣ\n\nf\n\n\n\n\n\n\n{\\displaystyle \\mathrm {\\Sigma ^{f}} \\,}\n\n of f is given by\nor, in matrix notation:\nThis is the most general expression for the propagation of error from one set of variables onto another. When the errors on x are uncorrelated the general expression simplifies to\nwhere \n\n\n\n\n\n\nΣ\n\n\n\nk\n\n\nx\n\n\n=\n\nσ\n\n\nx\n\nk\n\n\n\n\n2\n\n\n\n\n{\\displaystyle {\\mathit {\\Sigma }}_{k}^{x}=\\sigma _{x_{k}}^{2}}\n\n is the variance of k-th element of the x vector. Note that even though the errors on x may be uncorrelated, the errors on f are in general correlated; in other words, even if \n\n\n\n\n\nΣ\n\nx\n\n\n\n\n\n{\\displaystyle \\mathrm {\\Sigma ^{x}} }\n\n is a diagonal matrix, \n\n\n\n\n\nΣ\n\nf\n\n\n\n\n\n{\\displaystyle \\mathrm {\\Sigma ^{f}} }\n\n is in general a full matrix.\nThe general expressions for a scalar-valued function, f, are a little simpler.\n(where a is a row-vector).\nEach covariance term, \n\n\n\n\nσ\n\ni\nj\n\n\n\n\n{\\displaystyle \\sigma _{ij}}\n\n can be expressed in terms of the correlation coefficient \n\n\n\n\nρ\n\ni\nj\n\n\n\n\n\n{\\displaystyle \\rho _{ij}\\,}\n\n by \n\n\n\n\nσ\n\ni\nj\n\n\n=\n\nρ\n\ni\nj\n\n\n\nσ\n\ni\n\n\n\nσ\n\nj\n\n\n\n\n\n{\\displaystyle \\sigma _{ij}=\\rho _{ij}\\sigma _{i}\\sigma _{j}\\,}\n\n, so that an alternative expression for the variance of f is\nIn the case that the variables in x are uncorrelated this simplifies further to\nIn the simplest case of identical coefficients and variances, we find\nWhen f is a set of non-linear combination of the variables x, an interval propagation could be performed in order to compute intervals which contain all consistent values for the variables. In a probabilistic approach, the function f must usually be linearized by approximation to a first-order Taylor series expansion, though in some cases, exact formulas can be derived that do not depend on the expansion as is the case for the exact variance of products.[2] The Taylor expansion would be:\nwhere \n\n\n\n∂\n\nf\n\nk\n\n\n\n/\n\n∂\n\nx\n\ni\n\n\n\n\n{\\displaystyle \\partial f_{k}/\\partial x_{i}}\n\n denotes the partial derivative of fk with respect to the i-th variable, evaluated at the mean value of all components of vector x. Or in matrix notation,\nwhere J is the Jacobian matrix. Since f0 is a constant it does not contribute to the error on f. Therefore, the propagation of error follows the linear case, above, but replacing the linear coefficients, Aik and Ajk by the partial derivatives, \n\n\n\n\n\n\n∂\n\nf\n\nk\n\n\n\n\n∂\n\nx\n\ni\n\n\n\n\n\n\n\n{\\displaystyle {\\frac {\\partial f_{k}}{\\partial x_{i}}}}\n\n and \n\n\n\n\n\n\n∂\n\nf\n\nk\n\n\n\n\n∂\n\nx\n\nj\n\n\n\n\n\n\n\n{\\displaystyle {\\frac {\\partial f_{k}}{\\partial x_{j}}}}\n\n. In matrix notation, [3]\nThat is, the Jacobian of the function is used to transform the rows and columns of the variance-covariance matrix of the argument. Note this is equivalent to the matrix expression for the linear case with \n\n\n\n\nJ\n=\nA\n\n\n\n{\\displaystyle \\mathrm {J=A} }\n\n.\nNeglecting correlations or assuming independent variables yields a common formula among engineers and experimental scientists to calculate error propagation, the variance formula:[4]\n\n\n\n\n\ns\n\nf\n\n\n=\n\n\n\n\n(\n\n\n\n∂\nf\n\n\n∂\nx\n\n\n\n)\n\n\n2\n\n\n\ns\n\nx\n\n\n2\n\n\n+\n\n\n(\n\n\n\n∂\nf\n\n\n∂\ny\n\n\n\n)\n\n\n2\n\n\n\ns\n\ny\n\n\n2\n\n\n+\n\n\n(\n\n\n\n∂\nf\n\n\n∂\nz\n\n\n\n)\n\n\n2\n\n\n\ns\n\nz\n\n\n2\n\n\n+\n⋯\n\n\n\n\n{\\displaystyle s_{f}={\\sqrt {\\left({\\frac {\\partial f}{\\partial x}}\\right)^{2}s_{x}^{2}+\\left({\\frac {\\partial f}{\\partial y}}\\right)^{2}s_{y}^{2}+\\left({\\frac {\\partial f}{\\partial z}}\\right)^{2}s_{z}^{2}+\\cdots }}}\n\n\nwhere \n\n\n\n\ns\n\nf\n\n\n\n\n{\\displaystyle s_{f}}\n\n represents the standard deviation of the function \n\n\n\nf\n\n\n{\\displaystyle f}\n\n, \n\n\n\n\ns\n\nx\n\n\n\n\n{\\displaystyle s_{x}}\n\n represents the standard deviation of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, \n\n\n\n\ns\n\ny\n\n\n\n\n{\\displaystyle s_{y}}\n\n represents the standard deviation of \n\n\n\ny\n\n\n{\\displaystyle y}\n\n, and so forth.\nIt is important to note that this formula is based on the linear characteristics of the gradient of \n\n\n\nf\n\n\n{\\displaystyle f}\n\n and therefore it is a good estimation for the standard deviation of \n\n\n\nf\n\n\n{\\displaystyle f}\n\n as long as \n\n\n\n\ns\n\nx\n\n\n,\n\ns\n\ny\n\n\n,\n\ns\n\nz\n\n\n,\n…\n\n\n{\\displaystyle s_{x},s_{y},s_{z},\\ldots }\n\n are small compared to the partial derivatives[clarification needed].[5]\nAny non-linear differentiable function, f(a,b), of two variables, a and b, can be expanded as\nhence:\nIn the particular case that \n\n\n\nf\n=\na\nb\n\n\n\n{\\displaystyle f=ab\\!}\n\n, \n\n\n\n\n\n\n∂\nf\n\n\n∂\na\n\n\n\n=\nb\n,\n\n\n\n∂\nf\n\n\n∂\nb\n\n\n\n=\na\n\n\n{\\displaystyle {\\frac {\\partial f}{\\partial a}}=b,{\\frac {\\partial f}{\\partial b}}=a}\n\n. Then\nor\nError estimates for non-linear functions are biased on account of using a truncated series expansion. The extent of this bias depends on the nature of the function. For example, the bias on the error calculated for log x increases as x increases, since the expansion to 1 + x is a good approximation only when x is small.\nFor highly non-linear functions, there exist five categories of probabilistic approaches for uncertainty propagation;[6] see Uncertainty Quantification#Methodologies for forward uncertainty propagation for details.\nIn the special case of the inverse or reciprocal \n\n\n\n1\n\n/\n\nB\n\n\n{\\displaystyle 1/B}\n\n, where \n\n\n\nB\n=\nN\n(\n0\n,\n1\n)\n\n\n{\\displaystyle B=N(0,1)}\n\n, the distribution is a reciprocal normal distribution, and there is no definable variance. For such inverse distributions and for ratio distributions, there can be defined probabilities for intervals, which can be computed either by Monte Carlo simulation or, in some cases, by using the Geary–Hinkley transformation.[7]\nThe statistics, mean and variance, of the shifted reciprocal function \n\n\n\n\n\n1\n\np\n−\nB\n\n\n\n\n\n{\\displaystyle {\\frac {1}{p-B}}}\n\n for \n\n\n\nB\n=\nN\n(\nμ\n,\nσ\n)\n\n\n{\\displaystyle B=N(\\mu ,\\sigma )}\n\n, however, exist in a principal value sense if the difference between the shift or pole \n\n\n\np\n\n\n{\\displaystyle p}\n\n and the mean \n\n\n\nμ\n\n\n{\\displaystyle \\mu }\n\n is real. The mean of this transformed random variable is then indeed the scaled Dawson's function \n\n\n\n\n\n\n2\n\nσ\n\n\nF\n\n(\n\n\n\np\n−\nμ\n\n\n\n\n2\n\n\nσ\n\n\n\n)\n\n\n\n{\\displaystyle {\\frac {\\sqrt {2}}{\\sigma }}F\\left({\\frac {p-\\mu }{{\\sqrt {2}}\\sigma }}\\right)}\n\n.[8] In contrast, if the shift \n\n\n\np\n−\nμ\n\n\n{\\displaystyle p-\\mu }\n\n is purely complex, the mean exists and is a scaled Faddeeva function, whose exact expression depends on the sign of the imaginary part, \n\n\n\nIm\n⁡\n(\np\n−\nμ\n)\n\n\n{\\displaystyle \\operatorname {Im} (p-\\mu )}\n\n. In both cases, the variance is a simple function of the mean.[9] Therefore, the variance has to be considered in a principal value sense if \n\n\n\np\n−\nμ\n\n\n{\\displaystyle p-\\mu }\n\n is real, while it exists if the imaginary part of \n\n\n\np\n−\nμ\n\n\n{\\displaystyle p-\\mu }\n\n is non-zero. Note that these means and variances are exact, as they do not recur to linearisation of the ratio. The exact covariance of two ratios with a pair of different poles \n\n\n\n\np\n\n1\n\n\n\n\n{\\displaystyle p_{1}}\n\n and \n\n\n\n\np\n\n2\n\n\n\n\n{\\displaystyle p_{2}}\n\n is similarly available.[10] The case of the inverse of a complex normal variable \n\n\n\nB\n\n\n{\\displaystyle B}\n\n, shifted or not, exhibits different characteristics.[8]\nThis table shows the variances of simple functions of the real variables \n\n\n\nA\n,\nB\n\n\n\n{\\displaystyle A,B\\!}\n\n, with standard deviations \n\n\n\n\nσ\n\nA\n\n\n,\n\nσ\n\nB\n\n\n,\n\n\n\n{\\displaystyle \\sigma _{A},\\sigma _{B},\\,}\n\n covariance \n\n\n\n\nσ\n\nA\nB\n\n\n\n\n{\\displaystyle \\sigma _{AB}}\n\n and exactly known real-valued constants \n\n\n\na\n,\nb\n\n\n\n{\\displaystyle a,b\\,}\n\n (i.e., \n\n\n\n\nσ\n\na\n\n\n=\n\nσ\n\nb\n\n\n=\n0\n\n\n{\\displaystyle \\sigma _{a}=\\sigma _{b}=0}\n\n).\nFor uncorrelated variables (\n\n\n\n\nρ\n\nA\nB\n\n\n=\n0\n\n\n{\\displaystyle \\rho _{AB}=0}\n\n) the covariance terms are also zero, as \n\n\n\n\nσ\n\nA\nB\n\n\n=\n\nρ\n\nA\nB\n\n\n\nσ\n\nA\n\n\n\nσ\n\nB\n\n\n\n\n\n{\\displaystyle \\sigma _{AB}=\\rho _{AB}\\sigma _{A}\\sigma _{B}\\,}\n\n.\nIn this case, expressions for more complicated functions can be derived by combining simpler functions. For example, repeated multiplication, assuming no correlation gives,\nFor the case \n\n\n\nf\n=\nA\nB\n\n\n{\\displaystyle f=AB}\n\n we also have Goodman's expression[2] for the exact variance: for the uncorrelated case it is\nand therefore we have:\nWe can calculate the uncertainty propagation for the inverse tangent function as an example of using partial derivatives to propagate error.\nDefine\nwhere σx is the absolute uncertainty on our measurement of x. The derivative of f(x) with respect to x is\nTherefore, our propagated uncertainty is\nwhere σf is the absolute propagated uncertainty.\nA practical application is an experiment in which one measures current, I, and voltage, V, on a resistor in order to determine the resistance, R, using Ohm's law, R = V / I.\nGiven the measured variables with uncertainties, I ± σI and V ± σV, and neglecting their possible correlation, the uncertainty in the computed quantity, σR is", 
    "dbpedia_url": "http://dbpedia.org/resource/Propagation_of_uncertainty", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Propagation_of_uncertainty\n"
}