{
    "about": "In applied mathematics, the pseudospectral knotting method is a generalization and enhancement of a standard pseudospectral method for optimal control. The concept was introduced by I. Michael Ross and F. Fahroo[1] in 2004, and forms part of the collection of the Ross–Fahroo pseudospectral methods.", 
    "name": "Pseudospectral Knotting Method", 
    "classification": "Numerical Analysis", 
    "full_text": "In applied mathematics, the pseudospectral knotting method is a generalization and enhancement of a standard pseudospectral method for optimal control. The concept was introduced by I. Michael Ross and F. Fahroo[1] in 2004, and forms part of the collection of the Ross–Fahroo pseudospectral methods.\n\n\nAccording to Ross and Fahroo a pseudospectral (PS) knot is a double Lobatto point;[1] i.e. two boundary points on top of one another. At this point, information (such as discontinuities, jumps, dimension changes etc.) is exchanged between two standard PS methods. This information exchange is used to solve some of the most difficult problems in optimal control known as hybrid optimal control problems.[2]\nIn a hybrid optimal control problem, an optimal control problem is intertwined with a graph problem. A standard pseudospectral optimal control method is incapable of solving such problems; however, through the use of pseudospectral knots, the information of the graph can be encoded at the double Lobatto points thereby allowing a hybrid optimal control problem to be discretized and solved using powerful software such as DIDO.\nPS knots have found applications in aerospace problems such as the ascent guidance of a launch vehicles, and advancing the Aldrin Cycler through the use of solar sails.[3] [4] PS knots have also been used for anti-aliasing of PS optimal control solutions and for capturing critical information in switches in solving bang-bang-type optimal control problems.[5]\nThe PS knotting method was first implemented in the MATLAB optimal control software package, DIDO.", 
    "dbpedia_url": "http://dbpedia.org/resource/Pseudospectral_knotting_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Pseudospectral_knotting_method\n"
}