{
    "about": "In physics, a pseudopotential or effective potential is used as an approximation for the simplified description of complex systems. Applications include atomic physics and neutron scattering. The pseudopotential approximation was first introduced by Hans Hellmann in 1934.[1]", 
    "name": "Pseudopotential", 
    "classification": "Computational Physics", 
    "full_text": "In physics, a pseudopotential or effective potential is used as an approximation for the simplified description of complex systems. Applications include atomic physics and neutron scattering. The pseudopotential approximation was first introduced by Hans Hellmann in 1934.[1]\n\n\nThe pseudopotential is an attempt to replace the complicated effects of the motion of the core (i.e. non-valence) electrons of an atom and its nucleus with an effective potential, or pseudopotential, so that the Schrödinger equation contains a modified effective potential term instead of the Coulombic potential term for core electrons normally found in the Schrödinger equation.\nThe pseudopotential is an effective potential constructed to replace the atomic all-electron potential (full-potential) such that core states are eliminated and the valence electrons are described by pseudo-wavefunctions with significantly fewer nodes. This allows the pseudo-wavefunctions to be described with far fewer Fourier modes, thus making plane-wave basis sets practical to use. In this approach usually only the chemically active valence electrons are dealt with explicitly, while the core electrons are 'frozen', being considered together with the nuclei as rigid non-polarizable ion cores. It is possible to self-consistently update the pseudopotential with the chemical environment that it is embedded in, having the effect of relaxing the frozen core approximation, although this is rarely done.\nFirst-principles pseudopotentials are derived from an atomic reference state, requiring that the pseudo- and all-electron valence eigenstates have the same energies and amplitude (and thus density) outside a chosen core cut-off radius \n\n\n\n\nr\n\nc\n\n\n\n\n{\\displaystyle r_{c}}\n\n.\nPseudopotentials with larger cut-off radius are said to be softer, that is more rapidly convergent, but at the same time less transferable, that is less accurate to reproduce realistic features in different environments.\nMotivation:\nApproximations:\nEarly applications of pseudopotentials to atoms and solids based on attempts to fit atomic spectra achieved only limited success. Solid-state pseudopotentials achieved their present popularity largely because of the successful fits by Walter Harrison to the nearly free electron Fermi surface of aluminum (1958) and by James C. Phillips to the covalent energy gaps of silicon and germanium (1958). Phillips and coworkers (notably Marvin L. Cohen and coworkers) later extended this work to many other semiconductors, in what they called \"semiempirical pseudopotentials\".[4]\nNorm-conserving and ultrasoft are the two most common forms of pseudopotential used in modern plane-wave electronic structure codes. They allow a basis-set with a significantly lower cut-off (the frequency of the highest Fourier mode) to be used to describe the electron wavefunctions and so allow proper numerical convergence with reasonable computing resources. An alternative would be to augment the basis set around nuclei with atomic-like functions, as is done in LAPW. Norm-conserving pseudopotential was first proposed by Hamann, Schlüter, and Chiang (HSC) in 1979.[5] The original HSC norm-conserving pseudopotential takes the following form:\n\n\n\n\n\n\n\n\nV\n^\n\n\n\n\n\nps\n\n\n\n(\nr\n)\n=\n\n∑\n\nl\n\n\n\n∑\n\nm\n\n\n\n|\n\n\nY\n\nl\nm\n\n\n⟩\n\nV\n\nl\nm\n\n\n(\nr\n)\n⟨\n\nY\n\nl\nm\n\n\n\n|\n\n\n\n{\\displaystyle {\\hat {V}}_{\\textit {ps}}(r)=\\sum _{l}\\sum _{m}|Y_{lm}\\rangle V_{lm}(r)\\langle Y_{lm}|}\n\n\nwhere \n\n\n\n\n|\n\n\nY\n\nl\nm\n\n\n⟩\n\n\n{\\displaystyle |Y_{lm}\\rangle }\n\n projects a one-particle wavefunction, such as one Kohn-Sham orbital, to the angular momentum labeled by \n\n\n\n{\nl\n,\nm\n}\n\n\n{\\displaystyle \\{l,m\\}}\n\n. \n\n\n\n\nV\n\nl\nm\n\n\n(\nr\n)\n\n\n{\\displaystyle V_{lm}(r)}\n\n is the pseudopotential that acts on the projected component. Different angular momentum states then feel different potentials, thus the HSC norm-conserving pseudopotential is non-local, in contrast to local pseudopotential which acts on all one-particle wave-functions in the same way.\nNorm-conserving pseudopotentials are constructed to enforce two conditions.\n1. Inside the cut-off radius \n\n\n\n\nr\n\nc\n\n\n\n\n{\\displaystyle r_{c}}\n\n, the norm of each pseudo-wavefunction be identical to its corresponding all-electron wavefunction:[6]\n2. All-electron and pseudo wavefunctions are identical outside cut-off radius \n\n\n\n\nr\n\nc\n\n\n\n\n{\\displaystyle r_{c}}\n\n.\nUltrasoft pseudopotentials relax the norm-conserving constraint to reduce the necessary basis-set size further at the expense of introducing a generalized eigenvalue problem.[7] With a non-zero difference in norms we can now define:\nand so a normalised eigenstate of the pseudo Hamiltonian now obeys the generalized equation\nwhere the operator \n\n\n\n\n\n\nS\n^\n\n\n\n\n\n{\\displaystyle {\\hat {S}}}\n\n is defined as\nwhere \n\n\n\n\np\n\n\nR\n\n,\ni\n\n\n\n\n{\\displaystyle p_{\\mathbf {R} ,i}}\n\n are projectors that form a dual basis with the pseudo reference states inside the cut-off radius, and are zero outside:\nA related technique[8] is the projector augmented wave (PAW) method.\nEnrico Fermi introduced a pseudopotential, \n\n\n\nV\n\n\n{\\displaystyle V}\n\n, to describe the scattering of a free neutron by a nucleus.[9] The scattering is assumed to be s-wave scattering, and therefore spherically symmetric. Therefore, the potential is given as a function of radius, \n\n\n\nr\n\n\n{\\displaystyle r}\n\n:\n\n\n\n\nV\n(\nr\n)\n=\n\n\n\n4\nπ\n\nℏ\n\n2\n\n\n\nm\n\n\nb\n\nδ\n(\nr\n)\n\n\n{\\displaystyle V(r)={\\frac {4\\pi \\hbar ^{2}}{m}}b\\,\\delta (r)}\n\n,\nwhere \n\n\n\nℏ\n\n\n{\\displaystyle \\hbar }\n\n is the Planck constant divided by \n\n\n\n2\nπ\n\n\n{\\displaystyle 2\\pi }\n\n, \n\n\n\nm\n\n\n{\\displaystyle m}\n\n is the mass, \n\n\n\nδ\n(\nr\n)\n\n\n{\\displaystyle \\delta (r)}\n\n is the Dirac delta function, \n\n\n\nb\n\n\n{\\displaystyle b}\n\n is the bound coherent neutron scattering length, and \n\n\n\nr\n=\n0\n\n\n{\\displaystyle r=0}\n\n the center of mass of the nucleus.[10] The Fourier transform of this \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n-function leads to the constant neutron form factor.\nJames C Phillips developed a simplified pseudopotential while at Bell Labs useful for describing silicon and germanium.", 
    "dbpedia_url": "http://dbpedia.org/resource/Pseudopotential", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Pseudopotential\n"
}