{
    "about": "A pseudorandom number generator (PRNG), also known as a deterministic random bit generator (DRBG),[1] is an algorithm for generating a sequence of numbers whose properties approximate the properties of sequences of random numbers. The PRNG-generated sequence is not truly random, because it is completely determined by a relatively small set of initial values, called the PRNG's seed (which may include truly random values). Although sequences that are closer to truly random can be generated using hardware random number generators, pseudorandom number generators are important in practice for their speed in number generation and their reproducibility.[2]", 
    "name": "Pseudorandom Number Generator", 
    "classification": "Pseudorandom Number Generators", 
    "full_text": "A pseudorandom number generator (PRNG), also known as a deterministic random bit generator (DRBG),[1] is an algorithm for generating a sequence of numbers whose properties approximate the properties of sequences of random numbers. The PRNG-generated sequence is not truly random, because it is completely determined by a relatively small set of initial values, called the PRNG's seed (which may include truly random values). Although sequences that are closer to truly random can be generated using hardware random number generators, pseudorandom number generators are important in practice for their speed in number generation and their reproducibility.[2]\nPRNGs are central in applications such as simulations (e.g. for the Monte Carlo method), electronic games (e.g. for procedural generation), and cryptography. Cryptographic applications require the output not to be predictable from earlier outputs, and more elaborate algorithms, which do not inherit the linearity of simpler PRNGs, are needed.\nGood statistical properties are a central requirement for the output of a PRNG. In general, careful mathematical analysis is required to have any confidence that a PRNG generates numbers that are sufficiently close to random to suit the intended use. John von Neumann cautioned about the misinterpretation of a PRNG as a truly random generator, and joked that \"Anyone who considers arithmetical methods of producing random digits is, of course, in a state of sin.\"[3]\n\n\nA PRNG can be started from an arbitrary initial state using a seed state. It will always produce the same sequence when initialized with that state. The period of a PRNG is defined thus: the maximum, over all starting states, of the length of the repetition-free prefix of the sequence. The period is bounded by the number of the states, usually measured in bits. However, since the length of the period potentially doubles with each bit of \"state\" added, it is easy to build PRNGs with periods long enough for many practical applications.\nIf a PRNG's internal state contains n bits, its period can be no longer than 2n results, and may be much shorter. For some PRNGs, the period length can be calculated without walking through the whole period. Linear Feedback Shift Registers (LFSRs) are usually chosen to have periods of exactly 2n−1. Linear congruential generators have periods that can be calculated by factoring.[citation needed] Although PRNGs will repeat their results after they reach the end of their period, a repeated result does not imply that the end of the period has been reached, since its internal state may be larger than its output; this is particularly obvious with PRNGs with a one-bit output.\nMost PRNG algorithms produce sequences which are uniformly distributed by any of several tests. It is an open question, and one central to the theory and practice of cryptography, whether there is any way to distinguish the output of a high-quality PRNG from a truly random sequence without knowing the algorithm(s) used and the state with which it was initialized. The security of most cryptographic algorithms and protocols using PRNGs is based on the assumption that it is infeasible to distinguish use of a suitable PRNG from use of a truly random sequence. The simplest examples of this dependency are stream ciphers, which (most often) work by exclusive or-ing the plaintext of a message with the output of a PRNG, producing ciphertext. The design of cryptographically adequate PRNGs is extremely difficult, because they must meet additional criteria (see below). The size of its period is an important factor in the cryptographic suitability of a PRNG, but not the only one.\nIn practice, the output from many common PRNGs exhibit artifacts that cause them to fail statistical pattern-detection tests. These include:\nDefects exhibited by flawed PRNGs range from unnoticeable (and unknown) to very obvious. An example was the RANDU random number algorithm used for decades on mainframe computers. It was seriously flawed, but its inadequacy went undetected for a very long time.\nIn many fields, much research work prior to the 21st century that relied on random selection or on Monte Carlo simulations, or in other ways relied on PRNGs, is much less reliable than it might have been as a result of using poor-quality PRNGs.[4] Even today, caution is sometimes required, as illustrated by the following warning, which is given in the International Encyclopedia of Statistical Science (2010).[5]\nThe list of widely used generators that should be discarded is [long] ... Check the default [PRNG] of your favorite software and be ready to replace it if needed. This last recommendation has been made over and over again over the past 40 years. Perhaps amazingly, it remains as relevant today as it was 40 years ago.\nAs an illustration, consider the widely used programming language Java. As of 2016[update], Java still relies on a linear congruential generator (LCG) for its (non-cryptographically-secure) PRNG;[6] yet LCGs are of low quality—see further below.\nThe first PRNG to avoid major problems and still run fairly quickly was the Mersenne Twister (discussed below), which was published in 1998. Other high-quality PRNGs have since been developed.\nIn the second half of the 20th century, the standard class of algorithms used for PRNGs comprised linear congruential generators. The quality of LCGs was known to be inadequate, but better methods were unavailable. Press et al. (2007) described the result thus: \"If all scientific papers whose results are in doubt because of [LCGs and related] were to disappear from library shelves, there would be a gap on each shelf about as big as your fist\".[7]\nA major advance in the construction of pseudorandom generators was the introduction of techniques based on linear recurrences on the two-element field; such generators are related to linear feedback shift registers.\nThe 1997 invention of the Mersenne Twister,[8] in particular, avoided many of the problems with earlier generators. The Mersenne Twister has a period of 219937−1 iterations (≈4.3×106001), is proven to be equidistributed in (up to) 623 dimensions (for 32-bit values), and at the time of its introduction was running faster than other statistically reasonable generators.\nSubsequently, the WELL family of generators was developed.[9] The WELL generators in some ways improves on the quality of the Mersenne Twister—which has a too-large state space and a very slow recovery from state spaces with a large number of zeros.\nIn 2003, George Marsaglia introduced the family of xorshift generators,[10] again based on a linear recurrence. Such generators are extremely fast and, combined with a nonlinear operation, they pass strong statistical tests.[11]\nA PRNG suitable for cryptographic applications is called a cryptographically secure PRNG (CSPRNG). A requirement for a CSPRNG is that an adversary not knowing the seed has only negligible advantage in distinguishing the generator's output sequence from a random sequence. In other words, while a PRNG is only required to pass certain statistical tests, a CSPRNG must pass all statistical tests that are restricted to polynomial time in the size of the seed. Though a proof of this property is beyond the current state of the art of computational complexity theory, strong evidence may be provided by reducing the CSPRNG to a problem that is assumed to be hard, such as integer factorization.[12] In general, years of review may be required before an algorithm can be certified as a CSPRNG.\nSome classes of CSPRNGs include the following:\nIt has been shown to be likely that the NSA has inserted an asymmetric backdoor into the NIST certified pseudorandom number generator Dual_EC_DRBG.[15]\nThe German Federal Office for Information Security (Bundesamt für Sicherheit in der Informationstechnik, BSI) has established four criteria for quality of deterministic random number generators.[16] They are summarized here:\nFor cryptographic applications, only generators meeting the K3 or K4 standard are acceptable.\nGiven\nWe call a function \n\n\n\nf\n:\n\n\nN\n\n\n1\n\n\n→\n\nR\n\n\n\n{\\displaystyle f:\\mathbb {N} _{1}\\rightarrow \\mathbb {R} }\n\n (where \n\n\n\n\n\nN\n\n\n1\n\n\n=\n\n{\n1\n,\n2\n,\n3\n,\n…\n}\n\n\n\n{\\displaystyle \\mathbb {N} _{1}=\\left\\{1,2,3,\\dots \\right\\}}\n\n is the set of positive integers) a pseudo-random number generator for \n\n\n\nP\n\n\n{\\displaystyle P}\n\n given \n\n\n\n\n\nF\n\n\n\n\n{\\displaystyle {\\mathfrak {F}}}\n\n taking values in \n\n\n\nA\n\n\n{\\displaystyle A}\n\n iff\n(\n\n\n\n#\nS\n\n\n{\\displaystyle \\#S}\n\n denotes the number of elements in the finite set \n\n\n\nS\n\n\n{\\displaystyle S}\n\n.)\nIt can be shown that if \n\n\n\nf\n\n\n{\\displaystyle f}\n\n is a pseudo-random number generator for the uniform distribution on \n\n\n\n\n(\n0\n,\n1\n)\n\n\n\n{\\displaystyle \\left(0,1\\right)}\n\n and if \n\n\n\nF\n\n\n{\\displaystyle F}\n\n is the CDF of some given probability distribution \n\n\n\nP\n\n\n{\\displaystyle P}\n\n, then \n\n\n\n\nF\n\n∗\n\n\n∘\nf\n\n\n{\\displaystyle F^{*}\\circ f}\n\n is a pseudo-random number generator for \n\n\n\nP\n\n\n{\\displaystyle P}\n\n, where \n\n\n\n\nF\n\n∗\n\n\n:\n\n(\n0\n,\n1\n)\n\n→\n\nR\n\n\n\n{\\displaystyle F^{*}:\\left(0,1\\right)\\rightarrow \\mathbb {R} }\n\n is the percentile of \n\n\n\nP\n\n\n{\\displaystyle P}\n\n, i.e. \n\n\n\n\nF\n\n∗\n\n\n(\nx\n)\n:=\ninf\n\n{\nt\n∈\n\nR\n\n:\nx\n≤\nF\n(\nt\n)\n}\n\n\n\n{\\displaystyle F^{*}(x):=\\inf \\left\\{t\\in \\mathbb {R} :x\\leq F(t)\\right\\}}\n\n. Intuitively, an arbitrary distribution can be simulated from a simulation of the standard uniform distribution.\nAn early computer-based PRNG, suggested by John von Neumann in 1946, is known as the middle-square method. The algorithm is as follows: take any number, square it, remove the middle digits of the resulting number as the \"random number\", then use that number as the seed for the next iteration. For example, squaring the number \"1111\" yields \"1234321\", which can be written as \"01234321\", an 8-digit number being the square of a 4-digit number. This gives \"2343\" as the \"random\" number. Repeating this procedure gives \"4896\" as the next result, and so on. Von Neumann used 10 digit numbers, but the process was the same.\nA problem with the \"middle square\" method is that all sequences eventually repeat themselves, some very quickly, such as \"0000\". Von Neumann was aware of this, but he found the approach sufficient for his purposes, and was worried that mathematical \"fixes\" would simply hide errors rather than remove them.\nVon Neumann judged hardware random number generators unsuitable, for, if they did not record the output generated, they could not later be tested for errors. If they did record their output, they would exhaust the limited computer memories then available, and so the computer's ability to read and write numbers. If the numbers were written to cards, they would take very much longer to write and read. On the ENIAC computer he was using, the \"middle square\" method generated numbers at a rate some hundred times faster than reading numbers in from punched cards.\nThe middle-square method has since been supplanted by more elaborate generators.\nNumbers selected from a non-uniform probability distribution can be generated using a uniform distribution PRNG and a function that relates the two distributions.\nFirst, one needs the cumulative distribution function \n\n\n\nF\n(\nb\n)\n\n\n{\\displaystyle F(b)}\n\n of the target distribution \n\n\n\nf\n(\nb\n)\n\n\n{\\displaystyle f(b)}\n\n:\nNote that \n\n\n\n0\n=\nF\n(\n−\n∞\n)\n≤\nF\n(\nb\n)\n≤\nF\n(\n∞\n)\n=\n1\n\n\n{\\displaystyle 0=F(-\\infty )\\leq F(b)\\leq F(\\infty )=1}\n\n. Using a random number c from a uniform distribution as the probability density to \"pass by\", we get\nso that\nis a number randomly selected from distribution \n\n\n\nf\n(\nb\n)\n\n\n{\\displaystyle f(b)}\n\n.\nFor example, the inverse of cumulative Gaussian distribution \n\n\n\n\nerf\n\n−\n1\n\n\n⁡\n(\nx\n)\n\n\n{\\displaystyle \\operatorname {erf} ^{-1}(x)}\n\n with an ideal uniform PRNG with range (0, 1) as input \n\n\n\nx\n\n\n{\\displaystyle x}\n\n would produce a sequence of (positive only) values with a Gaussian distribution; however\nSimilar considerations apply to generating other non-uniform distributions such as Rayleigh and Poisson.", 
    "dbpedia_url": "http://dbpedia.org/resource/Pseudorandom_number_generator", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Pseudorandom_number_generator\n"
}