{
    "about": "Pseudo amino acid composition, or PseAA composition was originally introduced by Kuo-Chen Chou in 2001 to represent protein samples for improving protein subcellular localization prediction and membrane protein type prediction.[1]", 
    "name": "Pseudo Amino Acid Composition", 
    "classification": "Bioinformatics Algorithms", 
    "full_text": "Pseudo amino acid composition, or PseAA composition was originally introduced by Kuo-Chen Chou in 2001 to represent protein samples for improving protein subcellular localization prediction and membrane protein type prediction.[1]\n\n\nTo predict the subcellular localization of proteins and other attributes based on their sequence, two kinds of models are generally used to represent protein samples: (1) the sequential model, and (2) the non-sequential model or discrete model.\nThe most typical sequential representation for a protein sample is its entire amino acid (AA) sequence, which can contain its most complete information. This is an obvious advantage of the sequential model. To get the desired results, the sequence-similarity-search-based tools are usually utilized to conduct the prediction. However, this kind of approach fails when a query protein does not have significant homology to the known protein(s). Thus, various discrete models were proposed which do not rely on sequence-order.\nThe simplest discrete model is using the amino acid composition (AAC) to represent protein samples, formulated as follows. Given a protein sequence P with \n\n\n\nL\n\n\n{\\displaystyle L}\n\n amino acid residues, i.e.,\nwhere R1 represents the 1st residue of the protein P, R2 the 2nd residue, and so forth, according to the amino acid composition (AAC) model, the protein P of Eq.1 can be expressed by\nwhere \n\n\n\n\n\nf\n\nu\n\n\n\n(\nu\n=\n1\n,\n2\n,\n⋯\n,\n20\n)\n\n\n{\\displaystyle \\,f_{u}\\,(u=1,2,\\cdots ,20)}\n\n are the normalized occurrence frequencies of the 20 native amino acids in P, and T the transposing operator. Accordingly, the amino acid composition of a protein can be easily derived once the protein sequencing information is known.\nOwing to its simplicity, the amino acid composition (AAC) model was widely used in many earlier statistical methods for predicting protein attributes. However, all the sequence-order information is lost. This is its main shortcoming.\nTo avoid completely losing the sequence-order information, the concept of PseAA (pseudo amino acid) composition was proposed.[1] In contrast with the conventional amino acid composition that contains 20 components with each reflecting the occurrence frequency for one of the 20 native amino acids in a protein, the PseAA composition contains a set of greater than 20 discrete factors, where the first 20 represent the components of its conventional AA composition while the additional factors incorporate some sequence-order information via various modes.\nThe additional factors are a series of rank-different correlation factors along a protein chain, but they can also be any combinations of other factors so long as they can reflect some sorts of sequence-order effects one way or the other. Therefore, the essence of PseAA composition is that on one hand it covers the AA composition, but on the other hand it contains the information beyond the AA composition and hence can better reflect the feature of a protein sequence through a discrete model.\nMeanwhile, various modes to formulate the PseAA composition have also been developed, as summarized in a review.[2]\nAccording to the PseAA composition model, the protein P of Eq.1 can be formulated as\nwhere the (\n\n\n\n20\n+\nλ\n\n\n{\\displaystyle 20+\\lambda }\n\n) components are given by\nwhere \n\n\n\nw\n\n\n{\\displaystyle w}\n\n is the weight factor, and \n\n\n\n\nτ\n\nk\n\n\n\n\n{\\displaystyle \\tau _{k}}\n\n the \n\n\n\nk\n\n\n{\\displaystyle k}\n\n-th tier correlation factor that reflects the sequence order correlation between all the \n\n\n\nk\n\n\n{\\displaystyle k}\n\n-th most contiguous residues as formulated by\nwith\nwhere \n\n\n\n\nΦ\n\nq\n\n\n\n(\n\n\nR\n\n\ni\n\n\n)\n\n\n\n{\\displaystyle \\Phi _{q}\\left(\\mathrm {R} _{i}\\right)}\n\n is the \n\n\n\n\nq\n\n\n\n{\\displaystyle {q}}\n\n-th function of the amino acid \n\n\n\n\n\nR\n\n\ni\n\n\n\n\n\n{\\displaystyle \\mathrm {R} _{i}\\,}\n\n, and \n\n\n\nΓ\n\n\n\n{\\displaystyle \\Gamma \\,}\n\n the total number of the functions considered. For example, in the original paper by Chou,[1] \n\n\n\n\nΦ\n\n1\n\n\n\n(\n\n\nR\n\n\ni\n\n\n)\n\n\n\n{\\displaystyle \\Phi _{1}\\left(\\mathrm {R} _{i}\\right)}\n\n, \n\n\n\n\nΦ\n\n2\n\n\n\n(\n\n\nR\n\n\ni\n\n\n)\n\n\n\n{\\displaystyle \\Phi _{2}\\left(\\mathrm {R} _{i}\\right)}\n\n and \n\n\n\n\nΦ\n\n3\n\n\n\n(\n\n\nR\n\n\ni\n\n\n)\n\n\n\n{\\displaystyle \\Phi _{3}\\left(\\mathrm {R} _{i}\\right)}\n\n are respectively the hydrophobicity value, hydrophilicity value, and side chain mass of amino acid \n\n\n\n\n\nR\n\n\ni\n\n\n\n\n\n{\\displaystyle \\mathrm {R} _{i}\\,}\n\n; while \n\n\n\n\nΦ\n\n1\n\n\n\n(\n\n\nR\n\n\ni\n+\n1\n\n\n)\n\n\n\n{\\displaystyle \\Phi _{1}\\left(\\mathrm {R} _{i+1}\\right)}\n\n, \n\n\n\n\nΦ\n\n2\n\n\n\n(\n\n\nR\n\n\ni\n+\n1\n\n\n)\n\n\n\n{\\displaystyle \\Phi _{2}\\left(\\mathrm {R} _{i+1}\\right)}\n\n and \n\n\n\n\nΦ\n\n3\n\n\n\n(\n\n\nR\n\n\ni\n+\n1\n\n\n)\n\n\n\n{\\displaystyle \\Phi _{3}\\left(\\mathrm {R} _{i+1}\\right)}\n\n the corresponding values for the amino acid \n\n\n\n\n\nR\n\n\ni\n+\n1\n\n\n\n\n\n{\\displaystyle \\mathrm {R} _{i+1}\\,}\n\n. Therefore, the total number of functions considered there is \n\n\n\nΓ\n=\n3\n\n\n\n{\\displaystyle \\Gamma =3\\,}\n\n. It can be seen from Eq.3 that the first 20 components, i.e. \n\n\n\n\np\n\n1\n\n\n,\n\n\np\n\n2\n\n\n,\n\n⋯\n,\n\n\np\n\n20\n\n\n\n\n{\\displaystyle p_{1},\\,p_{2},\\,\\cdots ,\\,p_{20}}\n\n are associated with the conventional AA composition of protein, while the remaining components \n\n\n\n\np\n\n20\n+\n1\n\n\n,\n\n⋯\n,\n\n\np\n\n20\n+\nλ\n\n\n\n\n{\\displaystyle p_{20+1},\\,\\cdots ,\\,p_{20+\\lambda }}\n\n are the correlation factors that reflect the 1st tier, 2nd tier, …, and the \n\n\n\nλ\n\n\n\n{\\displaystyle \\lambda \\,}\n\n-th tier sequence order correlation patterns (Figure 1). It is through these additional \n\n\n\nλ\n\n\n\n{\\displaystyle \\lambda \\,}\n\n factors that some important sequence-order effects are incorporated.\n\n\n\n\nλ\n\n\n\n{\\displaystyle \\lambda \\,}\n\n in Eq.3 is a parameter of integer and that choosing a different integer for \n\n\n\nλ\n\n\n\n{\\displaystyle \\lambda \\,}\n\n will lead to a dimension-different PseAA composition.[3]\nUsing Eq.6 is just one of the modes for deriving the correlation factors or PseAA components. The others, such as the physicochemical distance mode[4] and amphiphilic pattern mode,[5] can also be used to derive different types of PseAA composition, as summarized in a review paper.[2]\nSince PseAA composition was introduced, it has been widely used to predict various attributes of proteins, such as structural classes of proteins,[6][7] enzyme family classes and subfamily classes,[8] GABA(A) receptor proteins,[9] protein folding rates,[10] cyclin proteins,[11] supersecondary structure,[12] subcellular location of proteins,[13][14] subnuclear location of proteins,[15] apoptosis protein subcellular localization,[16] submitochondria localization,[17] protein quaternary structure,[18][19] bacterial secreted proteins,[20] conotoxin superfamily and family classification,[21] protease types,[22] GPCR types,[23][24] human papillomaviruses, [25] outer membrane proteins,[26] membrane protein types,[27] protein secondary structural contents,[28] metalloproteinase family [29] subcellular localization of mycobacterial proteins,[30] antibacterial peptides [31] lipase types,[32] allergenic proteins [33] DNA-binding proteins,[34] essential proteins,[35] cell wall lytic enzymes,[36] cofactors of oxidoreductases,[37] among many other protein attributes and protein-related features (see, e.g., the review paper by Gonzalez-Diaz et al.[38] as well as the relevant references cited therein).\nEver since the concept of PseAA composition was introduced, it has been widely utilized to predict various protein attributes. It has also been used to incorporate the protein domain or FunD (functional domain) information and GO (gene ontology) information for improving the prediction quality for the subcellular localization of proteins.[39] as well as their other attributes.\nMeanwhile, the concept of PseAA composition has also stimulated the generation of pseudo-folding topological indices and pseudo-folding lattice network.[40][41][42]\nRecently, two open accessible tools were established to generate various modes of Chou’s pseudo amino acid composition.[43][44]", 
    "dbpedia_url": "http://dbpedia.org/resource/Pseudo_amino_acid_composition", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Pseudo_amino_acid_composition\n"
}