{
    "about": "Pulse compression is a signal processing technique commonly used by radar, sonar and echography to increase the range resolution as well as the signal to noise ratio. This is achieved by modulating the transmitted pulse and then correlating the received signal with the transmitted pulse.[1]", 
    "name": "Pulse Compression", 
    "classification": "Signal Processing", 
    "full_text": "Pulse compression is a signal processing technique commonly used by radar, sonar and echography to increase the range resolution as well as the signal to noise ratio. This is achieved by modulating the transmitted pulse and then correlating the received signal with the transmitted pulse.[1]\n\n\nThe simplest signal a pulse radar can transmit is a sinusoidal-amplitude pulse, \n\n\n\nA\n\n\n{\\displaystyle A}\n\n and carrier frequency, \n\n\n\n\nf\n\n0\n\n\n\n\n{\\displaystyle f_{0}}\n\n, truncated by a rectangular function of width, \n\n\n\n\nT\n\n\n\n{\\displaystyle \\scriptstyle T}\n\n. The pulse is transmitted periodically, but that is not the main topic of this article; we will consider only a single pulse, \n\n\n\ns\n\n\n{\\displaystyle s}\n\n. If we assume the pulse to start at time \n\n\n\nt\n\n=\n\n0\n\n\n{\\displaystyle t\\,=\\,0}\n\n, the signal can be written the following way, using the complex notation:\nLet us determine the range resolution which can be obtained with such a signal. The return signal, written \n\n\n\n\nr\n(\nt\n)\n\n\n\n{\\displaystyle \\scriptstyle r(t)}\n\n, is an attenuated and time-shifted copy of the original transmitted signal (in reality, Doppler effect can play a role too, but this is not important here.) There is also noise in the incoming signal, both on the imaginary and the real channel, which we will assume to be white and Gaussian (this generally holds in reality); we write \n\n\n\n\nB\n(\nt\n)\n\n\n\n{\\displaystyle \\scriptstyle B(t)}\n\n to denote that noise. To detect the incoming signal, matched filtering is commonly used. This method is optimal when a known signal is to be detected among additive white Gaussian noise.\nIn other words, the cross-correlation of the received signal with the transmitted signal is computed. This is achieved by convolving the incoming signal with a conjugated and time-reversed version of the transmitted signal. This operation can be done either in software or with hardware. We write \n\n\n\n\n<\ns\n,\n\nr\n>\n(\nt\n)\n\n\n\n{\\displaystyle \\scriptstyle <s,\\,r>(t)}\n\n for this cross-correlation. We have:\nIf the reflected signal comes back to the receiver at time \n\n\n\n\n\nt\n\nr\n\n\n\n\n\n{\\displaystyle \\scriptstyle t_{r}}\n\n and is attenuated by factor \n\n\n\n\nK\n\n\n\n{\\displaystyle \\scriptstyle K}\n\n, this yields:\nSince we know the transmitted signal, we obtain:\nwhere \n\n\n\n\n\nB\n′\n\n(\nt\n)\n\n\n\n{\\displaystyle \\scriptstyle B'(t)}\n\n, the result of the intercorrelation between the noise and the transmitted signal. Function \n\n\n\nΛ\n\n\n{\\displaystyle \\Lambda }\n\n is the triangle function, its value is 0 on \n\n\n\n\n[\n−\n∞\n,\n\n−\n\n\n1\n2\n\n\n]\n\n∪\n\n[\n\n\n1\n2\n\n\n,\n\n+\n∞\n]\n\n\n\n{\\displaystyle \\scriptstyle [-\\infty ,\\,-{\\frac {1}{2}}]\\,\\cup \\,[{\\frac {1}{2}},\\,+\\infty ]}\n\n, it increases linearly on \n\n\n\n\n[\n−\n\n\n1\n2\n\n\n,\n\n0\n]\n\n\n\n{\\displaystyle \\scriptstyle [-{\\frac {1}{2}},\\,0]}\n\n where it reaches its maximum 1, and it decreases linearly on \n\n\n\n\n[\n0\n,\n\n\n\n1\n2\n\n\n]\n\n\n\n{\\displaystyle \\scriptstyle [0,\\,{\\frac {1}{2}}]}\n\n until it reaches 0 again. Figures at the end of this paragraph show the shape of the intercorrelation for a sample signal (in red), in this case a real truncated sine, of duration \n\n\n\n\nT\n\n=\n\n1\n\n\n\n{\\displaystyle \\scriptstyle T\\,=\\,1}\n\n seconds, of unit amplitude, and frequency \n\n\n\n\n\nf\n\n0\n\n\n\n=\n\n10\n\n\n\n{\\displaystyle \\scriptstyle f_{0}\\,=\\,10}\n\n hertz. Two echoes (in blue) come back with delays of 3 and 5 seconds and amplitudes equal to 0.5 and 0.3 times the amplitude of the transmitted pulse, respectively; these are just random values for the sake of the example. Since the signal is real, the intercorrelation is weighted by an additional  1⁄2 factor.\nIf two pulses come back (nearly) at the same time, the intercorrelation is equal to the sum of the intercorrelations of the two elementary signals. To distinguish one \"triangular\" envelope from that of the other pulse, it is clearly visible that the times of arrival of the two pulses must be separated by at least \n\n\n\n\nT\n\n\n\n{\\displaystyle \\scriptstyle T}\n\n so that the maxima of both pulses can be separated. If this condition is not met, both triangles will be mixed together and impossible to separate.\nSince the distance travelled by a wave during \n\n\n\n\nT\n\n\n\n{\\displaystyle \\scriptstyle T}\n\n is \n\n\n\n\nc\nT\n\n\n\n{\\displaystyle \\scriptstyle cT}\n\n (where c is the speed of the wave in the medium), and since this distance corresponds to a round-trip time, we get:\n \nConclusion: to increase the resolution, the pulse length must be reduced.\n \nThe instantaneous power of the transmitted pulse is \n\n\n\n\nP\n(\nt\n)\n\n=\n\n\n|\n\ns\n\n\n|\n\n\n2\n\n\n(\nt\n)\n\n\n\n{\\displaystyle \\scriptstyle P(t)\\,=\\,|s|^{2}(t)}\n\n. The energy put into that signal is:\nSimilarly, the energy in the received pulse is \n\n\n\n\n\nE\n\nr\n\n\n\n=\n\n\nK\n\n2\n\n\n\nA\n\n2\n\n\nT\n\n\n\n{\\displaystyle \\scriptstyle E_{r}\\,=\\,K^{2}A^{2}T}\n\n. If \n\n\n\n\nσ\n\n\n\n{\\displaystyle \\scriptstyle \\sigma }\n\n is the standard deviation of the noise, the signal-to-noise ratio (SNR) at the receiver is:\nThe SNR is proportional to pulse duration \n\n\n\nT\n\n\n{\\displaystyle T}\n\n, if other parameters are held constant. This introduces a tradeoff: increasing \n\n\n\nT\n\n\n{\\displaystyle T}\n\n improves the SNR, but reduces the resolution, and vice versa.\nHow can one have a large enough pulse (to still have a good SNR at the receiver) without poor resolution? This is where pulse compression enters the picture. The basic principle is the following:\nIn radar or sonar applications, linear chirps are the most typically used signals to achieve pulse compression. The pulse being of finite length, the amplitude is a rectangle function. If the transmitted signal has a duration \n\n\n\n\nT\n\n\n\n{\\displaystyle \\scriptstyle T}\n\n, begins at \n\n\n\n\nt\n\n=\n\n0\n\n\n\n{\\displaystyle \\scriptstyle t\\,=\\,0}\n\n and linearly sweeps the frequency band \n\n\n\n\nΔ\nf\n\n\n\n{\\displaystyle \\scriptstyle \\Delta f}\n\n centered on carrier \n\n\n\n\n\nf\n\n0\n\n\n\n\n\n{\\displaystyle \\scriptstyle f_{0}}\n\n, it can be written:\nThe chirp definition above means that the phase of the chirped signal (that is, the argument of the complex exponential), is the quadratic:\nthus the instantaneous frequency is (by definition):\nwhich is the intended linear ramp going from \n\n\n\n\n\nf\n\n0\n\n\n\n−\n\n\n\n\nΔ\nf\n\n2\n\n\n\n\n\n{\\displaystyle \\scriptstyle f_{0}\\,-\\,{\\frac {\\Delta f}{2}}}\n\n at \n\n\n\n\nt\n\n=\n\n0\n\n\n\n{\\displaystyle \\scriptstyle t\\,=\\,0}\n\n to \n\n\n\n\n\nf\n\n0\n\n\n\n+\n\n\n\n\nΔ\nf\n\n2\n\n\n\n\n\n{\\displaystyle \\scriptstyle f_{0}\\,+\\,{\\frac {\\Delta f}{2}}}\n\n at \n\n\n\n\nt\n\n=\n\nT\n\n\n\n{\\displaystyle \\scriptstyle t\\,=\\,T}\n\n.\nThe relation of phase to frequency is often used in the other direction, starting with the desired \n\n\n\nf\n(\nt\n)\n\n\n{\\displaystyle f(t)}\n\n and writing the chirp phase via the integration of frequency:\nAs for the \"simple\" pulse, let us compute the cross-correlation between the transmitted and the received signal. To simplify things, we shall consider that the chirp is not written as it is given above, but in this alternate form (the final result will be the same):\nSince this cross-correlation is equal (save for the \n\n\n\nK\n\n\n{\\displaystyle K}\n\n attenuation factor), to the autocorrelation function of \n\n\n\n\n\ns\n\n\nc\n′\n\n\n\n\n\n\n{\\displaystyle \\scriptstyle s_{c'}}\n\n, this is what we consider:\nIt can be shown[2] that the autocorrelation function of \n\n\n\n\ns\n\n\nc\n′\n\n\n\n\n\n{\\displaystyle s_{c'}}\n\n is:\nThe maximum of the autocorrelation function of \n\n\n\n\n\ns\n\n\nc\n′\n\n\n\n\n\n\n{\\displaystyle \\scriptstyle s_{c'}}\n\n is reached at 0. Around 0, this function behaves as the sinc (or cardinal sine) term, defined here as \n\n\n\ns\ni\nn\nc\n(\nx\n)\n=\ns\ni\nn\n(\nπ\nx\n)\n\n/\n\n(\nπ\nx\n)\n\n\n{\\displaystyle sinc(x)=sin(\\pi x)/(\\pi x)}\n\n. The −3 dB temporal width of that cardinal sine is more or less equal to \n\n\n\n\n\nT\n′\n\n\n=\n\n\n\n1\n\nΔ\nf\n\n\n\n\n\n\n{\\displaystyle \\scriptstyle T'\\,=\\,{\\frac {1}{\\Delta f}}}\n\n. Everything happens as if, after matched filtering, we had the resolution that would have been reached with a simple pulse of duration \n\n\n\n\n\nT\n′\n\n\n\n\n{\\displaystyle \\scriptstyle T'}\n\n. For the common values of \n\n\n\n\nΔ\nf\n\n\n\n{\\displaystyle \\scriptstyle \\Delta f}\n\n, \n\n\n\n\n\nT\n′\n\n\n\n\n{\\displaystyle \\scriptstyle T'}\n\n is smaller than \n\n\n\n\nT\n\n\n\n{\\displaystyle \\scriptstyle T}\n\n, hence the pulse compression name.\nSince the cardinal sine can have annoying sidelobes, a common practice is to filter the result by a window (Hamming, Hann, etc.). In practice, this can be done at the same time as the adapted filtering by multiplying the reference chirp with the filter. The result will be a signal with a slightly lower maximum amplitude, but the sidelobes will be filtered out, which is more important.\n \n \nThe energy of the signal does not vary during pulse compression. However, it is now located in the main lobe of the cardinal sine, whose width is approximately \n\n\n\n\n\nT\n′\n\n\n≈\n\n\n\n1\n\nΔ\nf\n\n\n\n\n\n\n{\\displaystyle \\scriptstyle T'\\,\\approx \\,{\\frac {1}{\\Delta f}}}\n\n. If \n\n\n\n\nP\n\n\n\n{\\displaystyle \\scriptstyle P}\n\n is the power of the signal before compression, and \n\n\n\n\n\nP\n′\n\n\n\n\n{\\displaystyle \\scriptstyle P'}\n\n the power of the signal after compression, we have:\nwhich yields:\nBesides, the power of the noise does not change through intercorrelation since it is not correlated to the transmitted pulse (it is totally random). As a consequence:  \n \nThere are other means to modulate the signal. Phase modulation is a commonly used technique; in this case, the pulse is divided in \n\n\n\n\nN\n\n\n\n{\\displaystyle \\scriptstyle N}\n\n time slots of duration \n\n\n\n\n\n\nT\nN\n\n\n\n\n\n{\\displaystyle \\scriptstyle {\\frac {T}{N}}}\n\n for which the phase at the origin is chosen according to a pre-established convention. For instance, it is possible to not change the phase for some time slots (which comes down to just leaving the signal as it is, in those slots) and de-phase the signal in the other slots by \n\n\n\n\nπ\n\n\n\n{\\displaystyle \\scriptstyle \\pi }\n\n (which is equivalent of changing the sign of the signal). The precise way of choosing the sequence of \n\n\n\n\n{\n0\n,\n\nπ\n}\n\n\n\n{\\displaystyle \\scriptstyle \\{0,\\,\\pi \\}}\n\n phases is done according to a technique known as Barker codes. It is possible to code the sequence on more than two phases (polyphase coding). As with a linear chirp, pulse compression is achieved through intercorrelation.\nThe advantages[3] of the Barker codes are their simplicity (as indicated above, a \n\n\n\n\nπ\n\n\n\n{\\displaystyle \\scriptstyle \\pi }\n\n de-phasing is a simple sign change), but the pulse compression ratio is lower than in the chirp case and the compression is very sensitive to frequency changes due to the Doppler effect if that change is larger than \n\n\n\n\n\n\n1\nT\n\n\n\n\n\n{\\displaystyle \\scriptstyle {\\frac {1}{T}}}\n\n.", 
    "dbpedia_url": "http://dbpedia.org/resource/Pulse_compression", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Pulse_compression\n"
}