{
    "about": "Q-learning is a model-free reinforcement learning technique. Specifically, Q-learning can be used to find an optimal action-selection policy for any given (finite) Markov decision process (MDP). It works by learning an action-value function that ultimately gives the expected utility of taking a given action in a given state and following the optimal policy thereafter. A policy is a rule that the agent follows in selecting actions, given the state it is in. When such an action-value function is learned, the optimal policy can be constructed by simply selecting the action with the highest value in each state. One of the strengths of Q-learning is that it is able to compare the expected utility of the available actions without requiring a model of the environment. Additionally, Q-learning can handle problems with stochastic transitions and rewards, without requiring any adaptations. It has been proven that for any finite MDP, Q-learning eventually finds an optimal policy, in the sense that the expected value of the total reward return over all successive steps, starting from the current state, is the maximum achievable.", 
    "classification": "Machine Learning Algorithms", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Q-learning\n", 
    "full_text": "Q-learning is a model-free reinforcement learning technique. Specifically, Q-learning can be used to find an optimal action-selection policy for any given (finite) Markov decision process (MDP). It works by learning an action-value function that ultimately gives the expected utility of taking a given action in a given state and following the optimal policy thereafter. A policy is a rule that the agent follows in selecting actions, given the state it is in. When such an action-value function is learned, the optimal policy can be constructed by simply selecting the action with the highest value in each state. One of the strengths of Q-learning is that it is able to compare the expected utility of the available actions without requiring a model of the environment. Additionally, Q-learning can handle problems with stochastic transitions and rewards, without requiring any adaptations. It has been proven that for any finite MDP, Q-learning eventually finds an optimal policy, in the sense that the expected value of the total reward return over all successive steps, starting from the current state, is the maximum achievable.\n\n\nThe problem model consists of an agent, states \n\n\n\nS\n\n\n{\\displaystyle S}\n\n and a set of actions per state \n\n\n\nA\n\n\n{\\displaystyle A}\n\n. By performing an action \n\n\n\na\n∈\nA\n\n\n{\\displaystyle a\\in A}\n\n, the agent can move from state to state. Executing an action in a specific state provides the agent with a reward (a numerical score). The goal of the agent is to maximize its total reward. It does this by learning which action is optimal for each state. The action that is optimal for each state is the action that has the highest long-term reward. This reward is a weighted sum of the expected values of the rewards of all future steps starting from the current state, where the weight for a step from a state \n\n\n\nΔ\nt\n\n\n{\\displaystyle \\Delta t}\n\n steps into the future is calculated as \n\n\n\n\nγ\n\nΔ\nt\n\n\n\n\n{\\displaystyle \\gamma ^{\\Delta t}}\n\n. Here, \n\n\n\nγ\n\n\n{\\displaystyle \\gamma }\n\n is a number between 0 and 1 (\n\n\n\n0\n≤\nγ\n≤\n1\n\n\n{\\displaystyle 0\\leq \\gamma \\leq 1}\n\n) called the discount factor and trades off the importance of sooner versus later rewards. \n\n\n\nγ\n\n\n{\\displaystyle \\gamma }\n\n may also be interpreted as the likelihood to succeed (or survive) at every step \n\n\n\nΔ\nt\n\n\n{\\displaystyle \\Delta t}\n\n.\nThe algorithm therefore has a function that calculates the Quantity of a state-action combination:\nBefore learning has started, \n\n\n\nQ\n\n\n{\\displaystyle Q}\n\n returns an (arbitrary) fixed value, chosen by the designer. Then, each time the agent selects an action, and observes a reward and a new state that may depend on both the previous state and the selected action, \n\n\n\nQ\n\n\n{\\displaystyle Q}\n\n is updated. The core of the algorithm is a simple value iteration update. It assumes the old value and makes a correction based on the new information.\nwhere \n\n\n\n\nr\n\nt\n+\n1\n\n\n\n\n{\\displaystyle r_{t+1}}\n\n is the reward observed after performing \n\n\n\n\na\n\nt\n\n\n\n\n{\\displaystyle a_{t}}\n\n in \n\n\n\n\ns\n\nt\n\n\n\n\n{\\displaystyle s_{t}}\n\n, and where \n\n\n\n\nα\n\nt\n\n\n\n\n{\\displaystyle \\alpha _{t}}\n\n is the learning rate (\n\n\n\n0\n<\n\nα\n\nt\n\n\n≤\n1\n\n\n{\\displaystyle 0<\\alpha _{t}\\leq 1}\n\n).\nAn episode of the algorithm ends when state \n\n\n\n\ns\n\nt\n+\n1\n\n\n\n\n{\\displaystyle s_{t+1}}\n\n is a final state (or, \"absorbing state\"). However, Q-learning can also learn in non-episodic tasks. If the discount factor is lower than 1, the action values are finite even if the problem can contain infinite loops.\nNote that for all final states \n\n\n\n\ns\n\nf\n\n\n\n\n{\\displaystyle s_{f}}\n\n, \n\n\n\nQ\n(\n\ns\n\nf\n\n\n,\na\n)\n\n\n{\\displaystyle Q(s_{f},a)}\n\n is never updated but is set to the reward value \n\n\n\nr\n\n\n{\\displaystyle r}\n\n. In most cases, \n\n\n\nQ\n(\n\ns\n\nf\n\n\n,\na\n)\n\n\n{\\displaystyle Q(s_{f},a)}\n\n can be taken to be equal to zero.\nThe learning rate or step size determines to what extent the newly acquired information will override the old information. A factor of 0 will make the agent not learn anything, while a factor of 1 would make the agent consider only the most recent information. In fully deterministic environments, a learning rate of \n\n\n\n\nα\n\nt\n\n\n=\n1\n\n\n{\\displaystyle \\alpha _{t}=1}\n\n is optimal. When the problem is stochastic, the algorithm still converges under some technical conditions on the learning rate that require it to decrease to zero. In practice, often a constant learning rate is used, such as \n\n\n\n\nα\n\nt\n\n\n=\n0.1\n\n\n{\\displaystyle \\alpha _{t}=0.1}\n\n for all \n\n\n\nt\n\n\n{\\displaystyle t}\n\n.[1]\nThe discount factor \n\n\n\nγ\n\n\n{\\displaystyle \\gamma }\n\n determines the importance of future rewards. A factor of 0 will make the agent \"myopic\" (or short-sighted) by only considering current rewards, while a factor approaching 1 will make it strive for a long-term high reward. If the discount factor meets or exceeds 1, the action values may diverge. For \n\n\n\nγ\n=\n1\n\n\n{\\displaystyle \\gamma =1}\n\n, without a terminal state, or if the agent never reaches one, all environment histories will be infinitely long, and utilities with additive, undiscounted rewards will generally be infinite.[2] Even with a discount factor only slightly lower than 1, the Q-function learning leads to propagation of errors and instabilities when the value function is approximated with an artificial neural network.[3] In that case, it is known that starting with a lower discount factor and increasing it towards its final value yields accelerated learning.[4]\nSince Q-learning is an iterative algorithm, it implicitly assumes an initial condition before the first update occurs. High initial values, also known as \"optimistic initial conditions\",[5] can encourage exploration: no matter what action is selected, the update rule will cause it to have lower values than the other alternative, thus increasing their choice probability. Recently, it was suggested that the first reward \n\n\n\nr\n\n\n{\\displaystyle r}\n\n could be used to reset the initial conditions.[citation needed] According to this idea, the first time an action is taken the reward is used to set the value of \n\n\n\nQ\n\n\n{\\displaystyle Q}\n\n. This will allow immediate learning in case of fixed deterministic rewards. Surprisingly, this resetting-of-initial-conditions (RIC) approach seems to be consistent with human behaviour in repeated binary choice experiments.[6]\nQ-learning at its simplest uses tables to store data. This very quickly loses viability with increasing sizes of state/action space of the system it is monitoring/controlling. One answer to this problem is to use an (adapted) artificial neural network as a function approximator, as demonstrated by Tesauro in his Backgammon playing temporal difference learning research.[7]\nMore generally, Q-learning can be combined with function approximation.[8] This makes it possible to apply the algorithm to larger problems, even when the state space is continuous, and therefore infinitely large. Additionally, it may speed up learning in finite problems, due to the fact that the algorithm can generalize earlier experiences to previously unseen states.\nQ-learning was first introduced by Watkins[9] in 1989. The convergence proof was presented later by Watkins and Dayan[10] in 1992.\nA recent application of Q-learning to deep learning, by Google DeepMind, titled \"deep reinforcement learning\" or \"deep Q-networks\", has been successful at playing some Atari 2600 games at expert human levels. Preliminary results were presented in 2014, with a paper published in February 2015 in Nature.[11]\nBecause the maximum approximated action value is used in the Q-learning update, in noisy environments Q-learning can sometimes overestimate the actions values, slowing the learning. A recent variant called Double Q-learning was proposed to correct this. [12] This algorithm was later combined with deep learning, as in the DQN algorithm (see above), resulting in Double DQN which was shown to outperform the original DQN algorithm. [13]\nDelayed Q-learning is an alternative implementation of the online Q-learning algorithm, with Probably approximately correct learning (PAC).[14]\nGreedy GQ is a variant of Q-learning to use in combination with (linear) function approximation.[15] The advantage of Greedy GQ is that convergence guarantees can be given even when function approximation is used to estimate the action values.\nQ-learning may suffer from slow rate of convergence, especially when the discount factor \n\n\n\nγ\n\n\n{\\displaystyle \\gamma }\n\n is close to one.[16] Speedy Q-learning, a new variant of Q-learning algorithm, deals with this problem and achieves a slightly better rate of convergence than model-based methods such as value iteration.[17]", 
    "name": "Q Learning"
}