{
    "about": "In digital signal processing, a quadrature mirror filter is a filter whose magnitude response is the mirror image around \n\n\n\nπ\n\n/\n\n2\n\n\n{\\displaystyle \\pi /2}\n\n of that of another filter. Together these filters are known as the Quadrature Mirror Filter pair.", 
    "name": "Quadrature Mirror Filter", 
    "classification": "Digital Signal Processing", 
    "full_text": "In digital signal processing, a quadrature mirror filter is a filter whose magnitude response is the mirror image around \n\n\n\nπ\n\n/\n\n2\n\n\n{\\displaystyle \\pi /2}\n\n of that of another filter. Together these filters are known as the Quadrature Mirror Filter pair.\nA filter \n\n\n\n\nH\n\n1\n\n\n(\nz\n)\n\n\n{\\displaystyle H_{1}(z)}\n\n will be quadrature mirror filter of \n\n\n\n\nH\n\n0\n\n\n(\nz\n)\n\n\n{\\displaystyle H_{0}(z)}\n\n if \n\n\n\n\nH\n\n1\n\n\n(\nz\n)\n=\n\nH\n\n0\n\n\n(\n−\nz\n)\n\n\n{\\displaystyle H_{1}(z)=H_{0}(-z)}\n\n\nThe filter responses are symmetric about \n\n\n\nΩ\n=\nπ\n\n/\n\n2\n\n\n{\\displaystyle \\Omega =\\pi /2}\n\n\n\nIn audio/voice codecs, a quadrature mirror filter pair is often used to implement a filter bank that splits an input signal into two bands. The resulting high-pass and low-pass signals are often reduced by a factor of 2, giving a critically sampled two-channel representation of the original signal. The analysis filters are often related by the following formulae in addition to quadrate mirror property:\nThis is known as power complementary property. In other words, the power sum of the high-pass and low-pass filters is equal to 1.\nOrthogonal wavelets -- the Haar wavelets and related Daubechies wavelets, Coiflets, and some developed by Mallat, are generated by scaling functions which, with the wavelet, satisfy a quadrature mirror filter relationship.\nThe earliest wavelets were based on expanding a function in terms of rectangular steps, the Haar wavelets. This is usually a poor approximation, whereas Daubechies wavelets are among the simplest but most important families of wavelets. A linear filter that is zero for “smooth” signals, given a record of \n\n\n\nN\n\n\n{\\displaystyle N}\n\n points \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n is defined as:\nIt is desirable to have it vanish for a constant, so taking the order \n\n\n\nm\n=\n4\n\n\n{\\displaystyle m=4}\n\n for example:\nAnd to have it vanish for a linear ramp so that:\nA linear filter will vanish for any \n\n\n\nx\n=\nα\nn\n+\nβ\n\n\n{\\displaystyle x=\\alpha n+\\beta }\n\n, and this is all that can be done with a fourth order wavelet. Six terms will be needed to vanish a quadratic curve and so on given the other constraints to be included. Next an accompanying filter may be defined as:\nThis filter responds in an exactly opposite manner, being large for smooth signals and small for non-smooth signals. A linear filter is just a convolution of the signal with the filter’s coefficients, so the series of the coefficients is the signal that the filter responds to maximally. Thus, the output of the second filter vanishes when the coefficients of the first one are input into it. The aim is to have:\nWhere the associated time series flips the order of the coefficients because the linear filter is a convolution, and so both have the same index in this sum. A pair of filters with this property are defined as quadrature mirror filters.[1] Even if the two resulting bands have been subsampled by a factor of 2, the relationship between the filters means that approximately perfect reconstruction is possible. That is, the two bands can then be upsampled, filtered again with the same filters and added together, to reproduce the original signal exactly (but with a small delay). (In practical implementations, numeric precision issues in floating-point arithmetic may affect the perfection of the reconstruction.)", 
    "dbpedia_url": "http://dbpedia.org/resource/Quadrature_mirror_filter", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Quadrature_mirror_filter\n"
}