{
    "about": "Quadrature-based moment methods (QBMM) are a class of computational fluid dynamics (CFD) methods for solving Kinetic theory and is optimal for simulating phases such as rarefied gases or dispersed phases of a multiphase flow. The smallest \"particle\" entities which are tracked may be molecules of a single phase or granular \"particles\" such as aerosols, droplets, bubbles, precipitates, powders, dust, soot, etc. Moments of the Boltzmann equation are solved to predict the phase behavior as a continuous (Eulerian) medium, and is applicable for arbitrary Knudsen number \n\n\n\n(\nK\nn\n)\n\n\n{\\displaystyle (Kn)}\n\n and arbitrary Stokes number \n\n\n\n(\nS\nt\n)\n\n\n{\\displaystyle (St)}\n\n. Source terms for collision models such as Bhatnagar-Gross-Krook (BGK) and models for evaporation, coalescence, breakage, and aggregation are also available. By retaining a quadrature approximation of a probability density function (PDF), a set of abscissas and weights retain the physical solution and allow for the construction of moments that generate a set of partial differential equations (PDE's). QBMM has shown promising preliminary results for modeling granular gases or dispersed phases within carrier fluids and offers an alternative to Lagrangian methods such as Discrete Particle Simulation (DPS). The Lattice Boltzmann Method (LBM) shares some strong similarities in concept, but it relies on fixed abscissas whereas quadrature-based methods are more adaptive. Additionally, the Navier–Stokes equations(N-S) can be derived from the moment method approach.", 
    "name": "Quadrature Based Moment Methods", 
    "classification": "Computational Physics", 
    "full_text": "Quadrature-based moment methods (QBMM) are a class of computational fluid dynamics (CFD) methods for solving Kinetic theory and is optimal for simulating phases such as rarefied gases or dispersed phases of a multiphase flow. The smallest \"particle\" entities which are tracked may be molecules of a single phase or granular \"particles\" such as aerosols, droplets, bubbles, precipitates, powders, dust, soot, etc. Moments of the Boltzmann equation are solved to predict the phase behavior as a continuous (Eulerian) medium, and is applicable for arbitrary Knudsen number \n\n\n\n(\nK\nn\n)\n\n\n{\\displaystyle (Kn)}\n\n and arbitrary Stokes number \n\n\n\n(\nS\nt\n)\n\n\n{\\displaystyle (St)}\n\n. Source terms for collision models such as Bhatnagar-Gross-Krook (BGK) and models for evaporation, coalescence, breakage, and aggregation are also available. By retaining a quadrature approximation of a probability density function (PDF), a set of abscissas and weights retain the physical solution and allow for the construction of moments that generate a set of partial differential equations (PDE's). QBMM has shown promising preliminary results for modeling granular gases or dispersed phases within carrier fluids and offers an alternative to Lagrangian methods such as Discrete Particle Simulation (DPS). The Lattice Boltzmann Method (LBM) shares some strong similarities in concept, but it relies on fixed abscissas whereas quadrature-based methods are more adaptive. Additionally, the Navier–Stokes equations(N-S) can be derived from the moment method approach.\n\n\nQBMM is a relatively new simulation technique for granular systems and has attracted interest from researchers in computational physics, chemistry, and engineering. QBMM is similar to traditional CFD methods, which solve the conservation equations of macroscopic properties (i.e., mass, momentum, and energy) numerically, but QBMM accomplishes this by modeling the fluid as consisting of fictive particles, or nodes, that constitute a discretized PDF. A node consists of an abscissa/weight pair and the weight defines the probability of finding a particle that has the value of its abscissa. This quadrature approximation may also be adaptive, meaning that the number of nodes can increase/decrease to accommodate appropriately complex/simple PDF's. Due to its statistical nature, QBMM has several advantages over other conventional Lagrangian methods, especially in dealing with complex boundaries, incorporating microscopic interactions (such as collisions), parallelization of the algorithm, and computational costs being largely independent of particle population. The numerical methods for solving the system of partial differential equations can be interpreted as the propagation (with a flux term) and interactions (source terms) of fictitious particle probabilities in an Eulerian framework.\nQBMM is a family of methods encompassing a variety of models, some of which are designed specifically to handle PDF's of passive variables, and others more complex, capable of multidimensional PDF's of active variables (such as velocity). Note that the full representation of the PDF is \n\n\n\nf\n(\nt\n,\n\n\nx\n\n\n;\n\n\nξ\n\n\n)\n\n\n{\\displaystyle f(t,{\\mathbf {x}};{\\mathbf {\\xi }})}\n\n, where the parameters \n\n\n\nt\n\n\n{\\displaystyle t}\n\n and \n\n\n\n\n\nx\n\n\n\n\n{\\displaystyle {\\mathbf {x}}}\n\n represent the external coordinates of time and space respectively, while the internal coordinate vector, \n\n\n\n\n\nξ\n\n\n\n\n{\\displaystyle {\\mathbf {\\xi }}}\n\n, may contain any additional desired degrees of freedom to represent the particles, e.g., temperature \n\n\n\n(\nT\n)\n\n\n{\\displaystyle (T)}\n\n, diameter \n\n\n\n(\n\nL\n\np\n\n\n)\n\n\n{\\displaystyle (L_{p})}\n\n, velocity \n\n\n\n(\n\n\nv\n\n\n)\n\n\n{\\displaystyle ({\\mathbf {v}})}\n\n, angular velocity, etc.\nThe applicability of these methods depends upon which particle parameters are important (velocity, diameter, temperature, etc.), and importantly upon two values of the phase: \n\n\n\n(\nK\nn\n)\n\n\n{\\displaystyle (Kn)}\n\n and \n\n\n\n(\nS\nt\n)\n\n\n{\\displaystyle (St)}\n\n. For example, a monokinetic fluid will have a single velocity vector at each point in space, \n\n\n\n\n\nv\n\n\n(\nt\n,\n\n\nx\n\n\n)\n\n\n{\\displaystyle {\\mathbf {v}}(t,{\\mathbf {x}})}\n\n; therefore, its corresponding PDF, \n\n\n\nf\n(\n\n\nv\n\n\n)\n\n\n{\\displaystyle f({\\mathbf {v}})}\n\n, is a Dirac Delta function at every point in space. Similarly, a monodisperse phase has a constant diameter for all particles so that \n\n\n\nf\n(\n\nL\n\np\n\n\n)\n\n\n{\\displaystyle f(L_{p})}\n\n is also a Delta function at every point in space. In those cases a PDF is superfluous and can instead be modeled by just tracking a single value corresponding to the abscissa of the Delta function, and the Navier-Stokes equations may be far more optimal to implement.\nOne of the earliest applications of QBMM was the Quadrature Method of Moments (QMOM) by McGraw[1] in 1997. This method was used mainly for aerosol sprays and droplets by tracking their diameters through phenomenon such as breakage, coalescence, evaporation, etc.\nDirect QMOM (DQMOM) is a mathematical simplification of QMOM that works best for dispersed phases with low Stokes numbers. DQMOM is a very efficient model because the weights and abscissas appear directly in the transport equations alleviating any need for moment construction and inversion. When dealing with low inertia particles where tracking few passive variables is of concern, DQMOM is very advantageous; however, because a large set of unknowns (abscissas and weights) is solved simultaneously, the matrix inversions cannot guaranteed realizable results in some circumstances, even with expensive iterative processes.\nIn 2011 the Conditional QMOM (CQMOM) method was published by Yuan and Fox[2] and this comprehensive method is applicable to modeling very general problems by tracking moments of the PDF, \n\n\n\nf\n(\nt\n,\n\n\nx\n\n\n;\n\n\nξ\n\n\n)\n\n\n{\\displaystyle f(t,{\\mathbf {x}};{\\mathbf {\\xi }})}\n\n, with an arbitrary number of internal parameters. This requires a moment construction and inversion process that converts the set of moments into nodes, and vice versa. The inversion process is the main source of computational costs, but overall CQMOM offers realizable results that DQMOM cannot guarantee.\nCQMOM has the ability to model a fully 3D velocity PDF, known as a polykinetic approach where \n\n\n\nf\n(\n\n\nv\n\n\n)\n\n\n{\\displaystyle f({\\mathbf {v}})}\n\n is not assumed to be a single Delta function. The method is computationally expensive, but very cost-effective when collisions are considered or in dense particle regimes, \n\n\n\nK\nn\n≈\nO\n(\n1\n)\n\n\n{\\displaystyle Kn\\approx O(1)}\n\n, which cannot be modeled using N-S and where DPS is computationally restrictive. CQMOM is also applicable for a dispersed phase where \n\n\n\nS\nt\n>\n1\n\n\n{\\displaystyle St>1}\n\n.\nThe specialized Boltzmann Equation for \n\n\n\nf\n(\nt\n,\n\n\nx\n\n\n;\n\n\nv\n\n\n)\n\n\n{\\displaystyle f(t,{\\mathbf {x}};{\\mathbf {v}})}\n\n is\nwhere \n\n\n\n\n\n\n\nv\n˙\n\n\n\n\n=\n\n\n\n∂\n\n\nv\n\n\n\n\n∂\nt\n\n\n\n\n\n{\\displaystyle {\\mathbf {\\dot {v}}}={\\frac {\\partial {\\mathbf {v}}}{\\partial t}}}\n\n is the acceleration source term (drag, gravity, etc.) and \n\n\n\nC\n\n\n{\\displaystyle C}\n\n is the collision source term. The velocity moment of \n\n\n\nf\n(\nt\n,\n\n\nx\n\n\n;\n\n\nv\n\n\n)\n\n\n{\\displaystyle f(t,{\\mathbf {x}};{\\mathbf {v}})}\n\n in 3D space is defined as\nwhere \n\n\n\n\nv\n\nd\n\n\n\n\n{\\displaystyle v_{d}}\n\n is the velocity in the d'th dimension, \n\n\n\ni\n,\nj\n,\nk\n≥\n0\n\n\n{\\displaystyle i,j,k\\geq 0}\n\n are the multiplicities (arbitrary integer exponents) used to \"weight\" the PDF integration, and \n\n\n\nγ\n≡\ni\n+\nj\n+\nk\n\n\n{\\displaystyle \\gamma \\equiv i+j+k}\n\n is the order of the moment \n\n\n\nM\n\n\n{\\displaystyle M}\n\n. Similarly, by taking moments of the entire Boltzmann equation, any number of arbitrary integro-differential equations may be generated,\nwhere \n\n\n\n\n\ni\n\n\n≡\n{\ni\n,\nj\n,\nk\n}\n\n\n{\\displaystyle {\\mathbf {i}}\\equiv \\{i,j,k\\}}\n\n is a vector of the arbitrary integer indices and \n\n\n\n\n\ni\n\n\n\n\n\n\nv\n\n˙\n\n\n\n≡\n{\ni\n\n\n\n\nv\n˙\n\n\n\n\n1\n\n\n,\nj\n\n\n\n\nv\n˙\n\n\n\n\n2\n\n\n,\nk\n\n\n\n\nv\n˙\n\n\n\n\n3\n\n\n}\n\n\n{\\displaystyle {\\mathbf {i}}{\\dot {\\mathbf {v}}}\\equiv \\{i{\\dot {v}}_{1},j{\\dot {v}}_{2},k{\\dot {v}}_{3}\\}}\n\n is the element-wise scalar multiplication of the vectors. The convective term includes moments of order \n\n\n\nγ\n+\n1\n\n\n{\\displaystyle \\gamma +1}\n\n and requires closure. Moment closure is achieved using the quadrature approximation of the moments,\nwhere \n\n\n\nU\n,\nV\n,\nW\n\n\n{\\displaystyle U,V,W}\n\n are the velocity abscissas, \n\n\n\nϕ\n\n\n{\\displaystyle \\phi }\n\n the weight for the \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n'th node, and \n\n\n\nβ\n\n\n{\\displaystyle \\beta }\n\n the total number of nodes in the quadrature approximation.\nExtended QMOM (EQMOM) gives the quadrature representation of the PDF more flexibility. Instead of relying solely on Dirac delta functions as the basis functions, it uses a Gaussian distribution, thus allowing more complex PDF's to be represented with fewer quadrature nodes.\nDespite the increasing popularity of QBMM in solving the kinetic equations of granular gases, this novel approach has some limitations. At present, CQMOM's computational costs are significantly higher than that of the N-S Equations when \n\n\n\nK\nn\n<\n0.1\n\n\n{\\displaystyle Kn<0.1}\n\n or the DPS costs when \n\n\n\nK\nn\n>>\n1\n\n\n{\\displaystyle Kn>>1}\n\n or \n\n\n\nS\nt\n<\n0.1\n\n\n{\\displaystyle St<0.1}\n\n. Additionally, the finite-volume flux methods introduce errors that can lead to instabilities in the moment-inversion process. Nevertheless, the wide applications of this method show its potential in computational physics, including microfluidics. QBMM demonstrates promising results in the area of high Knudsen number and high Stokes number flows.", 
    "dbpedia_url": "http://dbpedia.org/resource/Quadrature_based_moment_methods", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Quadrature_based_moment_methods\n"
}