{
    "about": "The quantum jump method, also known as the Monte Carlo wave function (MCWF) method, is a technique in computational physics used for simulating open quantum systems. The quantum jump method was developed by Dalibard, Castin and Mølmer, with a very similar method also developed by Carmichael in the same time frame. Other contemporaneous works on wave-function-based Monte Carlo approaches to open quantum systems include those of Dum, Zoller and Ritsch and Hegerfeldt and Wilser.[1][2]", 
    "name": "Quantum Jump Method", 
    "classification": "Computational Physics", 
    "full_text": "The quantum jump method, also known as the Monte Carlo wave function (MCWF) method, is a technique in computational physics used for simulating open quantum systems. The quantum jump method was developed by Dalibard, Castin and Mølmer, with a very similar method also developed by Carmichael in the same time frame. Other contemporaneous works on wave-function-based Monte Carlo approaches to open quantum systems include those of Dum, Zoller and Ritsch and Hegerfeldt and Wilser.[1][2]\nThe quantum jump method is an approach which is much like the master-equation treatment except that it operates on the wave function rather than using a density matrix approach. The main component of the method is evolving the system's wave function in time with a pseudo-Hamiltonian; where at each time step, a quantum jump (discontinuous change) may take place with some probability. The calculated system state as a function of time is known as a quantum trajectory, and the desired density matrix as a function of time may be calculated by averaging over many simulated trajectories. For a Hilbert space of dimension N, the number of wave function components is equal to N while the number of density matrix components is equal to N2. Consequently, for certain problems the quantum jump method offers a performance advantage over direct master-equation approaches.[1]\n\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Quantum_jump_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Quantum_jump_method\n"
}