{
    "about": "In quantum computing, a quantum algorithm is an algorithm which runs on a realistic model of quantum computation, the most commonly used model being the quantum circuit model of computation.[1][2] A classical (or non-quantum) algorithm is a finite sequence of instructions, or a step-by-step procedure for solving a problem, where each step or instruction can be performed on a classical computer. Similarly, a quantum algorithm is a step-by-step procedure, where each of the steps can be performed on a quantum computer. Although all classical algorithms can also be performed on a quantum computer,[3] the term quantum algorithm is usually used for those algorithms which seem inherently quantum, or use some essential feature of quantum computation such as quantum superposition or quantum entanglement.", 
    "name": "Quantum Algorithm", 
    "classification": "Quantum Algorithms", 
    "full_text": "In quantum computing, a quantum algorithm is an algorithm which runs on a realistic model of quantum computation, the most commonly used model being the quantum circuit model of computation.[1][2] A classical (or non-quantum) algorithm is a finite sequence of instructions, or a step-by-step procedure for solving a problem, where each step or instruction can be performed on a classical computer. Similarly, a quantum algorithm is a step-by-step procedure, where each of the steps can be performed on a quantum computer. Although all classical algorithms can also be performed on a quantum computer,[3] the term quantum algorithm is usually used for those algorithms which seem inherently quantum, or use some essential feature of quantum computation such as quantum superposition or quantum entanglement.\nProblems which are undecidable using classical computers remain undecidable using quantum computers. What makes quantum algorithms interesting is that they might be able to solve some problems faster than classical algorithms.\nThe most well known algorithms are Shor's algorithm for factoring, and Grover's algorithm for searching an unstructured database or an unordered list. Shor's algorithms runs exponentially faster than the best known classical algorithm for factoring, the general number field sieve. Grover's algorithm runs quadratically faster than the best possible classical algorithm for the same task.\n\n\nQuantum algorithms are usually described, in the commonly used circuit model of quantum computation, by a quantum circuit which acts on some input qubits and terminates with a measurement. A quantum circuit consists of simple quantum gates which act on at most a fixed number of qubits, usually two or three. Quantum algorithms may also be stated in other models of quantum computation, such as the Hamiltonian oracle model.[4]\nQuantum algorithms can be categorized by the main techniques used by the algorithm. Some commonly used techniques/ideas in quantum algorithms include phase kick-back, phase estimation, the quantum Fourier transform, quantum walks, amplitude amplification and topological quantum field theory. Quantum algorithms may also be grouped by the type of problem solved, for instance see the survey on quantum algorithms for algebraic problems.[5]\nThe quantum Fourier transform is the quantum analogue of the discrete Fourier transform, and is used in several quantum algorithms. The Hadamard transform is also an example of a quantum Fourier transform over an n-dimensional vector space over the field F2. The quantum Fourier transform can be efficiently implemented on a quantum computer using only a polynomial number of quantum gates.\nThe Deutsch–Jozsa algorithm solves a black-box problem which probably requires exponentially many queries to the black box for any deterministic classical computer, but can be done with exactly one query by a quantum computer. If we allow both bounded-error quantum and classical algorithms, then there is no speedup since a classical probabilistic algorithm can solve the problem with a constant number of queries with small probability of error. The algorithm determines whether a function f is either constant (0 on all inputs or 1 on all inputs) or balanced (returns 1 for half of the input domain and 0 for the other half).\nSimon's algorithm solves a black-box problem exponentially faster than any classical algorithm, including bounded-error probabilistic algorithms. This algorithm, which achieves an exponential speedup over all classical algorithms that we consider efficient, was the motivation for Shor's factoring algorithm.\nThe quantum phase estimation algorithm is used to determine the eigenphase of an eigenvector of a unitary gate given a quantum state proportional to the eigenvector and access to the gate. The algorithm is frequently used as a subroutine in other algorithms.\nShor's algorithm solves the discrete logarithm problem and the integer factorization problem in polynomial time,[6] whereas the best known classical algorithms take super-polynomial time. These problems are not known to be in P or NP-complete. It is also one of the few quantum algorithms that solves a non–black-box problem in polynomial time where the best known classical algorithms run in super-polynomial time.\nThe abelian hidden subgroup problem is a generalization of many problems that can be solved by a quantum computer, such as Simon's problem, solving Pell's equation, testing the principal ideal of a ring R and factoring. There are efficient quantum algorithms known for the Abelian hidden subgroup problem.[7] The more general hidden subgroup problem, where the group isn't necessarily abelian, is a generalization of the previously mentioned problems and graph isomorphism and certain lattice problems. Efficient quantum algorithms are known for certain non-abelian groups. However, no efficient algorithms are known for the symmetric group, which would give an efficient algorithm for graph isomorphism[8] and the dihedral group, which would solve certain lattice problems.[9]\nThe Boson Sampling Problem in an experimental configuration assumes[10] an input of bosons (ex. photons of light) of moderate number getting randomly scattered into a large number of output modes constrained by a defined unitarity. The problem is then to produce a fair sample of the probability distribution of the output which is dependent on the input arrangement of bosons and the Unitarity.[11] Solving this problem with a classical computer algorithm requires computing the permanent of the unitary transform matrix, which may be either impossible or take a prohibitively long time. In 2014, it was proposed[12] that existing technology and standard probabilistic methods of generating single photon states could be used as input into a suitable quantum computable linear optical network and that sampling of the output probability distribution would be demonstrably superior using quantum algorithms. In 2015, investigation predicted[13] the sampling problem had similar complexity for inputs other than Fock state photons and identified a transition in computational complexity from classically simulatable to just as hard as the Boson Sampling Problem, dependent on the size of coherent amplitude inputs.\nA Gauss sum is a type of exponential sum. The best known classical algorithm for estimating these sums takes exponential time. Since the discrete logarithm problem reduces to Gauss sum estimation, an efficient classical algorithm for estimating Gauss sums would imply an efficient classical algorithm for computing discrete logarithms, which is considered unlikely. However, quantum computers can estimate Gauss sums to polynomial precision in polynomial time.[14]\nWe have an oracle consisting of n random Boolean functions mapping n-bit strings to a Boolean value. We are required to find n n-bit strings z1,..., zn such that for the Hadamard-Fourier transform, at least 3/4 of the strings satisfy\nand at least 1/4 satisfies\nThis can be done in BQP.[15]\nAmplitude amplification is a technique that allows the amplification of a chosen subspace of a quantum state. Applications of amplitude amplification usually lead to quadratic speedups over the corresponding classical algorithms. It can be considered to be a generalization of Grover's algorithm.\nGrover's algorithm searches an unstructured database (or an unordered list) with N entries, for a marked entry, using only \n\n\n\nO\n(\n\n\nN\n\n\n)\n\n\n{\\displaystyle O({\\sqrt {N}})}\n\n queries instead of the Ω(N) queries required classically.[16] Classically, Ω(N) queries are required, even if we allow bounded-error probabilistic algorithms.\nQuantum counting solves a generalization of the search problem. It solves the problem of counting the number of marked entries in an unordered list, instead of just detecting if one exists. Specifically, it counts the number of marked entries in an \n\n\n\nN\n\n\n{\\displaystyle N}\n\n-element list, with error \n\n\n\nϵ\n\n\n{\\displaystyle \\epsilon }\n\n making only \n\n\n\nΘ\n\n(\n\n\n1\nϵ\n\n\n\n\n\nN\nk\n\n\n\n)\n\n\n\n{\\displaystyle \\Theta \\left({\\frac {1}{\\epsilon }}{\\sqrt {\\frac {N}{k}}}\\right)}\n\n queries, where \n\n\n\nk\n\n\n{\\displaystyle k}\n\n is the number of marked elements in the list.[17][18] More precisely, the algorithm outputs an estimate \n\n\n\n\nk\n′\n\n\n\n{\\displaystyle k'}\n\n for \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, the number of marked entries, with the following accuracy: \n\n\n\n\n|\n\nk\n−\n\nk\n′\n\n\n|\n\n≤\nϵ\nk\n\n\n{\\displaystyle |k-k'|\\leq \\epsilon k}\n\n.\nA quantum walk is the quantum analogue of a classical random walk, which can be described by a probability distribution over some states. A quantum walk can be described by a quantum superposition over states. Quantum walks are known to give exponential speedups for some black-box problems.[19][20] They also provide polynomial speedups for many problems. A framework for the creation quantum walk algorithms exists and is quite a versatile tool.[21]\nThe element distinctness problem is the problem of determining whether all the elements of a list are distinct. Classically, Ω(N) queries are required for a list of size N, since this problem is harder than the search problem which requires Ω(N) queries. However, it can be solved in \n\n\n\nΘ\n(\n\nN\n\n2\n\n/\n\n3\n\n\n)\n\n\n{\\displaystyle \\Theta (N^{2/3})}\n\n queries on a quantum computer. The optimal algorithm is by Andris Ambainis.[22] Yaoyun Shi first proved a tight lower bound when the size of the range is sufficiently large.[23] Ambainis[24] and Kutin[25] independently (and via different proofs) extended his work to obtain the lower bound for all functions.\nThe triangle-finding problem is the problem of determining whether a given graph contains a triangle (a clique of size 3). The best-known lower bound for quantum algorithms is Ω(N), but the best algorithm known requires O(N1.297) queries,[26] an improvement over the previous best O(N1.3) queries.[21][27]\nA formula is a tree with a gate at each internal node and an input bit at each leaf node. The problem is to evaluate the formula, which is the output of the root node, given oracle access to the input.\nA well studied formula is the balanced binary tree with only NAND gates.[28] This type of formula requires Θ(Nc) queries using randomness,[29] where \n\n\n\nc\n=\n\nlog\n\n2\n\n\n⁡\n(\n1\n+\n\n\n33\n\n\n)\n\n/\n\n4\n≈\n0.754\n\n\n{\\displaystyle c=\\log _{2}(1+{\\sqrt {33}})/4\\approx 0.754}\n\n. With a quantum algorithm however, it can be solved in Θ(N0.5) queries. No better quantum algorithm for this case was known until one was found for the unconventional Hamiltonian oracle model.[4] The same result for the standard setting soon followed.[30]\nFast quantum algorithms for more complicated formulas are also known.[31]\nThe problem is to determine if a black box group, given by k generators, is commutative. A black box group is a group with an oracle function, which must be used to perform the group operations (multiplication, inversion, and comparison with identity). We are interested in the query complexity, which is the number of oracle calls needed to solve the problem. The deterministic and randomized query complexities are \n\n\n\nΘ\n(\n\nk\n\n2\n\n\n)\n\n\n{\\displaystyle \\Theta (k^{2})}\n\n and \n\n\n\nΘ\n(\nk\n)\n\n\n{\\displaystyle \\Theta (k)}\n\n respectively.[32] A quantum algorithm requires \n\n\n\nΩ\n(\n\nk\n\n2\n\n/\n\n3\n\n\n)\n\n\n{\\displaystyle \\Omega (k^{2/3})}\n\n queries but the best known algorithm uses \n\n\n\nO\n(\n\nk\n\n2\n\n/\n\n3\n\n\nlog\n⁡\nk\n)\n\n\n{\\displaystyle O(k^{2/3}\\log k)}\n\n queries.[33]\nWitten had shown that the Chern-Simons topological quantum field theory (TQFT) can be solved in terms of Jones polynomials. A quantum computer can simulate a TQFT, and thereby approximate the Jones polynomial,[34] which as far as we know, is hard to compute classically in the worst-case scenario.[citation needed]\nThe idea that quantum computers might be more powerful than classical computers originated in Richard Feynman's observation that classical computers seem to require exponential time to simulate many-particle quantum systems.[35] Since then, the idea that quantum computers can simulate quantum physical processes exponentially faster than classical computers has been greatly fleshed out and elaborated. Efficient (that is, polynomial-time) quantum algorithms have been developed for simulating both Bosonic and Fermionic systems[36] and in particular, the simulation of chemical reactions beyond the capabilities of current classical supercomputers requires only a few hundred qubits.[37] Quantum computers can also efficiently simulate topological quantum field theories.[38] In addition to its intrinsic interest, this result has led to efficient quantum algorithms for estimating quantum topological invariants such as Jones[39] and HOMFLY[40] polynomials, and the Turaev-Viro invariant of three-dimensional manifolds.[41]", 
    "dbpedia_url": "http://dbpedia.org/resource/Quantum_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Quantum_algorithm\n"
}