{
    "about": "A radial basis function (RBF) is a real-valued function whose value depends only on the distance from the origin, so that \n\n\n\nϕ\n(\n\nx\n\n)\n=\nϕ\n(\n∥\n\nx\n\n∥\n)\n\n\n{\\displaystyle \\phi (\\mathbf {x} )=\\phi (\\|\\mathbf {x} \\|)}\n\n; or alternatively on the distance from some other point c, called a center, so that \n\n\n\nϕ\n(\n\nx\n\n,\n\nc\n\n)\n=\nϕ\n(\n∥\n\nx\n\n−\n\nc\n\n∥\n)\n\n\n{\\displaystyle \\phi (\\mathbf {x} ,\\mathbf {c} )=\\phi (\\|\\mathbf {x} -\\mathbf {c} \\|)}\n\n. Any function \n\n\n\nϕ\n\n\n{\\displaystyle \\phi }\n\n that satisfies the property \n\n\n\nϕ\n(\n\nx\n\n)\n=\nϕ\n(\n∥\n\nx\n\n∥\n)\n\n\n{\\displaystyle \\phi (\\mathbf {x} )=\\phi (\\|\\mathbf {x} \\|)}\n\n is a radial function. The norm is usually Euclidean distance, although other distance functions are also possible.", 
    "name": "Radial Basis Function", 
    "classification": "Numerical Analysis", 
    "full_text": "A radial basis function (RBF) is a real-valued function whose value depends only on the distance from the origin, so that \n\n\n\nϕ\n(\n\nx\n\n)\n=\nϕ\n(\n∥\n\nx\n\n∥\n)\n\n\n{\\displaystyle \\phi (\\mathbf {x} )=\\phi (\\|\\mathbf {x} \\|)}\n\n; or alternatively on the distance from some other point c, called a center, so that \n\n\n\nϕ\n(\n\nx\n\n,\n\nc\n\n)\n=\nϕ\n(\n∥\n\nx\n\n−\n\nc\n\n∥\n)\n\n\n{\\displaystyle \\phi (\\mathbf {x} ,\\mathbf {c} )=\\phi (\\|\\mathbf {x} -\\mathbf {c} \\|)}\n\n. Any function \n\n\n\nϕ\n\n\n{\\displaystyle \\phi }\n\n that satisfies the property \n\n\n\nϕ\n(\n\nx\n\n)\n=\nϕ\n(\n∥\n\nx\n\n∥\n)\n\n\n{\\displaystyle \\phi (\\mathbf {x} )=\\phi (\\|\\mathbf {x} \\|)}\n\n is a radial function. The norm is usually Euclidean distance, although other distance functions are also possible.\nSums of radial basis functions are typically used to approximate given functions. This approximation process can also be interpreted as a simple kind of neural network; this was the context in which they originally surfaced, in work by David Broomhead and David Lowe in 1988,[1][2] which stemmed from Michael J. D. Powell's seminal research from 1977.[3][4][5] RBFs are also used as a kernel in support vector classification.[6]\n\n\nCommonly used types of radial basis functions include (writing \n\n\n\nr\n=\n∥\n\nx\n\n−\n\n\nx\n\n\ni\n\n\n∥\n\n\n\n{\\displaystyle r=\\|\\mathbf {x} -\\mathbf {x} _{i}\\|\\;}\n\n):\nRadial basis functions are typically used to build up function approximations of the form\nwhere the approximating function y(x) is represented as a sum of N radial basis functions, each associated with a different center xi, and weighted by an appropriate coefficient wi. The weights wi can be estimated using the matrix methods of linear least squares, because the approximating function is linear in the weights.\nApproximation schemes of this kind have been particularly used[citation needed] in time series prediction and control of nonlinear systems exhibiting sufficiently simple chaotic behaviour, 3D reconstruction in computer graphics (for example, hierarchical RBF and Pose Space Deformation).\nThe sum\ncan also be interpreted as a rather simple single-layer type of artificial neural network called a radial basis function network, with the radial basis functions taking on the role of the activation functions of the network. It can be shown that any continuous function on a compact interval can in principle be interpolated with arbitrary accuracy by a sum of this form, if a sufficiently large number N of radial basis functions is used.\nThe approximant y(x) is differentiable with respect to the weights wi. The weights could thus be learned using any of the standard iterative methods for neural networks.\nUsing radial basis functions in this manner yields a reasonable interpolation approach provided that the fitting set has been chosen such that it covers the entire range systematically (equidistant data points are ideal). However, without a polynomial term that is orthogonal to the radial basis functions, estimates outside the fitting set tend to perform poorly.", 
    "dbpedia_url": "http://dbpedia.org/resource/Radial_basis_function", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Radial_basis_function\n"
}