{
    "about": "Radio frequency sweep or \"Frequency sweep\" or \"RF sweep\" refer to scanning a radio frequency band for detecting signals being transmitted there. This is implemented using a radio receiver having a tunable receiving frequency. As the frequency of the receiver is changed to scan (sweep) a desired frequency band, a display indicates the power of the signals received at each frequency.", 
    "classification": "Signal Processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Radio-frequency_sweep\n", 
    "full_text": "Radio frequency sweep or \"Frequency sweep\" or \"RF sweep\" refer to scanning a radio frequency band for detecting signals being transmitted there. This is implemented using a radio receiver having a tunable receiving frequency. As the frequency of the receiver is changed to scan (sweep) a desired frequency band, a display indicates the power of the signals received at each frequency.\n\n\nA spectrum analyzer is a standard instrument used for RF sweep. It includes an electronically tunable receiver and a display. The display presents measured power (y axis) vs frequency (x axis). The power spectrum display is a two-dimensional display of measured power vs. frequency. The power may be either in linear units, or logarithmic units (dBm). Usually the logarithmic display is more useful, because it presents a larger dynamic range with better detail at each value. An RF sweep relates to a receiver which changes its frequency of operation continuously from a minimum frequency to a maximum (or from maximum to minimum). Usually the sweep is performed at a fixed, controllable rate, for example 5 MHz/sec.\nSome systems use frequency hopping, switching from one frequency of operation to another. One method of CDMA uses frequency hopping. Usually frequency hopping is performed in a random or pseudo-random pattern.\nFrequency sweeps may be used by regulatory agencies to monitor the radio spectrum, to ensure that users only transmit according to their licenses. The FCC for example controls and monitors the use of the spectrum in U.S.A. In testing of new electronic devices, a frequency sweep may be done to measure the performance of electronic components or systems. For example, RF oscillators are measured for phase noise, harmonics and spurious signals; computers for consumer sale are tested to avoid radio frequency interference with radio systems. Portable sweep equipment may be used to detect some types of covert listening device (bugs).\nIn professional audio, the optimum use of wireless microphones and wireless intercoms may require performing a sweep of the local radio spectrum, especially if many wireless devices are being used simultaneously. The sweep is generally limited in bandwidth to only the operating bandwidth of the wireless devices. For instance, at American Super Bowl games, audio engineers monitor (sweep) the radio spectrum in real time to make certain that all local wireless microphones are operating at previously agreed-upon and coordinated frequencies.[1]", 
    "name": "Radio Frequency Sweep"
}