{
    "about": "Ragel is a finite-state machine compiler and a parser generator. Initially Ragel supported output for C, C++ and Assembly source code,[2] and was subsequently extended to support Objective C, D, Go, Ruby, and Java. It supports the generation of table or control flow driven state machines from regular expressions[3] and/or state charts and can also build lexical analysers via the longest-match method. Ragel specifically targets text parsing and input validation.[4]", 
    "name": "Ragel", 
    "classification": "Pattern Matching", 
    "full_text": "Ragel is a finite-state machine compiler and a parser generator. Initially Ragel supported output for C, C++ and Assembly source code,[2] and was subsequently extended to support Objective C, D, Go, Ruby, and Java. It supports the generation of table or control flow driven state machines from regular expressions[3] and/or state charts and can also build lexical analysers via the longest-match method. Ragel specifically targets text parsing and input validation.[4]\n\n\nRagel supports the generation of table or control flow driven state machines from regular expressions and/or state charts and can also build lexical analysers via the longest-match method. A unique feature of Ragel is that user actions can be associated with arbitrary state machine transitions using operators that are integrated into the regular expressions. Ragel also supports visualization of the generated machine via graphviz.\n\nThe graph represents a state-machine that takes user input as a series of bytes representing ASCII characters and control codes. 48..57 is equivalent to the regular expression [0-9] (i.e. any digit), so only sequences beginning with a digit can be recognised. If 10 (line feed) is encountered, we're done. 46 is the decimal point ('.'), 43 and 45 are positive and negative signs ('+', '-') and 69/101 is uppercase/lowercase 'e' (to indicate a number in scientific format). As such it will recognize the following properly:\nbut not:", 
    "dbpedia_url": "http://dbpedia.org/resource/Ragel", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Ragel\n"
}