{
    "about": "A randomized algorithm is an algorithm that employs a degree of randomness as part of its logic. The algorithm typically uses uniformly random bits as an auxiliary input to guide its behavior, in the hope of achieving good performance in the \"average case\" over all possible choices of random bits. Formally, the algorithm's performance will be a random variable determined by the random bits; thus either the running time, or the output (or both) are random variables.", 
    "name": "Randomized Algorithm", 
    "classification": "Randomized Algorithms", 
    "full_text": "A randomized algorithm is an algorithm that employs a degree of randomness as part of its logic. The algorithm typically uses uniformly random bits as an auxiliary input to guide its behavior, in the hope of achieving good performance in the \"average case\" over all possible choices of random bits. Formally, the algorithm's performance will be a random variable determined by the random bits; thus either the running time, or the output (or both) are random variables.\nOne has to distinguish between algorithms that use the random input so that they always terminate with the correct answer, but where the expected running time is finite (Las Vegas algorithms), and algorithms which have a chance of producing an incorrect result (Monte Carlo algorithms) or fail to produce a result either by signalling a failure or failing to terminate.\nIn the second case, random performance and random output, the term \"algorithm\" for a procedure is somewhat questionable. In the case of random output, it is no longer formally effective.[1] However, in some cases, probabilistic algorithms are the only practical means of solving a problem.[2]\nIn common practice, randomized algorithms are approximated using a pseudorandom number generator in place of a true source of random bits; such an implementation may deviate from the expected theoretical behavior.\n\n\nAs a motivating example, consider the problem of finding an ‘a’ in an array of n elements.\nInput: An array of n≥2 elements, in which half are ‘a’s and the other half are ‘b’s.\nOutput: Find an ‘a’ in the array.\nWe give two versions of the algorithm, one Las Vegas algorithm and one Monte Carlo algorithm.\nLas Vegas algorithm:\nThis algorithm succeeds with probability 1. The number of iterations varies and can be arbitrarily large, but the expected number of iterations is\nSince it is constant the expected run time over many calls is \n\n\n\nΘ\n(\n1\n)\n\n\n{\\displaystyle \\Theta (1)}\n\n. (See Big O notation)\nMonte Carlo algorithm:\nIf an ‘a’ is found, the algorithm succeeds, else the algorithm fails. After k iterations, the probability of finding an ‘a’ is:\n\n\n\n\nPr\n[\n\nf\ni\nn\nd\n \na\n\n]\n=\n1\n−\n(\n1\n\n/\n\n2\n\n)\n\nk\n\n\n\n\n{\\displaystyle \\Pr[\\mathrm {find~a} ]=1-(1/2)^{k}}\n\n\nThis algorithm does not guarantee success, but the run time is bounded. The number of iterations is always less than or equal to k. Taking k to be constant the run time (expected and absolute) is \n\n\n\nΘ\n(\n1\n)\n\n\n{\\displaystyle \\Theta (1)}\n\n.\nRandomized algorithms are particularly useful when faced with a malicious \"adversary\" or attacker who deliberately tries to feed a bad input to the algorithm (see worst-case complexity and competitive analysis (online algorithm)) such as in the Prisoner's dilemma. It is for this reason that randomness is ubiquitous in cryptography. In cryptographic applications, pseudo-random numbers cannot be used, since the adversary can predict them, making the algorithm effectively deterministic. Therefore, either a source of truly random numbers or a cryptographically secure pseudo-random number generator is required. Another area in which randomness is inherent is quantum computing.\nIn the example above, the Las Vegas algorithm always outputs the correct answer, but its running time is a random variable. The Monte Carlo algorithm (related to the Monte Carlo method for simulation) is guaranteed to complete in an amount of time that can be bounded by a function the input size and its parameter k, but allows a small probability of error. Observe that any Las Vegas algorithm can be converted into a Monte Carlo algorithm (via Markov's inequality), by having it output an arbitrary, possibly incorrect answer if it fails to complete within a specified time. Conversely, if an efficient verification procedure exists to check whether an answer is correct, then a Monte Carlo algorithm can be converted into a Las Vegas algorithm by running the Monte Carlo algorithm repeatedly till a correct answer is obtained.\nComputational complexity theory models randomized algorithms as probabilistic Turing machines. Both Las Vegas and Monte Carlo algorithms are considered, and several complexity classes are studied. The most basic randomized complexity class is RP, which is the class of decision problems for which there is an efficient (polynomial time) randomized algorithm (or probabilistic Turing machine) which recognizes NO-instances with absolute certainty and recognizes YES-instances with a probability of at least 1/2. The complement class for RP is co-RP. Problem classes having (possibly nonterminating) algorithms with polynomial time average case running time whose output is always correct are said to be in ZPP.\nThe class of problems for which both YES and NO-instances are allowed to be identified with some error is called BPP. This class acts as the randomized equivalent of P, i.e. BPP represents the class of efficient randomized algorithms.\nHistorically, the first randomized algorithm was a method developed by Michael O. Rabin for the closest pair problem in computational geometry.[3] The study of randomized algorithms was spurred by the 1977 discovery of a randomized primality test (i.e., determining the primality of a number) by Robert M. Solovay and Volker Strassen. Soon afterwards Michael O. Rabin demonstrated that the 1976 Miller's primality test can be turned into a randomized algorithm. At that time, no practical deterministic algorithm for primality was known.\nThe Miller-Rabin primality test relies on a binary relation between two positive integers k and n that can be expressed by saying that k \"is a witness to the compositeness of\" n. It can be shown that\nObserve that this implies that the primality problem is in Co-RP.\nIf one randomly chooses 100 numbers less than a composite number n, then the probability of failing to find such a \"witness\" is (1/4)100 so that for most practical purposes, this is a good primality test. If n is big, there may be no other test that is practical. The probability of error can be reduced to an arbitrary degree by performing enough independent tests.\nTherefore, in practice, there is no penalty associated with accepting a small probability of error, since with a little care the probability of error can be made astronomically small. Indeed, even though a deterministic polynomial-time primality test has since been found (see AKS primality test), it has not replaced the older probabilistic tests in cryptographic software nor is it expected to do so for the foreseeable future.\nQuicksort is a familiar, commonly used algorithm in which randomness can be useful. Any deterministic version of this algorithm requires O(n2) time to sort n numbers for some well-defined class of degenerate inputs (such as an already sorted array), with the specific class of inputs that generate this behavior defined by the protocol for pivot selection. However, if the algorithm selects pivot elements uniformly at random, it has a provably high probability of finishing in O(n log n) time regardless of the characteristics of the input.\nIn computational geometry, a standard technique to build a structure like a convex hull or Delaunay triangulation is to randomly permute the input points and then insert them one by one into the existing structure. The randomization ensures that the expected number of changes to the structure caused by an insertion is small, and so the expected running time of the algorithm can be upper bounded. This technique is known as randomized incremental construction.[4]\nInput: A graph G(V,E)\nOutput: A cut partitioning the vertices into L and R, with the minimum number of edges between L and R.\nRecall that the contraction of two nodes, u and v, in a (multi-)graph yields a new node u ' with edges that are the union of the edges incident on either u or v, except from any edge(s) connecting u and v. Figure 1 gives an example of contraction of vertex A and B. After contraction, the resulting graph may have parallel edges, but contains no self loops.\nKarger's [5] basic algorithm:\nIn each execution of the outer loop, the algorithm repeats the inner loop until only 2 nodes remain, the corresponding cut is obtained. The run time of one execution is \n\n\n\nO\n(\nn\n)\n\n\n{\\displaystyle O(n)}\n\n, and n denotes the number of vertices. After m times executions of the outer loop, we output the minimum cut among all the results. The figure 2 gives an example of one execution of the algorithm. After execution, we get a cut of size 3.\nLemma 1: Let k be the min cut size, and let C = {e1,e2,...,ek} be the min cut. If, during iteration i, no edge e ∈ C is selected for contraction, then Ci = C.\nProof: If G is not connected, then G can be partitioned into L and R without any edge between them. So the min cut in a disconnected graph is 0. Now, assume G is connected. Let V=L∪R be the partition of V induced by C : C={ {u,v} ∈ E : u ∈ L,v ∈ R } (well-defined since G is connected). Consider an edge {u,v} of C. Initially, u,v are distinct vertices. As long as we pick an edge \n\n\n\nf\n≠\ne\n\n\n{\\displaystyle f\\neq e}\n\n, u and v do not get merged. Thus, at the end of the algorithm, we have two compound nodes covering the entire graph, one consisting of the vertices of L and the other consisting of the vertices of R. As in figure 2, the size of min cut is 1, and C = {(A,B)}. If we don't select (A,B) for contraction, we can get the min cut.\nLemma 2: If G is a multigraph with p vertices and whose min cut has size k, then G has at least pk/2 edges.\nProof: Because the min cut is k, every vertex v must satisfy degree(v) ≥ k. Therefore, the sum of the degree is at least pk. But it is well known that the sum of vertex degrees equals 2|E|. The lemma follows.\nAnalysis of algorithm\nThe probability that the algorithm succeeds is 1 − the probability that all attempts fail. By independence, the probability that all attempts fail is\n\n\n\n\n\n∏\n\ni\n=\n1\n\n\nm\n\n\nPr\n(\n\nC\n\ni\n\n\n≠\nC\n)\n=\n\n∏\n\ni\n=\n1\n\n\nm\n\n\n(\n1\n−\nPr\n(\n\nC\n\ni\n\n\n=\nC\n)\n)\n.\n\n\n{\\displaystyle \\prod _{i=1}^{m}\\Pr(C_{i}\\neq C)=\\prod _{i=1}^{m}(1-\\Pr(C_{i}=C)).}\n\n\nBy lemma 1, the probability that Ci = C is the probability that no edge of C is selected during iteration i. Consider the inner loop and let Gj denote the graph after j edge contractions, where j ∈ {0,1,...,n − 3}. Gj has n − j vertices. We use the chain rule of conditional possibilities. The probability that the edge chosen at iteration j is not in C, given that no edge of C has been chosen before, is \n\n\n\n1\n−\n\n\nk\n\n\n|\n\nE\n(\n\nG\n\nj\n\n\n)\n\n|\n\n\n\n\n\n\n{\\displaystyle 1-{\\frac {k}{|E(G_{j})|}}}\n\n. Note that Gj still has min cut of size k, so by Lemma 2, it still has at least \n\n\n\n\n\n\n(\nn\n−\nj\n)\nk\n\n2\n\n\n\n\n{\\displaystyle {\\frac {(n-j)k}{2}}}\n\n edges.\nThus, \n\n\n\n1\n−\n\n\nk\n\n\n|\n\nE\n(\n\nG\n\nj\n\n\n)\n\n|\n\n\n\n\n≥\n1\n−\n\n\n2\n\nn\n−\nj\n\n\n\n=\n\n\n\nn\n−\nj\n−\n2\n\n\nn\n−\nj\n\n\n\n\n\n{\\displaystyle 1-{\\frac {k}{|E(G_{j})|}}\\geq 1-{\\frac {2}{n-j}}={\\frac {n-j-2}{n-j}}}\n\n.\nSo by the chain rule, the probability of finding the min cut C is \n\n\n\nP\nr\n[\n\nC\n\ni\n\n\n=\nC\n]\n≥\n\n(\n\n\n\nn\n−\n2\n\nn\n\n\n)\n\n\n(\n\n\n\nn\n−\n3\n\n\nn\n−\n1\n\n\n\n)\n\n\n(\n\n\n\nn\n−\n4\n\n\nn\n−\n2\n\n\n\n)\n\n…\n\n(\n\n\n3\n5\n\n\n)\n\n\n(\n\n\n2\n4\n\n\n)\n\n\n(\n\n\n1\n3\n\n\n)\n\n.\n\n\n{\\displaystyle Pr[C_{i}=C]\\geq \\left({\\frac {n-2}{n}}\\right)\\left({\\frac {n-3}{n-1}}\\right)\\left({\\frac {n-4}{n-2}}\\right)\\ldots \\left({\\frac {3}{5}}\\right)\\left({\\frac {2}{4}}\\right)\\left({\\frac {1}{3}}\\right).}\n\n\nCancellation gives \n\n\n\nPr\n[\n\nC\n\ni\n\n\n=\nC\n]\n≥\n\n\n2\n\nn\n(\nn\n−\n1\n)\n\n\n\n\n\n{\\displaystyle \\Pr[C_{i}=C]\\geq {\\frac {2}{n(n-1)}}}\n\n. Thus the probability that the algorithm succeeds is at least \n\n\n\n1\n−\n\n\n(\n1\n−\n\n\n2\n\nn\n(\nn\n−\n1\n)\n\n\n\n)\n\n\nm\n\n\n\n\n{\\displaystyle 1-\\left(1-{\\frac {2}{n(n-1)}}\\right)^{m}}\n\n. For \n\n\n\nm\n=\n\n\n\nn\n(\nn\n−\n1\n)\n\n2\n\n\nln\n⁡\nn\n\n\n{\\displaystyle m={\\frac {n(n-1)}{2}}\\ln n}\n\n, this is equivalent to \n\n\n\n1\n−\n\n\n1\nn\n\n\n\n\n{\\displaystyle 1-{\\frac {1}{n}}}\n\n. The algorithm finds the min cut with probability \n\n\n\n1\n−\n\n\n1\nn\n\n\n\n\n{\\displaystyle 1-{\\frac {1}{n}}}\n\n, in time \n\n\n\nO\n(\nm\nn\n)\n=\nO\n(\n\nn\n\n3\n\n\nlog\n⁡\nn\n)\n\n\n{\\displaystyle O(mn)=O(n^{3}\\log n)}\n\n.\nRandomness can be viewed as a resource, like space and time. Derandomization is then the process of removing randomness (or using as little of it as possible). From the viewpoint of computational complexity, derandomizing an efficient randomized algorithm is the question, is P = BPP ?\nThere are also specific methods that can be employed to derandomize particular randomized algorithms:\nWhen the model of computation is restricted to Turing machines, it is currently an open question whether the ability to make random choices allows some problems to be solved in polynomial time that cannot be solved in polynomial time without this ability; this is the question of whether P = BPP. However, in other contexts, there are specific examples of problems where randomization yields strict improvements.", 
    "dbpedia_url": "http://dbpedia.org/resource/Randomized_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Randomized_algorithm\n"
}