{
    "about": "RANDU is a linear congruential pseudorandom number generator of the Park–Miller type, which has been used since the 1960s.[1] It is defined by the recurrence:", 
    "name": "Randu", 
    "classification": "Pseudorandom Number Generators", 
    "full_text": "RANDU is a linear congruential pseudorandom number generator of the Park–Miller type, which has been used since the 1960s.[1] It is defined by the recurrence:\nwith the initial seed number, \n\n\n\n\n\nV\n\n0\n\n\n\n\n\n{\\displaystyle \\scriptstyle V_{0}}\n\n as an odd number. It generates pseudorandom integers \n\n\n\n\n\nV\n\nj\n\n\n\n\n\n{\\displaystyle \\scriptstyle V_{j}}\n\n which are uniformly distributed in the interval [1, 231 − 1], but in practical applications are often mapped into pseudorandom rationals \n\n\n\n\n\nX\n\nj\n\n\n\n\n\n{\\displaystyle \\scriptstyle X_{j}}\n\n in the interval (0, 1), by the formula:\nIBM's RANDU is widely considered to be one of the most ill-conceived random number generators ever designed.[2] It fails the spectral test badly for dimensions greater than 2, and every integer result is odd. However, at least eight low-order bits are dropped when converted to single-precision (32 bit, 24 bit mantissa) floating-point.\nThe reason for choosing these particular values is that with a 32-bit-integer word size, the arithmetic of mod 231 and \n\n\n\n65539\n\n\n{\\displaystyle 65539}\n\n \n\n\n\n(\n\ni.e., \n\n\n2\n\n16\n\n\n+\n3\n)\n\n\n{\\displaystyle ({\\text{i.e., }}2^{16}+3)}\n\n calculations could be done quickly, using special features of some computer hardware.\n\n\nTo show the problem with these values, of multiplier 65539 and modulus 231, consider the following calculation where every term should be taken mod 231. Start by writing the recursive relation as:\nwhich becomes, after expanding the quadratic factor:\nand allows us to show the correlation between three points as:\nAs a result of this correlation, the points in three-dimensional space (mod 231) fall in 15 planes.[3][not in citation given] As a result of the wide use of RANDU in the early 1970s, many results from that time are seen as suspicious.[4]\nThis misbehavior was already detected in 1963[5] on a 36-bit computer, and carefully reimplemented[clarification needed] on the 32-bit IBM System/360. It was believed to have been widely purged by the early 1990s [6]\nThe start and end of the RANDU’s output period for the initial seed \n\n\n\n\n\nV\n\n0\n\n\n=\n1\n\n\n\n{\\displaystyle \\scriptstyle V_{0}=1}\n\n is:", 
    "dbpedia_url": "http://dbpedia.org/resource/RANDU", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/RANDU\n"
}