{
    "about": "In numerical analysis, the speed at which a convergent sequence approaches its limit is called the rate of convergence. Although strictly speaking, a limit does not give information about any finite first part of the sequence, this concept is of practical importance in dealing with a sequence of successive approximations for an iterative method, as then typically fewer iterations are needed to yield a useful approximation if the rate of convergence is higher. This may even make the difference between needing ten or a million iterations insignificant.", 
    "name": "Rate Of Convergence", 
    "classification": "Numerical Analysis", 
    "full_text": "In numerical analysis, the speed at which a convergent sequence approaches its limit is called the rate of convergence. Although strictly speaking, a limit does not give information about any finite first part of the sequence, this concept is of practical importance in dealing with a sequence of successive approximations for an iterative method, as then typically fewer iterations are needed to yield a useful approximation if the rate of convergence is higher. This may even make the difference between needing ten or a million iterations insignificant.\nSimilar concepts are used for discretization methods. The solution of the discretized problem converges to the solution of the continuous problem as the grid size goes to zero, and the speed of convergence is one of the factors of the efficiency of the method. However, the terminology in this case is different from the terminology for iterative methods.\nSeries acceleration is a collection of techniques for improving the rate of convergence of a series discretization. Such acceleration is commonly accomplished with sequence transformations.\n\n\nSuppose that the sequence {xk} converges to the number L.\nWe say that this sequence converges linearly to L, if there exists a number μ ∈ (0, 1) such that\nThe number μ is called the rate of convergence.\nIf the sequence converges, and\nIf the sequence converges sublinearly and additionally\nthen it is said the sequence {xk} converges logarithmically to L.\nThe next definition is used to distinguish superlinear rates of convergence. We say that the sequence converges with order q to L for q>1[1] if\nIn particular, convergence with order\nThis is sometimes called Q-linear convergence, Q-quadratic convergence, etc., to distinguish it from the definition below. The Q stands for \"quotient,\" because the definition uses the quotient between two successive terms.\nA practical method to calculate the rate of convergence for a sequence is to calculate the following sequence which is converging to p.\nThe drawback of the above definitions is that these do not catch some sequences which still converge reasonably fast, but whose \"speed\" is variable, such as the sequence {bk} below. Therefore, the definition of rate of convergence is sometimes extended as follows.\nUnder the new definition, the sequence {xk} converges with at least order q if there exists a sequence {εk} such that\nand the sequence {εk} converges to zero with order q according to the above \"simple\" definition. To distinguish it from that definition, this is sometimes called R-linear convergence, R-quadratic convergence, etc. (with the R standing for \"root\").\nConsider the following sequences:\nThe sequence {ak} converges linearly to 0 with rate 1/2. More generally, the sequence Cμk converges linearly with rate μ if |μ| < 1. The sequence {bk} also converges linearly to 0 with rate 1/2 under the extended definition, but not under the simple definition. The sequence {ck} converges superlinearly. In fact, it is quadratically convergent. Finally, the sequence {dk} converges sublinearly and logarithmically.\nA similar situation exists for discretization methods. The important parameter here for the convergence speed is not the iteration number k but it depends on the number of grid points and grid spacing. In this case, the number of grid points n in a discretization process is inversely proportional to the grid spacing.\nIn this case, a sequence \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n is said to converge to L with order p if there exists a constant C such that\nThis is written as |xn - L| = O(n−p) using the big O notation.\nThis is the relevant definition when discussing methods for numerical quadrature or the solution of ordinary differential equations. A practical method to calculate the rate of convergence for a discretization method is to implement the following formula:\nThe sequence {dk} with dk = 1 / (k+1) was introduced above. This sequence converges with order 1 according to the convention for discretization methods.\nThe sequence {ak} with ak = 2−k, which was also introduced above, converges with order p for every number p. It is said to converge exponentially using the convention for discretization methods. However, it only converges linearly (that is, with order 1) using the convention for iterative methods.\nThe order of convergence of a discretization method is related to its Global Truncation Error (GTE).\nMany methods exist to increase the rate of convergence of a given sequence, i.e. to transform a given sequence into one converging faster to the same limit. Such techniques are in general known as \"series acceleration\". The goal of the transformed sequence is to reduce the computational cost of the calculation. One example of series acceleration is Aitken's delta-squared process.\nThe simple definition is used in\nThe extended definition is used in\nLogarithmic convergence is used in\nThe Big O definition is used in\nThe terms Q-linear and R-linear are used in; The Big O definition when using Taylor series is used in\nOne may also study the following paper for Q-linear and R-linear:", 
    "dbpedia_url": "http://dbpedia.org/resource/Rate_of_convergence", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Rate_of_convergence\n"
}