{
    "about": "Recurrence quantification analysis (RQA) is a method of nonlinear data analysis (cf. chaos theory) for the investigation of dynamical systems. It quantifies the number and duration of recurrences of a dynamical system presented by its phase space trajectory.", 
    "name": "Recurrence Quantification Analysis", 
    "classification": "Signal Processing", 
    "full_text": "Recurrence quantification analysis (RQA) is a method of nonlinear data analysis (cf. chaos theory) for the investigation of dynamical systems. It quantifies the number and duration of recurrences of a dynamical system presented by its phase space trajectory.\n\n\nThe recurrence quantification analysis was developed in order to quantify differently appearing recurrence plots (RPs) based on the small-scale structures therein. Recurrence plots are tools which visualise the recurrence behaviour of the phase space trajectory of dynamical systems. They mostly contain single dots and lines which are parallel to the mean diagonal (line of identity, LOI) or which are vertical/horizontal. Lines parallel to the LOI are referred to as diagonal lines and the vertical structures as vertical lines. Because an RP is usually symmetric, horizontal and vertical lines correspond to each other, and, hence, only vertical lines are considered. The lines correspond to a typical behaviour of the phase space trajectory: whereas the diagonal lines represent such segments of the phase space trajectory which run parallel for some time, the vertical lines represent segments which remain in the same phase space region for some time.\nIf only a time series is available, the phase space can be reconstructed by using a time delay embedding (see Takens' theorem):\nwhere \n\n\n\nu\n(\ni\n)\n\n\n{\\displaystyle u(i)}\n\n is the time series, \n\n\n\nm\n\n\n{\\displaystyle m}\n\n the embedding dimension and \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n the time delay.\nThe RQA quantifies the small-scale structures of recurrence plots, which present the number and duration of the recurrences of a dynamical system. The measures introduced for the RQA were developed heuristically between 1992 and 2002 (Zbilut & Webber 1992; Webber & Zbilut 1994; Marwan et al. 2002). They are actually measures of complexity. The main advantage of the recurrence quantification analysis is that it can provide useful information even for short and non-stationary data, where other methods fail.\nRQA can be applied to almost every kind of data. It is widely used in physiology, but was also successfully applied on problems from engineering, chemistry, Earth sciences etc.\nThe simplest measure is the recurrence rate, which is the density of recurrence points in a recurrence plot:\nThe recurrence rate corresponds with the probability that a specific state will recur. It is almost equal with the definition of the correlation sum, where the LOI is excluded from the computation.\nThe next measure is the percentage of recurrence points which form diagonal lines in the recurrence plot of minimal length \n\n\n\n\nℓ\n\nmin\n\n\n\n\n{\\displaystyle \\ell _{\\min }}\n\n:\nwhere \n\n\n\nP\n(\nℓ\n)\n\n\n{\\displaystyle P(\\ell )}\n\n is the frequency distribution of the lengths \n\n\n\nℓ\n\n\n{\\displaystyle \\ell }\n\n of the diagonal lines. This measure is called determinism and is related with the predictability of the dynamical system, because white noise has a recurrence plot with almost only single dots and very few diagonal lines, whereas a deterministic process has a recurrence plot with very few single dots but many long diagonal lines.\nThe amount of recurrence points which form vertical lines can be quantified in the same way:\nwhere \n\n\n\nP\n(\nv\n)\n\n\n{\\displaystyle P(v)}\n\n is the frequency distribution of the lengths \n\n\n\nv\n\n\n{\\displaystyle v}\n\n of the vertical lines, which have at least a length of \n\n\n\n\nv\n\nmin\n\n\n\n\n{\\displaystyle v_{\\min }}\n\n. This measure is called laminarity and is related with the amount of laminar phases in the system (intermittency).\nThe lengths of the diagonal and vertical lines can be measured as well. The averaged diagonal line length\nis related with the predictability time of the dynamical system and the trapping time, measuring the average length of the vertical lines,\nis related with the laminarity time of the dynamical system, i.e. how long the system remains in a specific state.\nBecause the length of the diagonal lines is related on the time how long segments of the phase space trajectory run parallel, i.e. on the divergence behaviour of the trajectories, it was sometimes stated that the reciprocal of the maximal length of the diagonal lines (without LOI) would be an estimator for the positive maximal Lyapunov exponent of the dynamical system. Therefore, the maximal diagonal line length \n\n\n\n\nL\n\nmax\n\n\n\n\n{\\displaystyle L_{\\max }}\n\n or the divergence\nare also measures of the RQA. However, the relationship between these measures with the positive maximal Lyapunov exponent is not as easy as stated, but even more complex (to calculate the Lyapunov exponent from an RP, the whole frequency distribution of the diagonal lines has to be considered). The divergence can have the trend of the positive maximal Lyapunov exponent, but not more. Moreover, also RPs of white noise processes can have a really long diagonal line, although very seldom, just by a finite probability. It is obvious that therefore the divergence cannot reflect the maximal Lyapunov exponent.\nThe probability \n\n\n\np\n(\nℓ\n)\n\n\n{\\displaystyle p(\\ell )}\n\n that a diagonal line has exactly length \n\n\n\nℓ\n\n\n{\\displaystyle \\ell }\n\n can be estimated from the frequency distribution \n\n\n\nP\n(\nℓ\n)\n\n\n{\\displaystyle P(\\ell )}\n\n with \n\n\n\np\n(\nℓ\n)\n=\n\n\n\nP\n(\nℓ\n)\n\n\n\n∑\n\nℓ\n=\n\nl\n\nmin\n\n\n\n\nN\n\n\nP\n(\nℓ\n)\n\n\n\n\n\n{\\displaystyle p(\\ell )={\\frac {P(\\ell )}{\\sum _{\\ell =l_{\\min }}^{N}P(\\ell )}}}\n\n. The Shannon entropy of this probability,\nreflects the complexity of the deterministic structure in the system. However, this entropy depends sensitively on the bin number and, thus, may differ for different realisations of the same process, as well as for different data preparations.\nThe last measure of the RQA quantifies the thinning-out of the recurrence plot. The trend is the regression coefficient of a linear relationship between the density of recurrence points in a line parallel to the LOI and its distance to the LOI. More exactly, let us consider the recurrence rate in a diagonal line parallel to LOI of distance k (diagonal-wise recurrence rate):\nthen the trend is defined by\nwith \n\n\n\n⟨\n⋅\n⟩\n\n\n{\\displaystyle \\langle \\cdot \\rangle }\n\n as the average value and \n\n\n\n\n\n\nN\n~\n\n\n\n<\nN\n\n\n{\\displaystyle {\\tilde {N}}<N}\n\n. This latter relation should ensure to avoid the edge effects of too low recurrence point densities in the edges of the recurrence plot. The measure trend provides information about the stationarity of the system.\nSimilar to the diagonal-wise defined recurrence rate, the other measures based on the diagonal lines (DET, L, ENTR) can be defined diagonal-wise. These definitions are useful to study interrelations or synchronisation between different systems (using recurrence plots or cross recurrence plots).\nInstead of computing the RQA measures of the entire recurrence plot, they can be computed in small windows moving over the recurrence plot along the LOI. This provides time-dependent RQA measures which allow detecting, e.g., chaos-chaos transitions (Marwan et al. 2002). Note: the choice of the size of the window can strongly influence the measure trend.", 
    "dbpedia_url": "http://dbpedia.org/resource/Recurrence_quantification_analysis", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Recurrence_quantification_analysis\n"
}