{
    "about": "Reed–Solomon codes are a group of error-correcting codes that were introduced by Irving S. Reed and Gustave Solomon in 1960.[1] They have many applications, the most prominent of which include consumer technologies such as CDs, DVDs, Blu-ray Discs, QR Codes, data transmission technologies such as DSL and WiMAX, broadcast systems such as DVB and ATSC, and storage systems such as RAID 6. They are also used in satellite communication.", 
    "name": "Reed–Solomon Error Correction", 
    "classification": "Error Detection And Correction", 
    "full_text": "Reed–Solomon codes are a group of error-correcting codes that were introduced by Irving S. Reed and Gustave Solomon in 1960.[1] They have many applications, the most prominent of which include consumer technologies such as CDs, DVDs, Blu-ray Discs, QR Codes, data transmission technologies such as DSL and WiMAX, broadcast systems such as DVB and ATSC, and storage systems such as RAID 6. They are also used in satellite communication.\nIn coding theory, the Reed–Solomon code belongs to the class of non-binary cyclic error-correcting codes. The Reed–Solomon code is based on univariate polynomials over finite fields.\nIt is able to detect and correct multiple symbol errors. By adding t check symbols to the data, a Reed–Solomon code can detect any combination of up to t erroneous symbols, or correct up to ⌊t/2⌋ symbols. As an erasure code, it can correct up to t known erasures, or it can detect and correct combinations of errors and erasures. Furthermore, Reed–Solomon codes are suitable as multiple-burst bit-error correcting codes, since a sequence of b + 1 consecutive bit errors can affect at most two symbols of size b. The choice of t is up to the designer of the code, and may be selected within wide limits.\n\n\nReed–Solomon codes were developed in 1960 by Irving S. Reed and Gustave Solomon, who were then staff members of MIT Lincoln Laboratory. Their seminal article was titled \"Polynomial Codes over Certain Finite Fields.\" (Reed & Solomon 1960). The original encoding scheme described in the Reed Solomon article used a variable polynomial based on the message to be encoded, which made decoding impractical for all but the simplest of cases. This was resolved by changing the encoding scheme to use a fixed polynomial known to both encoder and decoder. A practical decoder developed by Daniel Gorenstein and Neal Zierler was described in an MIT Lincoln Laboratory report by Zierler in January 1960 and later in a paper in June 1961.[2] During the same period, work was also being done on BCH codes and Reed-Solomon codes were considered as a special class of BCH codes at the time. The Gorenstein-Zierler decoder and the related work on BCH codes are described in a book Error Correcting Codes by W. Wesley Peterson (1961).[3]\nAn improved decoder was developed in 1969 by Elwyn Berlekamp and James Massey, and is since known as the Berlekamp–Massey decoding algorithm. Another improved decoder was developed in 1975 by Yasuo Sugiyama, based on the extended Euclidean algorithm.[4]\nIn 1977, Reed–Solomon codes were implemented in the Voyager program in the form of concatenated error correction codes. The first commercial application in mass-produced consumer products appeared in 1982 with the compact disc, where two interleaved Reed–Solomon codes are used. Today, Reed–Solomon codes are widely implemented in digital storage devices and digital communication standards, though they are being slowly replaced by more modern low-density parity-check (LDPC) codes or turbo codes. For example, Reed–Solomon codes are used in the Digital Video Broadcasting (DVB) standard DVB-S, but LDPC codes are used in its successor, DVB-S2.\nReed–Solomon coding is very widely used in mass storage systems to correct the burst errors associated with media defects.\nReed–Solomon coding is a key component of the compact disc. It was the first use of strong error correction coding in a mass-produced consumer product, and DAT and DVD use similar schemes. In the CD, two layers of Reed–Solomon coding separated by a 28-way convolutional interleaver yields a scheme called Cross-Interleaved Reed–Solomon Coding (CIRC). The first element of a CIRC decoder is a relatively weak inner (32,28) Reed–Solomon code, shortened from a (255,251) code with 8-bit symbols. This code can correct up to 2 byte errors per 32-byte block. More importantly, it flags as erasures any uncorrectable blocks, i.e., blocks with more than 2 byte errors. The decoded 28-byte blocks, with erasure indications, are then spread by the deinterleaver to different blocks of the (28,24) outer code. Thanks to the deinterleaving, an erased 28-byte block from the inner code becomes a single erased byte in each of 28 outer code blocks. The outer code easily corrects this, since it can handle up to 4 such erasures per block.\nThe result is a CIRC that can completely correct error bursts up to 4000 bits, or about 2.5 mm on the disc surface. This code is so strong that most CD playback errors are almost certainly caused by tracking errors that cause the laser to jump track, not by uncorrectable error bursts.[5]\nDVDs use a similar scheme, but with much larger blocks, a (208,192) inner code, and a (182,172) outer code.\nReed–Solomon error correction is also used in parchive files which are commonly posted accompanying multimedia files on USENET. The Distributed online storage service Wuala (discontinued in 2015) also used to make use of Reed–Solomon when breaking up files.\nAlmost all two-dimensional bar codes such as PDF-417, MaxiCode, Datamatrix, QR Code, and Aztec Code use Reed–Solomon error correction to allow correct reading even if a portion of the bar code is damaged. When the bar code scanner cannot recognize a bar code symbol, it will treat it as an erasure.\nReed–Solomon coding is less common in one-dimensional bar codes, but is used by the PostBar symbology.\nSpecialized forms of Reed–Solomon codes, specifically Cauchy-RS and Vandermonde-RS, can be used to overcome the unreliable nature of data transmission over erasure channels. The encoding process assumes a code of RS(N, K) which results in N codewords of length N symbols each storing K symbols of data, being generated, that are then sent over an erasure channel.\nAny combination of K codewords received at the other end is enough to reconstruct all of the N codewords. The code rate is generally set to 1/2 unless the channel's erasure likelihood can be adequately modelled and is seen to be less. In conclusion, N is usually 2K, meaning that at least half of all the codewords sent must be received in order to reconstruct all of the codewords sent.\nReed–Solomon codes are also used in xDSL systems and CCSDS's Space Communications Protocol Specifications as a form of forward error correction.\nOne significant application of Reed–Solomon coding was to encode the digital pictures sent back by the Voyager space probe.\nVoyager introduced Reed–Solomon coding concatenated with convolutional codes, a practice that has since become very widespread in deep space and satellite (e.g., direct digital broadcasting) communications.\nViterbi decoders tend to produce errors in short bursts. Correcting these burst errors is a job best done by short or simplified Reed–Solomon codes.\nModern versions of concatenated Reed–Solomon/Viterbi-decoded convolutional coding were and are used on the Mars Pathfinder, Galileo, Mars Exploration Rover and Cassini missions, where they perform within about 1–1.5 dB of the ultimate limit, being the Shannon capacity.\nThese concatenated codes are now being replaced by more powerful turbo codes.\nThe Reed–Solomon code is actually a family of codes: For every choice of the three parameters k < n ≤ q, there is a Reed–Solomon code that has an alphabet of size q, a block length n, and a message length k. Moreover, the alphabet is interpreted as the finite field of order q, and thus, q has to be a prime power. In the most useful parameterizations of the Reed–Solomon code, the block length is usually some constant multiple of the message length, that is, the rate R = k/n is some constant, and furthermore, the block length is equal to or one less than the alphabet size, that is, n = q or n = q − 1.\nThere are different encoding procedures for the Reed–Solomon code, and thus, there are different ways to describe the set of all codewords. In the original view of Reed & Solomon (1960), every codeword of the Reed–Solomon code is a sequence of function values of a polynomial of degree less than k. One issue with this view is that decoding and checking for errors is not practical except for the simplest of cases. In order to obtain a codeword of the Reed–Solomon code, the message is interpreted as the description of a polynomial p of degree less than k over the finite field F with q elements. In turn, the polynomial p is evaluated at n distinct points \n\n\n\n\na\n\n1\n\n\n,\n…\n,\n\na\n\nn\n\n\n\n\n{\\displaystyle a_{1},\\dots ,a_{n}}\n\n of the field F, and the sequence of values is the corresponding codeword. Formally, the set \n\n\n\n\nC\n\n\n\n{\\displaystyle \\mathbf {C} }\n\n of codewords of the Reed–Solomon code is defined as follows:\nSince any two distinct polynomials of degree less than \n\n\n\nk\n\n\n{\\displaystyle k}\n\n agree in at most \n\n\n\nk\n−\n1\n\n\n{\\displaystyle k-1}\n\n points, this means that any two codewords of the Reed–Solomon code disagree in at least \n\n\n\nn\n−\n(\nk\n−\n1\n)\n=\nn\n−\nk\n+\n1\n\n\n{\\displaystyle n-(k-1)=n-k+1}\n\n positions. Furthermore, there are two polynomials that do agree in \n\n\n\nk\n−\n1\n\n\n{\\displaystyle k-1}\n\n points but are not equal, and thus, the distance of the Reed–Solomon code is exactly \n\n\n\nd\n=\nn\n−\nk\n+\n1\n\n\n{\\displaystyle d=n-k+1}\n\n. Then the relative distance is \n\n\n\nδ\n=\nd\n\n/\n\nn\n=\n1\n−\nk\n\n/\n\nn\n+\n1\n\n/\n\nn\n∼\n1\n−\nR\n\n\n{\\displaystyle \\delta =d/n=1-k/n+1/n\\sim 1-R}\n\n, where \n\n\n\nR\n=\nk\n\n/\n\nn\n\n\n{\\displaystyle R=k/n}\n\n is the rate. This trade-off between the relative distance and the rate is asymptotically optimal since, by the Singleton bound, every code satisfies \n\n\n\nδ\n+\nR\n≤\n1\n\n\n{\\displaystyle \\delta +R\\leq 1}\n\n. Being a code that achieves this optimal trade-off, the Reed–Solomon code belongs to the class of maximum distance separable codes.\nWhile the number of different polynomials of degree less than k and the number of different messages are both equal to \n\n\n\n\nq\n\nk\n\n\n\n\n{\\displaystyle q^{k}}\n\n, and thus every message can be uniquely mapped to such a polynomial, there are different ways of doing this encoding. The original construction of Reed & Solomon (1960) interprets the message x as the coefficients of the polynomial p, whereas subsequent constructions interpret the message as the values of the polynomial at the first k points \n\n\n\n\na\n\n1\n\n\n,\n…\n,\n\na\n\nk\n\n\n\n\n{\\displaystyle a_{1},\\dots ,a_{k}}\n\n and obtain the polynomial p by interpolating these values with a polynomial of degree less than k. The latter encoding procedure, while being slightly less efficient, has the advantage that it gives rise to a systematic code, that is, the original message is always contained as a subsequence of the codeword.\nIn many contexts it is convenient to choose the sequence \n\n\n\n\na\n\n1\n\n\n,\n…\n,\n\na\n\nn\n\n\n\n\n{\\displaystyle a_{1},\\dots ,a_{n}}\n\n of evaluation points so that they exhibit some additional structure. In particular, it is useful to choose the sequence of successive powers of a primitive root \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n of the field \n\n\n\nF\n\n\n{\\displaystyle F}\n\n, that is, \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n is generator of the finite field's multiplicative group and the sequence is defined as \n\n\n\n\na\n\ni\n\n\n=\n\nα\n\ni\n\n\n\n\n{\\displaystyle a_{i}=\\alpha ^{i}}\n\n for all \n\n\n\ni\n=\n1\n,\n…\n,\nq\n−\n1\n\n\n{\\displaystyle i=1,\\dots ,q-1}\n\n. This sequence contains all elements of \n\n\n\nF\n\n\n{\\displaystyle F}\n\n except for \n\n\n\n0\n\n\n{\\displaystyle 0}\n\n, so in this setting, the block length is \n\n\n\nn\n=\nq\n−\n1\n\n\n{\\displaystyle n=q-1}\n\n. Then it follows that, whenever \n\n\n\np\n(\na\n)\n\n\n{\\displaystyle p(a)}\n\n is a polynomial over \n\n\n\nF\n\n\n{\\displaystyle F}\n\n, then the function \n\n\n\np\n(\nα\na\n)\n\n\n{\\displaystyle p(\\alpha a)}\n\n is also a polynomial of the same degree, which gives rise to a codeword that is a cyclic left-shift of the codeword derived from \n\n\n\np\n(\na\n)\n\n\n{\\displaystyle p(a)}\n\n; thus, this construction of Reed–Solomon codes gives rise to a cyclic code.\nIn the original construction of Reed & Solomon (1960), the message \n\n\n\nx\n=\n(\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nk\n\n\n)\n∈\n\nF\n\nk\n\n\n\n\n{\\displaystyle x=(x_{1},\\dots ,x_{k})\\in F^{k}}\n\n is mapped to the polynomial \n\n\n\n\np\n\nx\n\n\n\n\n{\\displaystyle p_{x}}\n\n with\nAs described above, the codeword is then obtained by evaluating \n\n\n\np\n\n\n{\\displaystyle p}\n\n at \n\n\n\nn\n\n\n{\\displaystyle n}\n\n different points \n\n\n\n\na\n\n1\n\n\n,\n…\n,\n\na\n\nn\n\n\n\n\n{\\displaystyle a_{1},\\dots ,a_{n}}\n\n of the field \n\n\n\nF\n\n\n{\\displaystyle F}\n\n. Thus the classical encoding function \n\n\n\nC\n:\n\nF\n\nk\n\n\n→\n\nF\n\nn\n\n\n\n\n{\\displaystyle C:F^{k}\\to F^{n}}\n\n for the Reed–Solomon code is defined as follows:\nThis function \n\n\n\nC\n\n\n{\\displaystyle C}\n\n is a linear mapping, that is, it satisfies \n\n\n\nC\n(\nx\n)\n=\nx\n⋅\nA\n\n\n{\\displaystyle C(x)=x\\cdot A}\n\n for the following \n\n\n\n(\nk\n×\nn\n)\n\n\n{\\displaystyle (k\\times n)}\n\n-matrix \n\n\n\nA\n\n\n{\\displaystyle A}\n\n with elements from \n\n\n\nF\n\n\n{\\displaystyle F}\n\n:\nThis matrix is the transpose of a Vandermonde matrix over \n\n\n\nF\n\n\n{\\displaystyle F}\n\n. In other words, the Reed–Solomon code is a linear code, and in the classical encoding procedure, its generator matrix is \n\n\n\nA\n\n\n{\\displaystyle A}\n\n.\nAs mentioned above, there is an alternative way to map codewords \n\n\n\nx\n\n\n{\\displaystyle x}\n\n to polynomials \n\n\n\n\np\n\nx\n\n\n\n\n{\\displaystyle p_{x}}\n\n. In this alternative encoding procedure, the polynomial \n\n\n\n\np\n\nx\n\n\n\n\n{\\displaystyle p_{x}}\n\n is the unique polynomial of degree less than \n\n\n\nk\n\n\n{\\displaystyle k}\n\n such that\nTo compute this polynomial \n\n\n\n\np\n\nx\n\n\n\n\n{\\displaystyle p_{x}}\n\n from \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, one can use Lagrange interpolation. Once it has been found, it is evaluated at the other points \n\n\n\n\na\n\nk\n+\n1\n\n\n,\n…\n,\n\na\n\nn\n\n\n\n\n{\\displaystyle a_{k+1},\\dots ,a_{n}}\n\n of the field. The alternative encoding function \n\n\n\nC\n:\n\nF\n\nk\n\n\n→\n\nF\n\nn\n\n\n\n\n{\\displaystyle C:F^{k}\\to F^{n}}\n\n for the Reed–Solomon code is then again just the sequence of values:\nThis time, however, the first \n\n\n\nk\n\n\n{\\displaystyle k}\n\n entries of the codeword are exactly equal to \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, so this encoding procedure gives rise to a systematic code. It can be checked that the alternative encoding function is a linear mapping as well.\nReed & Solomon (1960) described a theoretical decoder that corrected errors by finding the most popular message polynomial. The decoder only knows the set of values \n\n\n\n\na\n\n1\n\n\n\n\n{\\displaystyle a_{1}}\n\n to \n\n\n\n\na\n\nn\n\n\n\n\n{\\displaystyle a_{n}}\n\n and which encoding method was used to generate the codeword's sequence of values. The original message, the polynomial, and any errors are unknown. A decoding procedure could use a method like Lagrange interpolation on various subsets of n codeword values taken k at a time to repeatedly produce potential polynomials, until a sufficient number of matching polynomials are produced to reasonably eliminate any errors in the received codeword. Once a polynomial is determined, then any errors in the codeword can be corrected, by recalculating the corresponding codeword values. Unfortunately, in all but the simplest of cases, there are too many subsets, so the algorithm is impractical. The number of subsets is the binomial coefficient, \n\n\n\n\n\n\n\n(\n\n\nn\nk\n\n\n)\n\n\n\n=\n\n\n\nn\n!\n\n\n(\nn\n−\nk\n)\n!\nk\n!\n\n\n\n\n\n\n{\\displaystyle \\textstyle {\\binom {n}{k}}={n! \\over (n-k)!k!}}\n\n, and the number of subsets is infeasible for even modest codes. For a \n\n\n\n(\n255\n,\n249\n)\n\n\n{\\displaystyle (255,249)}\n\n code that can correct 3 errors, the naive theoretical decoder would examine 359 billion subsets. Practical decoding involved changing the view of codewords to be a sequence of coefficients as explained in the next section.\nIn this view, the sender again maps the message \n\n\n\nx\n\n\n{\\displaystyle x}\n\n to a polynomial \n\n\n\n\np\n\nx\n\n\n\n\n{\\displaystyle p_{x}}\n\n, and for this, any of the two mappings above can be used (where the message is either interpreted as the coefficients of \n\n\n\n\np\n\nx\n\n\n\n\n{\\displaystyle p_{x}}\n\n or as the initial sequence of values of \n\n\n\n\np\n\nx\n\n\n\n\n{\\displaystyle p_{x}}\n\n). Once the sender has constructed the polynomial \n\n\n\n\np\n\nx\n\n\n\n\n{\\displaystyle p_{x}}\n\n in some way, however, instead of sending the values of \n\n\n\n\np\n\nx\n\n\n\n\n{\\displaystyle p_{x}}\n\n at all points, the sender computes some related polynomial \n\n\n\ns\n\n\n{\\displaystyle s}\n\n of degree at most \n\n\n\nn\n−\n1\n\n\n{\\displaystyle n-1}\n\n for \n\n\n\nn\n=\nq\n−\n1\n\n\n{\\displaystyle n=q-1}\n\n and sends the \n\n\n\nn\n\n\n{\\displaystyle n}\n\n coefficients of that polynomial. The polynomial \n\n\n\ns\n(\na\n)\n\n\n{\\displaystyle s(a)}\n\n is constructed by multiplying the message polynomial \n\n\n\n\np\n\nx\n\n\n(\na\n)\n\n\n{\\displaystyle p_{x}(a)}\n\n, which has degree at most \n\n\n\nk\n−\n1\n\n\n{\\displaystyle k-1}\n\n, with a generator polynomial \n\n\n\ng\n(\na\n)\n\n\n{\\displaystyle g(a)}\n\n of degree \n\n\n\nn\n−\nk\n\n\n{\\displaystyle n-k}\n\n that is known to both the sender and the receiver. The generator polynomial \n\n\n\ng\n(\nx\n)\n\n\n{\\displaystyle g(x)}\n\n is defined as the polynomial whose roots are exactly \n\n\n\nα\n,\n\nα\n\n2\n\n\n,\n…\n,\n\nα\n\nn\n−\nk\n\n\n\n\n{\\displaystyle \\alpha ,\\alpha ^{2},\\dots ,\\alpha ^{n-k}}\n\n, i.e.,\nThe transmitter sends the \n\n\n\nn\n=\nq\n−\n1\n\n\n{\\displaystyle n=q-1}\n\n coefficients of \n\n\n\ns\n(\na\n)\n=\n\np\n\nx\n\n\n(\na\n)\n⋅\ng\n(\na\n)\n\n\n{\\displaystyle s(a)=p_{x}(a)\\cdot g(a)}\n\n. Thus, in the BCH view of Reed Solomon codes, the set \n\n\n\n\n\nC\n′\n\n\n\n\n{\\displaystyle \\mathbf {C'} }\n\n of codewords is defined for \n\n\n\nn\n=\nq\n−\n1\n\n\n{\\displaystyle n=q-1}\n\n as follows:[6]\nWith this definition of the codewords, it can be immediately seen that a Reed–Solomon code is a polynomial code, and in particular a BCH code. The generator polynomial \n\n\n\ng\n(\na\n)\n\n\n{\\displaystyle g(a)}\n\n is the minimal polynomial with roots \n\n\n\nα\n,\n\nα\n\n2\n\n\n,\n…\n,\n\nα\n\nn\n−\nk\n\n\n\n\n{\\displaystyle \\alpha ,\\alpha ^{2},\\ldots ,\\alpha ^{n-k}}\n\n as defined above, and the codewords are exactly the polynomials that are divisible by \n\n\n\ng\n(\na\n)\n\n\n{\\displaystyle g(a)}\n\n.\nSince Reed–Solomon codes are a special case of BCH codes, the practical decoders designed for BCH codes are applicable to Reed–Solomon codes: The receiver interprets the received word as the coefficients of a polynomial \n\n\n\nr\n(\na\n)\n\n\n{\\displaystyle r(a)}\n\n. If no error has occurred during the transmission, that is, if \n\n\n\nr\n(\na\n)\n=\ns\n(\na\n)\n\n\n{\\displaystyle r(a)=s(a)}\n\n, then the receiver can use polynomial division to determine the message polynomial \n\n\n\n\np\n\nx\n\n\n(\na\n)\n=\nr\n(\na\n)\n\n/\n\ng\n(\na\n)\n\n\n{\\displaystyle p_{x}(a)=r(a)/g(a)}\n\n. In general, the receiver can use polynomial division to construct the unique polynomials \n\n\n\np\n(\na\n)\n\n\n{\\displaystyle p(a)}\n\n and \n\n\n\ne\n(\na\n)\n\n\n{\\displaystyle e(a)}\n\n, such that \n\n\n\ne\n(\na\n)\n\n\n{\\displaystyle e(a)}\n\n has degree less than the degree of \n\n\n\ng\n(\na\n)\n\n\n{\\displaystyle g(a)}\n\n and\nIf the remainder polynomial \n\n\n\ne\n(\na\n)\n\n\n{\\displaystyle e(a)}\n\n is not identically zero, then an error has occurred during the transmission. The receiver can evaluate \n\n\n\nr\n(\na\n)\n\n\n{\\displaystyle r(a)}\n\n at the roots of \n\n\n\ng\n(\na\n)\n\n\n{\\displaystyle g(a)}\n\n and build a system of equations that eliminates \n\n\n\ns\n(\na\n)\n\n\n{\\displaystyle s(a)}\n\n and identifies which coefficients of \n\n\n\nr\n(\na\n)\n\n\n{\\displaystyle r(a)}\n\n are in error, and the magnitude of each coefficient's error. If the system of equations can be solved, then the receiver knows how to modify the received word \n\n\n\nr\n(\na\n)\n\n\n{\\displaystyle r(a)}\n\n to get the most likely codeword \n\n\n\ns\n(\na\n)\n\n\n{\\displaystyle s(a)}\n\n that was sent.\nThe above encoding procedure for the BCH view of Reed–Solomon codes is classical, but does not give rise to a systematic encoding procedure, i.e., the codewords do not necessarily contain the message as a subsequence.To remedy this fact, instead of sending \n\n\n\ns\n(\nx\n)\n=\np\n(\nx\n)\ng\n(\nx\n)\n\n\n{\\displaystyle s(x)=p(x)g(x)}\n\n, the encoder constructs the transmitted polynomial \n\n\n\ns\n(\nx\n)\n\n\n{\\displaystyle s(x)}\n\n such that the coefficients of the \n\n\n\nk\n\n\n{\\displaystyle k}\n\n largest monomials are equal to the corresponding coefficients of \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n, and the lower-order coefficients of \n\n\n\ns\n(\nx\n)\n\n\n{\\displaystyle s(x)}\n\n are chosen exactly in such a way that \n\n\n\ns\n(\nx\n)\n\n\n{\\displaystyle s(x)}\n\n becomes divisible by \n\n\n\ng\n(\nx\n)\n\n\n{\\displaystyle g(x)}\n\n. Then the coefficients of \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n are a subsequence of the coefficients of \n\n\n\ns\n(\nx\n)\n\n\n{\\displaystyle s(x)}\n\n. To get a code that is overall systematic, we construct the message polynomial \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n by interpreting the message as the sequence of its coefficients.\nFormally, the construction is done by multiplying \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n by \n\n\n\n\nx\n\nt\n\n\n\n\n{\\displaystyle x^{t}}\n\n to make room for the \n\n\n\nt\n=\nn\n−\nk\n\n\n{\\displaystyle t=n-k}\n\n check symbols, dividing that product by \n\n\n\ng\n(\nx\n)\n\n\n{\\displaystyle g(x)}\n\n to find the remainder, and then compensating for that remainder by subtracting it. The \n\n\n\nt\n\n\n{\\displaystyle t}\n\n check symbols are created by computing the remainder \n\n\n\n\ns\n\nr\n\n\n(\nx\n)\n\n\n{\\displaystyle s_{r}(x)}\n\n:\nNote that the remainder has degree at most \n\n\n\nt\n−\n1\n\n\n{\\displaystyle t-1}\n\n, whereas the coefficients of \n\n\n\n\nx\n\nt\n−\n1\n\n\n,\n\nx\n\nt\n−\n2\n\n\n,\n…\n,\n\nx\n\n1\n\n\n,\n\nx\n\n0\n\n\n\n\n{\\displaystyle x^{t-1},x^{t-2},\\dots ,x^{1},x^{0}}\n\n in the polynomial \n\n\n\np\n(\nx\n)\n⋅\n\nx\n\nt\n\n\n\n\n{\\displaystyle p(x)\\cdot x^{t}}\n\n are zero. Therefore, the following definition of the codeword \n\n\n\ns\n(\nx\n)\n\n\n{\\displaystyle s(x)}\n\n has the property that the first \n\n\n\nk\n\n\n{\\displaystyle k}\n\n coefficients are identical to the coefficients of \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n:\nAs a result, the codewords \n\n\n\ns\n(\nx\n)\n\n\n{\\displaystyle s(x)}\n\n are indeed elements of \n\n\n\n\n\nC\n′\n\n\n\n\n{\\displaystyle \\mathbf {C'} }\n\n, that is, they are divisible by the generator polynomial \n\n\n\ng\n(\nx\n)\n\n\n{\\displaystyle g(x)}\n\n:[7]\nAt first sight, the two views of Reed–Solomon codes above seem very different. In the first definition, codewords in the set \n\n\n\n\nC\n\n\n\n{\\displaystyle \\mathbf {C} }\n\n are values of polynomials, whereas in the second set \n\n\n\n\n\nC\n′\n\n\n\n\n{\\displaystyle \\mathbf {C'} }\n\n, they are coefficients. Moreover, the generator polynomials in the first definition are of degree less than \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, are variable, and unknown to the decoder, whereas those in the second definition are of degree \n\n\n\nn\n−\nk\n\n\n{\\displaystyle n-k}\n\n, are required to have specific roots, and are known to both encoder and decoder. Although the codewords as produced by the above encoder schemes are not the same, there is a duality between the coefficients of polynomials and their values that would allow the same codeword to be considered as a set of coefficients or a set of values.\nThe equivalence of the two definitions can be proved using the discrete Fourier transform. This transform, which exists in all finite fields as well as the complex numbers, establishes a duality between the coefficients of polynomials and their values. This duality can be approximately summarized as follows: Let \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n and \n\n\n\nq\n(\nx\n)\n\n\n{\\displaystyle q(x)}\n\n be two polynomials of degree less than \n\n\n\nn\n\n\n{\\displaystyle n}\n\n. If the values of \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n are the coefficients of \n\n\n\nq\n(\nx\n)\n\n\n{\\displaystyle q(x)}\n\n, then (up to a scalar factor and reordering), the values of \n\n\n\nq\n(\nx\n)\n\n\n{\\displaystyle q(x)}\n\n are the coefficients of \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n. For this to make sense, the values must be taken at locations \n\n\n\nx\n=\n\nα\n\ni\n\n\n\n\n{\\displaystyle x=\\alpha ^{i}}\n\n, for \n\n\n\ni\n=\n0\n,\n…\n,\nn\n−\n1\n\n\n{\\displaystyle i=0,\\dots ,n-1}\n\n, where \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n is a primitive \n\n\n\nn\n\n\n{\\displaystyle n}\n\nth root of unity.\nTo be more precise, let\nand assume \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n and \n\n\n\nq\n(\nx\n)\n\n\n{\\displaystyle q(x)}\n\n are related by the discrete Fourier transform. Then the coefficients and values of \n\n\n\np\n(\nx\n)\n\n\n{\\displaystyle p(x)}\n\n and \n\n\n\nq\n(\nx\n)\n\n\n{\\displaystyle q(x)}\n\n are related as follows: for all \n\n\n\ni\n=\n0\n,\n…\n,\nn\n−\n1\n\n\n{\\displaystyle i=0,\\dots ,n-1}\n\n, \n\n\n\n\nf\n\ni\n\n\n=\np\n(\n\nα\n\ni\n\n\n)\n\n\n{\\displaystyle f_{i}=p(\\alpha ^{i})}\n\n and \n\n\n\n\n\nv\n\ni\n\n\n=\n\n\n1\nn\n\n\nq\n(\n\nα\n\nn\n−\ni\n\n\n)\n\n\n\n{\\displaystyle \\textstyle v_{i}={\\frac {1}{n}}q(\\alpha ^{n-i})}\n\n or in the case of a binary field where addition is effectively xor, \n\n\n\n\nv\n\ni\n\n\n=\nq\n(\n\nα\n\nn\n−\ni\n\n\n)\n\n\n{\\displaystyle v_{i}=q(\\alpha ^{n-i})}\n\n.\nUsing these facts, we have: \n\n\n\n(\n\nf\n\n0\n\n\n,\n…\n,\n\nf\n\nn\n−\n1\n\n\n)\n\n\n{\\displaystyle (f_{0},\\ldots ,f_{n-1})}\n\n is a code word of the Reed–Solomon code according to the first definition\nThis shows that the two definitions are equivalent. However, the practical decoders described below require a generator polynomial known to the decoder, and view a codeword as a set of coefficients.\nDesigners are not required to use the \"natural\" sizes of Reed–Solomon code blocks. A technique known as \"shortening\" can produce a smaller code of any desired size from a larger code. For example, the widely used (255,223) code can be converted to a (160,128) code by padding the unused portion of the source block with 95 binary zeroes and not transmitting them. At the decoder, the same portion of the block is loaded locally with binary zeroes. The Delsarte-Goethals-Seidel[8] theorem illustrates an example of an application of shortened Reed–Solomon codes. In parallel to shortening, a technique known as puncturing allows omitting some of the encoded parity symbols.\nThe Reed–Solomon code is a [n, k, n − k + 1] code; in other words, it is a linear block code of length n (over F) with dimension k and minimum Hamming distance n − k + 1. The Reed–Solomon code is optimal in the sense that the minimum distance has the maximum value possible for a linear code of size (n, k); this is known as the Singleton bound. Such a code is also called a maximum distance separable (MDS) code.\nThe error-correcting ability of a Reed–Solomon code is determined by its minimum distance, or equivalently, by \n\n\n\nn\n−\nk\n\n\n{\\displaystyle n-k}\n\n, the measure of redundancy in the block. If the locations of the error symbols are not known in advance, then a Reed–Solomon code can correct up to \n\n\n\n(\nn\n−\nk\n)\n\n/\n\n2\n\n\n{\\displaystyle (n-k)/2}\n\n erroneous symbols, i.e., it can correct half as many errors as there are redundant symbols added to the block. Sometimes error locations are known in advance (e.g., \"side information\" in demodulator signal-to-noise ratios)—these are called erasures. A Reed–Solomon code (like any MDS code) is able to correct twice as many erasures as errors, and any combination of errors and erasures can be corrected as long as the relation 2E + S ≤ n − k is satisfied, where \n\n\n\nE\n\n\n{\\displaystyle E}\n\n is the number of errors and \n\n\n\nS\n\n\n{\\displaystyle S}\n\n is the number of erasures in the block.\nFor practical uses of Reed–Solomon codes, it is common to use a finite field \n\n\n\nF\n\n\n{\\displaystyle F}\n\n with \n\n\n\n\n2\n\nm\n\n\n\n\n{\\displaystyle 2^{m}}\n\n elements. In this case, each symbol can be represented as an \n\n\n\nm\n\n\n{\\displaystyle m}\n\n-bit value. The sender sends the data points as encoded blocks, and the number of symbols in the encoded block is \n\n\n\nn\n=\n\n2\n\nm\n\n\n−\n1\n\n\n{\\displaystyle n=2^{m}-1}\n\n. Thus a Reed–Solomon code operating on 8-bit symbols has \n\n\n\nn\n=\n\n2\n\n8\n\n\n−\n1\n=\n255\n\n\n{\\displaystyle n=2^{8}-1=255}\n\n symbols per block. (This is a very popular value because of the prevalence of byte-oriented computer systems.) The number \n\n\n\nk\n\n\n{\\displaystyle k}\n\n, with \n\n\n\nk\n<\nn\n\n\n{\\displaystyle k<n}\n\n, of data symbols in the block is a design parameter. A commonly used code encodes \n\n\n\nk\n=\n223\n\n\n{\\displaystyle k=223}\n\n eight-bit data symbols plus 32 eight-bit parity symbols in an \n\n\n\nn\n=\n255\n\n\n{\\displaystyle n=255}\n\n-symbol block; this is denoted as a \n\n\n\n(\nn\n,\nk\n)\n=\n(\n255\n,\n223\n)\n\n\n{\\displaystyle (n,k)=(255,223)}\n\n code, and is capable of correcting up to 16 symbol errors per block.\nThe Reed–Solomon code properties discussed above make them especially well-suited to applications where errors occur in bursts. This is because it does not matter to the code how many bits in a symbol are in error — if multiple bits in a symbol are corrupted it only counts as a single error. Conversely, if a data stream is not characterized by error bursts or drop-outs but by random single bit errors, a Reed–Solomon code is usually a poor choice compared to a binary code.\nThe Reed–Solomon code, like the convolutional code, is a transparent code. This means that if the channel symbols have been inverted somewhere along the line, the decoders will still operate. The result will be the inversion of the original data. However, the Reed–Solomon code loses its transparency when the code is shortened. The \"missing\" bits in a shortened code need to be filled by either zeros or ones, depending on whether the data is complemented or not. (To put it another way, if the symbols are inverted, then the zero-fill needs to be inverted to a one-fill.) For this reason it is mandatory that the sense of the data (i.e., true or complemented) be resolved before Reed–Solomon decoding.\nThe decoders described below use the BCH view of the codeword as sequence of coefficients.\nDaniel Gorenstein and Neal Zierler developed a practical decoder that was described in a MIT Lincoln Laboratory report by Zierler in January 1960 and later in a paper in June 1961.[9] The Gorenstein-Zierler decoder and the related work on BCH codes are described in a book Error Correcting Codes by W. Wesley Peterson (1961).[10]\nThe transmitted message is viewed as the coefficients of a polynomial s(x) that is divisible by a generator polynomial g(x).\nwhere α is a primitive root.\nSince s(x) is divisible by generator g(x), it follows that\nThe transmitted polynomial is corrupted in transit by an error polynomial e(x) to produce the received polynomial r(x).\nwhere ei is the coefficient for the i-th power of x. Coefficient ei will be zero if there is no error at that power of x and nonzero if there is an error. If there are ν errors at distinct powers ik of x, then\nThe goal of the decoder is to find the number of errors (ν), the positions of the errors (ik), and the error values at those positions (eik). From those, e(x) can be calculated and subtracted from r(x) to get the original message s(x).\nThe syndromes Sj are defined as\nThe advantage of looking at the syndromes is that the message polynomial drops out. Another possible way of calculating e(x) is using polynomial interpolation to find the only polynomial that passes through the points \n\n\n\n(\n\nα\n\nj\n\n\n,\n\nS\n\nj\n\n\n)\n\n\n{\\displaystyle (\\alpha ^{j},S_{j})}\n\n (Because \n\n\n\n\nS\n\nj\n\n\n=\ne\n(\n\nα\n\nj\n\n\n)\n\n\n{\\displaystyle S_{j}=e(\\alpha ^{j})}\n\n), however, this is not used widely because polynomial interpolation is not always feasible in the fields used in Reed–Solomon error correction. For example, it is feasible over the integers (of course), but it is infeasible over the integers modulo a prime[citation needed].\nFor convenience, define the error locators Xk and error values Yk as:\nThen the syndromes can be written in terms of the error locators and error values as\nThe syndromes give a system of n − k ≥ 2ν equations in 2ν unknowns, but that system of equations is nonlinear in the Xk and does not have an obvious solution. However, if the Xk were known (see below), then the syndrome equations provide a linear system of equations that can easily be solved for the Yk error values.\nConsequently, the problem is finding the Xk, because then the leftmost matrix would be known, and both sides of the equation could be multiplied by its inverse, yielding Yk\nThere is a linear recurrence relation that gives rise to a system of linear equations. Solving those equations identifies the error locations.\nDefine the error locator polynomial Λ(x) as\nThe zeros of Λ(x) are the reciprocals \n\n\n\n\nX\n\nk\n\n\n−\n1\n\n\n\n\n{\\displaystyle X_{k}^{-1}}\n\n:\nMultiply both sides by \n\n\n\n\nY\n\nk\n\n\n\nX\n\nk\n\n\nj\n+\nν\n\n\n\n\n{\\displaystyle Y_{k}X_{k}^{j+\\nu }}\n\n and it will still be zero. j is any number such that 1≤j≤v.\nSum for k = 1 to ν\nThis reduces to\nThis yields a system of linear equations that can be solved for the coefficients Λi of the error location polynomial:\nThe above assumes the decoder knows the number of errors ν, but that number has not been determined yet. The PGZ decoder does not determine ν directly but rather searches for it by trying successive values. The decoder first assumes the largest value for a trial ν and sets up the linear system for that value. If the equations can be solved (i.e., the matrix determinant is nonzero), then that trial value is the number of errors. If the linear system cannot be solved, then the trial ν is reduced by one and the next smaller system is examined. (Gill n.d., p. 35)\nUse the coefficients Λi found in the last step to build the error location polynomial. The roots of the error location polynomial can be found by exhaustive search. The error locators are the reciprocals of those roots. Chien search is an efficient implementation of this step.\nCalculate ik by taking the log base a of Xk. This is generally done using a precomputed lookup table.\nOnce the error locators are known, the error values can be determined. This can be done by direct solution for Yk in the error equations given above, or using the Forney algorithm.\nFinally, e(x) is generated from ik and eik and then is subtracted from r(x) to get the sent message s(x).\nThe Berlekamp–Massey algorithm is an alternate iterative procedure for finding the error locator polynomial. During each iteration, it calculates a discrepancy based on a current instance of Λ(x) with an assumed number of errors e:\nand then adjusts Λ(x) and e so that a recalculated Δ would be zero. The article Berlekamp–Massey algorithm has a detailed description of the procedure. In the following example, C(x) is used to represent Λ(x).\nConsider the Reed–Solomon code defined in GF(929) with α = 3 and t = 4 (this is used in PDF417 barcodes). The generator polynomial is\nIf the message polynomial is p(x) = 3 x2 + 2 x + 1, then the codeword is calculated as follows.\nErrors in transmission might cause this to be received instead.\nThe syndromes are calculated by evaluating r at powers of α.\nTo correct the errors, first use the Berlekamp–Massey algorithm to calculate the error locator polynomial.\nThe final value of C is the error locator polynomial, Λ(x). The zeros can be found by trial substitution. They are x1 = 757 = 3−3 and x2 = 562 = 3−4, corresponding to the error locations. To calculate the error values, apply the Forney algorithm.\nSubtracting e1x3 and e2x4 from the received polynomial r reproduces the original codeword s.\nAnother iterative method for calculating both the error locator polynomial and the error value polynomial is based on Sugiyama's adaptation of the Extended Euclidean algorithm .\nDefine S(x), Λ(x), and Ω(x) for t syndromes and e errors:\nThe key equation is:\nFor t = 6 and e = 3:\nThe middle terms are zero due to the relationship between Λ and syndromes.\nThe extended Euclidean algorithm can find a series of polynomials of the form\nAi(x) S(x) + Bi(x) xt = Ri(x)\nwhere the degree of R decreases as i increases. Once the degree of Ri(x) < t/2, then\nAi(x) = Λ(x)\nBi(x) = -Q(x)\nRi(x) = Ω(x).\nB(x) and Q(x) don't need to be saved, so the algorithm becomes:\nto set low order term of Λ(x) to 1, divide Λ(x) and Ω(x) by Ai(0):\nAi(0) is the constant (low order) term of Ai.\nUsing the same data as the Berlekamp Massey example above:\nA discrete Fourier transform can be used for decoding.[11] To avoid conflict with syndrome names, let c(x) = s(x) the encoded codeword. r(x) and e(x) are the same as above. Define C(x), E(x), and R(x) as the discrete Fourier transforms of c(x), e(x), and r(x). Since r(x) = c(x) + e(x), and since a discrete Fourier transform is a linear operator, R(x) = C(x) + E(x).\nTransform r(x) to R(x) using discrete Fourier transform. Since the calculation for a discrete Fourier transform is the same as the calculation for syndromes, t coefficients of R(x) and E(x) are the same as the syndromes:\nUse \n\n\n\n\nR\n\n1\n\n\n\n\n{\\displaystyle R_{1}}\n\n through \n\n\n\n\nR\n\nt\n\n\n\n\n{\\displaystyle R_{t}}\n\n as syndromes (they're the same) and generate the error locator polynomial using the methods from any of the above decoders.\nLet v = number of errors. Generate E(x) using the known coefficients \n\n\n\n\nE\n\n1\n\n\n\n\n{\\displaystyle E_{1}}\n\n to \n\n\n\n\nE\n\nt\n\n\n\n\n{\\displaystyle E_{t}}\n\n, the error locator polynomial, and these formulas\nThen calculate C(x) = R(x) - E(x) and take the inverse transform of C(x) to produce c(x).\nThe Singleton bound states that the minimum distance d of a linear block code of size (n,k) is upper-bounded by n − k + 1. The distance d was usually understood to limit the error-correction capability to ⌊d/2⌋. The Reed–Solomon code achieves this bound with equality, and can thus correct up to ⌊(n − k + 1)/2⌋ errors. However, this error-correction bound is not exact.\nIn 1999, Madhu Sudan and Venkatesan Guruswami at MIT published \"Improved Decoding of Reed–Solomon and Algebraic-Geometry Codes\" introducing an algorithm that allowed for the correction of errors beyond half the minimum distance of the code.[12] It applies to Reed–Solomon codes and more generally to algebraic geometric codes. This algorithm produces a list of codewords (it is a list-decoding algorithm) and is based on interpolation and factorization of polynomials over \n\n\n\nG\nF\n(\n\n2\n\nm\n\n\n)\n\n\n{\\displaystyle GF(2^{m})}\n\n and its extensions.\nThe algebraic decoding methods described above are hard-decision methods, which means that for every symbol a hard decision is made about its value. For example, a decoder could associate with each symbol an additional value corresponding to the channel demodulator's confidence in the correctness of the symbol. The advent of LDPC and turbo codes, which employ iterated soft-decision belief propagation decoding methods to achieve error-correction performance close to the theoretical limit, has spurred interest in applying soft-decision decoding to conventional algebraic codes. In 2003, Ralf Koetter and Alexander Vardy presented a polynomial-time soft-decision algebraic list-decoding algorithm for Reed–Solomon codes, which was based upon the work by Sudan and Guruswami.[13]\nHere we present a simple Matlab implementation for an encoder.\nNow the decoding part:", 
    "dbpedia_url": "http://dbpedia.org/resource/Reed–Solomon_error_correction", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Reed–Solomon_error_correction\n"
}