{
    "about": "Remote error indication (REI) or formerly far end block error (FEBE) is an alarm signal used in synchronous optical networking (SONET). It indicates to the transmitting node that the receiver has detected a block error.[1]", 
    "name": "Remote Error Indication", 
    "classification": "Error Detection And Correction", 
    "full_text": "Remote error indication (REI) or formerly far end block error (FEBE) is an alarm signal used in synchronous optical networking (SONET). It indicates to the transmitting node that the receiver has detected a block error.[1]\nREI or FEBE errors are mostly seen on DS3 circuits, however they are known to be present on other types (SONET/T1s etc.).\nEach terminating device (router or otherwise) monitors the incoming signal for CP-bit path errors. If an error is detected on the incoming DS3, the terminating elements transmit a FEBE bit on the outgoing direction of the DS3. Network monitoring equipment located anywhere along the path then measures these FEBEs in each direction to gauge the quality of the circuit while in service.\nIf you have a DS3 running from New York to Atlanta, and there's a problem within one of the central offices in Virginia. The errors are being generated by a device in the central office, and being detected by the terminating device (a NID, M13 Mux or router). The terminating device then sends the 'FEBE' error signal outbound to alert further devices there were problems.\nSo, errors are generated on the incoming side of the loop, the device terminating that end picks up the errors, and transmits a 'FEBE errors' message on the outgoing side. This specific setup of error reporting is what causes the confusion between many technicians trying to perform repairs.\nTechnical jargon: An error detected by extracting the 4-bit FEBE field from the path status byte (G1). The legal range for the 4-bit field is between 0000 and 1000, representing zero to eight errors. Any other value is interpreted as zero errors.\nThe DS-3 M-frame uses P bits to check the line parity. The M-subframe uses C bits in a format called C-bit parity, which copies the result of the P bits at the source and checks the result at the destination. An ATM interface reports detected C-bit parity errors back to the source via a far-end block error (FEBE). ( Cisco.com all rights reserved)\nAn indication sent to a transmitting node that a flawed block has been detected at the receiving node. (DS3) A FEBE in C-bit parity is a parity violation detected at the far-end terminal and transmitted back to the near-end terminal.\nA maintenance cell indicates that an error occurred with a data block at the far end of the link. This cell then sends a message back to the near end.", 
    "dbpedia_url": "http://dbpedia.org/resource/Remote_error_indication", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Remote_error_indication\n"
}