{
    "about": "In mathematics, the resultant of two polynomials is a polynomial expression of their coefficients, which is equal to zero if and only if the polynomials have a common root (possibly in a field extension), or, equivalently, a common factor (over their field of coefficients). In some older texts, the resultant is also called eliminant.[1]", 
    "name": "Resultant", 
    "classification": "Computer Algebra", 
    "full_text": "In mathematics, the resultant of two polynomials is a polynomial expression of their coefficients, which is equal to zero if and only if the polynomials have a common root (possibly in a field extension), or, equivalently, a common factor (over their field of coefficients). In some older texts, the resultant is also called eliminant.[1]\nThe resultant is widely used in number theory, either directly or through the discriminant, which is essentially the resultant of a polynomial and its derivative. The resultant of two polynomials with rational or polynomial coefficients may be computed efficiently on a computer. It is a basic tool of computer algebra, and is a built-in function of most computer algebra systems. It is used, among others, for cylindrical algebraic decomposition, integration of rational functions and drawing of curves defined by a bivariate polynomial equation.\nThe resultant of n homogeneous polynomials in n variables or multivariate resultant, sometimes called Macaulay's resultant, is a generalization, introduced by Macaulay, of the usual resultant.[2] It is, with Gröbner bases, one of the main tools of effective elimination theory (elimination theory on computers).\n\n\nThe resultant of two univariate polynomials A and B is commonly denoted \n\n\n\nres\n⁡\n(\nA\n,\nB\n)\n\n\n{\\displaystyle \\operatorname {res} (A,B)}\n\n or \n\n\n\nRes\n⁡\n(\nA\n,\nB\n)\n.\n\n\n{\\displaystyle \\operatorname {Res} (A,B).}\n\n\nIn many applications of the resultant, the polynomials depend on several indeterminates and may be considered as univariate polynomials in one of their indeterminates, with polynomials in the other indeterminates as coefficients. In this case, the indeterminate that is selected for defining and computing the resultant is indicated as a subscript: \n\n\n\n\nres\n\nx\n\n\n⁡\n(\nA\n,\nB\n)\n\n\n{\\displaystyle \\operatorname {res} _{x}(A,B)}\n\n or \n\n\n\n\nRes\n\nx\n\n\n⁡\n(\nA\n,\nB\n)\n.\n\n\n{\\displaystyle \\operatorname {Res} _{x}(A,B).}\n\n\nThe degree of the polynomials are used in the definition of the resultant. However, a polynomial of degree d may also be considered as a polynomial of higher degree such the leading coefficients are zero. If such a higher degree is used for the resultant, it is usually indicated as a subscript or a superscript, such as \n\n\n\n\nres\n\nd\n,\ne\n\n\n⁡\n(\nA\n,\nB\n)\n\n\n{\\displaystyle \\operatorname {res} _{d,e}(A,B)}\n\n or \n\n\n\n\nres\n\nx\n\n\nd\n,\ne\n\n\n⁡\n(\nA\n,\nB\n)\n.\n\n\n{\\displaystyle \\operatorname {res} _{x}^{d,e}(A,B).}\n\n\nThe resultant of two univariate polynomials over a field or over a commutative ring is commonly defined as the determinant of their Sylvester matrix. More precisely, let\nand\nbe nonzero polynomials of respective degrees d and e. Let us denote by \n\n\n\n\n\n\nP\n\n\n\ni\n\n\n\n\n{\\displaystyle {\\mathcal {P}}_{i}}\n\n the vector space (or free module if the coefficients belong to a commutative ring) of dimension i whose elements are the polynomials of degree less than i. The map\nsuch that\nis a linear map between two spaces of the same dimension. Over the basis of the powers of x, this map is represented by a square matrix of dimension d + e, which called the Sylvester matrix of A and B (for many authors and in the article Sylvester matrix, the Sylvester matrix is defined as the transpose of this matrix; this convention is not used here, as it breaks the usual convention for writing the matrix of a linear map).\nThe resultant of A and B is thus the determinant\nwhich has e columns of ai and d columns of bj (for simplification, d = e in the displayed determinant).\nIn the case of monic polynomials over an integral domain the resultant is equal to the product\nwhere x and y run over the roots of the polynomials over an algebraically closed field containing the coefficients. For non-monic polynomials with leading coefficients a0 and b0 , respectively, the above product is multiplied by \n\n\n\n\na\n\n0\n\n\ne\n\n\n\nb\n\n0\n\n\nd\n\n\n.\n\n\n{\\displaystyle a_{0}^{e}b_{0}^{d}.}\n\n\nIn this section and its subsections, A and B are two polynomials in x of respective degrees d and e, and their resultant is denoted \n\n\n\nres\n⁡\n(\nA\n,\nB\n)\n.\n\n\n{\\displaystyle \\operatorname {res} (A,B).}\n\n\nThe preceding properties characterize the resultant. In other words, the resultant is the unique function of the coefficients of polynomials that has these properties.\nLet A and B be two polynomials of respective degrees d and e with coefficients in a commutative ring R, and \n\n\n\nφ\n:\nR\n→\nS\n\n\n{\\displaystyle \\varphi \\colon R\\to S}\n\n a ring homomorphism of R into another commutative ring S. Applying \n\n\n\nφ\n\n\n{\\displaystyle \\varphi }\n\n to the coefficients of a polynomial extends \n\n\n\nφ\n\n\n{\\displaystyle \\varphi }\n\n to a homomorphism of polynomial rings \n\n\n\nR\n[\nx\n]\n→\nS\n[\nx\n]\n\n\n{\\displaystyle R[x]\\to S[x]}\n\n, which is also denoted \n\n\n\nφ\n.\n\n\n{\\displaystyle \\varphi .}\n\n With this notation, we have:\nThese properties are easily deduced from the definition of the resultant as a determinant. They are mainly used in two situations. For computing a resultant of polynomials with integer coefficients, it is generally faster to compute it modulo several primes and to retrieve the desired resultant with Chinese remainder theorem. When R is a polynomial ring in other indeterminates, and S is the ring obtained by specializing to numerical values some or all indeterminates of R, these properties may be restated as if the degrees are preserved by the specialization, the resultant of the specialization of two polynomials is the specialization of the resultant. This property is fundamental, for example, for cylindrical algebraic decomposition.\nThis means that the property of the resultant being zero is invariant under linear and projective changes of the variable\nThese properties imply that in Euclidean algorithm for polynomials, the resultant of two successive remainders differs from the resultant of the initial polynomials by a factor, which is easy to compute. Moreover, the constant a in above second formula may be chosen in order that the successive remainders have their coefficients in the ring of coefficients of input polynomials. This is the starting idea of the subresultant-pseudo-remainder-sequence algorithm for computing the greatest common divisor and the resultant of two polynomials. This algorithms works for polynomials over the integers or, more generally, over an integral domain, without any other division than exact divisions (that is without involving fractions). It involves \n\n\n\nO\n(\nd\ne\n)\n\n\n{\\displaystyle O(de)}\n\n arithmetic operations, while the computation of the determinant of the Sylvester matrix with standard algorithms require \n\n\n\nO\n(\n(\nd\n+\ne\n\n)\n\n3\n\n\n)\n\n\n{\\displaystyle O((d+e)^{3})}\n\n arithmetic operations.\nIn this section, we consider two polynomials\nand\nwhose d + e + 2 coefficients are distinct indeterminates. Let\nbe the polynomial ring over the integers defined by these indeterminates. The resultant \n\n\n\nres\n⁡\n(\nA\n,\nB\n)\n\n\n{\\displaystyle \\operatorname {res} (A,B)}\n\n is often called the generic resultant for the degrees d and e. It has the following properties.\nThe generic resultant for the degrees d and e is homogeneous in various ways. More precisely:\nLet \n\n\n\nI\n=\n⟨\nA\n,\nB\n⟩\n\n\n{\\displaystyle I=\\langle A,B\\rangle }\n\n be the ideal generated by two polynomials A and B in a polynomial ring \n\n\n\nR\n[\nx\n]\n,\n\n\n{\\displaystyle R[x],}\n\n where R is itself a polynomial ring over a field. Then:\nAn example where k > 1 in the latter property is \n\n\n\nR\n=\n\n\nR\n\n\n[\ny\n]\n,\n\n\n{\\displaystyle R={\\mathbb {R}}[y],}\n\n \n\n\n\nA\n=\n\nx\n\n2\n\n\n+\n\ny\n\n2\n\n\n−\n1\n\n\n{\\displaystyle A=x^{2}+y^{2}-1}\n\n (the unit circle), and B = y − 2. In this case, \n\n\n\n\nres\n\nx\n\n\n⁡\n(\nA\n,\nB\n)\n=\n(\ny\n−\n2\n\n)\n\n2\n\n\n\n\n{\\displaystyle \\operatorname {res} _{x}(A,B)=(y-2)^{2}}\n\n and \n\n\n\n⟨\nA\n,\nB\n⟩\n∩\nR\n=\nR\n⋅\n(\ny\n−\n2\n)\n.\n\n\n{\\displaystyle \\langle A,B\\rangle \\cap R=R\\cdot (y-2).}\n\n This example has been chosen for having a prime ideal \n\n\n\n⟨\nA\n,\nB\n⟩\n.\n\n\n{\\displaystyle \\langle A,B\\rangle .}\n\n For another field of coefficients and another constant term in B, one has also k > 1, but the ideal may be non-prime.\nTheoretically, the resultant could be computed by using the formula expressing it as a product of roots differences. However, as the roots may generally not be computed exactly, such an algorithm would be inefficient and numerically unstable. As the resultant is a symmetric function of the roots of each polynomial, it could also be computed by using the fundamental theorem of symmetric polynomials, but this would be highly inefficient.\nAs the resultant is the determinant of the Sylvester matrix (and of the Bézout matrix), it may be computed by using any algorithm for computing determinants. This needs \n\n\n\nO\n(\n\nn\n\n3\n\n\n)\n\n\n{\\displaystyle O(n^{3})}\n\n arithmetic operations. As one knows algorithms with a better complexity (see below), this method is not used in practice.\nIt follows from § Invariance under change of polynomials that the computation of a resultant is strongly related with Euclidean algorithm for polynomials. This shows that the computation of the resultant of two polynomials of degrees d and e may be done in \n\n\n\nO\n(\nd\ne\n)\n\n\n{\\displaystyle O(de)}\n\n arithmetic operations in the field of coefficients.\nHowever, when the coefficients are integers, rational numbers or polynomials, these arithmetic operations imply a number of GCD computations of coefficients which is of the same order and make the algorithm inefficient. The subresultant pseudo-remainder sequences were introduced to solve this problem and avoid any fraction and any GCD computation of coefficients. A more efficient algorithm is obtained by using the good behavior of the resultant under a ring homomorphism on the coefficients: to compute a resultant of two polynomials with integer coefficients, one computes their resultants modulo sufficiently many prime numbers and then reconstructs the result with the Chinese remainder theorem.\nThe use of fast multiplication of integers and polynomials allows algorithms for resultants and greatest common divisors that have a better time complexity, which is of the order of the complexity of the multiplication, multiplied by the logarithm of the size of the input (\n\n\n\nlog\n⁡\n(\ns\n(\nd\n+\ne\n)\n)\n,\n\n\n{\\displaystyle \\log(s(d+e)),}\n\n where s is an upper bound of the number of digits of the input polynomials).\nResultants were introduced for solving systems of polynomial equations and provides the oldest proof that there exist algorithms for solving such systems. There are primarily intended for systems of two equations in two unknown, but allow also solving general systems.\nLet us consider two polynomials the system of equations\nwhere P and Q are polynomials of respective total degrees d and e. Then \n\n\n\nR\n=\n\nres\n\ny\n\n\nd\n,\ne\n\n\n⁡\n(\nP\n,\nQ\n)\n\n\n{\\displaystyle R=\\operatorname {res} _{y}^{d,e}(P,Q)}\n\n is a polynomial in x, which is generically of degree de (by properties of § Homogeneity). A value \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n of x is a root of R, if and only if, either there exist \n\n\n\nβ\n\n\n{\\displaystyle \\beta }\n\n in an algebraically closed field containing the coefficients, such that \n\n\n\nP\n(\nα\n,\nβ\n)\n=\nQ\n(\nα\n,\nβ\n)\n=\n0\n\n\n{\\displaystyle P(\\alpha ,\\beta )=Q(\\alpha ,\\beta )=0}\n\n, or \n\n\n\ndeg\n⁡\n(\nP\n(\nα\n,\ny\n)\n)\n<\nd\n\n\n{\\displaystyle \\deg(P(\\alpha ,y))<d}\n\n and \n\n\n\ndeg\n⁡\n(\nQ\n(\nα\n,\ny\n)\n)\n<\nd\n\n\n{\\displaystyle \\deg(Q(\\alpha ,y))<d}\n\n (in this case, one says that P and Q have a common root at infinity for \n\n\n\nx\n=\nα\n\n\n{\\displaystyle x=\\alpha }\n\n).\nTherefore, solving the system amounts computing the roots of R, and for each root \n\n\n\nα\n,\n\n\n{\\displaystyle \\alpha ,}\n\n computing the common root(s) of \n\n\n\nP\n(\nα\n,\ny\n)\n,\n\n\n{\\displaystyle P(\\alpha ,y),}\n\n \n\n\n\nQ\n(\nα\n,\ny\n)\n,\n\n\n{\\displaystyle Q(\\alpha ,y),}\n\n and \n\n\n\n\nres\n\nx\n\n\n⁡\n(\nP\n,\nQ\n)\n.\n\n\n{\\displaystyle \\operatorname {res} _{x}(P,Q).}\n\n\nIt is worth to remark that Bézout's theorem results of the value of \n\n\n\ndeg\n⁡\n\n(\n\nres\n\ny\n\n\nd\n,\ne\n\n\n⁡\n(\nP\n,\nQ\n)\n)\n\n.\n\n\n{\\displaystyle \\deg \\left(\\operatorname {res} _{y}^{d,e}(P,Q)\\right).}\n\n\nAt first glance, it seems that resultants may be applied to a general polynomial system of equations\nby computing the resultants of every pair \n\n\n\n(\n\nP\n\ni\n\n\n,\n\nP\n\nj\n\n\n)\n\n\n{\\displaystyle (P_{i},P_{j})}\n\n with respect to \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n for eliminating one unknown, and repeating the process until getting univariate polynomials. Unfortunately, this introduce many spurious solutions, which are difficult to remove.\nA method, introduced at the end of 19th century, works as follows: introduce k − 1 new indeterminates \n\n\n\n\nU\n\n2\n\n\n,\n…\n,\n\nU\n\nk\n\n\n\n\n{\\displaystyle U_{2},\\ldots ,U_{k}}\n\n and compute\nThis is a polynomial in \n\n\n\n\nU\n\n2\n\n\n,\n…\n,\n\nU\n\nk\n\n\n\n\n{\\displaystyle U_{2},\\ldots ,U_{k}}\n\n whose coefficients are polynomials in \n\n\n\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nn\n−\n1\n\n\n,\n\n\n{\\displaystyle x_{1},\\ldots ,x_{n-1},}\n\n which have the property that \n\n\n\n\nα\n\n1\n\n\n,\n…\n,\n\nα\n\nn\n−\n1\n\n\n\n\n{\\displaystyle \\alpha _{1},\\ldots ,\\alpha _{n-1}}\n\n is a common zero of these polynomial coefficients, if and only if the univariate polynomials \n\n\n\n\nP\n\ni\n\n\n(\n\nα\n\n1\n\n\n,\n…\n,\n\nα\n\nn\n−\n1\n\n\n,\n\nx\n\nn\n\n\n)\n\n\n{\\displaystyle P_{i}(\\alpha _{1},\\ldots ,\\alpha _{n-1},x_{n})}\n\n have a common zero, possibly at infinity. This process may be iterated until finding univariate polynomials.\nFor getting a correct algorithm two complements have to be added to the method. Firstly, at each step, a linear change of variable may be needed in order that the degrees of the polynomials in the last variable are the same as their total degree. Secondly, if, at any step, the resultant is zero, this means that the polynomials have a common factor and that the solutions split in two components. One, were the common factor is zero, and the other which is obtained by factoring out this common factor before continuing.\nThis algorithm is very complicated and has a huge time complexity. Therefore, its interest is mainly historical.\nThe discriminant of a polynomial, which is a fundamental tool in number theory is the quotient by its leading coefficient of the resultant of the polynomial and its derivative.\nIf x and y are algebraic numbers such that \n\n\n\nP\n(\nx\n)\n=\nQ\n(\ny\n)\n=\n0\n,\n\n\n{\\displaystyle P(x)=Q(y)=0,}\n\n with degree Q of degree n), then \n\n\n\nz\n=\nx\n+\ny\n\n\n{\\displaystyle z=x+y}\n\n is a root of the resultant \n\n\n\n\nres\n\nx\n\n\n⁡\n(\nP\n(\nx\n)\n,\nQ\n(\nz\n−\nx\n)\n)\n,\n\n\n{\\displaystyle \\operatorname {res} _{x}(P(x),Q(z-x)),}\n\n and \n\n\n\nt\n=\nx\ny\n\n\n{\\displaystyle t=xy}\n\n is a root of \n\n\n\n\nres\n\nx\n\n\n⁡\n(\nP\n(\nx\n)\n,\n\nx\n\nn\n\n\nQ\n(\nt\n\n/\n\nx\n)\n)\n.\n\n\n{\\displaystyle \\operatorname {res} _{x}(P(x),x^{n}Q(t/x)).}\n\n Combined with the fact that \n\n\n\n1\n\n/\n\ny\n\n\n{\\displaystyle 1/y}\n\n is a root of \n\n\n\n\ny\n\nn\n\n\nQ\n(\n1\n\n/\n\ny\n)\n\n\n{\\displaystyle y^{n}Q(1/y)}\n\n, this shows that the set of algebraic numbers is a field.\nLet \n\n\n\nK\n(\nα\n)\n\n\n{\\displaystyle K(\\alpha )}\n\n be an algebraic field extension generated by an element \n\n\n\nα\n,\n\n\n{\\displaystyle \\alpha ,}\n\n which has \n\n\n\nP\n(\nx\n)\n\n\n{\\displaystyle P(x)}\n\n as minimal polynomial. Every element of \n\n\n\nβ\n∈\nK\n(\nα\n)\n\n\n{\\displaystyle \\beta \\in K(\\alpha )}\n\n may be written as \n\n\n\nβ\n=\nQ\n(\nα\n)\n,\n\n\n{\\displaystyle \\beta =Q(\\alpha ),}\n\n where Q is a polynomial. Then \n\n\n\nβ\n\n\n{\\displaystyle \\beta }\n\n is a root of \n\n\n\n\nres\n\nx\n\n\n⁡\n(\nP\n(\nx\n)\n,\nz\n−\nQ\n(\nx\n)\n)\n,\n\n\n{\\displaystyle \\operatorname {res} _{x}(P(x),z-Q(x)),}\n\n and this resultant is a power of the minimal polynomial of \n\n\n\nβ\n.\n\n\n{\\displaystyle \\beta .}\n\n\nGiven two plane algebraic curves defined as the zeros of the polynomials P(x, y) and Q(x, y), the resultant allows the computation of their intersection. More precisely, the roots of \n\n\n\n\nres\n\ny\n\n\n⁡\n(\nP\n,\nQ\n)\n\n\n{\\displaystyle \\operatorname {res} _{y}(P,Q)}\n\n are the x-coordinates of the intersection points and of the common vertical asymptotes, and the roots of \n\n\n\n\nres\n\nx\n\n\n⁡\n(\nP\n,\nQ\n)\n\n\n{\\displaystyle \\operatorname {res} _{x}(P,Q)}\n\n are the y-coordinates of the intersection points and of the common horizontal asymptotes.\nA rational plane curve may be defined by a parametric equation\nwhere P, Q and R are polynomials. An implicit equation of the curve is given by\nThe degree of this curve is the highest degree of P, Q and R, which is equal to the total degree of the resultant.\nIn symbolic integration, for computing the antiderivative of a rational fraction, one uses partial fraction decomposition for decomposing the integral into a \"rational part\", which is a sum of rational fractions whose antiprimitives are rational fractions, and a \"logarithmic part\" which is a sum of rational fractions of the form\nwhere Q is a square-free polynomial and P is a polynomial of lower degree than Q. The antiderivative of such a function involves necessarily logarithms, and generally algebraic numbers (the roots of Q). In fact, the antiderivative is\nwhere the sum runs over all complex roots of Q.\nThe number of algebraic numbers involved by this expression is generally equal to the degree of Q, but it occurs frequently that an expression with less algebraic numbers may be computed. The Lazard–Rioboo–Trager method produced an expression, where the number of algebraic numbers is minimal, without any computation with algebraic numbers.\nLet\nbe the square-free factorization of the resultant which appears on the right. Trager proved that the antiderivative is\nwhere the internal sums run over the roots of the \n\n\n\n\nS\n\ni\n\n\n\n\n{\\displaystyle S_{i}}\n\n (if \n\n\n\n\nS\n\ni\n\n\n=\n1\n)\n\n\n{\\displaystyle S_{i}=1)}\n\n the sum is zero, as being the empty sum), and \n\n\n\n\nT\n\ni\n\n\n(\nr\n,\nx\n)\n\n\n{\\displaystyle T_{i}(r,x)}\n\n is a polynomial of degree i in x. The Lazard-Rioboo contribution is the proof that \n\n\n\n\nT\n\ni\n\n\n(\nr\n,\nx\n)\n\n\n{\\displaystyle T_{i}(r,x)}\n\n is the subresultant of degree i of \n\n\n\nr\n\nQ\n′\n\n(\nx\n)\n−\nP\n(\nx\n)\n\n\n{\\displaystyle rQ'(x)-P(x)}\n\n and \n\n\n\nQ\n(\nx\n)\n.\n\n\n{\\displaystyle Q(x).}\n\n It is thus obtained for free if the resultant is computed by the subresultant pseudo-remainder sequence.\nAll preceding applications, and many others, show that the resultant is a fundamental tool in computer algebra. In fact most computer algebra systems include an efficient implementation of the computation of resultants.\nThe resultant is also defined for two homogeneous polynomial in two indeterminates. Given two homogeneous polynomials P(x, y) and Q(x, y) of respective total degrees p and q, their homogeneous resultant is the determinant of the matrix over the monomial basis of the linear map\nwhere A runs over the bivariate homogeneous polynomials of degree q − 1, and B runs over the homogeneous polynomials of degree p − 1. In other words, the homogeneous resultant of P and Q is the resultant of P(x, 1) and Q(x, 1 when they are considered as polynomials of degree p and q (their degree in x may be lower than their total degree):\n(The capitalization of \"Res\" is used here for distinguishing the two resultants, although there is no standard rule for the capitalization of the abbreviation).\nThe homogeneous resultant has essentially the same properties as the usual resultant, with essentially two differences: instead of polynomial roots, one considers zeros in the projective line, and the degree of a polynomial may not change under a ring homomorphism. That is:\nAny property of the usual resultant may similarly extended to the homogeneous resultant, and the resulting property is either very similar or simpler than the corresponding property of the usual resultant.\nMacaulay's resultant, named after Francis Sowerby Macaulay, also called the multivariate resultant, or the multipolynomial resultant,[3] is a generalization of the homogeneous resultant to n homogeneous polynomials in n indeterminates. Macaulay's resultant is a polynomial in the coefficients of these n homogeneous polynomials that vanishes if and only if the polynomials have a common non-zero solution in an algebraically closed field containing containing the coefficients, or, equivalently, if the n hyper surfaces defined by the polynomials have a common zero in the n –1 dimensional projective space. The multivariate resultant is, with Gröbner bases, one of the main tools of effective elimination theory (elimination theory on computers).\nLike the homogeneous resultant, Macaulay's may be defined with determinants, and thus behaves well under ring homomorphisms. However, it cannot be defined by a single determinant. It follows that it is easier to define it first on generic polynomials.\nA homogeneous polynomial of degree d in n variables may have up to\ncoefficients; it is said to be generic, if these coefficients are distinct indeterminates.\nLet \n\n\n\n\nP\n\n1\n\n\n,\n…\n,\n\nP\n\nn\n\n\n\n\n{\\displaystyle P_{1},\\ldots ,P_{n}}\n\n be n generic homogeneous polynomials in n indeterminates, of respective degrees \n\n\n\n\nd\n\n1\n\n\n,\n…\n,\n\nd\n\nn\n\n\n.\n\n\n{\\displaystyle d_{1},\\dots ,d_{n}.}\n\n Together, they involve\nindeterminate coefficients. Let C be the polynomial ring over the integers, in all these indeterminate coefficients. The polynomials \n\n\n\n\nP\n\n1\n\n\n,\n…\n,\n\nP\n\nn\n\n\n\n\n{\\displaystyle P_{1},\\ldots ,P_{n}}\n\n belong thus to \n\n\n\nC\n[\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nn\n\n\n]\n,\n\n\n{\\displaystyle C[x_{1},\\ldots ,x_{n}],}\n\n and their resultant (still to be defined) belongs to C.\nThe Macaulay degree is the integer \n\n\n\nD\n=\n\nd\n\n1\n\n\n+\n⋯\n+\n\nd\n\nn\n\n\n−\nn\n+\n1\n,\n\n\n{\\displaystyle D=d_{1}+\\cdots +d_{n}-n+1,}\n\n which is fundamental in Macaulay's theory. For defining the resultant, one considers the Macaulay matrix, which is the matrix over the monomial basis of the C-linear map\nin which each \n\n\n\n\nQ\n\ni\n\n\n\n\n{\\displaystyle Q_{i}}\n\n runs over the homogeneous polynomials of degree \n\n\n\nD\n−\n\nd\n\ni\n\n\n,\n\n\n{\\displaystyle D-d_{i},}\n\n and the codomain is the C-module of the homogeneous polynomials of degree D.\nIf n = 2, the Macaulay matrix is the Sylvester matrix, and is a square matrix, but this is no longer true for n > 2. Thus, instead of considering the determinant, one considers all the maximal minors, that is the determinants of the square submatrices that have as many rows as the Macaulay matrix. Macaulay proved that the C-ideal generated by these principal minors is a principal ideal, which is generated by the greatest common divisor of these minors. As one is working with polynomials with integer coefficients, this greatest common divisor is defined up its sign. The generic Macaulay resultant is the greatest common divisor which becomes 1, when, for each i, zero is substituted for all coefficients of \n\n\n\n\nP\n\ni\n\n\n,\n\n\n{\\displaystyle P_{i},}\n\n except the coefficient of \n\n\n\n\nx\n\ni\n\n\n\nd\n\ni\n\n\n\n\n,\n\n\n{\\displaystyle x_{i}^{d_{i}},}\n\n for which one is substituted.\nFrom now on, we consider that the homogeneous polynomials \n\n\n\n\nP\n\n1\n\n\n,\n…\n,\n\nP\n\nn\n\n\n,\n\n\n{\\displaystyle P_{1},\\ldots ,P_{n},}\n\n of degrees \n\n\n\n\nd\n\n1\n\n\n,\n…\n,\n\nd\n\nn\n\n\n\n\n{\\displaystyle d_{1},\\ldots ,d_{n}}\n\n have their coefficients in a field k, that is that they belong to \n\n\n\nk\n[\n\nx\n\n1\n\n\n,\n⋯\n,\n\nx\n\nn\n\n\n]\n.\n\n\n{\\displaystyle k[x_{1},\\cdots ,x_{n}].}\n\n Their resultant is defined as the element of k obtained by replacing in the generic resultant the indeterminate coefficients by the actual coefficients of the \n\n\n\n\nP\n\ni\n\n\n.\n\n\n{\\displaystyle P_{i}.}\n\n\nThe main property of the resultant is that it is zero if only if \n\n\n\n\nP\n\n1\n\n\n,\n…\n,\n\nP\n\nn\n\n\n,\n\n\n{\\displaystyle P_{1},\\ldots ,P_{n},}\n\n have a nonzero common zero in an algebraically closed extension of k.\nThe \"only if\" part of this theorem results on the last property of the preceding paragraph, and is an effective version of Projective Nullstellensatz: If the resultant is nonzerozero, then\nwhere \n\n\n\nD\n=\n\nd\n\n1\n\n\n+\n⋯\n+\n\nd\n\nn\n\n\n−\nn\n+\n1\n\n\n{\\displaystyle D=d_{1}+\\cdots +d_{n}-n+1}\n\n is the Macaulay degree, and \n\n\n\n⟨\n\nx\n\n1\n\n\n,\n…\n\nx\n\nn\n\n\n⟩\n\n\n{\\displaystyle \\langle x_{1},\\ldots x_{n}\\rangle }\n\n is the maximal homogeneous ideal. This implies that any common zero of \n\n\n\n\nP\n\n1\n\n\n,\n…\n,\n\nP\n\nn\n\n\n\n\n{\\displaystyle P_{1},\\ldots ,P_{n}}\n\n is a common zero of \n\n\n\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nn\n\n\n.\n\n\n{\\displaystyle x_{1},\\ldots ,x_{n}.}\n\n\nAs the computation of a resultant may reduced to computing determinants and polynomial greatest common divisors, there are algorithms for computing resultants in a finite number of steps.\nHowever, the generic resultant is a polynomial of very high degree (exponential in n) depending on a huge number of indeterminates. It follows that, except for very small n and very small degrees of input polynomials, the generic resultant is, in practice, impossible to compute, even with modern computers. Moreover, the number of monomials of the generic resultant is so high, that, if it would be computable, the result could not be stored on available memory devices, even for rather small values of n and of the degrees of the input polynomials.\nTherefore, computing the resultant makes sense only for polynomials whose coefficients belong to a field or are polynomials in few indeterminates over a field.\nIn the case of input polynomials with coefficients in a field, the exact value of the resultant is rarely important, only its equality (or not) to zero matters. As the resultant is zero if and only if the rank of the Macaulay matrix is lower than its number of its rows, this equality to zero may by tested by applying Gaussian elimination to the Macaulay matrix. This provides a computational complexity \n\n\n\n\nd\n\nO\n(\nn\n)\n\n\n,\n\n\n{\\displaystyle d^{O(n)},}\n\n where d is the maximum degree of input polynomials.\nAnother case where the computation of the resultant may provide useful information is when the coefficients of the input polynomials are polynomials in a small number of indeterminates, often called parameters. In this case, the resultant, if not zero, defines a hypersurface in the parameter space. A point belongs to this hyper surface, if and only if there are values of \n\n\n\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{1},\\ldots ,x_{n}}\n\n which, together with the coordinates of the point are a zero of the input polynomials. In other words, the resultant is the result of the \"elimination\" of \n\n\n\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{1},\\ldots ,x_{n}}\n\n from the input polynomials.\nMacaulay's resultant provides a method, called \"U-resultant\" by Macaulay, for solving systems of polynomial equations.\nGiven n − 1 homogeneous polynomials \n\n\n\n\nP\n\n1\n\n\n,\n…\n,\n\nP\n\nn\n−\n1\n\n\n,\n\n\n{\\displaystyle P_{1},\\ldots ,P_{n-1},}\n\n of degrees \n\n\n\n\nd\n\n1\n\n\n,\n…\n,\n\nd\n\nn\n−\n1\n\n\n,\n\n\n{\\displaystyle d_{1},\\ldots ,d_{n-1},}\n\n in n indeterminates \n\n\n\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nn\n\n\n,\n\n\n{\\displaystyle x_{1},\\ldots ,x_{n},}\n\n over a field k, their U-resultant is the resultant of the n polynomials \n\n\n\n\nP\n\n1\n\n\n,\n…\n,\n\nP\n\nn\n−\n1\n\n\n,\n\nP\n\nn\n\n\n,\n\n\n{\\displaystyle P_{1},\\ldots ,P_{n-1},P_{n},}\n\n where\nis the generic linear form whose coefficients are new indeterminates \n\n\n\n\nu\n\n1\n\n\n,\n…\n,\n\nu\n\nn\n\n\n.\n\n\n{\\displaystyle u_{1},\\ldots ,u_{n}.}\n\n Notation \n\n\n\n\nu\n\ni\n\n\n\n\n{\\displaystyle u_{i}}\n\n or \n\n\n\n\nU\n\ni\n\n\n\n\n{\\displaystyle U_{i}}\n\n for these generic coefficients is traditional, and is the origin of the term U-resultant.\nThe U-resultant is a homogeneous polynomial in \n\n\n\nk\n[\n\nu\n\n1\n\n\n,\n…\n,\n\nu\n\nn\n\n\n]\n.\n\n\n{\\displaystyle k[u_{1},\\ldots ,u_{n}].}\n\n It is zero if and only if the common zeros of \n\n\n\n\nP\n\n1\n\n\n,\n…\n,\n\nP\n\nn\n−\n1\n\n\n\n\n{\\displaystyle P_{1},\\ldots ,P_{n-1}}\n\n form an projective algebraic set of positive dimension (that is, there are infinitely many projective zeros over an algebraically closed extension of k). If the U-resultant is not zero, its degree is the Bézout bound \n\n\n\n\nd\n\n1\n\n\n⋯\n\nd\n\nn\n−\n1\n\n\n.\n\n\n{\\displaystyle d_{1}\\cdots d_{n-1}.}\n\n The U-resultant factorizes over an algebraically closed extension of k into a product of linear forms. If \n\n\n\n\nα\n\n1\n\n\n\nu\n\n1\n\n\n+\n…\n+\n\nα\n\nn\n\n\n\nu\n\nn\n\n\n\n\n{\\displaystyle \\alpha _{1}u_{1}+\\ldots +\\alpha _{n}u_{n}}\n\n is such a linear factor, then \n\n\n\n\nα\n\n1\n\n\n,\n…\n,\n\nα\n\nn\n\n\n\n\n{\\displaystyle \\alpha _{1},\\ldots ,\\alpha _{n}}\n\n are the homogeneous coordinates of a common zero of \n\n\n\n\nP\n\n1\n\n\n,\n…\n,\n\nP\n\nn\n−\n1\n\n\n.\n\n\n{\\displaystyle P_{1},\\ldots ,P_{n-1}.}\n\n Moreover, every common zero may be obtained from one of these linear factors, and the multiplicity as a factor is equal to the intersection multiplicity of the \n\n\n\n\nP\n\ni\n\n\n\n\n{\\displaystyle P_{i}}\n\n at this zero. In other words, the U-resultant provides a completely explicit version of Bézout's theorem.\nThe U-resultant, as defined by Macaulay was defined only for a number of homogeneous polynomials, which is one less than the number of indeterminates. In 1981, Daniel Lazard provided the following generalization to any number of polynomials, which may be computed by a single Gaussian elimination.\nLet \n\n\n\n\nP\n\n1\n\n\n,\n…\n,\n\nP\n\nk\n\n\n\n\n{\\displaystyle P_{1},\\ldots ,P_{k}}\n\n be homogeneous polynomials in \n\n\n\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nn\n\n\n,\n\n\n{\\displaystyle x_{1},\\ldots ,x_{n},}\n\n of degrees \n\n\n\n\nd\n\n1\n\n\n,\n…\n,\n\nd\n\nk\n\n\n,\n\n\n{\\displaystyle d_{1},\\ldots ,d_{k},}\n\n over a field k. Without generality, one may suppose that \n\n\n\n\nd\n\n2\n\n\n≥\n\nd\n\n3\n\n\n≥\n⋯\n≥\n\nd\n\nk\n\n\n≥\n\nd\n\n1\n\n\n.\n\n\n{\\displaystyle d_{2}\\geq d_{3}\\geq \\cdots \\geq d_{k}\\geq d_{1}.}\n\n Setting \n\n\n\n\nd\n\ni\n\n\n=\n1\n\n\n{\\displaystyle d_{i}=1}\n\n for i > k, the Macaulay bound is \n\n\n\nD\n=\n\nd\n\n1\n\n\n+\n⋯\n+\n\nd\n\nn\n\n\n−\nn\n+\n1.\n\n\n{\\displaystyle D=d_{1}+\\cdots +d_{n}-n+1.}\n\n\nLet \n\n\n\n\nu\n\n1\n\n\n,\n…\n,\n\nu\n\nn\n\n\n\n\n{\\displaystyle u_{1},\\ldots ,u_{n}}\n\n be new indeterninates, and \n\n\n\n\nP\n\nk\n+\n1\n\n\n=\n\nu\n\n1\n\n\n\nx\n\n1\n\n\n+\n⋯\n+\n\nu\n\nn\n\n\n\nx\n\nn\n\n\n.\n\n\n{\\displaystyle P_{k+1}=u_{1}x_{1}+\\cdots +u_{n}x_{n}.}\n\n In this case, the Macaulay matrix is the matrix, over the basis of the monomials in \n\n\n\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nn\n\n\n,\n\n\n{\\displaystyle x_{1},\\ldots ,x_{n},}\n\n of the linear map\nwhere, for each i, \n\n\n\n\nQ\n\ni\n\n\n\n\n{\\displaystyle Q_{i}}\n\n runs over the homogeneous polynomials of degree \n\n\n\nD\n−\n\nd\n\ni\n\n\n.\n\n\n{\\displaystyle D-d_{i}.}\n\n\nGaussian elimination over k of the Macaulay matrix, provides, after removing zero rows and zero columns, either an empty matrix or a block diagonal square matrix. The result is the empty matrix if and only if \n\n\n\n\nP\n\n1\n\n\n,\n…\n,\n\nP\n\nk\n\n\n\n\n{\\displaystyle P_{1},\\ldots ,P_{k}}\n\n have infinitely many common projective zeros over an algebraically closed extension of k. In the other case, the block diagonal matrix consists of two blocks. One is an identity matrix, and the other is a square matrix of linear forms in \n\n\n\n\nu\n\n1\n\n\n,\n…\n,\n\nu\n\nn\n\n\n.\n\n\n{\\displaystyle u_{1},\\ldots ,u_{n}.}\n\n The U-resultant is the determinant of the latter matrix, which is equal to the determinant of the block diagonal matrix.\nAs for the original U-resultant, this U-resultant factorizes into linear factors over an algebraically closed extension of k. The coefficients of these linear factors are the homogeneous coordinates of the common zeros of \n\n\n\n\nP\n\n1\n\n\n,\n…\n,\n\nP\n\nk\n\n\n,\n\n\n{\\displaystyle P_{1},\\ldots ,P_{k},}\n\n and the multiplicity of a common zero equals the multiplicity of the corresponding linear factor.\nThe number of rows of the Macaulay matrix is less than \n\n\n\n(\ne\nd\n\n)\n\nn\n\n\n,\n\n\n{\\displaystyle (ed)^{n},}\n\n where e ~ 2.7182 is the usual mathematical constant, and d is the arithmetic mean of the degrees of the \n\n\n\n\nP\n\ni\n\n\n.\n\n\n{\\displaystyle P_{i}.}\n\n It follows that, if k is not too large (say, if k ≤ 2n), a system of polynomial equations, that has a finite number of projective zeros, may be completely solved in time \n\n\n\n\nd\n\nO\n(\nn\n)\n\n\n.\n\n\n{\\displaystyle d^{O(n)}.}\n\n\nAlthough large, this bound is almost optimal. In fact, if all input degrees are equal, this implies that the time complexity is polynomial in the expected number of solutions (Bézout's theorem).", 
    "dbpedia_url": "http://dbpedia.org/resource/Resultant", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Resultant\n"
}