{
    "about": "The return ratio of a dependent source in a linear electrical circuit is the negative of the ratio of the current (voltage) returned to the site of the dependent source to the current (voltage) of a replacement independent source. The terms loop gain and return ratio are often used interchangeably; however, they are necessarily equivalent only in the case of a single feedback loop system with unilateral blocks.[1]", 
    "name": "Return Ratio", 
    "classification": "Signal Processing", 
    "full_text": "The return ratio of a dependent source in a linear electrical circuit is the negative of the ratio of the current (voltage) returned to the site of the dependent source to the current (voltage) of a replacement independent source. The terms loop gain and return ratio are often used interchangeably; however, they are necessarily equivalent only in the case of a single feedback loop system with unilateral blocks.[1]\n\n\nThe steps for calculating the return ratio of a source are as follows:[2]\nThese steps may not be feasible when the dependent sources inside the devices are not directly accessible, for example when using built-in \"black box\" SPICE models or when measuring the return ratio experimentally. For SPICE simulations, one potential workaround is to manually replace non-linear devices by their small-signal equivalent model, with exposed dependent sources. However this will have to be redone if the bias point changes.\nA result by Rosenstark shows that return ratio can be calculated by breaking the loop at any unilateral point in the circuit. The problem is now finding how to break the loop without affecting the bias point and altering the results. Middlebrook[3] and Rosenstark[4] have proposed several methods for experimental evaluation of return ratio (loosely referred to by these authors as simply loop gain), and similar methods have been adapted for use in SPICE by Hurst.[5] See Spectrum user note or Roberts, or Sedra, and especially Tuinenga.[6][7][8]\nFigure 1 (top right) shows a bipolar amplifier with feedback bias resistor Rf driven by a Norton signal source. Figure 2 (left panel) shows the corresponding small-signal circuit obtained by replacing the transistor with its hybrid-pi model. The objective is to find the return ratio of the dependent current source in this amplifier.[9] To reach the objective, the steps outlined above are followed. Figure 2 (center panel) shows the application of these steps up to Step 4, with the dependent source moved to the left of the inserted source of value it, and the leads targeted for cutting marked with an x. Figure 2 (right panel) shows the circuit set up for calculation of the return ratio T, which is\nThe return current is\nThe feedback current in Rf is found by current division to be:\nThe base-emitter voltage vπ is then, from Ohm's law:\nConsequently,\nThe overall transresistance gain of this amplifier can be shown to be:\nwith R1 = RS || rπ and R2 = RD || rO.\nThis expression can be rewritten in the form used by the asymptotic gain model, which expresses the overall gain of a feedback amplifier in terms of several independent factors that are often more easily derived separately than the overall gain itself, and that often provide insight into the circuit. This form is:\nwhere the so-called asymptotic gain G∞ is the gain at infinite gm, namely:\nand the so-called feed forward or direct feedthrough G0 is the gain for zero gm, namely:\nFor additional applications of this method, see asymptotic gain model and Blackman's theorem.", 
    "dbpedia_url": "http://dbpedia.org/resource/Return_ratio", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Return_ratio\n"
}