{
    "about": "Reverberation mapping is an astrophysical technique for measuring the structure of the broad emission-line region (BLR) around a supermassive black hole at the center of an active galaxy and estimating the hole's mass. It is considered a \"primary\" mass estimation technique, i.e., the mass is measured directly from the motion that its gravitational force induces in the nearby gas.[1]", 
    "name": "Reverberation Mapping", 
    "classification": "Signal Processing", 
    "full_text": "Reverberation mapping is an astrophysical technique for measuring the structure of the broad emission-line region (BLR) around a supermassive black hole at the center of an active galaxy and estimating the hole's mass. It is considered a \"primary\" mass estimation technique, i.e., the mass is measured directly from the motion that its gravitational force induces in the nearby gas.[1]\nThe black hole mass is measured from the formula\nIn this formula, ΔV is the RMS velocity of gas moving near the black hole in the broad emission-line region, measured from the Doppler broadening of the gaseous emission lines; RBLR is the radius of the broad-line region; G is the constant of gravitation; and f is a poorly known \"form factor\" that depends on the shape of the BLR.\nThe biggest difficulty with applying this formula is the measurement of RBLR. One standard technique[2] is based on the fact that the emission-line fluxes vary strongly in response to changes in the continuum, i.e., the light from the accretion disk near the black hole (\"reverberation\"). Furthermore, the emission-line response is found to be delayed with respect to changes in the continuum. Assuming that the delay is due to light travel times, the size of the broad emission-line region can be measured.\nOnly a small handful of AGN (less than 40) have been accurately \"mapped\" in this way. An alternative approach is to use an empirical correlation between RBLR and the continuum luminosity.[1]\nAnother uncertainty is the value of f. In principle, the response of the BLR to variations in the continuum could be used to map out the three-dimensional structure of the BLR. In practice, the amount and quality of data required to carry out such a deconvolution is prohibitive. Until about 2004, f was estimated ab initio based on simple models for the structure of the BLR. More recently, the value of f has been determined so as to bring the M-sigma relation for active galaxies into the best possible agreement with the M–sigma relation for quiescent galaxies.[1] When f is determined in this way, reverberation mapping becomes a \"secondary\", rather than \"primary,\" mass estimation technique.", 
    "dbpedia_url": "http://dbpedia.org/resource/Reverberation_mapping", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Reverberation_mapping\n"
}