{
    "about": "In numerical analysis, Ridders' method is a root-finding algorithm based on the false position method and the use of an exponential function to successively approximate a root of a function f. The method is due to C. Ridders.[1][2]", 
    "name": "Ridders' Method", 
    "classification": "Root-Finding Algorithms", 
    "full_text": "In numerical analysis, Ridders' method is a root-finding algorithm based on the false position method and the use of an exponential function to successively approximate a root of a function f. The method is due to C. Ridders.[1][2]\nRidders' method is simpler than Muller's method or Brent's method but with similar performance.[3] The formula below converges quadratically when the function is well-behaved, which implies that the number of additional significant digits found at each step approximately doubles; but the function has to be evaluated twice for each step, so the overall order of convergence of the method is √2. If the function is not well-behaved, the root remains bracketed and the length of the bracketing interval at least halves on each iteration, so convergence is guaranteed. The algorithm also makes use of square roots, which are slower than basic floating point operations.\nPress et al. (2007) describe the method as follows. Given two values of the independent variable, x1 and x2, which are on two different sides of the root being sought, the method begins by evaluating the function at the midpoint x3 between the two points. One then finds the unique exponential function of the form eax which, when multiplied by f, transforms the function at the three points into a straight line. The false position method is then applied to the transformed values, leading to a new value x4, between x1 and x2, which can be used as one of the two bracketing values in the next step of the iteration. The other bracketing value is taken to be x3 if f(x3) has the opposite sign to f(x4), or otherwise whichever of x1 and x2 has f(x) of opposite sign to f(x4).\nThe method can be summarized by the formula (equation 9.2.4 from Press et al.)\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Ridders'_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Ridders'_method\n"
}