{
    "about": "The Robertson–Webb protocol is a protocol for envy-free cake-cutting which is also near-exact. It has the following properties:", 
    "name": "Robertson–Webb Protocol", 
    "classification": "Fair Division Protocols", 
    "full_text": "The Robertson–Webb protocol is a protocol for envy-free cake-cutting which is also near-exact. It has the following properties:\nThe protocol was developed by Jack M. Robertson and William A. Webb. It was first published in 1997[1] and later in 1998.[2]:128–133\n\n\nThe main difficulty in designing an envy-free procedure for n > 2 agents is that the problem is not \"divisible\". I.e., if we divide half of the cake among n/2 agents in an envy-free manner, we cannot just let the other n/2 agents divide the other half in the same manner, because this might cause the first group of n/2 agents to be envious (e.g., it is possible that A and B both believe they got 1/2 of their half which is 1/4 of the entire cake; C and D also believe the same way; but, A believes that C actually got the entire half while D got nothing, so A envies C).\nThe Robertson–Webb protocol addresses this difficulty by requiring that the division is not only envy-free but also near-exact. The recursive part of the protocol is the following subroutine.\nA partition of X to pieces X1, …, Xm, assigned to the m active players, such that:\nNote: the presentation here is informal and simplified. A more accurate presentation is given in the book.[2]\nUse a near-exact division procedure on X and get a partition which all n players view as ε-near-exact with weights w1, …, wm.\nLet one of the active players (e.g. A1) cut the pieces such that the division is exact for him, i.e. for every j: V1(Xj)/V1(X) = wj.\nIf all other active players agree with the cutter, then just give piece Xi to active player Ai. This division is envy-free among the active players, so we are done.\nOtherwise, there is some piece P on which there is disagreement among the active players. By cutting P to smaller pieces if necessary, we may bound the disagreement such that all players agree that: V(P)/V(X) < ε.\nSplit the active players to two camps: the \"optimists\" who think that P is more valuable, and the \"pessimists\" who think that P is less valuable. Let δ be the difference between the values, such that for every optimist i and every pessimist j: Vi(P)/Vi(X) – Vj(P)/Vj(X) > δ.\nDivide the remaining cake, X − P, into pieces Q and R, such that the division is near-exact among all n players.\nAssign P ∪ Q to the optimists. Because they believe that P is valuable, they necessarily believe that P ∪ Q is sufficiently valuable to more than cover their due share.\nAssign R to the pessimists. Because they believe that P is less valuable, they necessarily believe that the remainder, R, is sufficiently valuable to more than cover their due share.\nAt this point we have partitioned the active players to two camps, each collectively claiming complementary portions of the cake and each camp is more than satisfied with their collective portion.\nIt remains to divide each portion of the cake to the players in its camp. This is done by two recursive applications of the procedure:\nIn both applications, the near-exactness factor should be at most δ. Because the resulting partition is δ-near-exact among all n players, the partition among the optimists doesn't cause envy among the pessimists and vice versa. Thus the over-all division is both envy-free and near-exact.", 
    "dbpedia_url": "http://dbpedia.org/resource/Robertson–Webb_protocol", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Robertson–Webb_protocol\n"
}