{
    "about": "In mathematics, the Robinson–Schensted correspondence is a bijective correspondence between permutations and pairs of standard Young tableaux of the same shape. It has various descriptions, all of which are of algorithmic nature, it has many remarkable properties, and it has applications in combinatorics and other areas such as representation theory. The correspondence has been generalized in numerous ways, notably by Knuth to what is known as the Robinson–Schensted–Knuth correspondence, and a further generalization to pictures by Zelevinsky.", 
    "name": "Robinson–Schensted Correspondence", 
    "classification": "Combinatorial Algorithms", 
    "full_text": "In mathematics, the Robinson–Schensted correspondence is a bijective correspondence between permutations and pairs of standard Young tableaux of the same shape. It has various descriptions, all of which are of algorithmic nature, it has many remarkable properties, and it has applications in combinatorics and other areas such as representation theory. The correspondence has been generalized in numerous ways, notably by Knuth to what is known as the Robinson–Schensted–Knuth correspondence, and a further generalization to pictures by Zelevinsky.\nThe simplest description of the correspondence is using the Schensted algorithm (Schensted 1961), a procedure that constructs one tableau by successively inserting the values of the permutation according to a specific rule, while the other tableau records the evolution of the shape during construction. The correspondence had been described, in a rather different form, much earlier by Robinson (Robinson 1938), in an attempt to prove the Littlewood–Richardson rule. The correspondence is often referred to as the Robinson–Schensted algorithm, although the procedure used by Robinson is radically different from the Schensted–algorithm, and almost entirely forgotten. Other methods of defining the correspondence include a nondeterministic algorithm in terms of jeu de taquin.\nThe bijective nature of the correspondence relates it to the enumerative identity:\nwhere \n\n\n\n\n\n\nP\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\mathcal {P}}_{n}}\n\n denotes the set of partitions of n (or of Young diagrams with n squares), and tλ denotes the number of standard Young tableaux of shape λ.\n\n\nThe Schensted algorithm starts from the permutation σ written in two-line notation\nwhere σi = σ(i), and proceeds by constructing sequentially a sequence of (intermediate) ordered pairs of Young tableaux of the same shape:\nwhere P0 = Q0 are empty tableaux. The output tableaux are P = Pn and Q = Qn. Once Pi−1 is constructed, one forms Pi by inserting σi into Pi−1, and then Qi by adding an entry i to Qi−1 in the square added to the shape by the insertion (so that Pi and Qi have equal shapes for all i). Because of the more passive role of the tableaux Qi, the final one Qn, which is part of the output and from which the previous Qi are easily read off, is called the recording tableau; by contrast the tableaux Pi are called insertion tableaux.\nThe basic procedure used to insert each σi is called Schensted insertion or row-insertion (to distinguish it from a variant procedure called column-insertion). Its simplest form is defined in terms of \"incomplete standard tableaux\": like standard tableaux they have distinct entries, forming increasing rows and columns, but some values (still to be inserted) may be absent as entries. The procedure takes as arguments such a tableau T and a value x not present as entry of T; it produces as output a new tableau denoted T ← x and a square s by which its shape has grown. The value x appears in the first row of T ← x, either having been added at the end (if no entries larger than x were present), or otherwise replacing the first entry y > x in the first row of T. In the former case s is the square where x is added, and the insertion is completed; in the latter case the replaced entry y is similarly inserted into the second row of T, and so on, until at some step the first case applies (which certainly happens if an empty row of T is reached).\nMore formally, the following pseudocode describes the row-insertion of a new value x into T.[1]\nThe shape of T grows by exactly one square, namely s.\nThe fact that T ← x has increasing rows and columns, if the same holds for T, is not obvious from this procedure (entries in the same column are never even compared). It can however be seen as follows. At all times except immediately after step 4, the square (i, j) is either empty in T or holds a value greater than x; step 5 re-establishes this property because (i, j) now is the square immediately below the one that originally contained x in T. Thus the effect of the replacement in step 4 on the value Ti, j is to make it smaller; in particular it cannot become greater than its right or lower neighbours. On the other hand the new value is not less than its left neighbour (if present) either, as is ensured by the comparison that just made step 2 terminate. Finally to see that the new value is larger than its upper neighbour Ti−1, j if present, observe that Ti−1, j holds after step 5, and that decreasing j in step 2 only decreases the corresponding value Ti−1, j.\nThe full Schensted algorithm applied to a permutation σ proceeds as follows.\nThe algorithm produces a pair of standard Young tableaux.\nIt can be seen that given any pair (P, Q) of standard Young tableaux of the same shape, there is an inverse procedure that produces a permutation that will give rise to (P, Q) by the Schensted algorithm. It essentially consists of tracing steps of the algorithm backwards, each time using an entry of Q to find the square where the inverse insertion should start, moving the corresponding entry of P to the preceding row, and continuing upwards through the rows until an entry of the first row is replaced, which is the value inserted at the corresponding step of the construction algorithm. These two inverse algorithms define a bijective correspondence between permutations of n on one side, and pairs of standard Young tableaux of equal shape and containing n squares on the other side.\nOne of the most fundamental properties, but not evident from the algorithmic construction, is symmetry:\nThis can be proven, for instance, by appealing to Viennot's geometric construction.\nFurther properties, all assuming that the correspondence associates tableaux (P, Q) to the permutation σ = (σ1, ..., σn).", 
    "dbpedia_url": "http://dbpedia.org/resource/Robinson–Schensted_correspondence", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Robinson–Schensted_correspondence\n"
}