{
    "about": "Rocha–Thatte algorithm[1] is a distributed algorithm in graph theory for detecting cycles on large-scale directed graphs based on the bulk synchronous message passing abstraction. This algorithm for detecting cycles by message passing is suitable to be implemented in distributed graph processing systems, and it is also suitable for implementations in systems for disk-based computations, such as the GraphChi,[2] where the computation is mainly based on secondary memory. Disk-based computations are necessary when we have a single computer for processing large-scale graphs, and the computation exceeds the primary memory capacity.", 
    "name": "Rocha–Thatte Cycle Detection Algorithm", 
    "classification": "Graph Algorithms", 
    "full_text": "Rocha–Thatte algorithm[1] is a distributed algorithm in graph theory for detecting cycles on large-scale directed graphs based on the bulk synchronous message passing abstraction. This algorithm for detecting cycles by message passing is suitable to be implemented in distributed graph processing systems, and it is also suitable for implementations in systems for disk-based computations, such as the GraphChi,[2] where the computation is mainly based on secondary memory. Disk-based computations are necessary when we have a single computer for processing large-scale graphs, and the computation exceeds the primary memory capacity.\nThe Rocha–Thatte algorithm is a general algorithm for detecting cycles in a directed graph \n\n\n\nG\n\n\n{\\displaystyle G}\n\n by message passing among its vertices, based on the bulk synchronous message passing abstraction. This is a vertex-centric approach in which the vertices of the graph work together for detecting cycles. The bulk synchronous parallel model consists of a sequence of iterations, in each of which a vertex can receive messages sent by other vertices in the previous iteration, and send messages to other vertices.\nIn each pass, each active vertex of \n\n\n\nG\n\n\n{\\displaystyle G}\n\n sends a set of sequences of vertices to its out-neighbours as described next. In the first pass, each vertex \n\n\n\nv\n\n\n{\\displaystyle v}\n\n sends the message \n\n\n\n(\nv\n)\n\n\n{\\displaystyle (v)}\n\n to all its out-neighbours. In subsequent iterations, each active vertex \n\n\n\nv\n\n\n{\\displaystyle v}\n\n appends \n\n\n\nv\n\n\n{\\displaystyle v}\n\n to each sequence it received in the previous iteration. It then sends all the updated sequences to its out-neighbours. If \n\n\n\nv\n\n\n{\\displaystyle v}\n\n has not received any message in the previous iteration, then \n\n\n\nv\n\n\n{\\displaystyle v}\n\n deactivates itself. The algorithm terminates when all the vertices have been deactivated.\nFor a sequence \n\n\n\n(\n\nv\n\n1\n\n\n,\n\nv\n\n2\n\n\n,\n…\n,\n\nv\n\nk\n\n\n)\n\n\n{\\displaystyle (v_{1},v_{2},\\ldots ,v_{k})}\n\n received by vertex \n\n\n\nv\n\n\n{\\displaystyle v}\n\n, the appended sequence is not forwarded in two cases: (i) if \n\n\n\nv\n=\n\nv\n\n1\n\n\n\n\n{\\displaystyle v=v_{1}}\n\n, then \n\n\n\nv\n\n\n{\\displaystyle v}\n\n has detected a cycle, which is reported; (ii) if \n\n\n\nv\n=\n\nv\n\ni\n\n\n\n\n{\\displaystyle v=v_{i}}\n\n for some \n\n\n\ni\n∈\n\n2\n,\n3\n,\n…\n,\nk\n\n\n\n{\\displaystyle i\\in {2,3,\\ldots ,k}}\n\n, then \n\n\n\nv\n\n\n{\\displaystyle v}\n\n has detected a sequence that contains the cycle \n\n\n\n(\nv\n=\n\nv\n\ni\n\n\n,\n\nv\n\ni\n\n\n+\n1\n,\n…\n,\n\nv\n\nk\n\n\n,\n\nv\n\nk\n\n\n+\n1\n=\nv\n)\n\n\n{\\displaystyle (v=v_{i},v_{i}+1,\\ldots ,v_{k},v_{k}+1=v)}\n\n; in this case, the sequence is discarded, since the cycle must have been detected in an earlier iteration; to be precise, this cycle must have been detected in iteration \n\n\n\nk\n−\ni\n+\n1\n\n\n{\\displaystyle k-i+1}\n\n. Every cycle \n\n\n\n(\n\nv\n\n1\n\n\n,\n\nv\n\n2\n\n\n,\n…\n,\n\nv\n\nk\n\n\n,\n\nv\n\nk\n\n\n+\n1\n=\n\nv\n\n1\n\n\n)\n\n\n{\\displaystyle (v_{1},v_{2},\\ldots ,v_{k},v_{k}+1=v_{1})}\n\n is detected by all \n\n\n\n\nv\n\ni\n\n\n,\ni\n=\n1\n\n\n{\\displaystyle v_{i},i=1}\n\n to \n\n\n\nk\n\n\n{\\displaystyle k}\n\n in the same iteration; it is reported by the vertex \n\n\n\nmin\n{\n\nv\n\n1\n\n\n,\n…\n,\n\nv\n\nk\n\n\n}\n\n\n{\\displaystyle \\min\\{v_{1},\\ldots ,v_{k}\\}}\n\n.\nThe figure below presents an example of the execution of the algorithm. In iteration \n\n\n\ni\n=\n3\n\n\n{\\displaystyle i=3}\n\n, all the three vertices detect the cycle \n\n\n\n(\n2\n,\n3\n,\n4\n)\n\n\n{\\displaystyle (2,3,4)}\n\n. The algorithm ensures that the cycle is reported only once by emitting the detected cycle only from the vertex with the least identifier value in the ordered sequence, which is the vertex 2 in the example.[1]\n\nThe total number of iterations of the algorithm is the number of vertices in the longest path in the graph, plus a few more steps for deactivating the final vertices. During the analysis of the total number of iterations, we ignore the few extra iterations needed for deactivating the final vertices and detecting the end of the computation, since it is \n\n\n\nO\n(\n1\n)\n\n\n{\\displaystyle O(1)}\n\n iterations. In practice, the actual number of these final few iterations depends on the framework being used to implement the algorithm.[1]\nSimulations[3] show that the Rocha-Thatte algorithm has a smaller communication overhead than a distributed version of depth-first search, regarding both the number of messages and the total number of bits sent. Specifically, the distributed version of DFS may require up to one order of magnitude more messages exchanged than the Rocha-Thatte algorithm.", 
    "dbpedia_url": "http://dbpedia.org/resource/Rocha–Thatte_cycle_detection_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Rocha–Thatte_cycle_detection_algorithm\n"
}