{
    "about": "Named after I. Michael Ross and F. Fahroo, the Ross–Fahroo lemma is a fundamental result in optimal control theory.[1][2] [3][4] It states that dualization and discretization are, in general, non-commutative operations. The operations can be made commutative by an application of the covector mapping principle.[5]", 
    "name": "Ross–Fahroo Lemma", 
    "classification": "Numerical Analysis", 
    "full_text": "Named after I. Michael Ross and F. Fahroo, the Ross–Fahroo lemma is a fundamental result in optimal control theory.[1][2] [3][4] It states that dualization and discretization are, in general, non-commutative operations. The operations can be made commutative by an application of the covector mapping principle.[5]\n\n\nA continuous-time optimal control problem is information rich. A number of interesting properties of a given problem can be derived by applying the Pontryagin's minimum principle or the Hamilton–Jacobi–Bellman equations. These theories implicitly use the continuity of time in their derivation.[6] When an optimal control problem is discretized, the Ross–Fahroo lemma asserts that there is a fundamental loss of information. This loss of information can be in the primal variables as in the value of the control at one or both of the boundary points[7] [8] or in the dual variables as in the value of the Hamiltonian over the time horizon. To address the information loss, Ross and Fahroo introduced the concept of closure conditions which allow the known information loss to be put back in. This is done by an application of the covector mapping principle.[5]\nWhen pseudospectral methods are applied to discretize optimal control problems, the implications of the Ross–Fahroo lemma appear in the form of the discrete covectors seemingly being discretized by the transpose of the differentiation matrix.[1][2][3] When the covector mapping principle is applied, it reveals the proper transformation for the adjoints. Application of the transformation generates the Ross–Fahroo pseudospectral methods.[9][10]", 
    "dbpedia_url": "http://dbpedia.org/resource/Ross–Fahroo_lemma", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Ross–Fahroo_lemma\n"
}