{
    "about": "Introduced by I. Michael Ross and F. Fahroo, the Ross–Fahroo pseudospectral methods are a broad collection of pseudospectral methods optimal control[1] [2] [3] [4] [5][6] [7] [8] .[9] Examples of the Ross–Fahroo pseudospectral methods are the pseudospectral knotting method, the flat pseudospectral method, the Legendre-Gauss-Radau pseudospectral method[10][11] and pseudospectral methods for infinite-horizon optimal control.[12] [13]", 
    "name": "Ross–Fahroo Pseudospectral Method", 
    "classification": "Numerical Analysis", 
    "full_text": "Introduced by I. Michael Ross and F. Fahroo, the Ross–Fahroo pseudospectral methods are a broad collection of pseudospectral methods optimal control[1] [2] [3] [4] [5][6] [7] [8] .[9] Examples of the Ross–Fahroo pseudospectral methods are the pseudospectral knotting method, the flat pseudospectral method, the Legendre-Gauss-Radau pseudospectral method[10][11] and pseudospectral methods for infinite-horizon optimal control.[12] [13]\n\n\nThe Ross–Fahroo methods are based on shifted Gaussian pseudospectral node points. The shifts are obtained by means of a linear or nonlinear transformation while the Gaussian pseudospectral points are chosen from a collection of Gauss-Lobatto or Gauss-Radau distribution arising from Legendre or Chebyshev polynomials. The Gauss-Lobatto pseudospectral points are used for finite-horizon optimal control problems while the Gauss-Radau pseudospectral points are used for infinite-horizon optimal control problems.[14]\nThe Ross–Fahroo methods are founded on the Ross–Fahroo lemma; they can be applied to optimal control problems governed by differential equations, differential-algebraic equations, differential inclusions, and differentially-flat systems. They can also be applied to infinite-horizon optimal control problems by a simple domain transformation technique.[12] [13] The Ross–Fahroo pseudospectral methods also form the foundations for the Bellman pseudospectral method.\nThe Ross–Fahroo methods have been implemented in many practical applications and laboratories around the world. In 2006, NASA used the Ross–Fahroo method to implement the \"zero propellant maneuver\" on board the International Space Station.[15] In recognition of all these advances, the AIAA presented Ross and Fahroo, the 2010 Mechanics and Control of Flight Award, for \"... changing the landscape of flight mechanics.\" Ross was also elected AAS Fellow for \"his pioneering contributions to pseudospectral optimal control.\"\nA remarkable feature of the Ross–Fahroo methods is that it does away with the prior notions of \"direct\" and \"indirect\" methods. That is, through a collection of theorems put forth by Ross and Fahroo,[5][6][8] [16] they showed that it was possible to design pseudospectral methods for optimal control that were equivalent in both the direct and indirect forms. This implied that one could use their methods as simply as a \"direct\" method while automatically generating accurate duals as in \"indirect\" methods. This revolutionized solving optimal control problems leading to widespread use of the Ross–Fahroo techniques.[17]\nThe Ross–Fahroo methods are implemented in the MATLAB optimal control solver, DIDO.", 
    "dbpedia_url": "http://dbpedia.org/resource/Ross–Fahroo_pseudospectral_method", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Ross–Fahroo_pseudospectral_method\n"
}