{
    "about": "Ross' π lemma, named after I. Michael Ross,[1][2][3] is a result in computational optimal control. Based on generating Carathéodory-π solutions for feedback control, Ross' π-lemma states that there is fundamental time constant within which a control solution must be computed for controllability and stability. This time constant, known as Ross' time constant,[4][5] is proportional to the inverse of the Lipschitz constant of the vector field that governs the dynamics of a nonlinear control system.[6][7]", 
    "name": "Ross' π Lemma", 
    "classification": "Numerical Analysis", 
    "full_text": "Ross' π lemma, named after I. Michael Ross,[1][2][3] is a result in computational optimal control. Based on generating Carathéodory-π solutions for feedback control, Ross' π-lemma states that there is fundamental time constant within which a control solution must be computed for controllability and stability. This time constant, known as Ross' time constant,[4][5] is proportional to the inverse of the Lipschitz constant of the vector field that governs the dynamics of a nonlinear control system.[6][7]\n\n\nThe proportionality factor in the definition of Ross' time constant is dependent upon the magnitude of the disturbance on the plant and the specifications for feedback control. When there are no disturbances, Ross' π-lemma shows that the open-loop optimal solution is the same as the closed-loop one. In the presence of disturbances, the proportionality factor can be written in terms of the Lambert W-function.\nIn practical applications, Ross' time constant can be found by numerical experimentation using DIDO. Ross et al showed that this time constant is connected to the practical implementation of a Caratheodory-π solution.[6] That is, Ross et al showed that if feedback solutions are obtained by zero-order holds only, then a significantly faster sampling rate is needed to achieve controllability and stability. On the other hand, if a feedback solution is implemented by way of a Caratheodory-π technique, then a larger sampling rate can be accommodated. This implies that the computational burden on generating feedback solutions is significantly less than the standard implementations. These concepts have been used to generate collision-avoidance manevuers in robotics in the presence of uncertain and incomplete information of the static and dynamic obstacles.[8]", 
    "dbpedia_url": "http://dbpedia.org/resource/Ross'_π_lemma", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Ross'_π_lemma\n"
}