{
    "about": "In control system theory, the Routh–Hurwitz stability criterion is a mathematical test that is a necessary and sufficient condition for the stability of a linear time invariant (LTI) control system. The Routh test is an efficient recursive algorithm that English mathematician Edward John Routh proposed in 1876 to determine whether all the roots of the characteristic polynomial of a linear system have negative real parts.[1] German mathematician Adolf Hurwitz independently proposed in 1895 to arrange the coefficients of the polynomial into a square matrix, called the Hurwitz matrix, and showed that the polynomial is stable if and only if the sequence of determinants of its principal submatrices are all positive.[2] The two procedures are equivalent, with the Routh test providing a more efficient way to compute the Hurwitz determinants than computing them directly. A polynomial satisfying the Routh–Hurwitz criterion is called a Hurwitz polynomial.", 
    "name": "Routh–Hurwitz Stability Criterion", 
    "classification": "Signal Processing", 
    "full_text": "In control system theory, the Routh–Hurwitz stability criterion is a mathematical test that is a necessary and sufficient condition for the stability of a linear time invariant (LTI) control system. The Routh test is an efficient recursive algorithm that English mathematician Edward John Routh proposed in 1876 to determine whether all the roots of the characteristic polynomial of a linear system have negative real parts.[1] German mathematician Adolf Hurwitz independently proposed in 1895 to arrange the coefficients of the polynomial into a square matrix, called the Hurwitz matrix, and showed that the polynomial is stable if and only if the sequence of determinants of its principal submatrices are all positive.[2] The two procedures are equivalent, with the Routh test providing a more efficient way to compute the Hurwitz determinants than computing them directly. A polynomial satisfying the Routh–Hurwitz criterion is called a Hurwitz polynomial.\nThe importance of the criterion is that the roots p of the characteristic equation of a linear system with negative real parts represent solutions ept of the system that are stable (bounded). Thus the criterion provides a way to determine if the equations of motion of a linear system have only stable solutions, without solving the system directly. For discrete systems, the corresponding stability test can be handled by the Schur–Cohn criterion, the Jury test and the Bistritz test. With the advent of computers, the criterion has become less widely used, as an alternative is to solve the polynomial numerically, obtaining approximations to the roots directly.\nThe Routh test can be derived through the use of the Euclidean algorithm and Sturm's theorem in evaluating Cauchy indices. Hurwitz derived his conditions differently.[3]\n\n\nThe criterion is related to Routh–Hurwitz theorem. Indeed, from the statement of that theorem, we have \n\n\n\np\n−\nq\n=\nw\n(\n+\n∞\n)\n−\nw\n(\n−\n∞\n)\n\n\n{\\displaystyle p-q=w(+\\infty )-w(-\\infty )}\n\n where:\nBy the fundamental theorem of algebra, each polynomial of degree n must have n roots in the complex plane (i.e., for an ƒ with no roots on the imaginary line, p + q = n). Thus, we have the condition that ƒ is a (Hurwitz) stable polynomial if and only if p − q = n (the proof is given below). Using the Routh–Hurwitz theorem, we can replace the condition on p and q by a condition on the generalized Sturm chain, which will give in turn a condition on the coefficients of ƒ.\nLet f(z) be a complex polynomial. The process is as follows:\nNotice that we had to suppose b different from zero in the first division. The generalized Sturm chain is in this case \n\n\n\n(\n\nP\n\n0\n\n\n(\ny\n)\n,\n\nP\n\n1\n\n\n(\ny\n)\n,\n\nP\n\n2\n\n\n(\ny\n)\n)\n=\n(\nc\n−\na\n\ny\n\n2\n\n\n,\nb\ny\n,\n−\nc\n)\n\n\n{\\displaystyle (P_{0}(y),P_{1}(y),P_{2}(y))=(c-ay^{2},by,-c)}\n\n. Putting \n\n\n\ny\n=\n+\n∞\n\n\n{\\displaystyle y=+\\infty }\n\n, the sign of \n\n\n\nc\n−\na\n\ny\n\n2\n\n\n\n\n{\\displaystyle c-ay^{2}}\n\n is the opposite sign of a and the sign of by is the sign of b. When we put \n\n\n\ny\n=\n−\n∞\n\n\n{\\displaystyle y=-\\infty }\n\n, the sign of the first element of the chain is again the opposite sign of a and the sign of by is the opposite sign of b. Finally, -c has always the opposite sign of c.\nSuppose now that f is Hurwitz-stable. This means that \n\n\n\nw\n(\n+\n∞\n)\n−\nw\n(\n−\n∞\n)\n=\n2\n\n\n{\\displaystyle w(+\\infty )-w(-\\infty )=2}\n\n (the degree of f). By the properties of the function w, this is the same as \n\n\n\nw\n(\n+\n∞\n)\n=\n2\n\n\n{\\displaystyle w(+\\infty )=2}\n\n and \n\n\n\nw\n(\n−\n∞\n)\n=\n0\n\n\n{\\displaystyle w(-\\infty )=0}\n\n. Thus, a, b and c must have the same sign. We have thus found the necessary condition of stability for polynomials of degree 2.\nSystems meeting the above criteria are said to be closed-loop stable; otherwise, they are unstable because there are sign changes in the first-column elements.\nA tabular method can be used to determine the stability when the roots of a higher order characteristic polynomial are difficult to obtain. For an nth-degree polynomial\nthe table has n + 1 rows and the following structure:\nwhere the elements \n\n\n\n\nb\n\ni\n\n\n\n\n{\\displaystyle b_{i}}\n\n and \n\n\n\n\nc\n\ni\n\n\n\n\n{\\displaystyle c_{i}}\n\n can be computed as follows:\nWhen completed, the number of sign changes in the first column will be the number of non-negative poles.\nIn the first column, there are two sign changes (0.75 → −3, and −3 → 3), thus there are two non-negative roots where the system is unstable.\nSometimes the presence of poles on the imaginary axis creates a situation of marginal stability. In that case the coefficients of the \"Routh array\" in a whole row become zero and thus further solution of the polynomial for finding changes in sign is not possible. Then another approach comes into play. The row of polynomial which is just above the row containing the zeroes is called the \"auxiliary polynomial\".\nWe have the following table:\nIn such a case the auxiliary polynomial is \n\n\n\nA\n(\ns\n)\n=\n2\n\ns\n\n4\n\n\n+\n12\n\ns\n\n2\n\n\n+\n16.\n\n\n\n{\\displaystyle A(s)=2s^{4}+12s^{2}+16.\\,}\n\n which is again equal to zero. The next step is to differentiate the above equation which yields the following polynomial. \n\n\n\nB\n(\ns\n)\n=\n8\n\ns\n\n3\n\n\n+\n24\n\ns\n\n1\n\n\n.\n\n\n\n{\\displaystyle B(s)=8s^{3}+24s^{1}.\\,}\n\n. The coefficients of the row containing zero now become \"8\" and \"24\". The process of Routh array is proceeded using these values which yield two points on the imaginary axis. These two points on the imaginary axis are the prime cause of marginal stability.[4]", 
    "dbpedia_url": "http://dbpedia.org/resource/Routh–Hurwitz_stability_criterion", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Routh–Hurwitz_stability_criterion\n"
}