{
    "about": "The Selfridge–Conway procedure is a discrete procedure that produces an envy-free cake-cutting for three partners.[1]:13-14 It is named after John Selfridge and John Horton Conway. Selfridge discovered it in 1960, and told it to Richard Guy, who told it to many people, but Selfridge did not publish it. John Conway discovered it independently in 1993, and also never published it, but the result is attributed to them in a number of books.[2] This procedure was the first envy-free discrete procedure devised for three partners, and it paved the way for more advanced procedures for n partners (see envy-free cake-cutting).", 
    "name": "Selfridge–Conway Discrete Procedure", 
    "classification": "Fair Division Protocols", 
    "full_text": "The Selfridge–Conway procedure is a discrete procedure that produces an envy-free cake-cutting for three partners.[1]:13-14 It is named after John Selfridge and John Horton Conway. Selfridge discovered it in 1960, and told it to Richard Guy, who told it to many people, but Selfridge did not publish it. John Conway discovered it independently in 1993, and also never published it, but the result is attributed to them in a number of books.[2] This procedure was the first envy-free discrete procedure devised for three partners, and it paved the way for more advanced procedures for n partners (see envy-free cake-cutting).\nA procedure is envy-free if each recipient believes that (according to its measure) no other recipient has received more than he has. In their solution, the maximal number of cuts in the procedure is five. The pieces are not always contiguous.\n\n\nSuppose we have three players P1, P2 and P3. Where the procedure gives a criterion for a decision it means that criterion gives an optimum choice for the player.\nIt remains to divide the trimmings A2. The trimmed piece A1 has been chosen by either P2 or P3; let's call the player who chose it PA and the other player PB.\nLet's see why the procedure is envy-free. It must be shown that each player believes that no other player received more than he had. Without loss of generality, we can write (see illustration above):\nIn the following analysis \"largest\" means \"largest according to the player\":\nNote that if all we want is an envy-free division for a part of the cake (i.e. we allow free disposal), then we only need to use the first part of the Selfridge–Conway procedure, i.e.:\nThis guarantees that there is no envy, and additionally each partner receives a value of at least 1/4 the total (since the total number of pieces is 4).\nThis procedure can be generalized to 4 partners in the following way:[3]\nThis guarantees that there is no envy, and additionally each partner receives a value of at least 1/8 the total (since the total number of pieces is 8).\nBy induction. the procedure can be generalized to n partners, the first one dividing the cake to \n\n\n\n\n2\n\nn\n−\n2\n\n\n+\n1\n\n\n{\\displaystyle 2^{n-2}+1}\n\n equal pieces and the other partners follow by trimming. The resulting division is envy-free and each partner receives a value of at least \n\n\n\n1\n\n/\n\n\n2\n\nn\n−\n1\n\n\n\n\n{\\displaystyle 1/2^{n-1}}\n\n of the total.\nWe can apply the same procedure again on the remainders. By doing so an infinite number of times, we get an envy-free division of the entire cake.[4] A refinement of this infinite procedure yields a finite envy-free division procedure - the Brams–Taylor procedure.", 
    "dbpedia_url": "http://dbpedia.org/resource/Selfridge–Conway_discrete_procedure", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Selfridge–Conway_discrete_procedure\n"
}