{
    "about": "In mathematics, a self-avoiding walk (SAW) is a sequence of moves on a lattice (a lattice path) that does not visit the same point more than once. This is a special case of the graph theoretical notion of a path. A self-avoiding polygon (SAP) is a closed self-avoiding walk on a lattice. SAWs were first introduced by the chemist Paul Flory[1][dubious – discuss] in order to model the real-life behavior of chain-like entities such as solvents and polymers, whose physical volume prohibits multiple occupation of the same spatial point. Very little is known rigorously about the self-avoiding walk from a mathematical perspective, although physicists have provided numerous conjectures that are believed to be true and are strongly supported by numerical simulations.", 
    "classification": "Computational Physics", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Self-avoiding_walk\n", 
    "full_text": "In mathematics, a self-avoiding walk (SAW) is a sequence of moves on a lattice (a lattice path) that does not visit the same point more than once. This is a special case of the graph theoretical notion of a path. A self-avoiding polygon (SAP) is a closed self-avoiding walk on a lattice. SAWs were first introduced by the chemist Paul Flory[1][dubious – discuss] in order to model the real-life behavior of chain-like entities such as solvents and polymers, whose physical volume prohibits multiple occupation of the same spatial point. Very little is known rigorously about the self-avoiding walk from a mathematical perspective, although physicists have provided numerous conjectures that are believed to be true and are strongly supported by numerical simulations.\nIn computational physics a self-avoiding walk is a chain-like path in R2 or R3 with a certain number of nodes, typically a fixed step length and has the imperative property that it doesn't cross itself or another walk. A system of self-avoiding walks satisfies the so-called excluded volume condition. In higher dimensions, the self-avoiding walk is believed to behave much like the ordinary random walk. SAWs and SAPs play a central role in the modelling of the topological and knot-theoretic behaviour of thread- and loop-like molecules such as proteins. SAW is a fractal.[2][3] For example, in d = 2 the fractal dimension is 4/3, for d = 3 it is close to 5/3 while for d ≥ 4 the fractal dimension is 2. The dimension is called the upper critical dimension above which excluded volume is negligible. A SAW that does not satisfy the excluded volume condition was recently studied to model explicit surface geometry resulting from expansion of a SAW.[4]\nThe properties of SAWs cannot be calculated analytically, so numerical simulations are employed. The pivot algorithm is a common method for Markov chain Monte Carlo simulations for the uniform measure on n-step self-avoiding walks. The pivot algorithm works by taking a self-avoiding walk and randomly choosing a point on this walk, and then applying a symmetry operation (rotations and reflections) on the walk after the nth step to create a new walk. Calculating the number of self-avoiding walks in any given lattice is a common computational problem. There is currently no known formula for determining the number of self-avoiding walks, although there are rigorous methods for approximating them.[5][6] Finding the number of such paths is conjectured to be an NP-hard problem[citation needed]. For self-avoiding walks from one end of a diagonal to the other, with only moves in the positive direction, there are exactly\npaths for an m × n rectangular lattice.\n\n\nOne of the phenomena associated with self-avoiding walks and 2-dimensional statistical physics models in general is the notion of universality, that is, independence of macroscopic observables from microscopic details, such as the choice of the lattice. One important quantity that appears in conjectures for universal laws is the connective constant, defined as follows. Let cn denote the number of n-step self-avoiding walks. Since every (n + m)-step self avoiding walk can be decomposed into an n-step self-avoiding walk and an m-step self-avoiding walk, it follows that cn+m ≤ cncm. Therefore, the sequence {log cn} is subadditive and we can apply Fekete's lemma to show that the following limit exists:\nμ is called the connective constant, since cn depends on the particular lattice chosen for the walk so does μ. The exact value of μ is only known for the hexagonal lattice, where it is equal to:[7]\nFor other lattices, μ has only been approximated numerically, and is believed to not even be an algebraic number. It is conjectured that\nas n → ∞, where μ depends on the lattice, but the power law correction \n\n\n\n\nn\n\n\n11\n32\n\n\n\n\n\n{\\displaystyle n^{\\frac {11}{32}}}\n\n does not; in other words, this law is believed to be universal.\nSelf-avoiding walks have also been studied in the context of network theory.[8] In this context, it is customary to treat the SAW as a dynamical process, such that in every time step a walker randomly hops between neighboring nodes of the network. The walk ends when the walker reaches a dead-end state, such that it can no longer progress to newly un-visited nodes. It was recently found that on Erdős–Rényi networks, the distribution of path length's of such dynamically grown SAW's can be calculated analytically, and follows the Gompertz distribution.[9]\nConsider the uniform measure on n-step self-avoiding walks in the full plane. It is currently unknown whether the limit of the uniform measure as n → ∞ induces a measure on infinite full-plane walks. However, Harry Kesten has shown that such a measure exists for self-avoiding walks in the half-plane. One important question involving self-avoiding walks is the existence and conformal invariance of the scaling limit, that is, the limit as the length of the walk goes to infinity and the mesh of the lattice goes to zero. The scaling limit of the self-avoiding walk is conjectured to be described by Schramm–Loewner evolution with parameter κ = 8/3.", 
    "name": "Self Avoiding Walk"
}