{
    "about": "Sequential quadratic programming (SQP) is an iterative method for nonlinear optimization. SQP methods are used on mathematical problems for which the objective function and the constraints are twice continuously differentiable.", 
    "name": "Sequential Quadratic Programming", 
    "classification": "Optimization Algorithms And Methods", 
    "full_text": "Sequential quadratic programming (SQP) is an iterative method for nonlinear optimization. SQP methods are used on mathematical problems for which the objective function and the constraints are twice continuously differentiable.\nSQP methods solve a sequence of optimization subproblems, each of which optimizes a quadratic model of the objective subject to a linearization of the constraints. If the problem is unconstrained, then the method reduces to Newton's method for finding a point where the gradient of the objective vanishes. If the problem has only equality constraints, then the method is equivalent to applying Newton's method to the first-order optimality conditions, or Karush–Kuhn–Tucker conditions, of the problem. SQP methods have been implemented in many packages, including KNITRO,[1] NPSOL, SNOPT, NLPQL, OPSYC, OPTIMA, MATLAB, GNU Octave, SQP and SciPy.\n\n\nConsider a nonlinear programming problem of the form:\nThe Lagrangian for this problem is;[2]\nwhere \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n and \n\n\n\nσ\n\n\n{\\displaystyle \\sigma }\n\n are Lagrange multipliers. At an iterate \n\n\n\n\nx\n\nk\n\n\n\n\n{\\displaystyle x_{k}}\n\n, a basic sequential quadratic programming algorithm defines an appropriate search direction \n\n\n\n\nd\n\nk\n\n\n\n\n{\\displaystyle d_{k}}\n\n as a solution to the quadratic programming subproblem\nNote that the term \n\n\n\nf\n(\n\nx\n\nk\n\n\n)\n\n\n{\\displaystyle f(x_{k})}\n\n in the expression above may be left out for the minimization problem, since it is constant.\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Sequential_quadratic_programming", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Sequential_quadratic_programming\n"
}