{
    "about": "In mathematics, the Shapiro polynomials are a sequence of polynomials which were first studied by Harold S. Shapiro in 1951 when considering the magnitude of specific trigonometric sums.[1] In signal processing, the Shapiro polynomials have good autocorrelation properties[2] and their values on the unit circle are small. The first few members of the sequence are:", 
    "name": "Shapiro Polynomials", 
    "classification": "Digital Signal Processing", 
    "full_text": "In mathematics, the Shapiro polynomials are a sequence of polynomials which were first studied by Harold S. Shapiro in 1951 when considering the magnitude of specific trigonometric sums.[1] In signal processing, the Shapiro polynomials have good autocorrelation properties[2] and their values on the unit circle are small. The first few members of the sequence are:\nwhere the second sequence, indicated by Q, is said to be complementary to the first sequence, indicated by P.\n\n\nThe Shapiro polynomials Pn(z) may be constructed from the Golay-Rudin-Shapiro sequence an, which equals 1 if the number of pairs of consecutive ones in the binary expansion of n is even, and −1 otherwise. Thus a0 = 1, a1 = 1, a2 = 1, a3 = −1, etc.\nThe first Shapiro Pn(z) is the partial sum of order 2n − 1 (where n = 0, 1, 2, ...) of the power series\nThe Golay-Rudin-Shapiro sequence {an} has a fractal-like structure – for example, an = a2n – which implies that the subsequence (a0, a2, a4, ...) replicates the original sequence {an}. This in turn leads to remarkable functional equations satisfied by f(z).\nThe second or complementary Shapiro polynomials Qn(z) may be defined in terms of this sequence, or by the relation Qn(z) = (1-)nz2n-1Pn(-1/z), or by the recursions\nThe sequence of complementary polynomials Qn corresponding to the Pn is uniquely characterized by the following properties:\nThe most interesting property of the {Pn} is that the absolute value of Pn(z) is bounded on the unit circle by the square root of 2(n + 1), which is on the order of the L2 norm of Pn. Polynomials with coefficients from the set {−1, 1} whose maximum modulus on the unit circle is close to their mean modulus are useful for various applications in communication theory (e.g., antenna design and data compression). Property (iii) shows that (P, Q) form a Golay pair.\nThese polynomials have further properties:[3]", 
    "dbpedia_url": "http://dbpedia.org/resource/Shapiro_polynomials", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Shapiro_polynomials\n"
}