{
    "about": "The short-time Fourier transform (STFT), or alternatively short-term Fourier transform, is a Fourier-related transform used to determine the sinusoidal frequency and phase content of local sections of a signal as it changes over time.[1] In practice, the procedure for computing STFTs is to divide a longer time signal into shorter segments of equal length and then compute the Fourier transform separately on each shorter segment. This reveals the Fourier spectrum on each shorter segment. One then usually plots the changing spectra as a function of time.", 
    "classification": "Signal Processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Short-time_Fourier_transform\n", 
    "full_text": "The short-time Fourier transform (STFT), or alternatively short-term Fourier transform, is a Fourier-related transform used to determine the sinusoidal frequency and phase content of local sections of a signal as it changes over time.[1] In practice, the procedure for computing STFTs is to divide a longer time signal into shorter segments of equal length and then compute the Fourier transform separately on each shorter segment. This reveals the Fourier spectrum on each shorter segment. One then usually plots the changing spectra as a function of time.\n\n\nSimply, in the continuous-time case, the function to be transformed is multiplied by a window function which is nonzero for only a short period of time. The Fourier transform (a one-dimensional function) of the resulting signal is taken as the window is slid along the time axis, resulting in a two-dimensional representation of the signal. Mathematically, this is written as:\nwhere w(t) is the window function, commonly a Hann window or Gaussian window centered around zero, and x(t) is the signal to be transformed.[citation needed] (Note the difference between w and ω.) X(τ,ω) is essentially the Fourier Transform of x(t)w(t-τ), a complex function representing the phase and magnitude of the signal over time and frequency. Often phase unwrapping is employed along either or both the time axis, τ, and frequency axis, ω, to suppress any jump discontinuity of the phase result of the STFT. The time index τ is normally considered to be \"slow\" time and usually not expressed in as high resolution as time t.\nIn the discrete time case, the data to be transformed could be broken up into chunks or frames (which usually overlap each other, to reduce artifacts at the boundary). Each chunk is Fourier transformed, and the complex result is added to a matrix, which records magnitude and phase for each point in time and frequency. This can be expressed as:\nlikewise, with signal x[n] and window w[n]. In this case, m is discrete and ω is continuous, but in most typical applications the STFT is performed on a computer using the Fast Fourier Transform, so both variables are discrete and quantized.\nThe magnitude squared of the STFT yields the spectrogram of the function:\nSee also the modified discrete cosine transform (MDCT), which is also a Fourier-related transform that uses overlapping windows.\nIf only a small number of ω are desired, or if the STFT is desired to be evaluated for every shift m of the window, then the STFT may be more efficiently evaluated using a sliding DFT algorithm.[2]\nThe STFT is invertible, that is, the original signal can be recovered from the transform by the Inverse STFT. The most widely accepted way of inverting the STFT is by using the overlap-add (OLA) method, which also allows for modifications to the STFT complex spectrum. This makes for a versatile signal processing method,[3] referred to as the overlap and add with modifications method.\nGiven the width and definition of the window function w(t), we initially require the area of the window function to be scaled so that\nIt easily follows that\nand\nThe continuous Fourier Transform is\nSubstituting x(t) from above:\nSwapping order of integration:\nSo the Fourier Transform can be seen as a sort of phase coherent sum of all of the STFTs of x(t). Since the inverse Fourier transform is\nthen x(t) can be recovered from X(τ,ω) as\nor\nIt can be seen, comparing to above that windowed \"grain\" or \"wavelet\" of x(t) is\nthe inverse Fourier transform of X(τ,ω) for τ fixed.\nOne of the pitfalls of the STFT is that it has a fixed resolution. The width of the windowing function relates to how the signal is represented—it determines whether there is good frequency resolution (frequency components close together can be separated) or good time resolution (the time at which frequencies change). A wide window gives better frequency resolution but poor time resolution. A narrower window gives good time resolution but poor frequency resolution. These are called narrowband and wideband transforms, respectively.\nThis is one of the reasons for the creation of the wavelet transform and multiresolution analysis, which can give good time resolution for high-frequency events and good frequency resolution for low-frequency events, the combination best suited for many real signals.\nThis property is related to the Heisenberg uncertainty principle, but not directly – see Gabor limit for discussion. The product of the standard deviation in time and frequency is limited. The boundary of the uncertainty principle (best simultaneous resolution of both) is reached with a Gaussian window function, as the Gaussian minimizes the Fourier uncertainty principle. This is called the Gabor transform (and with modifications for multiresolution becomes the Morlet wavelet transform).\nOne can consider the STFT for varying window size as a two-dimensional domain (time and frequency), as illustrated in the example below, which can be calculated by varying the window size. However, this is no longer a strictly time–frequency representation – the kernel is not constant over the entire signal.\nUsing the following sample signal \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n that is composed of a set of four sinusoidal waveforms joined together in sequence. Each waveform is only composed of one of four frequencies (10, 25, 50, 100 Hz). The definition of \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n is:\nThen it is sampled at 400 Hz. The following spectrograms were produced:\nThe 25 ms window allows us to identify a precise time at which the signals change but the precise frequencies are difficult to identify. At the other end of the scale, the 1000 ms window allows the frequencies to be precisely seen but the time between frequency changes is blurred.\nIt can also be explained with reference to the sampling and Nyquist frequency.\nTake a window of N samples from an arbitrary real-valued signal at sampling rate fs . Taking the Fourier transform produces N complex coefficients. Of these coefficients only half are useful (the last N/2 being the complex conjugate of the first N/2 in reverse order, as this is a real valued signal).\nThese N/2 coefficients represent the frequencies 0 to fs/2 (Nyquist) and two consecutive coefficients are spaced apart by fs/N Hz.\nTo increase the frequency resolution of the window the frequency spacing of the coefficients needs to be reduced. There are only two variables, but decreasing fs (and keeping N constant) will cause the window size to increase — since there are now fewer samples per unit time. The other alternative is to increase N, but this again causes the window size to increase. So any attempt to increase the frequency resolution causes a larger window size and therefore a reduction in time resolution—and vice versa.\nAs the Nyquist frequency is a limitation in the maximum frequency that can be meaningfully analysed, so is the Rayleigh frequency a limitation on the minimum frequency.\nRayleigh frequency is the minimum frequency that can be resolved by a finite duration time window.[4][5]\nGiven a time window that is Τ seconds long, the minimum frequency that can be resolved is 1/Τ Hz.\nRayleigh frequency is important to consider in applications of the short-time Fourier transform (STFT), such as in analysing neural signals[6][7]\nSTFTs as well as standard Fourier transforms and other tools are frequently used to analyze music. The spectrogram can, for example, show frequency on the horizontal axis, with the lowest frequencies at left, and the highest at the right. The height of each bar (augmented by color) represents the amplitude of the frequencies within that band. The depth dimension represents time, where each new bar was a separate distinct transform. Audio engineers use this kind of visual to gain information about an audio sample, for example, to locate the frequencies of specific noises (especially when used with greater frequency resolution) or to find frequencies which may be more or less resonant in the space where the signal was recorded. This information can be used for equalization or tuning other audio effects.\nOriginal function:\n\n\n\nX\n(\nt\n,\nf\n)\n=\n\n∫\n\n−\n∞\n\n\n∞\n\n\nw\n(\nt\n−\nτ\n)\nx\n(\nτ\n)\n\ne\n\n−\nj\n2\nπ\nf\nτ\n\n\nd\nτ\n\n\n{\\displaystyle X(t,f)=\\int _{-\\infty }^{\\infty }w(t-\\tau )x(\\tau )e^{-j2\\pi f\\tau }d\\tau }\n\n\nConverting into the discrete form:\n\n\n\n\nt\n=\nn\n\nΔ\n\nt\n\n\n\n\n{\\displaystyle t=n\\Delta _{t}}\n\n, \n\n\n\nf\n=\nm\n\nΔ\n\nf\n\n\n\n\n{\\displaystyle f=m\\Delta _{f}}\n\n, \n\n\n\nτ\n=\np\n\nΔ\n\nt\n\n\n\n\n{\\displaystyle \\tau =p\\Delta _{t}}\n\n\n\n\n\n\nX\n(\nn\n\nΔ\n\nt\n\n\n,\nm\n\nΔ\n\nf\n\n\n)\n=\n\n∑\n\n−\n∞\n\n\n∞\n\n\nw\n(\n(\nn\n−\np\n)\n\nΔ\n\nt\n\n\n)\nx\n(\np\n\nΔ\n\nt\n\n\n)\n\ne\n\n−\nj\n2\nπ\np\nm\n\nΔ\n\nt\n\n\n\nΔ\n\nf\n\n\n\n\n\nΔ\n\nt\n\n\n\n\n{\\displaystyle X(n\\Delta _{t},m\\Delta _{f})=\\sum _{-\\infty }^{\\infty }w((n-p)\\Delta _{t})x(p\\Delta _{t})e^{-j2\\pi pm\\Delta _{t}\\Delta _{f}}\\Delta _{t}}\n\n\nSuppose that \n\n\n\nw\n(\nt\n)\n≅\n0\n \n\nf\no\nr\n \n\n|\n\nt\n\n|\n\n\n>\nB\n,\n\n\nB\n\nΔ\n\nt\n\n\n\n\n=\nQ\n\n\n{\\displaystyle w(t)\\cong 0\\ \\mathrm {for\\ |t|} >B,{\\frac {B}{\\Delta _{t}}}=Q}\n\n\nThen we can write the original function into\n\n\n\n\nX\n(\nn\n\nΔ\n\nt\n\n\n,\nm\n\nΔ\n\nf\n\n\n)\n=\n\n∑\n\np\n=\nn\n−\nQ\n\n\nn\n+\nQ\n\n\nw\n(\n(\nn\n−\np\n)\n\nΔ\n\nt\n\n\n)\nx\n(\np\n\nΔ\n\nt\n\n\n)\n\ne\n\n−\nj\n2\nπ\np\nm\n\nΔ\n\nt\n\n\n\nΔ\n\nf\n\n\n\n\n\nΔ\n\nt\n\n\n\n\n{\\displaystyle X(n\\Delta _{t},m\\Delta _{f})=\\sum _{p=n-Q}^{n+Q}w((n-p)\\Delta _{t})x(p\\Delta _{t})e^{-j2\\pi pm\\Delta _{t}\\Delta _{f}}\\Delta _{t}}\n\n\na. Nyquist criterion(Avoiding the aliasing effect):\n\n\n\n\n\nΔ\n\nt\n\n\n<\n\n\n1\n\n2\nΩ\n\n\n\n\n\n{\\displaystyle \\Delta _{t}<{\\frac {1}{2\\Omega }}}\n\n, \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n is the bandwidth of \n\n\n\nx\n(\nτ\n)\nw\n(\nt\n−\nτ\n)\n\n\n{\\displaystyle x(\\tau )w(t-\\tau )}\n\n\na. \n\n\n\n\nΔ\n\nt\n\n\n\nΔ\n\nf\n\n\n=\n\n\n1\nN\n\n\n\n\n{\\displaystyle \\Delta _{t}\\Delta _{f}={\\frac {1}{N}}}\n\n, \n\n\n\nN\n\n\n{\\displaystyle N}\n\n is an integer\nb. \n\n\n\nN\n≥\n2\nQ\n+\n1\n\n\n{\\displaystyle N\\geq 2Q+1}\n\n\nc. Nyquist criterion(Avoiding the aliasing effect):\n\n\n\n\n\nΔ\n\nt\n\n\n<\n\n\n1\n\n2\nΩ\n\n\n\n\n\n{\\displaystyle \\Delta _{t}<{\\frac {1}{2\\Omega }}}\n\n, \n\n\n\nΩ\n\n\n{\\displaystyle \\Omega }\n\n is the bandwidth of \n\n\n\nx\n(\nτ\n)\nw\n(\nt\n−\nτ\n)\n\n\n{\\displaystyle x(\\tau )w(t-\\tau )}\n\n\n\n\na. \nb. \nc. Nyquist criterion(Avoiding the aliasing effect):\n\nd. Only for implementing the rectangular-STFT\n\nApplying the recursive formula to calculate \n\na. \n\nOther time-frequency transforms:", 
    "name": "Short Time Fourier Transform"
}