{
    "about": "In signal processing, reconstruction usually means the determination of an original continuous signal from a sequence of equally spaced samples.", 
    "name": "Signal Reconstruction", 
    "classification": "Signal Processing", 
    "full_text": "In signal processing, reconstruction usually means the determination of an original continuous signal from a sequence of equally spaced samples.\nThis article takes a generalized abstract mathematical approach to signal sampling and reconstruction. For a more practical approach based on band-limited signals, see Whittaker–Shannon interpolation formula.\n\n\nLet F be any sampling method, i.e. a linear map from the Hilbert space of square-integrable functions \n\n\n\n\nL\n\n2\n\n\n\n\n{\\displaystyle L^{2}}\n\n to complex space \n\n\n\n\n\n\nC\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\mathbb {C}}^{n}}\n\n.\nIn our example, the vector space of sampled signals \n\n\n\n\n\n\nC\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\mathbb {C}}^{n}}\n\n is n-dimensional complex space. Any proposed inverse R of F (reconstruction formula, in the lingo) would have to map \n\n\n\n\n\n\nC\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\mathbb {C}}^{n}}\n\n to some subset of \n\n\n\n\nL\n\n2\n\n\n\n\n{\\displaystyle L^{2}}\n\n. We could choose this subset arbitrarily, but if we're going to want a reconstruction formula R that is also a linear map, then we have to choose an n-dimensional linear subspace of \n\n\n\n\nL\n\n2\n\n\n\n\n{\\displaystyle L^{2}}\n\n.\nThis fact that the dimensions have to agree is related to the Nyquist–Shannon sampling theorem.\nThe elementary linear algebra approach works here. Let \n\n\n\n\nd\n\nk\n\n\n:=\n(\n0\n,\n.\n.\n.\n,\n0\n,\n1\n,\n0\n,\n.\n.\n.\n,\n0\n)\n\n\n{\\displaystyle d_{k}:=(0,...,0,1,0,...,0)}\n\n (all entries zero, except for the kth entry, which is a one) or some other basis of \n\n\n\n\n\n\nC\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\mathbb {C}}^{n}}\n\n. To define an inverse for F, simply choose, for each k, an \n\n\n\n\ne\n\nk\n\n\n∈\n\nL\n\n2\n\n\n\n\n{\\displaystyle e_{k}\\in L^{2}}\n\n so that \n\n\n\nF\n(\n\ne\n\nk\n\n\n)\n=\n\nd\n\nk\n\n\n\n\n{\\displaystyle F(e_{k})=d_{k}}\n\n. This uniquely defines the (pseudo-)inverse of F.\nOf course, one can choose some reconstruction formula first, then either compute some sampling algorithm from the reconstruction formula, or analyze the behavior of a given sampling algorithm with respect to the given formula.\nIdeally, the reconstruction formula is derived by minimizing the expected error variance. This requires that either the signal statistics is known or a prior probability for the signal can be specified. Information field theory is then an appropriate mathematical formalism to derive an optimal reconstruction formula.[1]\nPerhaps the most widely used reconstruction formula is as follows. Let \n\n\n\n{\n\ne\n\nk\n\n\n}\n\n\n{\\displaystyle \\{e_{k}\\}}\n\n be a basis of \n\n\n\n\nL\n\n2\n\n\n\n\n{\\displaystyle L^{2}}\n\n in the Hilbert space sense; for instance, one could use the eikonal\nalthough other choices are certainly possible. Note that here the index k can be any integer, even negative.\nThen we can define a linear map R by\nfor each \n\n\n\nk\n=\n⌊\n−\nn\n\n/\n\n2\n⌋\n,\n.\n.\n.\n,\n⌊\n(\nn\n−\n1\n)\n\n/\n\n2\n⌋\n\n\n{\\displaystyle k=\\lfloor -n/2\\rfloor ,...,\\lfloor (n-1)/2\\rfloor }\n\n, where \n\n\n\n(\n\nd\n\nk\n\n\n)\n\n\n{\\displaystyle (d_{k})}\n\n is the basis of \n\n\n\n\n\n\nC\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\mathbb {C}}^{n}}\n\n given by\n(This is the usual discrete Fourier basis.)\nThe choice of range \n\n\n\nk\n=\n⌊\n−\nn\n\n/\n\n2\n⌋\n,\n.\n.\n.\n,\n⌊\n(\nn\n−\n1\n)\n\n/\n\n2\n⌋\n\n\n{\\displaystyle k=\\lfloor -n/2\\rfloor ,...,\\lfloor (n-1)/2\\rfloor }\n\n is somewhat arbitrary, although it satisfies the dimensionality requirement and reflects the usual notion that the most important information is contained in the low frequencies. In some cases, this is incorrect, so a different reconstruction formula needs to be chosen.\nA similar approach can be obtained by using wavelets instead of Hilbert bases. For many applications, the best approach is still not clear today.", 
    "dbpedia_url": "http://dbpedia.org/resource/Signal_reconstruction", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Signal_reconstruction\n"
}