{
    "about": "A signal analyzer is an instrument that measures the magnitude and phase of the input signal at a single frequency within the IF bandwidth of the instrument. It employs digital techniques to extract useful information that is carried by an electrical signal.[1] In common usage the term is related to both spectrum analyzers and vector signal analyzers. While spectrum analyzers measure the amplitude or magnitude of signals, a signal analyzer with appropriate software or programming can measure any aspect of the signal such as modulation. Today’s high-frequency signal analyzers achieve good performance by optimizing both the analog front end and the digital back end.[2]", 
    "name": "Signal Analyzer", 
    "classification": "Signal Processing", 
    "full_text": "A signal analyzer is an instrument that measures the magnitude and phase of the input signal at a single frequency within the IF bandwidth of the instrument. It employs digital techniques to extract useful information that is carried by an electrical signal.[1] In common usage the term is related to both spectrum analyzers and vector signal analyzers. While spectrum analyzers measure the amplitude or magnitude of signals, a signal analyzer with appropriate software or programming can measure any aspect of the signal such as modulation. Today’s high-frequency signal analyzers achieve good performance by optimizing both the analog front end and the digital back end.[2]\nModern signal analyzers use a superheterodyne receiver to downconvert a portion of the signal spectrum for analysis. As shown in the figure to the right, the signal is first converted to an intermediate frequency and then filtered in order to band-limit the signal and prevent aliasing. The downconversion can operate in a swept-tuned mode similar to a traditional spectrum analyzer, or in a fixed-tuned mode. In the fixed-tuned mode the range of frequencies downconverted does not change and the downconverter output is then digitized for further analysis. The digitizing process typically involves in-phase/quadrature (I/Q) or complex sampling so that all characteristics of the signal are preserved, as opposed to the magnitude-only processing of a spectrum analyzer. The sampling rate of the digitizing process may be varied in relation to the frequency span under consideration or (more typically) the signal may be digitally resampled.\nSignal analyzers can perform the operations of both spectrum analyzers and vector signal analyzers. A signal analyzer can be viewed as a measurement platform, with operations such as spectrum analysis (including phase noise, power, and distortion) and vector signal analysis (including demodulation or modulation quality analysis) performed as measurement applications. These measurement applications can be built into the analyzer platform as measurement firmware or installed as changeable application software.", 
    "dbpedia_url": "http://dbpedia.org/resource/Signal_analyzer", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Signal_analyzer\n"
}