{
    "about": "SigSpec is an acronym of \"SIGnificance SPECtrum\" and addresses a statistical technique to provide the reliability of periodicities in a measured (noisy and not necessarily equidistant) time series.[1] It relies on the amplitude spectrum obtained by the Discrete Fourier transform (DFT) and assigns a quantity called the spectral significance (frequently abbreviated by “sig”) to each amplitude. This quantity is a logarithmic measure of the probability that the given amplitude level is due to white noise, in the sense of a type I error. It represents the answer to the question, “What would be the chance to obtain an amplitude like the measured one or higher, if the analysed time series were random?”", 
    "name": "Sigspec", 
    "classification": "Digital Signal Processing", 
    "full_text": "SigSpec is an acronym of \"SIGnificance SPECtrum\" and addresses a statistical technique to provide the reliability of periodicities in a measured (noisy and not necessarily equidistant) time series.[1] It relies on the amplitude spectrum obtained by the Discrete Fourier transform (DFT) and assigns a quantity called the spectral significance (frequently abbreviated by “sig”) to each amplitude. This quantity is a logarithmic measure of the probability that the given amplitude level is due to white noise, in the sense of a type I error. It represents the answer to the question, “What would be the chance to obtain an amplitude like the measured one or higher, if the analysed time series were random?”\nSigSpec may be considered a formal extension to the Lomb-Scargle periodogram,[2][3] appropriately incorporating a time series to be averaged to zero before applying the DFT, which is done in many practical applications. When a zero-mean corrected dataset has to be statistically compared to a random sample, the sample mean (rather than the population mean only) has to be zero.\n\n\nConsidering a time series to be represented by a set of \n\n\n\nK\n\n\n{\\displaystyle K}\n\n pairs \n\n\n\n(\n\nt\n\nk\n\n\n,\n\nx\n\nk\n\n\n)\n\n\n{\\displaystyle (t_{k},x_{k})}\n\n, the amplitude pdf of white noise in Fourier space, depending on frequency and phase angle may be described in terms of three parameters, \n\n\n\n\nα\n\n0\n\n\n\n\n{\\displaystyle \\alpha _{0}}\n\n, \n\n\n\n\nβ\n\n0\n\n\n\n\n{\\displaystyle \\beta _{0}}\n\n, \n\n\n\n\nθ\n\n0\n\n\n\n\n{\\displaystyle \\theta _{0}}\n\n, defining the “sampling profile”, according to\nIn terms of the phase angle in Fourier space, \n\n\n\nθ\n\n\n{\\displaystyle \\theta }\n\n, with\nthe probability density of amplitudes is given by\nwhere the sock function is defined by\nand \n\n\n\n<\n\nx\n\n2\n\n\n>\n\n\n{\\displaystyle <x^{2}>}\n\n denotes the variance of the dependent variable \n\n\n\n\nx\n\nk\n\n\n\n\n{\\displaystyle x_{k}}\n\n.\nIntegration of the pdf yields the false-alarm probability that white noise in the time domain produces an amplitude of at least \n\n\n\nA\n\n\n{\\displaystyle A}\n\n,\nThe sig is defined as the negative logarithm of the false-alarm probability and evaluates to\nIt returns the number of random time series one would have to examine to obtain one amplitude exceeding \n\n\n\nA\n\n\n{\\displaystyle A}\n\n at the given frequency and phase.\nSigSpec is primarily used in asteroseismology to identify variable stars and to classify stellar pulsation (see references below). The fact that this method incorporates the properties of the time-domain sampling appropriately makes it a valuable tool for typical astronomical measurements containing data gaps.", 
    "dbpedia_url": "http://dbpedia.org/resource/SigSpec", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/SigSpec\n"
}