{
    "about": "Similarity search is the most general term used for a range of mechanisms which share the principle of searching (typically, very large) spaces of objects where the only available comparator is the similarity between any pair of objects. This is becoming increasingly important in an age of large information repositories where the objects contained do not possess any natural order, for example large collections of images, sounds and other sophisticated digital objects.", 
    "name": "Similarity Search", 
    "classification": "Search Algorithms", 
    "full_text": "Similarity search is the most general term used for a range of mechanisms which share the principle of searching (typically, very large) spaces of objects where the only available comparator is the similarity between any pair of objects. This is becoming increasingly important in an age of large information repositories where the objects contained do not possess any natural order, for example large collections of images, sounds and other sophisticated digital objects.\nNearest neighbor search and range queries are important subclasses of similarity search, and a number of solutions exist. Research in Similarity Search is dominated by the inherent problems of searching over complex objects. Such objects cause most known techniques to lose traction over large collections, and there are still many unsolved problems. Unfortunately, in many cases where similarity search is necessary, the objects are inherently complex.\nThe most general approach to similarity search that allows construction of efficient index structures use the mathematical notion of metric space.\nA popular approach for similarity search is locality sensitive hashing – LSH.[1] hashes input items so that similar items map to the same \"buckets\" in memory with high probability (the number of buckets being much smaller than the universe of possible input items). It is often applied in nearest neighbor search on large scale high-dimensional data, e.g., image databases, document collections, time-series databases, and genome databases.[2]\n\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Similarity_search", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Similarity_search\n"
}