{
    "about": "In numerical analysis, Simpson's rule is a method for numerical integration, the numerical approximation of definite integrals. Specifically, it is the following approximation:", 
    "name": "Simpson'S Rule", 
    "classification": "Numerical Analysis", 
    "full_text": "In numerical analysis, Simpson's rule is a method for numerical integration, the numerical approximation of definite integrals. Specifically, it is the following approximation:\nfor points that are equally spaced. For unequally spaced points, please see Cartwright.[1]\nSimpson's rule also corresponds to the three-point Newton-Cotes quadrature rule.\nThe method is credited to the mathematician Thomas Simpson (1710–1761) of Leicestershire, England. Kepler used similar formulas over 100 years prior. For this reason the method is sometimes called Kepler's rule, or Keplersche Fassregel in German.\n\n\nSimpson's rule can be derived in various ways.\nOne derivation replaces the integrand \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n by the quadratic polynomial (i.e. parabola)\n\n\n\nP\n(\nx\n)\n\n\n{\\displaystyle P(x)}\n\n which takes the same values as \n\n\n\nf\n(\nx\n)\n\n\n{\\displaystyle f(x)}\n\n at the end points a and b and the midpoint m = (a + b) / 2. One can use Lagrange polynomial interpolation to find an expression for this polynomial,\nAn easy (albeit tedious) integration by substitution shows that\nThis calculation can be carried out more easily if one first observes that (by scaling) there is no loss of generality in assuming that \n\n\n\na\n=\n−\n1\n\n\n{\\displaystyle a=-1}\n\n and \n\n\n\nb\n=\n1\n\n\n{\\displaystyle b=1}\n\n.\nAnother derivation constructs Simpson's rule from two simpler approximations: the midpoint rule\nand the trapezoidal rule\nThe errors in these approximations are\nrespectively, where \n\n\n\nO\n(\n(\nb\n−\na\n\n)\n\n4\n\n\n)\n\n\n{\\displaystyle O((b-a)^{4})}\n\n denotes a term asymptotically proportional to \n\n\n\n(\nb\n−\na\n\n)\n\n4\n\n\n\n\n{\\displaystyle (b-a)^{4}}\n\n. The two \n\n\n\nO\n(\n(\nb\n−\na\n\n)\n\n4\n\n\n)\n\n\n{\\displaystyle O((b-a)^{4})}\n\n terms are not equal; see Big O notation for more details. It follows from the above formulas for the errors of the midpoint and trapezoidal rule that the leading error term vanishes if we take the weighted average\nThis weighted average is exactly Simpson's rule.\nUsing another approximation (for example, the trapezoidal rule with twice as many points), it is possible to take a suitable weighted average and eliminate another error term. This is Romberg's method.\nThe third derivation starts from the ansatz\nThe coefficients α, β and γ can be fixed by requiring that this approximation be exact for all quadratic polynomials. This yields Simpson's rule.\nThe error in approximating an integral by Simpson's rule is\nwhere \n\n\n\nξ\n\n\n{\\displaystyle \\xi }\n\n is some number between \n\n\n\na\n\n\n{\\displaystyle a}\n\n and \n\n\n\nb\n\n\n{\\displaystyle b}\n\n.[3]\nThe error is asymptotically proportional to \n\n\n\n(\nb\n−\na\n\n)\n\n5\n\n\n\n\n{\\displaystyle (b-a)^{5}}\n\n. However, the above derivations suggest an error proportional to \n\n\n\n(\nb\n−\na\n\n)\n\n4\n\n\n\n\n{\\displaystyle (b-a)^{4}}\n\n. Simpson's rule gains an extra order because the points at which the integrand is evaluated are distributed symmetrically in the interval [a, b].\nSince the error term is proportional to the fourth derivative of f at \n\n\n\nξ\n\n\n{\\displaystyle \\xi }\n\n, this shows that Simpson's rule provides exact results for any polynomial f of degree three or less, since the fourth derivative of such a polynomial is zero at all points.\nIf the interval of integration \n\n\n\n[\na\n,\nb\n]\n\n\n{\\displaystyle [a,b]}\n\n is in some sense \"small\", then Simpson's rule will provide an adequate approximation to the exact integral. By small, what we really mean is that the function being integrated is relatively smooth over the interval \n\n\n\n[\na\n,\nb\n]\n\n\n{\\displaystyle [a,b]}\n\n. For such a function, a smooth quadratic interpolant like the one used in Simpson's rule will give good results.\nHowever, it is often the case that the function we are trying to integrate is not smooth over the interval. Typically, this means that either the function is highly oscillatory, or it lacks derivatives at certain points. In these cases, Simpson's rule may give very poor results. One common way of handling this problem is by breaking up the interval \n\n\n\n[\na\n,\nb\n]\n\n\n{\\displaystyle [a,b]}\n\n into a number of small subintervals. Simpson's rule is then applied to each subinterval, with the results being summed to produce an approximation for the integral over the entire interval. This sort of approach is termed the composite Simpson's rule.\nSuppose that the interval \n\n\n\n[\na\n,\nb\n]\n\n\n{\\displaystyle [a,b]}\n\n is split up into \n\n\n\nn\n\n\n{\\displaystyle n}\n\n subintervals, with \n\n\n\nn\n\n\n{\\displaystyle n}\n\n an even number. Then, the composite Simpson's rule is given by\nwhere \n\n\n\n\nx\n\nj\n\n\n=\na\n+\nj\nh\n\n\n{\\displaystyle x_{j}=a+jh}\n\n for \n\n\n\nj\n=\n0\n,\n1\n,\n.\n.\n.\n,\nn\n−\n1\n,\nn\n\n\n{\\displaystyle j=0,1,...,n-1,n}\n\n with \n\n\n\nh\n=\n(\nb\n−\na\n)\n\n/\n\nn\n\n\n{\\displaystyle h=(b-a)/n}\n\n; in particular, \n\n\n\n\nx\n\n0\n\n\n=\na\n\n\n{\\displaystyle x_{0}=a}\n\n and \n\n\n\n\nx\n\nn\n\n\n=\nb\n\n\n{\\displaystyle x_{n}=b}\n\n. This composite rule with \n\n\n\nn\n=\n2\n\n\n{\\displaystyle n=2}\n\n corresponds with the regular Simpson's Rule of the preceding section. The above formula can also be written as\nThe error committed by the composite Simpson's rule is bounded (in absolute value) by\nwhere \n\n\n\nh\n\n\n{\\displaystyle h}\n\n is the \"step length\", given by \n\n\n\nh\n=\n(\nb\n−\na\n)\n\n/\n\nn\n.\n\n\n{\\displaystyle h=(b-a)/n.}\n\n[4]\nThis formulation splits the interval \n\n\n\n[\na\n,\nb\n]\n\n\n{\\displaystyle [a,b]}\n\n in subintervals of equal length. In practice, it is often advantageous to use subintervals of different lengths, and concentrate the efforts on the places where the integrand is less well-behaved. This leads to the adaptive Simpson's method.\nThis is another formulation of a composite Simpson's rule: instead of applying Simpson's rule to disjoint segments of the integral to be approximated, Simpson's rule is applied to overlapping segments, yielding:[5]\nThe formula above is obtained by combining the original composite Simpson's rule with the one consisting in using Simpson's 3/8 rule in the extreme subintervals and the standard 3-point rule in the remaining subintervals. The result is then obtained by taking the mean of the two formulas.\nSimpson's 3/8 rule is another method for numerical integration proposed by Thomas Simpson. It is based upon a cubic interpolation rather than a quadratic interpolation. Simpson's 3/8 rule is as follows:\nwhere b - a = 3h. The error of this method is:\nwhere \n\n\n\nξ\n\n\n{\\displaystyle \\xi }\n\n is some number between \n\n\n\na\n\n\n{\\displaystyle a}\n\n and \n\n\n\nb\n\n\n{\\displaystyle b}\n\n. Thus, the 3/8 rule is about twice as accurate as the standard method, but it uses one more function value. A composite 3/8 rule also exists, similarly as above.[6]\nA further generalization of this concept for interpolation with arbitrary degree polynomials are the Newton–Cotes formulas.\nDefining,\nwe have\nNote, we can only use this if \n\n\n\nn\n\n\n{\\displaystyle n}\n\n is a multiple of three.\nA simplified version of Simpson's rules is used in naval architecture. The 3/8th rule is also called Simpson's Second Rule.\nAn implementation of the composite Simpson's rule in Python:\nNote that this function is available in SciPy as scipy.integrate.simps.\nThis article incorporates material from Code for Simpson's rule on PlanetMath, which is licensed under the Creative Commons Attribution/Share-Alike License.", 
    "dbpedia_url": "http://dbpedia.org/resource/Simpson's_rule", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Simpson's_rule\n"
}