{
    "about": "The power spectrum \n\n\n\n\nS\n\nx\nx\n\n\n(\nf\n)\n\n\n{\\displaystyle S_{xx}(f)}\n\n of a time series \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n describes the distribution of power into frequency components composing that signal. According to Fourier analysis any physical signal can be decomposed into a number of discrete frequencies, or a spectrum of frequencies over a continuous range. The statistical average of a certain signal or sort of signal (including noise) as analyzed in terms of its frequency content, is called its spectrum.", 
    "name": "Spectral Density", 
    "classification": "Signal Processing", 
    "full_text": "The power spectrum \n\n\n\n\nS\n\nx\nx\n\n\n(\nf\n)\n\n\n{\\displaystyle S_{xx}(f)}\n\n of a time series \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n describes the distribution of power into frequency components composing that signal. According to Fourier analysis any physical signal can be decomposed into a number of discrete frequencies, or a spectrum of frequencies over a continuous range. The statistical average of a certain signal or sort of signal (including noise) as analyzed in terms of its frequency content, is called its spectrum.\nWhen the energy of the signal is concentrated around a finite time interval, especially if its total energy is finite, one may compute the energy spectral density. More commonly used is the power spectral density (or simply power spectrum), which applies to signals existing over all time, or over a time period large enough (especially in relation to the duration of a measurement) that it could as well have been over an infinite time interval. The power spectral density (PSD) then refers to the spectral energy distribution that would be found per unit time, since the total energy of such a signal over all time would generally be infinite. Summation or integration of the spectral components yields the total power (for a physical process) or variance (in a statistical process), identical to what would be obtained by integrating \n\n\n\n\nx\n\n2\n\n\n(\nt\n)\n\n\n{\\displaystyle x^{2}(t)}\n\n over the time domain, as dictated by Parseval's theorem.\nThe spectrum of a physical process \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n often contains essential information about the nature of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n. For instance, the pitch and timbre of a musical instrument are immediately determined from a spectral analysis. The color of a light source is determined by the spectrum of the electromagnetic wave's electric field \n\n\n\nE\n(\nt\n)\n\n\n{\\displaystyle E(t)}\n\n as it fluctuates at an extremely high frequency. Obtaining a spectrum from time series such as these involves the Fourier transform, and generalizations based on Fourier analysis. In many cases the time domain is not specifically employed in practice, such as when a dispersive prism is used to obtain a spectrum of light in a spectrograph, or when a sound is perceived through its effect on the auditory receptors of the inner ear, each of which is sensitive to a particular frequency.\nHowever this article concentrates on situations in which the time series is known (at least in a statistical sense) or directly measured (such as by a microphone sampled by a computer). The power spectrum is important in statistical signal processing and in the statistical study of stochastic processes, as well as in many other branches of physics and engineering. Typically the process is a function of time but one can similarly discuss data in the spatial domain being decomposed in terms of spatial frequency.\n\n\nAny signal that can be represented as an amplitude that varies in time has a corresponding frequency spectrum. This includes familiar entities such as visible light (perceived as color), musical notes (perceived as pitch), radio/TV (specified by their frequency, or sometimes wavelength) and even the regular rotation of the earth. When these signals are viewed in the form of a frequency spectrum, certain aspects of the received signals or the underlying processes producing them are revealed. In some cases the frequency spectrum may include a distinct peak corresponding to a sine wave component. And additionally there may be peaks corresponding to harmonics of a fundamental peak, indicating a periodic signal which is not simply sinusoidal. Or a continuous spectrum may show narrow frequency intervals which are strongly enhanced corresponding to resonances, or frequency intervals containing almost zero power as would be produced by a notch filter.\nIn physics, the signal might be a wave, such as an electromagnetic wave, an acoustic wave, or the vibration of a mechanism. The power spectral density (PSD) of the signal describes the power present in the signal as a function of frequency, per unit frequency. Power spectral density is commonly expressed in watts per hertz (W/Hz).[1]\nWhen a signal is defined in terms only of a voltage, for instance, there is no unique power associated with the stated amplitude. In this case \"power\" is simply reckoned in terms of the square of the signal, as this would always be proportional to the actual power delivered by that signal into a given impedance. So one might use units of V2 Hz−1 for the PSD and V2 s Hz−1 for the ESD (energy spectral density)[2] even though no actual \"power\" or \"energy\" is specified.\nSometimes one encounters an amplitude spectral density (ASD), which is the square root of the PSD; the ASD of a voltage signal has units of V Hz−1/2.[3] This is useful when the shape of the spectrum is rather constant, since variations in the ASD will then be proportional to variations in the signal's voltage level itself. But it is mathematically preferred to use the PSD, since only in that case is the area under the curve meaningful in terms of actual power over all frequency or over a specified bandwidth.\nFor random vibration analysis, units of g2 Hz−1 are frequently used for the PSD of acceleration. Here g denotes the g-force.[4]\nMathematically it is not necessary to assign physical dimensions to the signal or to the independent variable. In the following discussion the meaning of x(t) will remain unspecified, but the independent variable will be assumed to be that of time.\nEnergy spectral density describes how the energy of a signal or a time series is distributed with frequency. Here, the term energy is used in the generalized sense of signal processing;[5] that is, the energy \n\n\n\nE\n\n\n{\\displaystyle E}\n\n of a signal \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n is\nThe energy spectral density is most suitable for transients—that is, pulse-like signals—having a finite total energy. In this case, Parseval's theorem [6] gives us an alternate expression for the energy of the signal:\nwhere\nis the Fourier transform transform of the signal and \n\n\n\nf\n\n\n{\\displaystyle f}\n\n is the frequency in Hz, i.e., cycles per second. Often used is the angular frequency \n\n\n\nω\n=\n2\nπ\nf\n\n\n{\\displaystyle \\omega =2\\pi f}\n\n. Since the integral on the right-hand side is the energy of the signal, the integrand \n\n\n\n\n\n|\n\n\n\nx\n^\n\n\n\n(\nf\n)\n|\n\n\n2\n\n\n\n\n{\\displaystyle \\left|{\\hat {x}}(f)\\right|^{2}}\n\n can be interpreted as a density function describing the energy per unit frequency contained in the signal at the frequency \n\n\n\nf\n\n\n{\\displaystyle f}\n\n. In light of this, the energy spectral density of a signal \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n is defined as[6]\nAs a physical example of how one might measure the energy spectral density of a signal, suppose \n\n\n\nV\n(\nt\n)\n\n\n{\\displaystyle V(t)}\n\n represents the potential (in volts) of an electrical pulse propagating along a transmission line of impedance \n\n\n\nZ\n\n\n{\\displaystyle Z}\n\n, and suppose the line is terminated with a matched resistor (so that all of the pulse energy is delivered to the resistor and none is reflected back). By Ohm's law, the power delivered to the resistor at time \n\n\n\nt\n\n\n{\\displaystyle t}\n\n is equal to \n\n\n\nV\n(\nt\n\n)\n\n2\n\n\n\n/\n\nZ\n\n\n{\\displaystyle V(t)^{2}/Z}\n\n, so the total energy is found by integrating \n\n\n\nV\n(\nt\n\n)\n\n2\n\n\n\n/\n\nZ\n\n\n{\\displaystyle V(t)^{2}/Z}\n\n with respect to time over the duration of the pulse. To find the value of the energy spectral density \n\n\n\n\nS\n\nx\nx\n\n\n(\nf\n)\n\n\n{\\displaystyle S_{xx}(f)}\n\n at frequency \n\n\n\nf\n\n\n{\\displaystyle f}\n\n, one could insert between the transmission line and the resistor a bandpass filter which passes only a narrow range of frequencies (\n\n\n\nΔ\nf\n\n\n{\\displaystyle \\Delta f}\n\n, say) near the frequency of interest and then measure the total energy \n\n\n\nE\n(\nf\n)\n\n\n{\\displaystyle E(f)}\n\n dissipated across the resistor. The value of the energy spectral density at \n\n\n\nf\n\n\n{\\displaystyle f}\n\n is then estimated to be \n\n\n\nE\n(\nf\n)\n\n/\n\nΔ\nf\n\n\n{\\displaystyle E(f)/\\Delta f}\n\n. In this example, since the power \n\n\n\nV\n(\nt\n\n)\n\n2\n\n\n\n/\n\nZ\n\n\n{\\displaystyle V(t)^{2}/Z}\n\n has units of V2 Ω−1, the energy \n\n\n\nE\n(\nf\n)\n\n\n{\\displaystyle E(f)}\n\n has units of V2 s Ω−1 = J, and hence the estimate \n\n\n\nE\n(\nf\n)\n\n/\n\nΔ\nf\n\n\n{\\displaystyle E(f)/\\Delta f}\n\n of the energy spectral density has units of J Hz−1, as required. In many situations, it is common to forgo the step of dividing by \n\n\n\nZ\n\n\n{\\displaystyle Z}\n\n so that the energy spectral density instead has units of V2 s Hz−1.\nThis definition generalizes in a straightforward manner to a discrete signal with an infinite number of values \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n such as a signal sampled at discrete times \n\n\n\n\nx\n\nn\n\n\n=\nx\n(\nn\nΔ\nt\n)\n\n\n{\\displaystyle x_{n}=x(n\\Delta t)}\n\n:\nwhere \n\n\n\n\n\n\n\nx\n^\n\n\n\n\nd\n\n\n(\nf\n)\n\n\n{\\displaystyle {\\hat {x}}_{d}(f)}\n\n is the discrete Fourier transform of \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n and \n\n\n\n\n\n\n\nx\n^\n\n\n\n\nd\n\n\n∗\n\n\n(\nf\n)\n\n\n{\\displaystyle {\\hat {x}}_{d}^{*}(f)}\n\n is the complex conjugate of \n\n\n\n\n\n\n\nx\n^\n\n\n\n\nd\n\n\n(\nf\n)\n.\n\n\n{\\displaystyle {\\hat {x}}_{d}(f).}\n\n The sampling interval \n\n\n\nΔ\nt\n\n\n{\\displaystyle \\Delta t}\n\n is needed to keep the correct physical units and to ensure that we recover the continuous case in the limit \n\n\n\nΔ\nt\n→\n0\n\n\n{\\displaystyle \\Delta t\\to 0}\n\n; however, in the mathematical sciences, the interval is often set to 1.\nThe above definition of energy spectral density is suitable for transients (pulse-like signals) whose energy is concentrated around one time window; then the Fourier transforms of the signals generally exist. For continuous signals over all time, such as stationary processes, one must rather define the power spectral density (PSD); this describes how power of a signal or time series is distributed over frequency, as in the simple example given previously. Here, power can be the actual physical power, or more often, for convenience with abstract signals, is simply identified with the squared value of the signal. For example, statisticians study the variance of a function over time \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n (or over another independent variable), and using an analogy with electrical signals (among other physical processes), it is customary to refer to it as the power spectrum even when there is no physical power involved. If one were to create a physical voltage source which followed \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n and applied it to the terminals of a 1 ohm resistor, then indeed the instantaneous power dissipated in that resistor would be given by x2 watts.\nThe average power P of a signal \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n over all time is therefore given by the following time average:\nNote that a stationary process, for instance, may have a finite power but an infinite energy. After all, energy is the integral of power, and the stationary signal continues over an infinite time. That is the reason that we cannot use the energy spectral density as defined above in such cases.\nIn analyzing the frequency content of the signal \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n, one might like to compute the ordinary Fourier transform \n\n\n\n\n\n\nx\n^\n\n\n\n(\nω\n)\n\n\n{\\displaystyle {\\hat {x}}(\\omega )}\n\n; however, for many signals of interest the Fourier transform does not formally exist.[N 1] Because of this complication one can as well work with a truncated Fourier transform \n\n\n\n\n\n\n\nx\n^\n\n\n\n\nT\n\n\n(\nω\n)\n\n\n{\\displaystyle {\\hat {x}}_{T}(\\omega )}\n\n, where the signal is integrated only over a finite interval [0, T]:\nThen the power spectral density can be defined as[8][9]\nHere E denotes the expected value; explicitly, we have[9]\nIn the latter form (for a stationary random process), one can make the change of variables \n\n\n\nΔ\nt\n=\nt\n−\n\nt\n′\n\n\n\n{\\displaystyle \\Delta t=t-t'}\n\n and with the limits of integration (rather than [0,T]) approaching infinity, the resulting power spectral density \n\n\n\n\nS\n\nx\nx\n\n\n(\nω\n)\n\n\n{\\displaystyle S_{xx}(\\omega )}\n\n and the autocorrelation function of this signal are seen to be Fourier transform pairs (Wiener–Khinchin theorem). The autocorrelation function is a statistic defined as\nor more generally as\nin the case that X(t) is complex-valued. Provided that \n\n\n\nγ\n(\nτ\n)\n\n\n{\\displaystyle \\gamma (\\tau )}\n\n is absolutely integrable (which is not always true)[10],\nMany authors use this equality to actually define the power spectral density.[11]\nThe power of the signal in a given frequency band \n\n\n\n[\n\nf\n\n1\n\n\n,\n\nf\n\n2\n\n\n]\n\n\n{\\displaystyle [f_{1},f_{2}]}\n\n (or \n\n\n\n[\n\nω\n\n1\n\n\n,\n\nω\n\n2\n\n\n]\n\n\n{\\displaystyle [\\omega _{1},\\omega _{2}]}\n\n) can be calculated by integrating over frequency. Since \n\n\n\n\nS\n\nx\nx\n\n\n(\n−\nω\n)\n=\n\nS\n\nx\nx\n\n\n(\nω\n)\n\n\n{\\displaystyle S_{xx}(-\\omega )=S_{xx}(\\omega )}\n\n, an equal amount of power can be attributed to positive and negative frequencies, which accounts for the factor of 2 in the following form (such trivial factors dependent on conventions used):\nMore generally, similar techniques may be used to estimate a time-varying spectral density. In this case the truncated Fourier transform defined above over the finite time interval (0, T) is not evaluated in the limit of T approaching infinity. This results in decreased spectral coverage and resolution since frequencies of less than 1/T are not sampled, and results at frequencies which are not an integer multiple of 1/T are not independent. Just using a single such time series, the estimated power spectrum will be very \"noisy\", however this can be alleviated if it is possible to evaluate the expected value (in the above equation) using a large (or infinite) number of short-term spectra corresponding to statistical ensembles of realizations of x(t) evaluated over the specified time window.\nThis definition of the power spectral density can be generalized to discrete time variables \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n. As above we can consider a finite window of \n\n\n\n1\n≤\nn\n≤\nN\n\n\n{\\displaystyle 1\\leq n\\leq N}\n\n with the signal sampled at discrete times \n\n\n\n\nx\n\nn\n\n\n=\nx\n(\nn\nΔ\nt\n)\n\n\n{\\displaystyle x_{n}=x(n\\Delta t)}\n\n for a total measurement period \n\n\n\nT\n=\nN\nΔ\nt\n\n\n{\\displaystyle T=N\\Delta t}\n\n. Then a single estimate of the PSD can be obtained through summation rather than integration:\nAs before, the actual PSD is achieved when N (and thus T) approach infinity and the expected value is formally applied. In a real-world application, one would typically average this single-measurement PSD over many trials to obtain a more accurate estimate of the theoretical PSD of the physical process underlying the individual measurements. This computed PSD is sometimes called a periodogram. This periodogram converges to the true PSD as the number of estimates as well as the averaging time interval T approach infinity (Brown & Hwang[12]).\nIf two signals both possess power spectral densities, then the #Cross-spectral density can similarly be calculated; as the PSD is related to the autocorrelation, so is the cross-spectral density related to the cross-correlation.\nSome properties of the PSD include:[13]\nThe integrated spectrum or power spectral distribution \n\n\n\nF\n(\nω\n)\n\n\n{\\displaystyle F(\\omega )}\n\n is defined as[dubious – discuss][14]\nGiven two signals \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n and \n\n\n\ny\n(\nt\n)\n\n\n{\\displaystyle y(t)}\n\n, each of which possess power spectral densities \n\n\n\n\nS\n\nx\nx\n\n\n(\nω\n)\n\n\n{\\displaystyle S_{xx}(\\omega )}\n\n and \n\n\n\n\nS\n\ny\ny\n\n\n(\nω\n)\n\n\n{\\displaystyle S_{yy}(\\omega )}\n\n, it is possible to define a cross-spectral density (CSD) given by\nThe cross-spectral density (or 'cross power spectrum') is thus the Fourier transform of the cross-correlation function.\nwhere \n\n\n\n\nR\n\nx\ny\n\n\n(\nt\n)\n\n\n{\\displaystyle R_{xy}(t)}\n\n is the cross-correlation of \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n and \n\n\n\ny\n(\nt\n)\n\n\n{\\displaystyle y(t)}\n\n.\nBy an extension of the Wiener–Khinchin theorem, the Fourier transform of the cross-spectral density \n\n\n\n\nS\n\nx\ny\n\n\n(\nω\n)\n\n\n{\\displaystyle S_{xy}(\\omega )}\n\n is the cross-covariance function.[15] In light of this, the PSD is seen to be a special case of the CSD for \n\n\n\nx\n(\nt\n)\n=\ny\n(\nt\n)\n\n\n{\\displaystyle x(t)=y(t)}\n\n.\nFor discrete signals xn and yn, the relationship between the cross-spectral density and the cross-covariance is\nThe goal of spectral density estimation is to estimate the spectral density of a random signal from a sequence of time samples. Depending on what is known about the signal, estimation techniques can involve parametric or non-parametric approaches, and may be based on time-domain or frequency-domain analysis. For example, a common parametric technique involves fitting the observations to an autoregressive model. A common non-parametric technique is the periodogram.\nThe spectral density is usually estimated using Fourier transform methods (such as the Welch method), but other techniques such as the maximum entropy method can also be used.\nThe concept and use of the power spectrum of a signal is fundamental in electrical engineering, especially in electronic communication systems, including radio communications, radars, and related systems, plus passive remote sensing technology. Electronic instruments called spectrum analyzers are used to observe and measure the power spectra of signals.\nThe spectrum analyzer measures the magnitude of the short-time Fourier transform (STFT) of an input signal. If the signal being analyzed can be considered a stationary process, the STFT is a good smoothed estimate of its power spectral density.\nPrimordial fluctuations, density variations in the early universe, are quantified by a power spectrum which gives the power of the variations as a function of spatial scale.", 
    "dbpedia_url": "http://dbpedia.org/resource/Spectral_density", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Spectral_density\n"
}