{
    "about": "Spectrum continuation analysis (SCA) is a generalization of the concept of Fourier series to non-periodic functions of which only a fragment has been sampled in the time domain.", 
    "name": "Spectrum Continuation Analysis", 
    "classification": "Digital Signal Processing", 
    "full_text": "Spectrum continuation analysis (SCA) is a generalization of the concept of Fourier series to non-periodic functions of which only a fragment has been sampled in the time domain.\nRecall that a Fourier series is only suitable to the analysis of periodic (or finite-domain) functions f(x) with period 2π. It can be expressed as an infinite series of sinusoids:\nwhere \n\n\n\n\nF\n\nn\n\n\n\n\n{\\displaystyle F_{n}}\n\n is the amplitude of the individual harmonics.\nIn SCA however, one decomposes the spectrum into optimized discrete frequencies. As a consequence, and as the period of the sampled function is supposed to be infinite or not yet known, each of the discrete periodic functions that compose the sampled function fragment can not be considered to be a multiple of the fundamental frequency:\nAs such, SCA does not necessarily deliver \n\n\n\n2\nπ\n\n\n{\\displaystyle 2\\pi }\n\n periodic functions, as would have been the case in Fourier analysis. For real-valued functions, the SCA series can be written as:\nwhere An and Bn are the series amplitudes. The amplitudes can only be solved if the series of values \n\n\n\n\nω\n\nn\n\n\n\n\n{\\displaystyle \\omega _{n}}\n\n is previously optimized for a desired objective function (usually least residuals). \n\n\n\nC\n(\nx\n)\n\n\n{\\displaystyle C(x)}\n\n is not necessarily the average value over the sampled interval: one might prefer to include predominant information on the behavior of the offset value in the time domain.\nSCA deals with the prediction problem of continuing a frequency spectrum beyond a sampled (usually stochastic) time series fragment. Unlike ordinary Fourier analysis that infinitely repeats an observed function period or time domain, SCA filters the exact composing frequencies out of the observed spectrum and let them continue (resp. precede) in the time domain. In the scientific terminology, therefore preference is given to the term continuation rather than for instance extrapolation.\nAn algorithm is required to cope with several problems: detrending, decomposition, frequency resolution optimization, superposition, transformation and computational efficiency.\nSince discrete Fourier transform is inherently related to Fourier analysis, this type of spectral analysis is by definition not suitable for spectrum decomposition in SCA. DFT (or FFT) may provide however an initial approximation, which often speeds up the decomposition.\nAfter decomposition of a discrete frequency, it should be filtered for optimal resolution (i.e. varying three parameters: frequency value, amplitude and phase).\nCompared to DFT (or FFT), which is characterized by perfect spectral resolution, but poor temporal information, SCA favours temporal information, but yields higher spectrum dispersion. This property shows where the analytic strength of SCA is located. For instance, discrete composing frequency resolution is by definition far better in SCA than in DFT.", 
    "dbpedia_url": "http://dbpedia.org/resource/Spectrum_continuation_analysis", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Spectrum_continuation_analysis\n"
}