{
    "about": "In statistical signal processing, the goal of spectral density estimation (SDE) is to estimate the spectral density (also known as the power spectral density) of a random signal from a sequence of time samples of the signal. Intuitively speaking, the spectral density characterizes the frequency content of the signal. One purpose of estimating the spectral density is to detect any periodicities in the data, by observing peaks at the frequencies corresponding to these periodicities.", 
    "name": "Spectral Density Estimation", 
    "classification": "Signal Processing", 
    "full_text": "In statistical signal processing, the goal of spectral density estimation (SDE) is to estimate the spectral density (also known as the power spectral density) of a random signal from a sequence of time samples of the signal. Intuitively speaking, the spectral density characterizes the frequency content of the signal. One purpose of estimating the spectral density is to detect any periodicities in the data, by observing peaks at the frequencies corresponding to these periodicities.\nSome SDE techniques assume that a signal is composed of a limited (usually small) number of generating frequencies plus noise and seek to find the location and intensity of the generated frequencies. Others make no assumption on the number of components and seek to estimate the whole generating spectrum.\n\n\nSpectrum analysis, also referred to as frequency domain analysis or spectral density estimation, is the technical process of decomposing a complex signal into simpler parts. As described above, many physical processes are best described as a sum of many individual frequency components. Any process that quantifies the various amounts (e.g. amplitudes, powers, intensities, or phases), versus frequency can be called spectrum analysis.\nSpectrum analysis can be performed on the entire signal. Alternatively, a signal can be broken into short segments (sometimes called frames), and spectrum analysis may be applied to these individual segments. Periodic functions (such as \n\n\n\nsin\n⁡\n(\nt\n)\n\n\n{\\displaystyle \\sin(t)}\n\n) are particularly well-suited for this sub-division. General mathematical techniques for analyzing non-periodic functions fall into the category of Fourier analysis.\nThe Fourier transform of a function produces a frequency spectrum which contains all of the information about the original signal, but in a different form. This means that the original function can be completely reconstructed (synthesized) by an inverse Fourier transform. For perfect reconstruction, the spectrum analyzer must preserve both the amplitude and phase of each frequency component. These two pieces of information can be represented as a 2-dimensional vector, as a complex number, or as magnitude (amplitude) and phase in polar coordinates (i.e., as a phasor). A common technique in signal processing is to consider the squared amplitude, or power; in this case the resulting plot is referred to as a power spectrum.\nBecause of reversibility, the Fourier transform is called a representation of the function, in terms of frequency instead of time; thus, it is a frequency domain representation. Linear operations that could be performed in the time domain have counterparts that can often be performed more easily in the frequency domain. Frequency analysis also simplifies the understanding and interpretation of the effects of various time-domain operations, both linear and non-linear. For instance, only non-linear or time-variant operations can create new frequencies in the frequency spectrum.\nIn practice, nearly all software and electronic devices that generate frequency spectra utilize a discrete Fourier transform (DFT), which operates on samples of the signal, and which provides a mathematical approximation to the full integral solution. The DFT is almost invariably implemented by an efficient algorithm called fast Fourier transform (FFT). The squared-magnitude components of a DFT are a type of power spectrum called periodogram, which is widely used for examining the frequency characteristics of noise-free functions such as filter impulse responses and window functions. But the periodogram does not provide processing-gain when applied to noiselike signals or even sinusoids at low signal-to-noise ratios. In other words, the variance of its spectral estimate at a given frequency does not decrease as the number of samples used in the computation increases. This can be mitigated by averaging over time (Welch's method[1])  or over frequency (smoothing). Welch's method is widely used for SDE. However, periodogram-based techniques introduce small biases that are unacceptable in some applications. So other alternatives are presented in the next section.\nMany other techniques for spectral estimation have been developed to mitigate the disadvantages of the basic periodogram. These techniques can generally be divided into non-parametric and parametric methods. The non-parametric approaches explicitly estimate the covariance or the spectrum of the process without assuming that the process has any particular structure. Some of the most common estimators in use for basic applications (e.g. Welch's method) are non-parametric estimators closely related to the periodogram. By contrast, the parametric approaches assume that the underlying stationary stochastic process has a certain structure that can be described using a small number of parameters (for example, using an auto-regressive or moving average model). In these approaches, the task is to estimate the parameters of the model that describes the stochastic process.\nFollowing is a partial list of non-parametric spectral density estimation techniques:\nBelow is a partial list of parametric techniques:\nIn parametric spectral estimation, one assumes that the signal is modeled by a stationary process which has a spectral density function (SDF) \n\n\n\nS\n(\nf\n;\n\na\n\n1\n\n\n,\n…\n,\n\na\n\np\n\n\n)\n\n\n{\\displaystyle S(f;a_{1},\\ldots ,a_{p})}\n\n that is a function of the frequency \n\n\n\nf\n\n\n{\\displaystyle f}\n\n and \n\n\n\np\n\n\n{\\displaystyle p}\n\n parameters \n\n\n\n\na\n\n1\n\n\n,\n…\n,\n\na\n\np\n\n\n\n\n{\\displaystyle a_{1},\\ldots ,a_{p}}\n\n.[2] The estimation problem then becomes one of estimating these parameters.\nThe most common form of parametric SDF estimate uses as a model an autoregressive model \n\n\n\nA\nR\n(\np\n)\n\n\n{\\displaystyle AR(p)}\n\n of order \n\n\n\np\n\n\n{\\displaystyle p}\n\n.[2]:392 A signal sequence \n\n\n\n{\n\nY\n\nt\n\n\n}\n\n\n{\\displaystyle \\{Y_{t}\\}}\n\n obeying a zero mean \n\n\n\nA\nR\n(\np\n)\n\n\n{\\displaystyle AR(p)}\n\n process satisfies the equation\nwhere the \n\n\n\n\nϕ\n\n1\n\n\n,\n…\n,\n\nϕ\n\np\n\n\n\n\n{\\displaystyle \\phi _{1},\\ldots ,\\phi _{p}}\n\n are fixed coefficients and \n\n\n\n\nϵ\n\nt\n\n\n\n\n{\\displaystyle \\epsilon _{t}}\n\n is a white noise process with zero mean and innovation variance \n\n\n\n\nσ\n\np\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{p}^{2}}\n\n. The SDF for this process is\nwith \n\n\n\nΔ\nt\n\n\n{\\displaystyle \\Delta t}\n\n the sampling time interval and \n\n\n\n\nf\n\nN\n\n\n\n\n{\\displaystyle f_{N}}\n\n the Nyquist frequency.\nThere are a number of approaches to estimating the parameters \n\n\n\n\nϕ\n\n1\n\n\n,\n…\n,\n\nϕ\n\np\n\n\n,\n\nσ\n\np\n\n\n2\n\n\n\n\n{\\displaystyle \\phi _{1},\\ldots ,\\phi _{p},\\sigma _{p}^{2}}\n\n of the \n\n\n\nA\nR\n(\np\n)\n\n\n{\\displaystyle AR(p)}\n\n process and thus the spectral density:[2]:452-453\nAlternative parametric methods include fitting to a moving average model (MA) and to a full autoregressive moving average model (ARMA).\nFrequency estimation is the process of estimating the complex frequency components of a signal in the presence of noise given assumptions about the number of the components.[4] This contrasts with the general methods above, which do not make prior assumptions about the components.\nA typical model for a signal \n\n\n\nx\n(\nn\n)\n\n\n{\\displaystyle x(n)}\n\n consists of a sum of \n\n\n\np\n\n\n{\\displaystyle p}\n\n complex exponentials in the presence of white noise, \n\n\n\nw\n(\nn\n)\n\n\n{\\displaystyle w(n)}\n\n\nThe power spectral density of \n\n\n\nx\n(\nn\n)\n\n\n{\\displaystyle x(n)}\n\n is composed of \n\n\n\np\n\n\n{\\displaystyle p}\n\n impulse functions in addition to the spectral density function due to noise.\nThe most common methods for frequency estimation involve identifying the noise subspace to extract these components. These methods are based on eigen decomposition of the autocorrelation matrix into a signal subspace and a noise subspace. After these subspaces are identified, a frequency estimation function is used to find the component frequencies from the noise subspace. The most popular methods of noise subspace based frequency estimation are Pisarenko's method, the multiple signal classification (MUSIC) method, the eigenvector method, and the minimum norm method.\nIf one only wants to estimate the single loudest frequency, one can use a pitch detection algorithm. If the dominant frequency changes over time, then the problem becomes the estimation of the instantaneous frequency as defined in the time–frequency representation. Methods for instantaneous frequency estimation include those based on the Wigner-Ville distribution and higher order ambiguity functions.[5]\nIf one wants to know all the (possibly complex) frequency components of a received signal (including transmitted signal and noise), one uses a discrete Fourier transform or some other Fourier-related transform.\nSuppose \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n, from \n\n\n\nn\n=\n0\n\n\n{\\displaystyle n=0}\n\n to \n\n\n\nN\n−\n1\n\n\n{\\displaystyle N-1}\n\n is a time series (discrete time) with zero mean. Suppose that it is a sum of a finite number of periodic components (all frequencies are positive):\nThe variance of \n\n\n\n\nx\n\nn\n\n\n\n\n{\\displaystyle x_{n}}\n\n is, for a zero-mean function as above, given by \n\n\n\n\n\n1\nN\n\n\n\n∑\n\nn\n=\n0\n\n\nN\n−\n1\n\n\n\nx\n\nn\n\n\n2\n\n\n\n\n{\\displaystyle {\\frac {1}{N}}\\sum _{n=0}^{N-1}x_{n}^{2}}\n\n. If these data were samples taken from an electrical signal, this would be its average power (power is energy per unit time, so it is analogous to variance if energy is analogous to the amplitude squared).\nNow, for simplicity, suppose the signal extends infinitely in time, so we pass to the limit as \n\n\n\nN\n→\n∞\n\n\n{\\displaystyle N\\rightarrow \\infty }\n\n. If the average power is bounded, which is almost always the case in reality, then the following limit exists and is the variance of the data.\nAgain, for simplicity, we will pass to continuous time, and assume that the signal extends infinitely in time in both directions. Then these two formulas become\nand\nThe root mean square of \n\n\n\nsin\n\n\n{\\displaystyle \\sin }\n\n is \n\n\n\n1\n\n/\n\n\n\n2\n\n\n\n\n{\\displaystyle 1/{\\sqrt {2}}}\n\n, so the variance of \n\n\n\n\nA\n\nk\n\n\nsin\n⁡\n(\n2\nπ\n\nν\n\nk\n\n\nt\n+\n\nϕ\n\nk\n\n\n)\n\n\n{\\displaystyle A_{k}\\sin(2\\pi \\nu _{k}t+\\phi _{k})}\n\n is \n\n\n\n\nA\n\nk\n\n\n2\n\n\n\n/\n\n2\n\n\n{\\displaystyle A_{k}^{2}/2}\n\n. Hence, the contribution to the average power of \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n coming from the component with frequency \n\n\n\n\nν\n\nk\n\n\n\n\n{\\displaystyle \\nu _{k}}\n\n is \n\n\n\n\nA\n\nk\n\n\n2\n\n\n\n/\n\n2.\n\n\n{\\displaystyle A_{k}^{2}/2.}\n\n. All these contributions add up to the average power of \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n.\nThen the power as a function of frequency is \n\n\n\n\nA\n\nk\n\n\n2\n\n\n\n/\n\n2\n\n\n{\\displaystyle A_{k}^{2}/2}\n\n, and its statistical cumulative distribution function \n\n\n\nS\n(\nν\n)\n\n\n{\\displaystyle S(\\nu )}\n\n will be\n\n\n\n\nS\n\n\n{\\displaystyle S}\n\n is a step function, monotonically non-decreasing. Its jumps occur at the frequencies of the periodic components of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, and the value of each jump is the power or variance of that component.\nThe variance is the covariance of the data with itself. If we now consider the same data but with a lag of \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n, we can take the covariance of \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n with \n\n\n\nx\n(\nt\n+\nτ\n)\n\n\n{\\displaystyle x(t+\\tau )}\n\n, and define this to be the autocorrelation function \n\n\n\nc\n\n\n{\\displaystyle c}\n\n of the signal (or data) \n\n\n\nx\n\n\n{\\displaystyle x}\n\n:\nIf it exists, it is an even function of \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n. If the average power is bounded, then \n\n\n\nc\n\n\n{\\displaystyle c}\n\n exists everywhere, is finite, and is bounded by \n\n\n\nc\n(\n0\n)\n\n\n{\\displaystyle c(0)}\n\n, which is the average power or variance of the data.\nIt can be shown that \n\n\n\nc\n\n\n{\\displaystyle c}\n\n can be decomposed into periodic components with the same periods as \n\n\n\nx\n\n\n{\\displaystyle x}\n\n:\nThis is in fact the spectral decomposition of \n\n\n\nc\n\n\n{\\displaystyle c}\n\n over the different frequencies, and is related to the distribution of power of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n over the frequencies: the amplitude of a frequency component of \n\n\n\nc\n\n\n{\\displaystyle c}\n\n is its contribution to the average power of the signal.\nThe power spectrum of this example is not continuous, and therefore does not have a derivative, and therefore this signal does not have a power spectral density function. In general, the power spectrum will usually be the sum of two parts: a line spectrum such as in this example, which is not continuous and does not have a density function, and a residue, which is absolutely continuous and does have a density function.", 
    "dbpedia_url": "http://dbpedia.org/resource/Spectral_density_estimation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Spectral_density_estimation\n"
}