{
    "about": "Power spectral estimation forms the basis for distinguishing and tracking signals in the presence of noise and extracting information from available data. One dimensional signals are expressed in terms of a single domain while multidimensional signals are represented in wave vector and frequency spectrum. Therefore, spectral estimation in the case of multidimensional signals gets a bit tricky.", 
    "name": "Spectral Estimation Of Multidimensional Signals", 
    "classification": "Digital Signal Processing", 
    "full_text": "Power spectral estimation forms the basis for distinguishing and tracking signals in the presence of noise and extracting information from available data. One dimensional signals are expressed in terms of a single domain while multidimensional signals are represented in wave vector and frequency spectrum. Therefore, spectral estimation in the case of multidimensional signals gets a bit tricky.\n\n\nMultidimensional spectral estimation has gained popularity because of its application in fields like medicine, aerospace, sonar, radar, bio informatics and geophysics. In the recent past, a number of methods have been suggested to design models with finite parameters to estimate the power spectrum of multidimensional signals. In this article, we will be looking into the basics of methods used to estimate the power spectrum of multidimensional signals.\nThere are many applications of spectral estimation of multi-D signals such as classification of signals as low pass, high pass, pass band and stop band. It is also used in compression and coding of audio and video signals, beam forming and direction finding in radars,[1] Seismic data estimation and processing, array of sensors and antennas and vibrational analysis. In the field of radio astronomy,[1] it is used to synchronize the outputs of an array of telescopes.\nIn a single dimensional case, a signal is characterized by an amplitude and a time scale. The basic concepts involved in spectral estimation include autocorrelation, multi-D Fourier transform, mean square error and entropy.[2] When it comes to multidimensional signals, there are two main approaches: use a bank of filters or estimate the parameters of the random process in order to estimate the power spectrum.\nIt is a technique to estimate the power spectrum of a single dimensional or a multidimensional signal as it cannot be calculated accurately. Given are samples of a wide sense stationary random process and its second order statistics (measurements).The estimates are obtained by applying a multidimensional Fourier transform of the autocorrelation function of the random signal. The estimation begins by calculating a periodogram which is obtained by squaring the magnitude of the multidimensional Fourier transform of the measurements ri(n). The spectral estimates obtained from the periodogram have a large variance in amplitude for consecutive periodogram samples or in wavenumber. This problem is resolved using techniques that constitute the classical estimation theory. They are as follows: 1.Bartlett suggested a method that averages the spectral estimates to calculate the power spectrum. The measurements are divided into equally spaced segments in time and an average is taken. This gives a better estimate.[3] 2.Based on the wavenumber and index of the receiver/output we can partition the segments. This increases the spectral estimates and decreases the variances between consecutive segments. 3.Welch suggested that we should divide the measurements using data window functions, calculate a periodogram, average them to get a spectral estimate and calculate the power spectrum using Fast Fourier Transform (FFT). This increases the computational speed.[4] 4.Smoothing window will help us smoothen the estimate by multiplying the periodogram with a smoothening spectrum. Wider the main lobe of the smoothening spectrum, smoother it becomes at the cost of frequency resolution.[2] \n\n\n\nP\n\n(\n\nK\n\nx\n\n\n,\nw\n)\n\n=\n\n∫\n\n−\n∞\n\n\n∞\n\n\n\n∫\n\n−\n∞\n\n\n∞\n\n\n\nφ\n\ns\ns\n\n\n\n(\nx\n,\nt\n)\n\n \n\ne\n\n−\nj\n\n(\nw\nt\n−\n\nk\n′\n\nx\n)\n\n\n\n\nd\nx\n\nd\nt\n\n\n{\\displaystyle P\\left(K_{x},w\\right)=\\int _{-\\infty }^{\\infty }\\int _{-\\infty }^{\\infty }\\varphi _{ss}\\left(x,t\\right)\\ e^{-j\\left(wt-k'x\\right)}\\,dx\\,dt}\n\n\n\n\n\n\n\nφ\n\ns\ns\n\n\n\n(\nx\n,\nt\n)\n\n=\ns\n\n[\n\n(\nξ\n,\nτ\n)\n\ns\n∗\n\n(\nξ\n−\nx\n,\nτ\n−\nt\n)\n\n]\n\n\n\n{\\displaystyle \\varphi _{ss}\\left(x,t\\right)=s\\left[\\left(\\xi ,\\tau \\right)s*\\left(\\xi -x,\\tau -t\\right)\\right]}\n\n [2]\n\n\n\n\n\nP\n\nB\n\n\n\n(\nw\n)\n\n=\n\n\n1\n\nd\ne\nt\nN\n\n\n\n\n∑\n\nl\n\n\n\n|\n\n\n∑\n\nn\n\n\n \nx\n\n(\nn\n+\nM\nI\n)\n\n \n\ne\n\n−\nj\n\n(\n\nw\n′\n\nn\n)\n\n\n\n\n\n|\n\n\n2\n\n\n\n\n{\\displaystyle P_{B}\\left(w\\right)={\\frac {1}{detN}}\\sum _{l}|\\sum _{n}\\ x\\left(n+MI\\right)\\ e^{-j\\left(w'n\\right)}|^{2}}\n\n Bartlett's case [2]\n\n\n\n\n\nP\n\nM\n\n\n\n(\nw\n)\n\n=\n\n\n1\n\nd\ne\nt\nN\n\n\n\n\n|\n\n\n∑\n\nn\n\n\n \ng\n\n(\nn\n)\n\n \nx\n\n(\nn\n)\n\n \n\ne\n\n−\nj\n\n(\n\nw\n′\n\nn\n)\n\n\n\n\n\n|\n\n\n2\n\n\n\n\n{\\displaystyle P_{M}\\left(w\\right)={\\frac {1}{detN}}|\\sum _{n}\\ g\\left(n\\right)\\ x\\left(n\\right)\\ e^{-j\\left(w'n\\right)}|^{2}}\n\n Modified periodogram [2]\n\n\n\n\n\nP\n\nW\n\n\n\n(\nw\n)\n\n=\n\n\n1\n\nd\ne\nt\nN\n\n\n\n\n∑\n\nl\n\n\n\n|\n\n\n∑\n\nn\n\n\n \ng\n\n(\nn\n)\n\n \nx\n\n(\nn\n+\nM\nI\n)\n\n \n\ne\n\n−\nj\n\n(\n\nw\n′\n\nn\n)\n\n\n\n\n\n|\n\n\n2\n\n\n\n\n{\\displaystyle P_{W}\\left(w\\right)={\\frac {1}{detN}}\\sum _{l}|\\sum _{n}\\ g\\left(n\\right)\\ x\\left(n+MI\\right)\\ e^{-j\\left(w'n\\right)}|^{2}}\n\n Welch's case [2]\nAdvantages: Straightforward method involving Fourier transforms.\nLimitations: 1.Since some of the above methods sample the sequence in time, the frequency resolution is reduced (aliasing). 2.Number of instances of a wide sense stationary random process are less which makes it difficult to calculate the estimates accurately.\nThis method gives a better estimate whose frequency resolution is higher than the classical estimation theory. In the high resolution estimation method we use a variable wavenumber window which allows only certain wavenumbers and suppresses the others. Capon’s [5] work helped us establish an estimation method by using wavenumber-frequency components. This results in an estimate with a higher frequency resolution. It is similar to maximum likelihood method as the optimization tool used is similar.\nAssumption: The output obtained from the sensors is a wide sense stationary random process with zero mean.[6]\n\n\n\n\n\nP\n\nC\n\n\n\n(\n\nK\n\no\n\n\nx\n,\n\nw\n\no\n\n\n)\n\n=\nE\n\n[\n\n|\n\ny\n\n(\ni\n,\nn\n)\n\n\n\n|\n\n\n2\n\n\n]\n\n=\n\n\n1\n\n\n∑\n\nα\n=\n0\n\n\nN\n−\n1\n\n\n\n∑\n\nβ\n=\n0\n\n\nM\n−\n1\n\n\n\n∑\n\nl\n=\n0\n\n\nN\n−\n1\n\n\n\n∑\n\nm\n=\n0\n\n\nM\n−\n1\n\n\n\nψ\n\ne\n\n\n\n(\nl\n,\nα\n;\nm\n,\nβ\n)\n\n\n\n\n\n\n{\\displaystyle P_{C}\\left(K_{o}x,w_{o}\\right)=E\\left[|y\\left(i,n\\right)|^{2}\\right]={\\frac {1}{\\sum _{\\alpha =0}^{N-1}\\sum _{\\beta =0}^{M-1}\\sum _{l=0}^{N-1}\\sum _{m=0}^{M-1}\\psi _{e}\\left(l,\\alpha ;m,\\beta \\right)}}}\n\n [2]\nAdvantages: 1.Higher frequency resolution compare to other existing methods. 2.Better frequency estimate since we are using a variable wavenumber window as compared to classical method which uses a fixed wavenumber window. 3.Faster Computational speed as it uses FFT.\n[1]\nIn this type of estimation, we select the multidimensional signal to be a separable function. Because of this property we will be able to view the Fourier analysis taking place in multiple dimensions successively. A time delay in the magnitude squaring operation will help us process the Fourier transformation in each dimension. A Discrete time Multidimensional Fourier transform is applied along each dimension and in the end a maximum entropy estimator is applied and the magnitude is squared.\nAdvantages: 1.The Fourier analysis is flexible as the signal is separable. 2.It preserves the phase components of every dimension unlike other spectral estimators.\n[2]\nThis method is an extension of a 1-D technique called Autoregressive spectral estimation. In autoregressive models, the output variables depend linearly on its own previous values. In this model, the estimation of power spectrum is reduced to estimating the coefficients from the autocorrelation coefficients of the random process which are assumed to be known for a specific region. The power spectrum \n\n\n\n\nP\n\nA\n\n\n(\n\nk\n\nx\n\n\n,\nw\n)\n\n\n{\\displaystyle P_{A}(k_{x},w)}\n\n of a random process \n\n\n\nr\n(\ni\n,\nn\n)\n\n\n{\\displaystyle r(i,n)}\n\n is given by:-\n\n\n\n\n\nP\n\nA\n\n\n\n(\n\nk\n\nx\n\n\n,\nw\n)\n\n=\n\nP\n\ne\n\n\n\n(\n\nk\n\nx\n\n\n,\nw\n)\n\n\n|\n\n\n\n1\n\n1\n−\nA\n\n(\n\nk\n\nx\n\n\n,\nw\n)\n\n\n\n\n\n\n|\n\n\n2\n\n\n\n\n{\\displaystyle P_{A}\\left(k_{x},w\\right)=P_{e}\\left(k_{x},w\\right)|{\\frac {1}{1-A\\left(k_{x},w\\right)}}|^{2}}\n\n [2]\nWhere \n\n\n\n\nP\n\ne\n\n\n\n(\n\nk\n\nx\n\n\n,\nw\n)\n\n\n\n{\\displaystyle P_{e}\\left(k_{x},w\\right)}\n\n is the power spectrum of a random process \n\n\n\ne\n(\ni\n,\nn\n)\n\n\n{\\displaystyle e(i,n)}\n\n , which is given as the input to a system with a transfer function \n\n\n\n\n|\n\n\n\n1\n\n1\n−\nA\n\n(\n\nk\n\nx\n\n\n,\nw\n)\n\n\n\n\n\n|\n\n\n\n{\\displaystyle |{\\frac {1}{1-A\\left(k_{x},w\\right)}}|}\n\n to obtain \n\n\n\nr\n(\ni\n,\nn\n)\n\n\n{\\displaystyle r(i,n)}\n\n[2]\nAnd \n\n\n\nA\n\n(\n\nk\n\nx\n\n\n,\nw\n)\n\n=\n\n∑\n\np\n=\no\n\n\nN\n−\n1\n\n\n\n∑\n\nq\n=\n0\n\n\nM\n−\n1\n\n\na\n(\np\n,\nq\n)\ne\nx\np\n(\nj\n\nk\n\nx\n\n\np\n−\nj\nw\nq\n)\n\n\n{\\displaystyle A\\left(k_{x},w\\right)=\\sum _{p=o}^{N-1}\\sum _{q=0}^{M-1}a(p,q)exp(jk_{x}p-jwq)}\n\n[2]\nTherefore, the power estimation reduces to estimation of coefficients of \n\n\n\na\n\n(\np\n,\nq\n)\n\n\n\n{\\displaystyle a\\left(p,q\\right)}\n\n from the auto correlation function \n\n\n\nφ\n\n(\nl\n,\nm\n)\n\n\n\n{\\displaystyle \\varphi \\left(l,m\\right)}\n\nof the random process. The coefficients can also be estimated using the linear prediction formulation which deals with minimization of mean square error between the actual random signal and predicted values of the random signal.\nLimitations:-\n1. In 1-D we have the same number of linear equations with the same number of unknowns because of the autocorrelation matching property. But it may not be possible in multi-D [2] since the set of parameters does not contain enough degrees of freedom to match autocorrelation coefficients.\n2. We assume that the array of coefficients is limited to a certain area.\n3. In 1-D formulation of linear prediction, the inverse filter has minimum phase property thus proving that the filter is stable. It is not always necessarily true in multi-D case.\n4. In 1-D formulation, the autocorrelation matrix is positive definite but positive definite extension may not exist in the case of multi-D.\nIn this method of spectral estimation, we try to find the spectral estimate whose inverse Fourier transform matches the known auto correlation coefficients. We maximize the entropy of the spectral estimate such that it matches the autocorrelation coefficients.[2] The entropy equation is given as \n\n\n\nH\n=\n\n\n1\n\n4\n\nπ\n\n2\n\n\n\n\n\n\n∫\n\n−\nπ\n\n\nπ\n\n\n\n∫\n\n−\nπ\n\n\nπ\n\n\nl\no\ng\nP\n\n(\n\nk\n\nx\n\n\n,\nw\n)\n\nd\n\nk\n\nx\n\n\nd\nw\n\n\n{\\displaystyle H={\\frac {1}{4\\pi ^{2}}}\\int _{-\\pi }^{\\pi }\\int _{-\\pi }^{\\pi }logP\\left(k_{x},w\\right)dk_{x}dw}\n\n[1][2]\nThe power spectrum \n\n\n\nP\n\n(\nk\n,\nw\n)\n\n\n\n{\\displaystyle P\\left(k,w\\right)}\n\n can be expressed as a sum of known autocorrelation coefficients and unknown autocorrelation coefficients. By adjusting the values of unconstrained coefficients, the entropy can be maximized.\nThe max entropy is of the form \n\n\n\n\nP\n\nM\nE\n\n\n=\n\n\n1\n\n\n∑\n\nl\n\n\n\n∑\n\nm\n\n\nλ\n\n(\nl\n,\nm\n)\n\ne\nx\np\n\n(\nj\n\nk\n\nx\n\n\nl\n−\nj\nw\nm\n)\n\n\n\n\n\n\n{\\displaystyle P_{ME}={\\frac {1}{\\sum _{l}\\sum _{m}\\lambda \\left(l,m\\right)exp\\left(jk_{x}l-jwm\\right)}}}\n\n[1][2]\nλ(l,m) must be chosen such that known autocorrelation coefficients are matched.\nLimitations:-\n1.It has constrained optimization. It can be overcome by using the method of Lagrange multipliers.[2]\n2. All pole spectral estimate is not the solution to maximum entropy in multidimensional case as it is in the case of 1-D. This is because the all pole spectral model does not contain enough degree of freedom to match the know autocorrelation coefficients.\nAdvantages and Disadvantages:-\nThe advantage of this estimator is that errors in measuring or estimating the known autocorrelation coefficients can be taken into account since exact match is not required.\nThe disadvantage is that too many computations are required.\nThis is a relatively new approach. Improved maximum likelihood method (IMLM) is a combination of two MLM(maximum likelihood) estimators.[1][7] The improved maximum likelihood of two 2-dimensional arrays A and B at a wave number k( gives information about the orientation of the array in space) is given by the relation:-\n\n\n\n\nI\nM\nL\nM\n\n(\nk\n:\nA\n,\nB\n)\n\n=\n\n\n1\n\n\n\n1\n\nM\nL\nM\n\n(\nk\n:\nA\n)\n\n\n\n\n−\n\n\n1\n\nM\nL\nM\n\n(\nk\n:\nB\n)\n\n\n\n\n\n\n\n\n\n{\\displaystyle IMLM\\left(k:A,B\\right)={\\frac {1}{{\\frac {1}{MLM\\left(k:A\\right)}}-{\\frac {1}{MLM\\left(k:B\\right)}}}}}\n\n[7][8]\nArray B is a subset of A. Therefore, assuming that A>B, if there is a difference between the MLM of A and MLM of B then significant part of the estimated spectral energy at the frequency may be due to power leakage from other frequencies. The de-emphasis of MLM of A may improve spectral estimate. This is accomplished by multiplying by a weighted function which is smaller when there is a greater difference between MLA of B and MLA of A.\n. \n\n\n\nI\nM\nL\nM\n\n(\nk\n:\nA\n,\nB\n)\n\n=\n\n\n\nM\nL\nM\n\n(\nk\n:\nA\n)\n\nM\nL\nM\n\n(\nk\n:\nB\n)\n\n\n\nM\nL\nM\n\n(\nk\n:\nB\n)\n\n−\nM\nL\nM\n\n(\nk\n:\nA\n)\n\n\n\n\n\n\n{\\displaystyle IMLM\\left(k:A,B\\right)={\\frac {MLM\\left(k:A\\right)MLM\\left(k:B\\right)}{MLM\\left(k:B\\right)-MLM\\left(k:A\\right)}}}\n\n\n\n\n\n\nI\nM\nL\nM\n\n(\nk\n:\nA\n,\nB\n)\n\n=\nM\nL\nM\n\n(\nk\n:\nA\n)\n\n\nW\n\nA\nB\n\n\n\n(\nk\n)\n\n\n\n{\\displaystyle IMLM\\left(k:A,B\\right)=MLM\\left(k:A\\right)W_{AB}\\left(k\\right)}\n\n\nwhere \n\n\n\n\nW\n\nA\nB\n\n\n\n(\nk\n)\n\n\n\n{\\displaystyle W_{AB}\\left(k\\right)}\n\n is the weighting function and is given by the expression:- \n\n\n\n\nW\n\nA\nB\n\n\n\n(\nk\n)\n\n=\n\n\n\nM\nL\nM\n\n(\nk\n:\nB\n)\n\n\n\nM\nL\nM\n\n(\nk\n:\nB\n)\n\n−\nM\nL\nM\n\n(\nk\n:\nA\n)\n\n\n\n\n\n\n{\\displaystyle W_{AB}\\left(k\\right)={\\frac {MLM\\left(k:B\\right)}{MLM\\left(k:B\\right)-MLM\\left(k:A\\right)}}}\n\n[7]\nAdvantages:-\n1. Used as an alternative to MLM or MEM(Maximum Entropy Method/principle of maximum entropy)\n2. IMLM has better resolution than MLM and it requires lesser number of computations when compared to MEM [7][8]", 
    "dbpedia_url": "http://dbpedia.org/resource/Spectral_estimation_of_multidimensional_signals", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Spectral_estimation_of_multidimensional_signals\n"
}