{
    "about": "The spectral concentration problem in Fourier analysis refers to finding a time sequence whose discrete Fourier transform is maximally localized on a given frequency interval, as measured by the spectral concentration.", 
    "name": "Spectral Concentration Problem", 
    "classification": "Signal Processing", 
    "full_text": "The spectral concentration problem in Fourier analysis refers to finding a time sequence whose discrete Fourier transform is maximally localized on a given frequency interval, as measured by the spectral concentration.\n\n\nThe discrete-time Fourier transform (DTFT) U(f) of a finite series \n\n\n\n\nw\n\nt\n\n\n\n\n{\\displaystyle w_{t}}\n\n, \n\n\n\nt\n=\n1\n,\n2\n,\n3\n,\n4\n,\n.\n.\n.\n,\nT\n\n\n{\\displaystyle t=1,2,3,4,...,T}\n\n is defined as\nIn the following, the sampling interval will be taken as Δt = 1, and hence the frequency interval as f ∈ [-½,½]. U(f) is a periodic function with a period 1.\nFor a given frequency W such that 0<W<½, the spectral concentration \n\n\n\nλ\n(\nT\n,\nW\n)\n\n\n{\\displaystyle \\lambda (T,W)}\n\n of U(f) on the interval [-W,W] is defined as the ratio of power of U(f) contained in the frequency band [-W,W] to the power of U(f) contained in the entire frequency band [-½,½]. That is,\nIt can be shown that U(f) has only isolated zeros and hence \n\n\n\n0\n<\nλ\n(\nT\n,\nW\n)\n<\n1\n\n\n{\\displaystyle 0<\\lambda (T,W)<1}\n\n (see [1]). Thus, the spectral concentration is strictly less than one, and there is no finite sequence \n\n\n\n\nw\n\nt\n\n\n\n\n{\\displaystyle w_{t}}\n\n for which the DTFT can be confined to a band [-W,W] and made to vanish outside this band.\nAmong all sequences \n\n\n\n{\n\nw\n\nt\n\n\n}\n\n\n{\\displaystyle \\lbrace w_{t}\\rbrace }\n\n for a given T and W, is there a sequence for which the spectral concentration is maximum? In other words, is there a sequence for which the sidelobe energy outside a frequency band [-W,W] is minimum?\nThe answer is yes; such a sequence indeed exists and can be found by optimizing \n\n\n\nλ\n(\nT\n,\nW\n)\n\n\n{\\displaystyle \\lambda (T,W)}\n\n. Thus maximising the power\nsubject to the constraint that the total power is fixed, say\nleads to the following equation satisfied by the optimal sequence \n\n\n\n\nw\n\nt\n\n\n\n\n{\\displaystyle w_{t}}\n\n:\nThis is an eigenvalue equation for a symmetric matrix given by\nIt can be shown that this matrix is positive-definite, hence all the eigenvalues of this matrix lie between 0 and 1. The largest eigenvalue of the above equation corresponds to the largest possible spectral concentration; the corresponding eigenvector is the required optimal sequence \n\n\n\n\nw\n\nt\n\n\n\n\n{\\displaystyle w_{t}}\n\n. This sequence is called a 0th–order Slepian sequence (also known as a discrete prolate spheroidal sequence, or DPSS), which is a unique taper with maximally suppressed sidelobes.\nIt turns out that the number of dominant eigenvalues of the matrix M that are close to 1, corresponds to N=2WT called as Shannon number. If the eigenvalues \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n are arranged in decreasing order (i.e., \n\n\n\n\nλ\n\n1\n\n\n>\n\nλ\n\n2\n\n\n>\n\nλ\n\n3\n\n\n>\n.\n.\n.\n>\n\nλ\n\nN\n\n\n\n\n{\\displaystyle \\lambda _{1}>\\lambda _{2}>\\lambda _{3}>...>\\lambda _{N}}\n\n), then the eigenvector corresponding to \n\n\n\n\nλ\n\nn\n+\n1\n\n\n\n\n{\\displaystyle \\lambda _{n+1}}\n\n is called nth–order Slepian sequence (DPSS) (0≤n≤N-1). This nth–order taper also offers the best sidelobe suppression and is pairwise orthogonal to the Slepian sequences of previous orders \n\n\n\n(\n0\n,\n1\n,\n2\n,\n3....\n,\nn\n−\n1\n)\n\n\n{\\displaystyle (0,1,2,3....,n-1)}\n\n. These lower order Slepian sequences form the basis for spectral estimation by multitaper method.\nNot limited to time series, the spectral concentration problem can be reformulated to apply on the surface of the sphere by using spherical harmonics, for applications in geophysics and cosmology among others.", 
    "dbpedia_url": "http://dbpedia.org/resource/Spectral_concentration_problem", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Spectral_concentration_problem\n"
}