{
    "about": "Spreading activation is a method for searching associative networks, neural networks, or semantic networks. The search process is initiated by labeling a set of source nodes (e.g. concepts in a semantic network) with weights or \"activation\" and then iteratively propagating or \"spreading\" that activation out to other nodes linked to the source nodes. Most often these \"weights\" are real values that decay as activation propagates through the network. When the weights are discrete this process is often referred to as marker passing. Activation may originate from alternate paths, identified by distinct markers, and terminate when two alternate paths reach the same node. However brain studies show that several different brain areas play an important role in semantic processing.[1]", 
    "name": "Spreading Activation", 
    "classification": "Search Algorithms", 
    "full_text": "Spreading activation is a method for searching associative networks, neural networks, or semantic networks. The search process is initiated by labeling a set of source nodes (e.g. concepts in a semantic network) with weights or \"activation\" and then iteratively propagating or \"spreading\" that activation out to other nodes linked to the source nodes. Most often these \"weights\" are real values that decay as activation propagates through the network. When the weights are discrete this process is often referred to as marker passing. Activation may originate from alternate paths, identified by distinct markers, and terminate when two alternate paths reach the same node. However brain studies show that several different brain areas play an important role in semantic processing.[1]\nSpreading activation models are used in cognitive psychology[2][3] to model the fan out effect.\nSpreading activation can also be applied in information retrieval,[4][5] by means of a network of nodes representing documents and terms contained in those documents.\n\n\nAs it relates to cognitive psychology, spreading activation is how the brain moves through an entire network of ideas to retrieve specific information. The spreading activation theory presents the array of concepts within our memory as cognitive units, each consisting of a node and its associated elements or characteristics, all connected together by edges.[3] A spreading activation network can be represented schematically, in a sort of web diagram with shorter lines between two nodes meaning the ideas are more closely related and will typically be associated more quickly to the original concept.[2]\nWhen a word (the target) is preceded by an associated word (the prime) in word recognition tasks, participants seem to perform better in the amount of time that it takes them to respond. For instance, subjects respond faster to the word “doctor” when it is preceded by “nurse” than when it is preceded by an unrelated word like “carrot”. This semantic priming effect with words that are close in meaning within the cognitive network has been seen in a wide range of tasks given by experimenters, ranging from sentence verification to lexical decision and naming.[6]\nAs another example, if the original concept is “red” and the concept “vehicles” is primed, they are much more likely to say “fire engine” instead of something unrelated to vehicles, such as “cherries.” If instead “fruits” was primed, they would likely name “cherries” and continue on from there. The activation of pathways in the network has everything to do with how closely linked two concepts are by meaning, as well as how a subject is primed.\nA directed graph is populated by Nodes[ 1...N ] each having an associated activation value A [ i ] which is a real number in the range [ 0.0 ... 1.0]. A Link[ i, j ] connects source node[ i ] with target node[ j ]. Each edge has an associated weight W [ i, j ] usually a real number in the range [0.0 ... 1.0].[7]\nParameters:\nSteps:", 
    "dbpedia_url": "http://dbpedia.org/resource/Spreading_activation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Spreading_activation\n"
}