{
    "about": "Stochastic gradient descent (often shortened in SGD), also known as incremental gradient descent, is a stochastic approximation of the gradient descent optimization method for minimizing an objective function that is written as a sum of differentiable functions. In other words, SGD tries to find minimums or maximums by iteration.", 
    "name": "Stochastic Gradient Descent", 
    "classification": "Computational Statistics", 
    "full_text": "Stochastic gradient descent (often shortened in SGD), also known as incremental gradient descent, is a stochastic approximation of the gradient descent optimization method for minimizing an objective function that is written as a sum of differentiable functions. In other words, SGD tries to find minimums or maximums by iteration.\n\n\nBoth statistical estimation and machine learning consider the problem of minimizing an objective function that has the form of a sum:\nwhere the parameter \n\n\n\nw\n\n\n{\\displaystyle w}\n\n which minimizes \n\n\n\nQ\n(\nw\n)\n\n\n{\\displaystyle Q(w)}\n\n is to be estimated. Each summand function \n\n\n\n\nQ\n\ni\n\n\n\n\n{\\displaystyle Q_{i}}\n\n is typically associated with the \n\n\n\ni\n\n\n{\\displaystyle i}\n\n-th observation in the data set (used for training).\nIn classical statistics, sum-minimization problems arise in least squares and in maximum-likelihood estimation (for independent observations). The general class of estimators that arise as minimizers of sums are called M-estimators. However, in statistics, it has been long recognized that requiring even local minimization is too restrictive for some problems of maximum-likelihood estimation.[1] Therefore, contemporary statistical theorists often consider stationary points of the likelihood function (or zeros of its derivative, the score function, and other estimating equations).\nThe sum-minimization problem also arises for empirical risk minimization: In this case, \n\n\n\n\nQ\n\ni\n\n\n(\nw\n)\n\n\n{\\displaystyle Q_{i}(w)}\n\n is the value of the loss function at \n\n\n\ni\n\n\n{\\displaystyle i}\n\n-th example, and \n\n\n\nQ\n(\nw\n)\n\n\n{\\displaystyle Q(w)}\n\n is the empirical risk.\nWhen used to minimize the above function, a standard (or \"batch\") gradient descent method would perform the following iterations :\nwhere \n\n\n\nη\n\n\n{\\displaystyle \\eta }\n\n is a step size (sometimes called the learning rate in machine learning).\nIn many cases, the summand functions have a simple form that enables inexpensive evaluations of the sum-function and the sum gradient. For example, in statistics, one-parameter exponential families allow economical function-evaluations and gradient-evaluations.\nHowever, in other cases, evaluating the sum-gradient may require expensive evaluations of the gradients from all summand functions. When the training set is enormous and no simple formulas exist, evaluating the sums of gradients becomes very expensive, because evaluating the gradient requires evaluating all the summand functions' gradients. To economize on the computational cost at every iteration, stochastic gradient descent samples a subset of summand functions at every step. This is very effective in the case of large-scale machine learning problems.[2]\nIn stochastic (or \"on-line\") gradient descent, the true gradient of \n\n\n\nQ\n(\nw\n)\n\n\n{\\displaystyle Q(w)}\n\n is approximated by a gradient at a single example:\nAs the algorithm sweeps through the training set, it performs the above update for each training example. Several passes can be made over the training set until the algorithm converges. If this is done, the data can be shuffled for each pass to prevent cycles. Typical implementations may use an adaptive learning rate so that the algorithm converges.\nIn pseudocode, stochastic gradient descent can be presented as follows:\nA compromise between computing the true gradient and the gradient at a single example, is to compute the gradient against more than one training example (called a \"mini-batch\") at each step. This can perform significantly better than true stochastic gradient descent because the code can make use of vectorization libraries rather than computing each step separately. It may also result in smoother convergence, as the gradient computed at each step uses more training examples.\nThe convergence of stochastic gradient descent has been analyzed using the theories of convex minimization and of stochastic approximation. Briefly, when the learning rates \n\n\n\nη\n\n\n{\\displaystyle \\eta }\n\n decrease with an appropriate rate, and subject to relatively mild assumptions, stochastic gradient descent converges almost surely to a global minimum when the objective function is convex or pseudoconvex, and otherwise converges almost surely to a local minimum.[3][4] This is in fact a consequence of the Robbins-Siegmund theorem.[5]\nLet's suppose we want to fit a straight line \n\n\n\ny\n=\n\n\nw\n\n1\n\n\n+\n\nw\n\n2\n\n\nx\n\n\n{\\displaystyle y=\\!w_{1}+w_{2}x}\n\n to a training set of two-dimensional points \n\n\n\n(\n\nx\n\n1\n\n\n,\n\ny\n\n1\n\n\n)\n,\n…\n,\n(\n\nx\n\nn\n\n\n,\n\ny\n\nn\n\n\n)\n\n\n{\\displaystyle (x_{1},y_{1}),\\ldots ,(x_{n},y_{n})}\n\n using least squares. The objective function to be minimized is:\nThe last line in the above pseudocode for this specific problem will become:\nStochastic gradient descent is a popular algorithm for training a wide range of models in machine learning, including (linear) support vector machines, logistic regression (see, e.g., Vowpal Wabbit) and graphical models.[6] When combined with the backpropagation algorithm, it is the de facto standard algorithm for training artificial neural networks.[7]\nStochastic gradient descent competes with the L-BFGS algorithm,[citation needed] which is also widely used. Stochastic gradient descent has been used since at least 1960 for training linear regression models, originally under the name ADALINE.[8]\nAnother popular stochastic gradient descent algorithm is the least mean squares (LMS) adaptive filter.\nMany improvements on the basic stochastic gradient descent algorithm have been proposed and used. In particular, in machine learning, the need to set a learning rate (step size) has been recognized as problematic. Setting this parameter too high can cause the algorithm to diverge; setting it too low makes it slow to converge. A conceptually simple extension of stochastic gradient descent makes the learning rate a decreasing function ηt of the iteration number t, giving a learning rate schedule, so that the first iterations cause large changes in the parameters, while the later ones do only fine-tuning. Such schedules have been known since the work of MacQueen on k-means clustering.[9]\nFurther proposals include the momentum method, which appeared in Rumelhart, Hinton and Williams' seminal paper on backpropagation learning.[10] Stochastic gradient descent with momentum remembers the update Δ w at each iteration, and determines the next update as a convex combination of the gradient and the previous update:[11]\nor as a mathematically equivalent formulation:[12]\nthat leads to:\nwhere the parameter \n\n\n\nw\n\n\n{\\displaystyle w}\n\n which minimizes \n\n\n\nQ\n(\nw\n)\n\n\n{\\displaystyle Q(w)}\n\n is to be estimated, and \n\n\n\nη\n\n\n{\\displaystyle \\eta }\n\n is a step size (sometimes called the learning rate in machine learning).\nThe name momentum stems from an analogy to momentum in physics: the weight vector, thought of as a particle traveling through parameter space,[10] incurs acceleration from the gradient of the loss (\"force\"). Unlike in classical stochastic gradient descent, it tends to keep traveling in the same direction, preventing oscillations. Momentum has been used successfully for several decades.[13]\nAveraged stochastic gradient descent, invented independently by Ruppert and Polyak in the late 1980s, is ordinary stochastic gradient descent that records an average of its parameter vector over time. That is, the update is the same as for ordinary stochastic gradient descent, but the algorithm also keeps track of[14]\nWhen optimization is done, this averaged parameter vector takes the place of w.\nAdaGrad (for adaptive gradient algorithm) is a modified stochastic gradient descent with per-parameter learning rate, first published in 2011.[15][16] Informally, this increases the learning rate for more sparse parameters and decreases the learning rate for less sparse ones. This strategy often improves convergence performance over standard stochastic gradient descent in settings where data is sparse and sparse parameters are more informative. Examples of such applications include natural language processing and image recognition.[15] It still has a base learning rate η, but this is multiplied with the elements of a vector {Gj,j} which is the diagonal of the outer product matrix.\nwhere \n\n\n\n\ng\n\nτ\n\n\n=\n∇\n\nQ\n\ni\n\n\n(\nw\n)\n\n\n{\\displaystyle g_{\\tau }=\\nabla Q_{i}(w)}\n\n, the gradient, at iteration τ. The diagonal is given by\nThis vector is updated after every iteration. The formula for an update is now\nor, written as per-parameter updates,\nEach {G(i,i)} gives rise to a scaling factor for the learning rate that applies to a single parameter wi. Since the denominator in this factor, \n\n\n\n\n\n\nG\n\ni\n\n\n\n\n=\n\n\n\n∑\n\nτ\n=\n1\n\n\nt\n\n\n\ng\n\nτ\n\n\n2\n\n\n\n\n\n\n{\\displaystyle {\\sqrt {G_{i}}}={\\sqrt {\\sum _{\\tau =1}^{t}g_{\\tau }^{2}}}}\n\n is the ℓ2 norm of previous derivatives, extreme parameter updates get dampened, while parameters that get few or small updates receive higher learning rates.[13]\nWhile designed for convex problems, AdaGrad has been successfully applied to non-convex optimization.[17]\nRMSProp (for Root Mean Square Propagation) is also a method in which the learning rate is adapted for each of the parameters. The idea is to divide the learning rate for a weight by a running average of the magnitudes of recent gradients for that weight.[18] So, first the running average is calculated in terms of means square,\nwhere, \n\n\n\nγ\n\n\n{\\displaystyle \\gamma }\n\n is the forgetting factor.\nAnd the parameters are updated as,\nRMSProp has shown excellent adaptation of learning rate in different applications. RMSProp can be seen as a generalization of Rprop and is capable to work with mini-batches as well opposed to only full-batches.[19]\n'Adam'[20] (for Adaptive Moment Estimation) is an update to RMSProp optimizer. In this running average of both the gradients and their magnitudes are used. The three equations that define this optimizer is as follows,\nwhere, \n\n\n\n\nγ\n\n1\n\n\n\n\n{\\displaystyle \\gamma _{1}}\n\n and \n\n\n\n\nγ\n\n2\n\n\n\n\n{\\displaystyle \\gamma _{2}}\n\n are two forgetting factors of the algorithm, respectively for gradients and magnitude of gradients.", 
    "dbpedia_url": "http://dbpedia.org/resource/Stochastic_gradient_descent", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Stochastic_gradient_descent\n"
}