{
    "about": "In machine learning and data mining, a string kernel is a kernel function that operates on strings, i.e. finite sequences of symbols that need not be of the same length. String kernels can be intuitively understood as functions measuring the similarity of pairs of strings: the more similar two strings a and b are, the higher the value of a string kernel K(a, b) will be.", 
    "name": "String Kernel", 
    "classification": "Algorithms On Strings", 
    "full_text": "In machine learning and data mining, a string kernel is a kernel function that operates on strings, i.e. finite sequences of symbols that need not be of the same length. String kernels can be intuitively understood as functions measuring the similarity of pairs of strings: the more similar two strings a and b are, the higher the value of a string kernel K(a, b) will be.\nUsing string kernels with kernelized learning algorithms such as support vector machines allow such algorithms to work with strings, without having to translate these to fixed-length, real-valued feature vectors.[1] String kernels are used in domains where sequence data are to be clustered or classified, e.g. in text mining and gene analysis.[2]\n\n\nSuppose one wants to compare some text passages automatically and indicate their relative similarity. For many applications, it might be sufficient to find some keywords which match exactly. One example where exact matching is not always enough is found in spam detection.[3] Another would be in computational gene analysis, where homologous genes have mutated, resulting in common subsequences along with deleted, inserted or replaced symbols.\nSince several well-proven data clustering, classification and information retrieval methods (for example support vector machines) are designed to work on vectors (i.e. data are elements of a vector space), using a string kernel allows the extension of these methods to handle sequence data.\nThe string kernel method is to be contrasted with earlier approaches for text classification where feature vectors only indicated the presence or absence of a word. Not only does it improve on these approaches, but it is an example for a whole class of kernels adapted to data structures, which began to appear at the turn of the 21st century. A survey of such methods has been compiled by Gärtner.[4]\nA kernel on a domain \n\n\n\nD\n\n\n{\\displaystyle D}\n\n is a function \n\n\n\nK\n:\nD\n×\nD\n→\n\nR\n\n\n\n{\\displaystyle K:D\\times D\\rightarrow \\mathbb {R} }\n\n satisfying some conditions (being symmetric in the arguments, continuous and positive semidefinite in a certain sense).\nMercer's theorem asserts that \n\n\n\nK\n\n\n{\\displaystyle K}\n\n can then be expressed as \n\n\n\nK\n(\nx\n,\ny\n)\n=\nφ\n(\nx\n)\n⋅\nφ\n(\ny\n)\n\n\n{\\displaystyle K(x,y)=\\varphi (x)\\cdot \\varphi (y)}\n\n with \n\n\n\nφ\n\n\n{\\displaystyle \\varphi }\n\n mapping the arguments into an inner product space.\nWe can now reproduce the definition of a string subsequence kernel[1] on strings over an alphabet \n\n\n\nΣ\n\n\n{\\displaystyle \\Sigma }\n\n. Coordinate-wise, the mapping is defined as follows:\nThe \n\n\n\n\ni\n\n\n\n{\\displaystyle \\mathbf {i} }\n\n are multiindices and \n\n\n\nu\n\n\n{\\displaystyle u}\n\n is a string of length \n\n\n\nn\n\n\n{\\displaystyle n}\n\n: subsequences can occur in a non-contiguous manner, but gaps are penalized. The multiindex \n\n\n\n\ni\n\n\n\n{\\displaystyle \\mathbf {i} }\n\n gives the positions of the characters matching \n\n\n\nu\n\n\n{\\displaystyle u}\n\n in \n\n\n\ns\n\n\n{\\displaystyle s}\n\n. \n\n\n\nl\n(\n\ni\n\n)\n\n\n{\\displaystyle l(\\mathbf {i} )}\n\n is the difference between the first and last entry in \n\n\n\n\ni\n\n\n\n{\\displaystyle \\mathbf {i} }\n\n, that is: how far apart in \n\n\n\ns\n\n\n{\\displaystyle s}\n\n the subsequence matching \n\n\n\nu\n\n\n{\\displaystyle u}\n\n is. The parameter \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n may be set to any value between \n\n\n\n0\n\n\n{\\displaystyle 0}\n\n (gaps are not allowed, as only \n\n\n\n\n0\n\n0\n\n\n\n\n{\\displaystyle 0^{0}}\n\n is not \n\n\n\n0\n\n\n{\\displaystyle 0}\n\n but \n\n\n\n1\n\n\n{\\displaystyle 1}\n\n) and \n\n\n\n1\n\n\n{\\displaystyle 1}\n\n (even widely-spread \"occurrences\" are weighted the same as appearances as a contiguous substring, as \n\n\n\n\n1\n\nl\n(\n\ni\n\n)\n\n\n=\n1\n\n\n{\\displaystyle 1^{l(\\mathbf {i} )}=1}\n\n).\n\nFor several relevant algorithms, data enters into the algorithm only in expressions involving an inner product of feature vectors, hence the name kernel methods. A desirable consequence of this is that one does not need to explicitly calculate the transformation \n\n\n\nϕ\n(\nx\n)\n\n\n{\\displaystyle \\phi (x)}\n\n, only the inner product via the kernel, which may be a lot quicker, especially when approximated.[1]", 
    "dbpedia_url": "http://dbpedia.org/resource/String_kernel", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/String_kernel\n"
}