{
    "about": "The Stromquist moving-knives procedure is a procedure for envy-free cake-cutting among three players. It is named after Walter Stromquist who presented it in 1980. [1]", 
    "classification": "Fair Division Protocols", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Stromquist_three-knives_procedure\n", 
    "full_text": "The Stromquist moving-knives procedure is a procedure for envy-free cake-cutting among three players. It is named after Walter Stromquist who presented it in 1980. [1]\nThis procedure was the first envy-free moving knife procedure devised for three players. It requires four knives but only two cuts, so each player receives a single connected piece. There is no natural generalization to more than three players which divides the cake without extra cuts. The resulting partition is not necessarily efficient.[2]:120-121\n\n\nA referee moves a sword from left to right over the cake, hypothetically dividing it into small left piece and a large right piece. Each player moves a knife over the right piece, always keeping it parallel to the sword. The players must move their knives in a continuous manner, without making any \"jumps\".[3] When any player shouts \"cut\", the cake is cut by the sword and by whichever of the players' knives happens to be the central one of the three (that is, the second in order from the sword). Then the cake is divided in the following way:\nEach player can act in a way that guarantees that - according to his own measure - no other player receives more than him:\nWe now prove that any player using the above strategy receives an envy-free share.\nFirst, consider the two quieters. Each of them receives a piece that contains his knife, so they do not envy each other. Additionally, because they remained quiet, the piece they receive is larger in their eyes than Left, so they also don't envy the shouter.\nThe shouter receives Left, which is equal to the piece he could receive by remaining silent and larger than the third piece, hence the shouter does not envy any of the quieters.\nFollowing this strategy each person gets the largest or one of the largest pieces by their own valuation and therefore the division is envy-free.\nThe same analysis shows that the division is envy-free even in the somewhat degenerate case when there are two shouters, and the leftmost piece is given to any of them.\nThe moving-knives procedure can be adapted for chore division - dividing a cake with a negative value.[4]:exercise 5.11", 
    "name": "Stromquist Three Knives Procedure"
}