{
    "about": "In mathematics, the Sturm sequence of a univariate polynomial p is a sequence of polynomials associated with p and its derivative by a variant of Euclid's algorithm for polynomials. Sturm's theorem expresses the number of distinct real roots of p located in an interval in terms of the number of changes of signs of the values of the Sturm's sequence at the bounds of the interval. Applied to the interval of all the real numbers, it gives the total number of real roots of p.", 
    "name": "Sturm'S Theorem", 
    "classification": "Computer Algebra", 
    "full_text": "In mathematics, the Sturm sequence of a univariate polynomial p is a sequence of polynomials associated with p and its derivative by a variant of Euclid's algorithm for polynomials. Sturm's theorem expresses the number of distinct real roots of p located in an interval in terms of the number of changes of signs of the values of the Sturm's sequence at the bounds of the interval. Applied to the interval of all the real numbers, it gives the total number of real roots of p.\nWhereas the fundamental theorem of algebra readily yields the overall number of complex roots, counted with multiplicity, it does not provide a procedure for calculating them. Sturm's theorem counts the number of distinct real roots and locates them in intervals. By subdividing the intervals containing some roots, it can isolate the roots into arbitrary small intervals, each containing exactly one root. This yields an arbitrary-precision numeric root finding algorithm for univariate polynomials.\nSturm's sequence and Sturm's theorems are named after Jacques Charles François Sturm.\n\n\nA Sturm chain or Sturm sequence is a finite sequence of polynomials\nof decreasing degree with these following properties:\nSturm's sequence is a modification of Fourier's sequence.\nTo obtain a Sturm chain, Sturm himself proposed to choose the intermediary results when applying Euclid's algorithm to p and its derivative:\nwhere rem(pi, pj) and qi are the remainder and the quotient of the polynomial long division of pi by pj, and where m is the minimal number of polynomial divisions (never greater than deg(p)) needed to obtain a zero remainder. That is, successively take the remainders with polynomial division and change their signs. Since deg(pi+1) < deg(pi) for 0 ≤ i < m, the algorithm terminates. The final polynomial, pm, is the greatest common divisor of p and its derivative. If p is square free, it shares no roots with its derivative, hence pm will be a non-zero constant polynomial. The Sturm chain, called the canonical Sturm chain, then is\nIf p is not square-free, this sequence does not formally satisfy the definition of a Sturm chain above; nevertheless it still satisfies the conclusion of Sturm's theorem (below).\nLet p0, ..., pm be the Sturm chain of a square-free polynomial p, and let σ(ξ) denote the number of sign changes (ignoring zeroes) in the sequence\nSturm's theorem then states that for two real numbers a < b, the number of distinct roots of p in the half-open interval (a, b] is σ(a) − σ(b).\nLet p0, ..., pm be the canonical Sturm sequence of a polynomial p, not necessarily square-free. Then σ(a) − σ(b) is the number of distinct roots of p in (a, b] whenever a < b are real numbers such that neither a nor b is a multiple root of p.\nSuppose we wish to find the number of roots in some range for the polynomial \n\n\n\np\n(\nx\n)\n=\n\nx\n\n4\n\n\n+\n\nx\n\n3\n\n\n−\nx\n−\n1\n\n\n{\\displaystyle p(x)=x^{4}+x^{3}-x-1}\n\n. So\nUsing polynomial long division to divide p0 by p1 gives the remainder \n\n\n\n−\n\n\n\n3\n16\n\n\n\n\nx\n\n2\n\n\n−\n\n\n\n3\n4\n\n\n\nx\n−\n\n\n\n15\n16\n\n\n\n\n\n{\\displaystyle -{\\tfrac {3}{16}}x^{2}-{\\tfrac {3}{4}}x-{\\tfrac {15}{16}}}\n\n, and upon multiplying this remainder by −1 we obtain \n\n\n\n\np\n\n2\n\n\n(\nx\n)\n=\n\n\n\n3\n16\n\n\n\n\nx\n\n2\n\n\n+\n\n\n\n3\n4\n\n\n\nx\n+\n\n\n\n15\n16\n\n\n\n\n\n{\\displaystyle p_{2}(x)={\\tfrac {3}{16}}x^{2}+{\\tfrac {3}{4}}x+{\\tfrac {15}{16}}}\n\n. Next dividing p1 by p2 and multiplying the remainder by −1, we obtain \n\n\n\n\np\n\n3\n\n\n(\nx\n)\n=\n−\n32\nx\n−\n64\n\n\n{\\displaystyle p_{3}(x)=-32x-64}\n\n. And dividing p2 by p3 and multiplying the remainder by −1, we obtain \n\n\n\n\np\n\n4\n\n\n(\nx\n)\n=\n−\n\n\n\n3\n16\n\n\n\n\n\n{\\displaystyle p_{4}(x)=-{\\tfrac {3}{16}}}\n\n.\nThus the complete chain of Sturm polynomials is:\nTo find the number of roots between −∞ and ∞, first evaluate p0, p1, p2, p3, and p4 at −∞ and note the sequence of signs of the results: + − + + −, which contains three sign changes (+ to −, then − to +, then + to −). The same procedure for ∞ gives the sign sequence + + + − −, which contains just one sign change. Hence the number of roots of the original polynomial between −∞ and ∞ is 3 − 1 = 2. That this is correct can be seen by noting that p(x) = x4 + x3 − x − 1 can be factored as (x2 − 1)(x2 + x + 1), where it is readily verifiable that x2 − 1 has the two roots −1 and 1 while x2 + x + 1 has no real roots. In more complicated examples in which there is no advance knowledge of the roots because factoring is either impossible or impractical, one can experiment with various finite bounds for the range to be considered, thus narrowing down the locations of the roots.\nPolynomials are continuous functions, and any sign change must occur at a root, so consider the behavior of a Sturm chain around the roots of its constituent polynomials.\nFirst, note that two adjacent polynomials can share a common root only when it is a multiple root of p (in which case it is a root of every pi). Indeed, if pi(ξ) = pi−1 (ξ) = 0, then pi+1(ξ) = 0, since sign(pi−1(ξ)) = −sign(pi+1(ξ)). The zero then propagates recursively up and down the chain, so that ξ is a root of all the polynomials p0, ..., pm.\nNext, consider roots of polynomials in the interior (i.e., 0 < i < m) of the Sturm chain that are not multiple roots of p. If pi(ξ) = 0, then from the previous paragraph it is true that pi−1(ξ) ≠ 0 and pi+1(ξ) ≠ 0. Furthermore, sign(pi−1(ξ)) = −sign(pi+1(ξ)). Since pi−1 and pi+1 are continuous, sign(pi+1(x)) = −sign(pi−1(x)) for every x in the vicinity of ξ. Similarly, the sign of pi(x) is constant before and after ξ, and changes as x is crossing ξ. Thus, whenever x is crossing ξ, moving from left to right, the part pi−1, pi, pi+1 of the Sturm chain loses a sign change at one side, and acquires a new sign change at the other side. Consequently, the total number of sign changes is never affected by the polynomial variations in the interior of the chain, and only roots of the original polynomial, at the top of the chain, can affect the total number of sign changes.\nConsider a root ξ, so p(ξ), and assume first that it is a simple root. Then the derivative of p, which is p1, must be non-zero at ξ, so p must be either increasing or decreasing at ξ. If it's increasing, then its sign is changing from negative to positive when moving from left to right while its derivative (again, p1) is positive, so the total number of sign changes decreases by one. Conversely, if it's decreasing, then its sign changes from positive to negative while its derivative is negative, so again the total number of sign changes decreases by one.\nFinally, let ξ be a multiple root of p, and let p0, ..., pm be the canonical Sturm chain. Let d = gcd(p,p′), q = p/d, and let q0, ..., qm′ be the canonical Sturm chain of q. Then m = m′ and pi = qid for every i. In particular, σ(x) is the same for both chains whenever x is not a root of d. Then the number of sign changes (in either chain) around ξ decreases by one, since ξ is a simple root of q.\nIn summary, only sign changes at roots of the original polynomial affect the total number of sign changes across the chain, and the total number of sign changes always decreases by one as roots are passed. The theorem follows directly.\nFor counting and isolating the real roots, other methods are usually preferred, because they are computationally more efficient; these methods all use Descartes' rule of signs (just like Fourier[1] did back in 1820) and Vincent's theorem. The very first one of those methods was initially called \"modified Uspensky's algorithm\" by its inventors,[2] but it was later shown that there is no Uspensky's method;[3] afterwards, people started calling it either \"Collins-Akritas method\"[4] or \"Descartes' method\" only to be shown that there is no Descartes' method[4] either. Finally, François Boulier, of the University of Lille,[5] p. 24, gave it the name \"Vincent-Collins-Akritas\" (VCA for short) to also give credit to Vincent. VCA is a bisection method; there exists also a continued fractions method based on Vincent's theorem namely, the Vincent-Akritas-Strzeboński (VAS) method.[6]\nVAS is based on Budan's theorem whereas Sturm's method was inspired by Fourier's theorem. In fact Sturm himself,[7] p. 108, acknowledges the great influence Fourier's theorem had on him: « C'est en m'appuyant sur les principes qu'il a posés, et en imitant ses démonstrations, que j'ai trouvé les nouveaux théorèmes que je vais énoncer. » which translates to \"It is by relying upon the principles he has laid out and by imitating his proofs that I have found the new theorems which I am about to announce.\"\nSturm's theorem can be used to compute the total number of real roots of a polynomial.\nThis may be done by choosing −a = b = M where M is larger than the absolute value of every root. For example, a bound due to Cauchy says that all real roots of a polynomial with coefficients ai are in the interval [−M, M], where\nAlthough theoretically the above approach is the simplest, in practice bounds on the positive (only) roots of polynomials are used and the positive roots are isolated and evaluated first; the negative roots are treated by first substituting x by −x, then compute a new (positive root) bound to isolate and evaluate the negative roots. Sturm's method and VCA need to compute only one bound to isolate the positive roots. In contrast, to isolate the positive roots VAS needs to compute various positive bounds, for the various polynomials that appear in the process.[8][9]\nAnother method is computationally simpler. One can use the fact that for large x, the sign of\nis sign(an), whereas sign(p(−x)) is (−1)nan. In this way, simply counting the sign changes in the leading coefficients in the Sturm chain readily gives the number of distinct real roots of a polynomial.\nSturm's theorem allows also to determine the multiplicity of a given root, say ξ. Indeed, suppose that a < ξ < b, with σ(a) − σ(b) = 1. Then, ξ has multiplicity k precisely when ξ is a root with multiplicity k − 1 of pm (since it is the GCD of p and its derivative). Thus the multiplicity of ξ may be computed by recursively applying Sturm's theorem to pm. However, this method is rarely used, as square-free factorization is computationally more efficient for this purpose.\nThe remainder is needed to compute the chain using Euclid's algorithm. For two polynomials\nthis is accomplished by\nwhere the quotient is built solely of the first two leading coefficients.\nLet ξ be in the compact interval [a, b]. A generalized Sturm chain over [a, b] is a finite sequence of real polynomials (X0, X1, ..., Xr) such that:\nOne can check that each Sturm chain is indeed a generalized Sturm chain.", 
    "dbpedia_url": "http://dbpedia.org/resource/Sturm's_theorem", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Sturm's_theorem\n"
}