{
    "about": "In computational complexity theory, there is an open problem of whether some information about a sum of radicals may be computed in polynomial time depending on the input size, i.e., in the number of bits necessary to represent this sum. It is of importance for many problems in computational geometry, since the computation of the Euclidean distance between two points in the general case involves the computation of a square root, and therefore the perimeter of a polygon or the length of a polygonal chain takes the form of a sum of radicals.[1]", 
    "name": "Sum Of Radicals", 
    "classification": "Computer Algebra", 
    "full_text": "In computational complexity theory, there is an open problem of whether some information about a sum of radicals may be computed in polynomial time depending on the input size, i.e., in the number of bits necessary to represent this sum. It is of importance for many problems in computational geometry, since the computation of the Euclidean distance between two points in the general case involves the computation of a square root, and therefore the perimeter of a polygon or the length of a polygonal chain takes the form of a sum of radicals.[1]\nThe sum of radicals is defined as a finite linear combination of radicals:\nwhere \n\n\n\nn\n,\n\nr\n\ni\n\n\n\n\n{\\displaystyle n,r_{i}}\n\n are natural numbers and \n\n\n\n\nk\n\ni\n\n\n,\n\nx\n\ni\n\n\n\n\n{\\displaystyle k_{i},x_{i}}\n\n are real numbers.\nMost theoretical research in computational geometry of combinatorial character assumes the computational model of infinite precision real RAM, i.e., an abstract computer in which real numbers and operations on them are performed with infinite precision and the input size of a real number and the cost of an elementary operation are constants.[2] However, there is research in computational complexity, especially in computer algebra, where the input size of a number is the number of bits necessary for its representation.[3]\nIn particular, of interest in computational geometry is the problem of determining the sign of the sum of radicals. For instance, the length of a polygonal path in which all vertices have integer coordinates may be expressed using the Pythagorean theorem as a sum of integer square roots, so in order to determine whether one path is longer or shorter than another in a Euclidean shortest path problem, it is necessary to determine the sign of an expression in which the first path's length is subtracted from the second; this expression is a sum of radicals.\nIn a similar way, the sum of radicals problem is inherent in the problem of minimum-weight triangulation in the Euclidean metric.\nIn 1991, Blömer proposed a polynomial time Monte Carlo algorithm for determining whether a sum of radicals is zero, or more generally whether it represents a rational number.[4] While Blömer's result does not resolve the computational complexity of finding the sign of the sum of radicals, it does imply that if the latter problem is in class NP, then it is also in co-NP.[4]", 
    "dbpedia_url": "http://dbpedia.org/resource/Sum_of_radicals", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Sum_of_radicals\n"
}