{
    "about": "A talk box or talkbox is an effects unit that allows musicians to modify the sound of a musical instrument by shaping the frequency content of the sound and to apply speech sounds (in the same way as singing) onto the sounds of the instrument. Typically, a talk box directs sound from the instrument into the musician's mouth by means of a plastic tube adjacent to their vocal microphone. The musician controls the modification of the instrument's sound by changing the shape of the mouth, \"vocalizing\" the instrument's output into a microphone. ", 
    "name": "Talk Box", 
    "classification": "Digital Signal Processing", 
    "full_text": "A talk box or talkbox is an effects unit that allows musicians to modify the sound of a musical instrument by shaping the frequency content of the sound and to apply speech sounds (in the same way as singing) onto the sounds of the instrument. Typically, a talk box directs sound from the instrument into the musician's mouth by means of a plastic tube adjacent to their vocal microphone. The musician controls the modification of the instrument's sound by changing the shape of the mouth, \"vocalizing\" the instrument's output into a microphone. \n\nA talk box is usually an effects pedal that sits on the floor and contains a speaker attached with an airtight connection to a plastic tube; however, it can come in other forms, including homemade, usually crude, versions, and higher quality custom-made versions. The speaker is generally in the form of a compression driver, the sound-generating part of a horn loudspeaker with the horn replaced by the tube connection.\nThe box has connectors for the connection to the speaker output of an instrument amplifier and a connection to a normal instrument speaker. A foot-operated switch on the box directs the sound either to the talk box speaker or to the normal speaker. The switch is usually a push-on/push-off type. The other end of the tube is taped to the side of a microphone, extending enough to direct the reproduced sound in or near the performer's mouth.\nWhen activated, the sound from the amplifier is reproduced by the speaker in the talk box and directed through the tube into the performer's mouth. The shape of the mouth filters the sound, with the modified sound being picked up by the microphone. The shape of the mouth changes the harmonic content of the sound in the same way it affects the harmonic content generated by the vocal folds when speaking.\nThe performer can vary the shape of the mouth and position of the tongue, changing the sound of the instrument being reproduced by the talk box speaker. The performer can mouth words, with the resulting effect sounding as though the instrument is speaking. This \"shaped\" sound exits the performer's mouth, and when it enters a microphone, an instrument/voice hybrid is heard.\nThe sound can be that of any musical instrument, but the effect is most commonly associated with the guitar. The rich harmonics of an electric guitar are shaped by the mouth, producing a sound very similar to voice, effectively allowing the guitar to appear to \"speak\".\nThe effect produced by talk boxes and vocoders are often conflated by listeners.[1][2] However, they have radically different mechanisms for achieving the effect. Talk boxes send the carrier signal into the singer's mouth, where it is then modulated by the singer themselves. On the other hand, vocoders process both the carrier and the modulator signal integrally, producing the output as a separate electric signal. In addition, they are also more common in different genres: a talk box is often found in rock music due to its typical pairing with a guitar, whereas vocoders are almost always paired with synthesizers, and as such, are ubiquitous in electronic music.\nIn 1939, Alvino Rey, amateur radio operator W6UK, used a carbon throat microphone wired in such a way as to modulate his electric steel guitar sound. The mic, originally developed for military pilot communications, was placed on the throat of Rey's wife Luise King (one of The King Sisters), who stood behind a curtain and mouthed the words, along with the guitar lines. The novel-sounding combination was called \"Singing Guitar\", and employed on stage and in the movie Jam Session, as a \"novelty\" attraction, but was not developed further.\nRey also created a somewhat similar \"talking\" effect by manipulating the tone controls of his Fender electric guitar, but the vocal effect was less pronounced.[3]\nAnother early voice effect using the same principle of the throat as a filter was the Sonovox, invented by Gilbert Wright in 1939. Instead of a throat microphone modulating a guitar signal, it used small transducers attached to the performer's throat to pickup voice sounds.[4] The Sonovox was marketed and promoted by the Wright-Sonovox company, an affiliate of the Free & Peters advertising agency.\nThe Sonovox was used in many radio station IDs and jingles produced by JAM Creative Productions and the PAMS advertising agency of Dallas, Texas. Lucille Ball made one of her earliest film appearances during the 1930s in a Pathé Newsreel demonstrating the Sonovox.[5]\nThe first use in music was a score by Ernst Toch in the Paramount Picture \"The Ghost Breakers\", in June 1940.[6] The Sonovox also appeared in the 1940 film You'll Find Out starring Kay Kyser and his orchestra, Bela Lugosi, Boris Karloff, and Peter Lorre. Lugosi uses the Sonovox to portray the voice of a dead person during a seance.\nThe Sonovox was used in films such as A Letter to Three Wives (1949), Possessed (1947), The Secret Life of Walter Mitty (1947), The Good Humor Man (1950), the voice of Casey Junior the train in Dumbo (1941) and The Reluctant Dragon (1941).\nIt was heard on the piano in Sparky's Magic Piano, and the airplane in Whizzer The Talking Airplane (1947). The Sonovox was also used to give the impression instruments \"talking\" in the children's album Rusty in Orchestraville (1949).\nBritish rock band The Who included a piece on their 1967 album, The Who Sell Out, that consisted of the days of the week \"spoken\" by electric guitar chords using the Sonovox. This recording was in fact a radio jingle by created by PAMS.\nPete Drake, a Nashville mainstay on the pedal steel guitar, used a talk box on his 1964 album Forever, in what came to be called his \"talking steel guitar\". The following year Gallant released three albums with the box, Pete Drake & His Talking Guitar, Talking Steel and Singing Strings, and Talking Steel Guitar.[7] Drake's device consisted of an 8-inch paper cone speaker driver attached to a funnel from which a clear tube brought the sound to the performer's mouth. It was only loud enough to be useful in the recording studio.[3]\nThe Kustom Electronics device, \"The Bag\",[8] was the first mass market talk box and was housed in a decorative bag slung over the shoulder like a wine bottle. It used a 30-watt driver and was released to the mass music market in early 1969, two years before Bob Heil's Talk Box became widely available. The Bag is claimed to have been designed by Doug Forbes,[9][10] who states that exactly the same concept (speaker attached to a plastic tube and inserted into the mouth) had previously been patented as an artificial larynx.[11]\nJohn Kay of Steppenwolf used the Kustom Electronics Talk Box (The Bag) in studio recordings and live performances beginning in 1969. On the album Steppenwolf Live recorded in January 1970, the Kustom Bag talk box can clearly be heard on the tracks \"From Here To There Eventually\", \"Hey Lawdy Mama\" and \"Twisted\". John Kay was observed using a Kustom Electronics talk box on stage in Charlotte, North Carolina in June 1970 and at two shows in New Jersey (Wildwood and Cherry Hill) in 1971. Steppenwolf appeared on the live music TV shows The Midnight Special and Don Kirshner's Rock Concert and lead guitarist Bobby Cochran as well as John Kay used the Kustom Bag. Two other early examples of a Kustom Electronics talk box being used on studio recordings are Sly and the Family Stone's \"Sex Machine\" from their album Stand! and Al Kooper with Shuggie Otis' \"One Room Country Shack\" from their album Kooper Session, both released in 1969.\nThe band Iron Butterfly used a talk box in the song \"Butterfly Bleu\" from the album Metamorphosis in 1970. Alvin Lee used a talk box for the Ten Years After song \"I Say Yeah\" from the album Watt in 1970. Young-Holt Unlimited featured a talk box on their song \"Wah-Wah Man\", also released in 1970, on the album Born Again. Stevie Wonder first used a talk box on his album Music of My Mind in early 1972. The Osmonds used a talk box on their 1972 track \"Hold Her Tight\". John Rebourn used a talk box on the song \"Back on the Road Again\" in 1972 on his \"Faro Annie\" album. The Crusaders featured a talk box on the album \"Southern Comfort\" in 1974 – notably on the song \"Greasy Spoon\". Jeff Beck used the Kustom Bag talk box on \"She's A Woman\" from his 1975 release Blow by Blow, and was seen using it for the song on BBC television program \"Five Faces of the Guitar\" in 1974 in which he also explains its use to the host of the show.[12]\nThe first high-powered Talk Box was developed by Bob Heil[13] but there is clearly prior art in the form of the Kustom Electronics device, \"The Bag\", referenced above. Heil came up with the first high-powered Talk Box that could be reliable when used on high-level rock stages. His first Heil Talk Box was built for Joe Walsh's Barnstorm tour. Heil and Walsh both avid ham radio experimenters (K9EID and WB6ACU), along with Walsh's guitar tech \"Krinkle\" combined a 250-watt JBL driver and suitable hi-pass filter which was used for Walsh's single \"Rocky Mountain Way\". Walsh gives credit to Bill West, an electrical engineer, Nashville steel guitarist and first husband of country music legend Dottie West, for inventing the talk box for him in the May 2012 issue of Guitar World magazine.\nPete Townshend, in his 2012 autobiography Who I Am, claimed to have invented a version of the Talk Box during a Who tour of the USA in 1976. \"I built a speaker in a small box, attached a tube and put the tube in my mouth, allowing me to speak music.\" Townshend did not specify if his version was for guitar or only for music.\nIn 1988, Heil sold the manufacturing rights to Dunlop Manufacturing, Inc., which currently builds the Heil Talk Box to the exact standards that Heil designed in 1973.\nThe 1974 hit single \"Tell Me Something Good\", performed by Rufus and Chaka Khan and written by Stevie Wonder, which peaked at number three on the Billboard Hot 100, was among the earliest hits to use the guitar talk box.\nIn an interview for the 1999 DVD Live in Detroit, Peter Frampton says he first heard the talk box in 1970 while sitting in on sessions for George Harrison's All Things Must Pass. While he sat next to Pete Drake in the album sessions at Abbey Road studio, he heard Pete using it with a pedal steel guitar. Frampton said in the same interview that the sound it produced reminded him of an audio effect he loved listening to on Radio Luxembourg in the later 1960s. Frampton acquired one as a Christmas present from Bob Heil in 1974. It was a hand-built Talk Box in a fiberglass box using a 100-watt high-powered driver. This was the Heil Talk Box used for the Frampton Comes Alive tour and album.[14][15][16][17] He then promptly locked himself away in a practice space for two weeks, and came out with some mastery of it. Due to the success of the albums Frampton and Frampton Comes Alive!, and particularly the hit singles \"Do You Feel Like We Do\" and \"Show Me the Way\", Frampton has become somewhat synonymous with the talk box.\nPeter Frampton also now sells his own line of custom-designed \"Framptone\" products, including a talk box.[18]\nIn 1972 Todd Rundgren used a Talk Box on the album Something/Anything? on the instrumental track, \"Breathless\". Over a synthesized background his VCS3 synthesizer repeatedly \"sings\" the words \"I am so breathless\", which can be taken as a reference to the Talk Box. In 1975, Nazareth lead singer Dan McCafferty used a talk box in the popular single \"Hair of the Dog\". In 1975, Aerosmith guitarist Joe Perry used a talk box in the band's highly popular singles \"Sweet Emotion\" and \"Walk This Way\", both off the album Toys in the Attic. He also used it in the theme song from the Spider-Man 90's cartoon. In 1976, Steely Dan guitarist Walter Becker recorded the talk box effect atop an already-recorded Dean Parks solo in \"Haitian Divorce\", on the album The Royal Scam.[19] It was also used in a solo section of \"East St. Louis Toodle-Oo\", on Steely Dan's 1974 album Pretzel Logic. Ronnie Montrose used a talk box on the title track from his 1976 album \"Jump On It\". Also in 1976, the band Ruby (featuring Tom Fogerty) used a talk box on the track \"Running Back To Me\". David Gilmour of Pink Floyd used the talk box on \"Pigs (Three Different Ones)\" from their 1977 Animals album, and on \"Keep Talking\" from 1994's The Division Bell. The band Stillwater used a talkbox on their song \"Mind Bender\" in 1977. Also from 1977, the Meters used one on their track \"Funkify Your Life\". Roger Troutman, lead singer of the R&B group Zapp, used the talk box on the group's first hit single in 1980, \"More Bounce to the Ounce\", and in numerous other songs including Tupac Shakur's \"California Love\".\nMatthias Jabs, lead guitarist for Scorpions, has used the talk box in many of their songs, most notably the 1980 song \"The Zoo\". Joe Walsh used a talk box in the song \"Space Age Whiz Kids\" on the 1983 album You Bought It You Name It, in \"I Broke My Leg\" on the 1985 album The Confessor, and also in \"Half of the Time\" on the 1987 album Got Any Gum?. Walsh, along with Don Felder, did a dual talk box guitar solo in the song \"Those Shoes\" from their 1979 album, The Long Run. The 1986 Daryl Hall hit \"Foolish Pride\" features the talk box played by English guitarist Richard Morcombe.\nBon Jovi guitarist Richie Sambora used the Heil Talk box in many of the band's songs, including 1986's \"Livin' on a Prayer\" from Slippery When Wet, 2000's \"It's My Life\" from Crush, 2002's \"Everyday\" from Bounce, 2007's \"We Got it Goin' On\" (Lost Highway) and 2009's \"Bullet\" (The Circle). Lead guitarist Slash of the hard rock band Guns N' Roses used a talk box in \"Anything Goes\" off their album Appetite for Destruction, released in 1987, and in \"Dust and Bones\", from their following record, Use Your Illusion I. Mötley Crüe's Mick Mars used a talk box in \"Kickstart My Heart\" off their 1989 release, Dr. Feelgood.\nBrian May was asked in an interview whether the song \"Delilah\" was recorded using a talk box on Queen's 1991 Innuendo record. May answered: \"Yes, I finally succumbed and used one ... I suppose there’s no other way to make the meow sounds, meow, meow, meow.\" Tom Morello of Rage Against the Machine used a talk box on their song \"Wake Up\" in 1992. Bob Hartman, from Petra, used the talk box during the 1993 song \"Underneath the Blood\", from their Wake-Up Call album. Metallica used a talk box during the solo on \"The House Jack Built\", from the 1996 album Load. The Foo Fighters' Dave Grohl used a talk box during their song \"Generator\" off their 1999 release, There Is Nothing Left To Lose; his use of the device was partly inspired by Grohl's admiration of Peter Frampton and Joe Walsh. Dream Theater guitarist John Petrucci used the talk box for live performances of the song \"Home\", from the band's 1999 album Metropolis Pt. 2: Scenes from a Memory. Avenged Sevenfold vocalist M. Shadows used a talk box in their song \"Lost\" off their 2007 self-titled album, Avenged Sevenfold. In Godsmack's cover of the Joe Walsh song \"Rocky Mountain Way\", frontman Sully Erna used a talk box.\nAlice in Chains, Adam Jones of Tool, Slash, the Eagles, Chromeo, plus dozens of other groups continue to keep the Heil Talk Box in their song sets.\nThe talk box was used in Elton John's 1975 album Rock of the Westies, on the song \"Dan Dare (Pilot of the Future)\", as played by Davey Johnstone.\nA talk box connected to an iPad running an effects program was used to create the voice of the character BB-8 in Star Wars: The Force Awakens.", 
    "dbpedia_url": "http://dbpedia.org/resource/Talk_box", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Talk_box\n"
}