{
    "about": "A time-invariant (TIV) system is a system whose output does not depend explicitly on time. Such systems are regarded as a class of systems in the field of system analysis. Lack of time dependence is captured in the following mathematical property of such a system:", 
    "classification": "Signal Processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Time-invariant_system\n", 
    "full_text": "A time-invariant (TIV) system is a system whose output does not depend explicitly on time. Such systems are regarded as a class of systems in the field of system analysis. Lack of time dependence is captured in the following mathematical property of such a system:\nThis property can be satisfied if the transfer function of the system is not a function of time except expressed by the input and output.\nIn the context of a system schematic, this property can also be stated as follows:\nIf a time-invariant system is also linear, it is the subject of LTI system theory (linear time-invariant) with direct applications in NMR spectroscopy, seismology, circuits, signal processing, control theory, and other technical areas. Nonlinear time-invariant systems lack a comprehensive, governing theory. Discrete time-invariant systems are known as shift-invariant systems. Systems which lack the time-invariant property are studied as time-variant systems.\n\n\nTo demonstrate how to determine if a system is time-invariant, consider the two systems:\nSince system A explicitly depends on t outside of \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n and \n\n\n\ny\n(\nt\n)\n\n\n{\\displaystyle y(t)}\n\n, it is not time-invariant. System B, however, does not depend explicitly on t so it is time-invariant.\nA more formal proof of why systems A and B above differ is now presented. To perform this proof, the second definition will be used.\nSystem A:\nSystem B:\nWe can denote the shift operator by \n\n\n\n\n\nT\n\n\nr\n\n\n\n\n{\\displaystyle \\mathbb {T} _{r}}\n\n where \n\n\n\nr\n\n\n{\\displaystyle r}\n\n is the amount by which a vector's index set should be shifted. For example, the \"advance-by-1\" system\ncan be represented in this abstract notation by\nwhere \n\n\n\n\n\n\nx\n~\n\n\n\n\n\n{\\displaystyle {\\tilde {x}}}\n\n is a function given by\nwith the system yielding the shifted output\nSo \n\n\n\n\n\nT\n\n\n1\n\n\n\n\n{\\displaystyle \\mathbb {T} _{1}}\n\n is an operator that advances the input vector by 1.\nSuppose we represent a system by an operator \n\n\n\n\nH\n\n\n\n{\\displaystyle \\mathbb {H} }\n\n. This system is time-invariant if it commutes with the shift operator, i.e.,\nIf our system equation is given by\nthen it is time-invariant if we can apply the system operator \n\n\n\n\nH\n\n\n\n{\\displaystyle \\mathbb {H} }\n\n on \n\n\n\n\n\n\nx\n~\n\n\n\n\n\n{\\displaystyle {\\tilde {x}}}\n\n followed by the shift operator \n\n\n\n\n\nT\n\n\nr\n\n\n\n\n{\\displaystyle \\mathbb {T} _{r}}\n\n, or we can apply the shift operator \n\n\n\n\n\nT\n\n\nr\n\n\n\n\n{\\displaystyle \\mathbb {T} _{r}}\n\n followed by the system operator \n\n\n\n\nH\n\n\n\n{\\displaystyle \\mathbb {H} }\n\n, with the two computations yielding equivalent results.\nApplying the system operator first gives\nApplying the shift operator first gives\nIf the system is time-invariant, then", 
    "name": "Time Invariant System"
}