{
    "about": "The time-evolving block decimation (TEBD) algorithm is a numerical scheme used to simulate one-dimensional quantum many-body systems, characterized by at most nearest-neighbour interactions. It is dubbed Time-evolving Block Decimation because it dynamically identifies the relevant low-dimensional Hilbert subspaces of an exponentially larger original Hilbert space. The algorithm, based on the Matrix Product States formalism, is highly efficient when the amount of entanglement in the system is limited, a requirement fulfilled by a large class of quantum many-body systems in one dimension.", 
    "classification": "Computational Physics", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Time-evolving_block_decimation\n", 
    "full_text": "The time-evolving block decimation (TEBD) algorithm is a numerical scheme used to simulate one-dimensional quantum many-body systems, characterized by at most nearest-neighbour interactions. It is dubbed Time-evolving Block Decimation because it dynamically identifies the relevant low-dimensional Hilbert subspaces of an exponentially larger original Hilbert space. The algorithm, based on the Matrix Product States formalism, is highly efficient when the amount of entanglement in the system is limited, a requirement fulfilled by a large class of quantum many-body systems in one dimension.\n\n\nThere is nowadays a considerable interest in the field of quantum theory for computational methods well-suited to the physics of many-body systems. Considering the inherent difficulties of simulating general quantum many-body systems, the exponential increase in parameters with the size of the system, and correspondingly, the high computational costs, one solution would be to look for numerical methods that deal with special cases, where one can profit from the physics of the system. The raw approach, by directly dealing with all the parameters used to fully characterize a quantum many-body system is seriously impeded by the lavishly exponential buildup with the system size of the amount of variables needed for simulation, which leads, in the best cases, to unreasonably long computational times and extended use of memory. To get around this problem a number of various methods have been developed and put into practice in the course of time, one of the most successful ones being the quantum Monte Carlo method (QMC). Also the density matrix renormalization group (DMRG) method, next to QMC, is a very reliable method, with an expanding community of users and an increasing number of applications to physical systems.\nWhen the first quantum computer will be plugged in and functioning, the perspectives for the field of computational physics will look rather promising, but until that day one has to restrict oneself to the mundane tools offered by classical computers. While experimental physicists are putting a lot of effort in trying to build the first quantum computer, theoretical physicists are searching, in the field of quantum information theory (QIT), for genuine quantum algorithms, appropriate for problems that would perform badly when trying to be solved on a classical computer, but pretty fast and successful on a quantum one. The search for such algorithms is still going, the best-known (and almost the only ones found) being the Shor's algorithm, for factoring large numbers, and Grover's search algorithm.\nIn the field of QIT one has to identify the primary resources necessary for genuine quantum computation. Such a resource may be responsible for the speedup gain in quantum versus classical, identifying them means also identifying systems that can be simulated in a reasonably efficient manner on a classical computer. Such a resource is quantum entanglement; hence, it is possible to establish a distinct lower bound for the entanglement needed for quantum computational speedups.\nGuifré Vidal, then at the Institute for Quantum Information, Caltech, has recently proposed a scheme useful for simulating a certain category of quantum[1] systems. He asserts that \"any quantum computation with pure states can be efficiently simulated with a classical computer provided the amount of entanglement involved is sufficiently restricted\" . This happens to be the case with generic Hamiltonians displaying local interactions, as for example, Hubbard-like Hamiltonians. The method exhibits a low-degree polynomial behavior in the increase of computational time with respect to the amount of entanglement present in the system. The algorithm is based on a scheme that exploits the fact that in these one-dimensional systems the eigenvalues of the reduced density matrix on a bipartite split of the system are exponentially decaying, thus allowing us to work in a re-sized space spanned by the eigenvectors corresponding to the eigenvalues we selected.\nOne can also estimate the amount of computational resources required for the simulation of a quantum system on a classical computer, knowing how the entanglement contained in the system scales with the size of the system. The classically (and quantum, as well) feasible simulations are those that involve systems only a trifle entangled—the strongly entangled ones being, on the other hand, good candidates only for genuine quantum computations.\nThe numerical method is efficient in simulating real-time dynamics or calculations of ground states using imaginary-time evolution or isentropic interpolations between a target Hamiltonian and a Hamiltonian with an already-known ground state. The computational time scales linearly with the system size, hence many-particles systems in 1D can be investigated.\nA useful feature of the TEBD algorithm is that it can be reliably employed for time evolution simulations of time-dependent Hamiltonians, describing systems that can be realized with cold atoms in optical lattices, or in systems far from equilibrium in quantum transport. From this point of view, TEBD had a certain ascendance over DMRG, a very powerful technique, but until recently not very well suited for simulating time-evolutions. With the Matrix Product States formalism being at the mathematical heart of DMRG, the TEBD scheme was adopted by the DMRG community, thus giving birth to the time dependent DMRG [6], t-DMRG for short.\nAround the same time, other groups have developed similar approaches in which quantum information plays a predominant role as, for example, in DMRG implementations for periodic boundary conditions [7], and for studying mixed-state dynamics in one-dimensional quantum lattice systems,.[2][3] Those last approaches actually provide a formalism that is more general than the original TEBD approach, as it also allows to deal with evolutions with matrix product operators; this enables the simulation of nontrivial non-infinitesimal evolutions as opposed to the TEBD case, and is a crucial ingredient to deal with higher-dimensional analogues of matrix product states.\nLet us consider a chain of N qubits, described by the function \n\n\n\n\n|\n\nΨ\n⟩\n∈\n\nH\n\n\n⊗\n\nN\n\n\n\n\n{\\displaystyle |\\Psi \\rangle \\in H^{{\\otimes }N}}\n\n. The most natural way of describing \n\n\n\n\n|\n\nΨ\n⟩\n\n\n{\\displaystyle |\\Psi \\rangle }\n\n would be using the local \n\n\n\n\nM\n\nN\n\n\n\n\n{\\displaystyle M^{N}}\n\n-dimensional basis \n\n\n\n\n|\n\n\ni\n\n1\n\n\n,\n\ni\n\n2\n\n\n,\n.\n.\n,\n\ni\n\nN\n−\n1\n\n\n,\n\ni\n\nN\n\n\n⟩\n\n\n{\\displaystyle |i_{1},i_{2},..,i_{N-1},i_{N}\\rangle }\n\n:\nwhere M is the on-site dimension.\nThe trick of TEBD is to re-write the coefficients \n\n\n\n\nc\n\n\ni\n\n1\n\n\n\ni\n\n2\n\n\n.\n.\n\ni\n\nN\n\n\n\n\n\n\n{\\displaystyle c_{i_{1}i_{2}..i_{N}}}\n\n:\nThis may seem rather esoteric in the beginning but let's try take a look at how this decomposition is obtained and what it is good for.\nFor this we have to make use of another piece of mathematics called the Schmidt decomposition of a state, or singular value decomposition.\nLet us consider the state of a bipartite system \n\n\n\n|\nΨ\n⟩\n∈\n\n\nH\n\nA\n\n\n⊗\n\nH\n\nB\n\n\n\n\n\n{\\displaystyle \\vert \\Psi \\rangle \\in {H_{A}\\otimes H_{B}}}\n\n. Every such state \n\n\n\n\n|\n\n\nΨ\n\n⟩\n\n\n{\\displaystyle |{\\Psi }\\rangle }\n\n can be represented in an appropriately chosen basis as:\nwhere \n\n\n\n\n|\n\n\n\nΦ\n\ni\n\n\nA\n\n\n\nΦ\n\ni\n\n\nB\n\n\n\n⟩\n=\n\n|\n\n\n\nΦ\n\ni\n\n\nA\n\n\n\n⟩\n⊗\n\n|\n\n\n\nΦ\n\ni\n\n\nB\n\n\n\n⟩\n\n\n{\\displaystyle |{\\Phi _{i}^{A}\\Phi _{i}^{B}}\\rangle =|{\\Phi _{i}^{A}}\\rangle \\otimes |{\\Phi _{i}^{B}}\\rangle }\n\n are formed with vectors \n\n\n\n\n|\n\n\n\nΦ\n\ni\n\n\nA\n\n\n\n⟩\n\n\n{\\displaystyle |{\\Phi _{i}^{A}}\\rangle }\n\n that make an orthonormal basis in \n\n\n\n\nH\n\nA\n\n\n\n\n{\\displaystyle H_{A}}\n\n and, correspondingly, vectors \n\n\n\n\n|\n\n\n\nΦ\n\ni\n\n\nB\n\n\n\n⟩\n\n\n{\\displaystyle |{\\Phi _{i}^{B}}\\rangle }\n\n, which form an orthonormal basis in \n\n\n\n\n\nH\n\nB\n\n\n\n\n\n{\\displaystyle {H_{B}}}\n\n, with the coefficients \n\n\n\n\na\n\ni\n\n\n\n\n{\\displaystyle a_{i}}\n\n being real and positive, \n\n\n\n\n∑\n\ni\n=\n1\n\n\nM\n\n\n\na\n\ni\n\n\n2\n\n\n=\n1\n\n\n{\\displaystyle \\sum \\limits _{i=1}^{M}a_{i}^{2}=1}\n\n. This is called the Schmidt decomposition (SD) of a state. The summation can go up to \n\n\n\n\nM\n\nmax\n\n\n=\nmin\n(\ndim\n⁡\n(\n\n\nH\n\nA\n\n\n\n)\n,\ndim\n⁡\n(\n\n\nH\n\nB\n\n\n\n)\n)\n\n\n{\\displaystyle M_{\\max }=\\min(\\dim({H_{A}}),\\dim({H_{B}}))}\n\n, the lowest of the two Hilbert spaces. The Schmidt rank of a bipartite split is given by the number of non-zero Schmidt coefficients. If the Schmidt rank is one, the split is characterized by a product state. The vectors of the SD are determined up to a phase and the eigenvalues and the Schmidt rank are unique.\nFor example, the two-qubit state:\nhas the following SD:\nwith\nOn the other hand, the state:\nis a product state:\nAt this point we probably know enough to try to see how we explicitly build the decomposition (let's call it D).\nConsider the bipartite splitting \n\n\n\n[\n1\n]\n:\n[\n2..\nN\n]\n\n\n{\\displaystyle [1]:[2..N]}\n\n. The SD has the coefficients \n\n\n\n\nλ\n\n\n\nα\n\n\n1\n\n\n\n\n[\n1\n]\n\n\n\n\n{\\displaystyle \\lambda _{{\\alpha }_{1}}^{[1]}}\n\n and eigenvectors \n\n\n\n\n|\n\n\n\nΦ\n\n\nα\n\n1\n\n\n\n\n[\n1\n]\n\n\n\n⟩\n\n|\n\n\n\nΦ\n\n\nα\n\n1\n\n\n\n\n[\n2..\nN\n]\n\n\n\n⟩\n\n\n{\\displaystyle |{\\Phi _{\\alpha _{1}}^{[1]}}\\rangle |{\\Phi _{\\alpha _{1}}^{[2..N]}}\\rangle }\n\n. By expanding the \n\n\n\n\n|\n\n\n\nΦ\n\n\nα\n\n1\n\n\n\n\n[\n1\n]\n\n\n\n⟩\n\n\n{\\displaystyle |{\\Phi _{\\alpha _{1}}^{[1]}}\\rangle }\n\n's in the local basis, one can write:\nThe process can be decomposed in three steps, iterated for each bond (and, correspondingly, SD) in the chain:\nStep 1: express the \n\n\n\n\n|\n\n\n\nΦ\n\n\nα\n\n1\n\n\n\n\n[\n2..\nN\n]\n\n\n\n⟩\n\n\n{\\displaystyle |{\\Phi _{\\alpha _{1}}^{[2..N]}}\\rangle }\n\n's in a local basis for qubit 2:\nThe vectors \n\n\n\n\n|\n\n\n\nτ\n\n\nα\n\n1\n\n\n\ni\n\n2\n\n\n\n\n[\n3..\nN\n]\n\n\n\n⟩\n\n\n{\\displaystyle |{\\tau _{\\alpha _{1}i_{2}}^{[3..N]}}\\rangle }\n\n are not necessarily normalized.\nStep 2: write each vector \n\n\n\n\n|\n\n\n\nτ\n\n\nα\n\n1\n\n\n\ni\n\n2\n\n\n\n\n[\n3..\nN\n]\n\n\n\n⟩\n\n\n{\\displaystyle |{\\tau _{\\alpha _{1}i_{2}}^{[3..N]}}\\rangle }\n\n in terms of the at most (Vidal's emphasis) \n\n\n\nχ\n\n\n{\\displaystyle \\chi }\n\n Schmidt vectors \n\n\n\n\n|\n\n\n\nΦ\n\n\nα\n\n2\n\n\n\n\n[\n3..\nN\n]\n\n\n\n⟩\n\n\n{\\displaystyle |{\\Phi _{\\alpha _{2}}^{[3..N]}}\\rangle }\n\n and, correspondingly, coefficients \n\n\n\n\nλ\n\n\n\nα\n\n\n2\n\n\n\n\n[\n2\n]\n\n\n\n\n{\\displaystyle \\lambda _{{\\alpha }_{2}}^{[2]}}\n\n:\nStep 3: make the substitutions and obtain:\nRepeating the steps 1 to 3, one can construct the whole decomposition of state D. The last \n\n\n\nΓ\n\n\n{\\displaystyle \\Gamma }\n\n's are a special case, like the first ones, expressing the right-hand Schmidt vectors at the \n\n\n\n(\nN\n−\n1\n\n)\n\nt\nh\n\n\n\n\n{\\displaystyle (N-1)^{th}}\n\n bond in terms of the local basis at the \n\n\n\n\nN\n\nt\nh\n\n\n\n\n{\\displaystyle N^{th}}\n\n lattice place. As shown in,[1] it is straightforward to obtain the Schmidt decomposition at \n\n\n\n\nk\n\nt\nh\n\n\n\n\n{\\displaystyle k^{th}}\n\n bond, i.e. \n\n\n\n[\n1..\nk\n]\n:\n[\nk\n+\n1..\nN\n]\n\n\n{\\displaystyle [1..k]:[k+1..N]}\n\n, from D.\nThe Schmidt eigenvalues, are given explicitly in D:\nThe Schmidt eigenvectors are simply:\nand\nNow, looking at D, instead of \n\n\n\n\nM\n\nN\n\n\n\n\n{\\displaystyle M^{N}}\n\n initial terms, there are \n\n\n\n\n\nχ\n\n\n2\n\n\n\n⋅\n\nM\n(\nN\n−\n2\n)\n+\n2\n\nχ\n\nM\n+\n(\nN\n−\n1\n)\nχ\n\n\n{\\displaystyle {\\chi }^{2}{\\cdot }M(N-2)+2{\\chi }M+(N-1)\\chi }\n\n. Apparently this is just a fancy way of rewriting the coefficients \n\n\n\n\nc\n\n\ni\n\n1\n\n\n\ni\n\n2\n\n\n.\n.\n\ni\n\nN\n\n\n\n\n\n\n{\\displaystyle c_{i_{1}i_{2}..i_{N}}}\n\n, but in fact there is more to it than that. Assuming that N is even, the Schmidt rank \n\n\n\nχ\n\n\n{\\displaystyle \\chi }\n\n for a bipartite cut in the middle of the chain can have a maximal value of \n\n\n\n\nM\n\nN\n\n/\n\n2\n\n\n\n\n{\\displaystyle M^{N/2}}\n\n; in this case we end up with at least \n\n\n\n\nM\n\nN\n+\n1\n\n\n\n⋅\n\n(\nN\n−\n2\n)\n\n\n{\\displaystyle M^{N+1}{\\cdot }(N-2)}\n\n coefficients, considering only the \n\n\n\n\n\nχ\n\n\n2\n\n\n\n\n{\\displaystyle {\\chi }^{2}}\n\n ones, slightly more than the initial \n\n\n\n\nM\n\nN\n\n\n\n\n{\\displaystyle M^{N}}\n\n! The truth is that the decomposition D is useful when dealing with systems that exhibit a low degree of entanglement, which fortunately is the case with many 1D systems, where the Schmidt coefficients of the ground state decay in an exponential manner with \n\n\n\nα\n\n\n{\\displaystyle \\alpha }\n\n:\nTherefore, it is possible to take into account only some of the Schmidt coefficients (namely the largest ones), dropping the others and consequently normalizing again the state:\nwhere \n\n\n\n\nχ\n\nc\n\n\n\n\n{\\displaystyle \\chi _{c}}\n\n is the number of kept Schmidt coefficients.\nLet's get away from this abstract picture and refresh ourselves with a concrete example, to emphasize the advantage of making this decomposition. Consider for instance the case of 50 fermions in a ferromagnetic chain, for the sake of simplicity. A dimension of 12, let's say, for the \n\n\n\n\nχ\n\nc\n\n\n\n\n{\\displaystyle \\chi _{c}}\n\n would be a reasonable choice, keeping the discarded eigenvalues at \n\n\n\n0.0001\n\n\n{\\displaystyle 0.0001}\n\n% of the total, as shown by numerical studies,[4] meaning roughly \n\n\n\n\n2\n\n14\n\n\n\n\n{\\displaystyle 2^{14}}\n\n coefficients, as compared to the originally \n\n\n\n\n2\n\n50\n\n\n\n\n{\\displaystyle 2^{50}}\n\n ones.\nEven if the Schmidt eigenvalues don't have this exponential decay, but they show an algebraic decrease, we can still use D to describe our state \n\n\n\nψ\n\n\n{\\displaystyle \\psi }\n\n. The number of coefficients to account for a faithful description of \n\n\n\nψ\n\n\n{\\displaystyle \\psi }\n\n may be sensibly larger, but still within reach of eventual numerical simulations.\nOne can proceed now to investigate the behaviour of the decomposition D when acted upon with one-qubit gates (OQG) and two-qubit gates (TQG) acting on neighbouring qubits. Instead of updating all the \n\n\n\n\nM\n\nN\n\n\n\n\n{\\displaystyle M^{N}}\n\n coefficients \n\n\n\n\nc\n\n\ni\n\n1\n\n\n\ni\n\n2\n\n\n.\n.\n\ni\n\nN\n\n\n\n\n\n\n{\\displaystyle c_{i_{1}i_{2}..i_{N}}}\n\n, we will restrict ourselves to a number of operations that increase in \n\n\n\nχ\n\n\n{\\displaystyle \\chi }\n\n as a polynomial of low degree, thus saving computational time.\nThe OQGs are affecting only the qubit they are acting upon, the update of the state \n\n\n\n\n|\n\n\nψ\n\n⟩\n\n\n{\\displaystyle |{\\psi }\\rangle }\n\n after an unitary operator at qubit k does not modify the Schmidt eigenvalues or vectors on the left, consequently the \n\n\n\n\nΓ\n\n[\nk\n−\n1\n]\n\n\n\n\n{\\displaystyle \\Gamma ^{[k-1]}}\n\n's, or on the right, hence the \n\n\n\n\nΓ\n\n[\nk\n+\n1\n]\n\n\n\n\n{\\displaystyle \\Gamma ^{[k+1]}}\n\n's. The only \n\n\n\nΓ\n\n\n{\\displaystyle \\Gamma }\n\n's that will be updated are the \n\n\n\n\nΓ\n\n[\nk\n]\n\n\n\n\n{\\displaystyle \\Gamma ^{[k]}}\n\n's (requiring only at most \n\n\n\n\nO\n\n(\n\nM\n\n2\n\n\n⋅\n\nχ\n\n2\n\n\n)\n\n\n{\\displaystyle {O}(M^{2}\\cdot \\chi ^{2})}\n\n operations), as\nThe changes required to update the \n\n\n\nΓ\n\n\n{\\displaystyle \\Gamma }\n\n's and the \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n's, following a unitary operation V on qubits k, k+1, concern only \n\n\n\n\nΓ\n\n[\nk\n]\n\n\n\n\n{\\displaystyle \\Gamma ^{[k]}}\n\n, and \n\n\n\n\nΓ\n\n[\nk\n+\n1\n]\n\n\n\n\n{\\displaystyle \\Gamma ^{[k+1]}}\n\n. They consist of a number of \n\n\n\n\nO\n\n(\n\n\nM\n⋅\nχ\n\n\n3\n\n\n)\n\n\n{\\displaystyle {O}({M\\cdot \\chi }^{3})}\n\n basic operations.\nFollowing Vidal's original approach, \n\n\n\n\n|\n\n\nψ\n\n⟩\n\n\n{\\displaystyle |{\\psi }\\rangle }\n\n can be regarded as belonging to only four subsystems:\nThe subspace J is spanned by the eigenvectors of the reduced density matrix \n\n\n\n\nρ\n\nJ\n\n\n=\nT\n\nr\n\nC\nD\nK\n\n\n\n|\n\nψ\n⟩\n⟨\nψ\n\n|\n\n\n\n{\\displaystyle \\rho ^{J}=Tr_{CDK}|\\psi \\rangle \\langle \\psi |}\n\n:\nIn a similar way, the subspace K is spanned by the eigenvectors of the reduced density matrix:\nThe subspaces \n\n\n\n\nH\n\nC\n\n\n\n\n{\\displaystyle H_{C}}\n\n and \n\n\n\n\nH\n\nD\n\n\n\n\n{\\displaystyle H_{D}}\n\n belong to the qubits k and k + 1. Using this basis and the decomposition D, \n\n\n\n\n|\n\n\nψ\n\n⟩\n\n\n{\\displaystyle |{\\psi }\\rangle }\n\n can be written as:\nUsing the same reasoning as for the OQG, the applying the TQG V to qubits k, k + 1 one needs only to update\nWe can write \n\n\n\n\n|\n\n\n\nψ\n′\n\n\n⟩\n=\nV\n\n|\n\n\nψ\n\n⟩\n\n\n{\\displaystyle |{\\psi '}\\rangle =V|{\\psi }\\rangle }\n\n as:\nwhere\nTo find out the new decomposition, the new \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n's at the bond k and their corresponding Schmidt eigenvectors must be computed and expressed in terms of the \n\n\n\n\nΓ\n\n\n\n{\\displaystyle {\\Gamma }}\n\n's of the decomposition D. The reduced density matrix \n\n\n\n\nρ\n\n\n\n′\n\n[\nD\nK\n]\n\n\n\n\n{\\displaystyle \\rho ^{'[DK]}}\n\n is therefore diagonalized:\nThe square roots of its eigenvalues are the new \n\n\n\nλ\n\n\n{\\displaystyle \\lambda }\n\n's. Expressing the eigenvectors of the diagonalized matrix in the basis :\n\n\n\n{\n\n|\n\n\nj\nγ\n\n⟩\n}\n\n\n{\\displaystyle \\{|{j\\gamma }\\rangle \\}}\n\n the \n\n\n\n\nΓ\n\n[\n\nD\n]\n\n\n\n\n\n{\\displaystyle \\Gamma ^{[{D]}}}\n\n's are obtained as well:\nFrom the left-hand eigenvectors,\nafter expressing them in the basis \n\n\n\n{\n\n|\n\n\ni\nα\n\n⟩\n}\n\n\n{\\displaystyle \\{|{i\\alpha }\\rangle \\}}\n\n, the \n\n\n\n\nΓ\n\n[\n\nC\n\n]\n\n\n\n\n{\\displaystyle \\Gamma ^{[{C}]}}\n\n's are:\nThe dimension of the largest tensors in D is of the order \n\n\n\n\nO\n\n(\nM\n\n⋅\n\n\n\nχ\n\n\n2\n\n\n)\n\n\n{\\displaystyle {O}(M{\\cdot }{\\chi }^{2})}\n\n; when constructing the \n\n\n\n\nΘ\n\nα\nγ\n\n\ni\nj\n\n\n\n\n{\\displaystyle \\Theta _{\\alpha \\gamma }^{ij}}\n\n one makes the summation over \n\n\n\nβ\n\n\n{\\displaystyle \\beta }\n\n, \n\n\n\n\n\nm\n\n\n\n\n{\\displaystyle {\\it {m}}}\n\n and \n\n\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\it {n}}}\n\n for each \n\n\n\nγ\n,\nα\n,\n\n\ni\n,\nj\n\n\n\n\n{\\displaystyle \\gamma ,\\alpha ,{\\it {i,j}}}\n\n, adding up to a total of \n\n\n\n\nO\n\n(\n\nM\n\n4\n\n\n\n⋅\n\n\n\nχ\n\n\n3\n\n\n)\n\n\n{\\displaystyle {O}(M^{4}{\\cdot }{\\chi }^{3})}\n\n operations. The same holds for the formation of the elements \n\n\n\n\nρ\n\nγ\n\nγ\n′\n\n\n\nj\n\nj\n′\n\n\n\n\n\n{\\displaystyle \\rho _{\\gamma \\gamma '}^{jj'}}\n\n, or for computing the left-hand eigenvectors \n\n\n\n\nλ\n\nβ\n\n\n\n\n′\n\n\n\n\n|\n\n\n\nΦ\n\nβ\n\n\n\n\n′\n\n[\n\n\nJ\nC\n\n\n]\n\n\n\n⟩\n\n\n{\\displaystyle \\lambda _{\\beta }^{'}|{\\Phi _{\\beta }^{'[{\\it {JC}}]}}\\rangle }\n\n, a maximum of \n\n\n\n\n\nO\n\n\n(\n\nM\n\n3\n\n\n\n⋅\n\n\n\nχ\n\n\n3\n\n\n)\n\n\n{\\displaystyle {\\it {O}}(M^{3}{\\cdot }{\\chi }^{3})}\n\n, respectively \n\n\n\n\n\nO\n\n\n(\n\nM\n\n2\n\n\n\n⋅\n\n\n\nχ\n\n\n3\n\n\n)\n\n\n{\\displaystyle {\\it {O}}(M^{2}{\\cdot }{\\chi }^{3})}\n\n basic operations. In the case of qubits, \n\n\n\n\n\nM\n\n\n=\n2\n\n\n{\\displaystyle {\\it {M}}=2}\n\n, hence its role is not very relevant for the order of magnitude of the number of basic operations, but in the case when the on-site dimension is higher than two it has a rather decisive contribution.\nThe numerical simulation is targeting (possibly time-dependent) Hamiltonians of a system of \n\n\n\n\n\nN\n\n\n\n\n{\\displaystyle {\\it {N}}}\n\n particles, which are composed of arbitrary OQGs and TQGs:\nIt is useful to decompose \n\n\n\n\nH\n\nn\n\n\n\n\n{\\displaystyle H_{n}}\n\n as a sum of two possibly non-commuting terms, \n\n\n\n\nH\n\nn\n\n\n=\nF\n+\nG\n\n\n{\\displaystyle H_{n}=F+G}\n\n, where\nAny two-body terms commute: \n\n\n\n[\n\nF\n\n[\nl\n]\n\n\n,\n\nF\n\n[\n\nl\n′\n\n]\n\n\n]\n=\n0\n\n\n{\\displaystyle [F^{[l]},F^{[l']}]=0}\n\n, \n\n\n\n[\n\nG\n\n[\nl\n]\n\n\n,\n\nG\n\n[\n\nl\n′\n\n]\n\n\n]\n=\n0\n\n\n{\\displaystyle [G^{[l]},G^{[l']}]=0}\n\n This is done to make the Suzuki-Trotter expansion (ST)[5] of the exponential operator.\nThe Suzuki-Trotter expansion of the first order (ST1) represents a general way of writing exponential operators:\nor, equivalently\nThe correction term vanishes in the limit \n\n\n\nδ\n→\n0\n\n\n{\\displaystyle \\delta \\rightarrow 0}\n\n\nFor simulations of quantum dynamics it is useful to use operators that are unitary, conserving the norm (unlike power series expansions), and there's where the Trotter-Suzuki expansion comes in. In problems of quantum dynamics the unitarity of the operators in the ST expansion proves quite practical, since the error tends to concentrate in the overall phase, thus allowing us to faithfully compute expectation values and conserved quantities. Because the ST conserves the phase-space volume, it is also called a symplectic integrator.\nThe trick of the ST2 is to write the unitary operators \n\n\n\n\ne\n\n−\ni\nH\nt\n\n\n\n\n{\\displaystyle e^{-iHt}}\n\n as:\nwhere \n\n\n\nn\n=\n\n\nT\nδ\n\n\n\n\n{\\displaystyle n={\\frac {T}{\\delta }}}\n\n. The number \n\n\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\it {n}}}\n\n is called the Trotter number.\nThe operators \n\n\n\n\ne\n\n\n\nδ\n2\n\n\nF\n\n\n\n\n{\\displaystyle e^{{\\frac {\\delta }{2}}F}}\n\n, \n\n\n\n\ne\n\n\nδ\n\nG\n\n\n\n\n{\\displaystyle e^{{\\delta }G}}\n\n are easy to express, as:\nsince any two operators \n\n\n\n\nF\n\n[\nl\n]\n\n\n\n\n{\\displaystyle F^{[l]}}\n\n,\n\n\n\n\nF\n\n[\n\nl\n′\n\n]\n\n\n\n\n{\\displaystyle F^{[l']}}\n\n (respectively, \n\n\n\n\nG\n\n[\nl\n]\n\n\n\n\n{\\displaystyle G^{[l]}}\n\n,\n\n\n\n\nG\n\n[\n\nl\n′\n\n]\n\n\n\n\n{\\displaystyle G^{[l']}}\n\n) commute for \n\n\n\nl\n\n≠\n\n\nl\n′\n\n\n\n{\\displaystyle l{\\neq }l'}\n\n and an ST expansion of the first order keeps only the product of the exponentials, the approximation becoming, in this case, exact.\nThe time-evolution can be made according to\nFor each \"time-step\" \n\n\n\nδ\n\n\n{\\displaystyle \\delta }\n\n, \n\n\n\n\ne\n\n−\ni\n\n\nδ\n2\n\n\n\nF\n\n[\nl\n]\n\n\n\n\n\n\n{\\displaystyle e^{-i{\\frac {\\delta }{2}}F^{[l]}}}\n\n are applied successively to all odd sites, then \n\n\n\n\ne\n\n\n−\ni\nδ\n\n\nG\n\n[\nl\n]\n\n\n\n\n\n\n{\\displaystyle e^{{-i\\delta }G^{[l]}}}\n\n to the even ones, and \n\n\n\n\ne\n\n−\ni\n\n\nδ\n2\n\n\n\nF\n\n[\nl\n]\n\n\n\n\n\n\n{\\displaystyle e^{-i{\\frac {\\delta }{2}}F^{[l]}}}\n\n again to the odd ones; this is basically a sequence of TQG's, and it has been explained above how to update the decomposition \n\n\n\n\n\nD\n\n\n\n\n{\\displaystyle {\\it {D}}}\n\n when applying them.\nOur goal is to make the time evolution of a state \n\n\n\n\n|\n\n\n\nψ\n\n0\n\n\n\n⟩\n\n\n{\\displaystyle |{\\psi _{0}}\\rangle }\n\n for a time T, towards the state \n\n\n\n\n|\n\n\n\nψ\n\nT\n\n\n\n⟩\n\n\n{\\displaystyle |{\\psi _{T}}\\rangle }\n\n using the n-particle Hamiltonian \n\n\n\n\nH\n\nn\n\n\n\n\n{\\displaystyle H_{n}}\n\n.\nIt is rather troublesome, if at all possible, to construct the decomposition \n\n\n\n\n\nD\n\n\n\n\n{\\displaystyle {\\it {D}}}\n\n for an arbitrary n-particle state, since this would mean one has to compute the Schmidt decomposition at each bond, to arrange the Schmidt eigenvalues in decreasing order and to choose the first \n\n\n\n\nχ\n\nc\n\n\n\n\n{\\displaystyle \\chi _{c}}\n\n and the appropriate Schmidt eigenvectors. Mind this would imply diagonalizing somewhat generous reduced density matrices, which, depending on the system one has to simulate, might be a task beyond our reach and patience. Instead, one can try to do the following:\ni) construct the decomposition \n\n\n\n\n\nD\n\n\n\n\n{\\displaystyle {\\it {D}}}\n\n for a simple initial state, let us say, some product state \n\n\n\n\n|\n\n\n\nψ\n\nP\n\n\n\n⟩\n\n\n{\\displaystyle |{\\psi _{P}}\\rangle }\n\n, for which the decomposition is straightforward.\nii) relate \n\n\n\n\n|\n\n\n\nψ\n\n0\n\n\n\n⟩\n\n\n{\\displaystyle |{\\psi _{0}}\\rangle }\n\n to the ground state \n\n\n\n\n|\n\n\n\nψ\n\ng\nr\n\n\n\n⟩\n\n\n{\\displaystyle |{\\psi _{gr}}\\rangle }\n\n of a Hamiltonian \n\n\n\n\n\n\nH\n~\n\n\n\n\n\n{\\displaystyle {\\tilde {H}}}\n\n by a sufficiently local transformation Q (one that can be expressed as a product of TQGs, for example) \n\n\n\n\n|\n\n\n\nψ\n\n0\n\n\n\n⟩\n=\nQ\n\n|\n\n\n\nψ\n\ng\nr\n\n\n\n⟩\n\n\n{\\displaystyle |{\\psi _{0}}\\rangle =Q|{\\psi _{gr}}\\rangle }\n\n\niii) make an imaginary-time evolution towards the ground state of the Hamiltonian \n\n\n\n\n\n\nH\n~\n\n\n\n\n\n{\\displaystyle {\\tilde {H}}}\n\n, \n\n\n\n\n|\n\n\n\nψ\n\ng\nr\n\n\n\n⟩\n\n\n{\\displaystyle |{\\psi _{gr}}\\rangle }\n\n according to:\nor, alternatively, simulate an isentropic evolution using a time-dependent Hamiltonian, which interpolates between the Hamiltonian \n\n\n\n\nH\n\n1\n\n\n\n\n{\\displaystyle H_{1}}\n\n, which has the product state \n\n\n\n\n|\n\n\n\nψ\n\nP\n\n\n\n⟩\n\n\n{\\displaystyle |{\\psi _{P}}\\rangle }\n\n as its ground state, and the Hamiltonian \n\n\n\n\n\n\nH\n~\n\n\n\n\n\n{\\displaystyle {\\tilde {H}}}\n\n; the evolution must be done slow enough, such that the system is always in the ground state or, at least, very close to it.\niv)finally, make the time-evolution of the state \n\n\n\n\n|\n\n\n\nψ\n\n0\n\n\n\n⟩\n\n\n{\\displaystyle |{\\psi _{0}}\\rangle }\n\n towards \n\n\n\n\n|\n\n\n\nψ\n\nT\n\n\n\n⟩\n\n\n{\\displaystyle |{\\psi _{T}}\\rangle }\n\n using the Hamiltonian \n\n\n\n\nH\n\nn\n\n\n\n\n{\\displaystyle H_{n}}\n\n:\nThe errors in the simulation are resulting from the Suzuki-Trotter approximation and the involved truncation of the Hilbert space.\nIn the case of a Trotter approximation of \n\n\n\n\n\n\np\n\nt\nh\n\n\n\n\n\n\n{\\displaystyle {\\it {p^{th}}}}\n\n order, the error is of order \n\n\n\n\n\nδ\n\n\np\n+\n1\n\n\n\n\n{\\displaystyle {\\delta }^{p+1}}\n\n. Taking into account \n\n\n\nn\n=\n\n\nT\nδ\n\n\n\n\n{\\displaystyle n={\\frac {T}{\\delta }}}\n\n steps, the error after the time T is:\nThe unapproximated state \n\n\n\n\n|\n\n\n\n\n\n\nψ\n~\n\n\n\n\nT\nr\n\n\n\n⟩\n\n\n{\\displaystyle |{{\\tilde {\\psi }}_{Tr}}\\rangle }\n\n is:\nwhere \n\n\n\n\n|\n\n\n\nψ\n\nT\nr\n\n\n\n⟩\n\n\n{\\displaystyle |{\\psi _{Tr}}\\rangle }\n\n is the state kept after the Trotter expansion and \n\n\n\n\n|\n\n\n\nψ\n\nT\nr\n\n\n⊥\n\n\n\n⟩\n\n\n{\\displaystyle |{\\psi _{Tr}^{\\bot }}\\rangle }\n\n accounts for the part that is neglected when doing the expansion.\nThe total error scales with time \n\n\n\n\n\nT\n\n\n\n\n{\\displaystyle {\\it {T}}}\n\n as:\nOne should notice that the Trotter error is independent of the dimension of the chain.\nConsidering the errors arising from the truncation of the Hilbert space comprised in the decomposition D, they are twofold.\nFirst, as we have seen above, the smallest contributions to the Schmidt spectrum are left away, the state being faithfully represented up to:\nwhere \n\n\n\n\nϵ\n\nn\n\n\n=\n\n∑\n\nα\n=\n\nχ\n\nc\n\n\n\n\nχ\n\n\n(\n\nλ\n\nα\n\n\n[\nn\n]\n\n\n\n)\n\n2\n\n\n\n\n{\\displaystyle \\epsilon _{n}=\\sum \\limits _{\\alpha =\\chi _{c}}^{\\chi }(\\lambda _{\\alpha }^{[n]})^{2}}\n\n is the sum of all the discarded eigenvalues of the reduced density matrix, at the bond \n\n\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\it {n}}}\n\n. The state \n\n\n\n\n|\n\n\nψ\n\n⟩\n\n\n{\\displaystyle |{\\psi }\\rangle }\n\n is, at a given bond \n\n\n\n\n\nn\n\n\n\n\n{\\displaystyle {\\it {n}}}\n\n, described by the Schmidt decomposition:\nwhere\nis the state kept after the truncation and\nis the state formed by the eigenfunctions corresponding to the smallest, irrelevant Schmidt coefficients, which are neglected. Now, \n\n\n\n⟨\n\nψ\n\nD\n\n\n⊥\n\n\n\n|\n\n\nψ\n\nD\n\n\n⟩\n=\n0\n\n\n{\\displaystyle \\langle \\psi _{D}^{\\bot }|\\psi _{D}\\rangle =0}\n\n because they are spanned by vectors corresponding to orthogonal spaces. Using the same argument as for the Trotter expansion, the error after the truncation is:\nAfter moving to the next bond, the state is, similarly:\nThe error, after the second truncation, is:\nand so on, as we move from bond to bond.\nThe second error source enfolded in the decomposition \n\n\n\n\n\nD\n\n\n\n\n{\\displaystyle {\\it {D}}}\n\n is more subtle and requires a little bit of calculation.\nAs we calculated before, the normalization constant after making the truncation at bond \n\n\n\n\n\nl\n\n\n\n\n{\\displaystyle {\\it {l}}}\n\n \n\n\n\n(\n[\n1..\nl\n]\n:\n[\nl\n+\n1..\nN\n]\n)\n\n\n{\\displaystyle ([1..l]:[l+1..N])}\n\n is:\nNow let us go to the bond \n\n\n\n\n\nl\n\n\n−\n1\n\n\n{\\displaystyle {\\it {l}}-1}\n\n and calculate the norm of the right-hand Schmidt vectors \n\n\n\n\n|\n\n\n|\n\n\n\nΦ\n\n\nα\n\nl\n−\n1\n\n\n\n\n[\nl\n−\n1..\nN\n]\n\n\n\n\n|\n\n\n|\n\n\n\n{\\displaystyle ||{\\Phi _{\\alpha _{l-1}}^{[l-1..N]}}||}\n\n; taking into account the full Schmidt dimension, the norm is:\nwhere \n\n\n\n(\n\nc\n\n\nα\n\nl\n−\n1\n\n\n\nα\n\nl\n\n\n\n\n\n)\n\n2\n\n\n=\n\n∑\n\n\ni\n\nl\n\n\n=\n1\n\n\nd\n\n\n(\n\nΓ\n\n\nα\n\nl\n−\n1\n\n\n\nα\n\nl\n\n\n\n\n[\nl\n]\n\ni\n\nl\n\n\n\n\n\n)\n\n∗\n\n\n\nΓ\n\n\nα\n\nl\n−\n1\n\n\n\nα\n\nl\n\n\n\n\n[\nl\n]\n\ni\n\nl\n\n\n\n\n\n\n{\\displaystyle (c_{\\alpha _{l-1}\\alpha _{l}})^{2}=\\sum \\limits _{i_{l}=1}^{d}(\\Gamma _{\\alpha _{l-1}\\alpha _{l}}^{[l]i_{l}})^{*}\\Gamma _{\\alpha _{l-1}\\alpha _{l}}^{[l]i_{l}}}\n\n.\nTaking into account the truncated space, the norm is:\nTaking the difference, \n\n\n\nϵ\n=\n\nn\n\n2\n\n\n−\n\nn\n\n1\n\n\n=\n\nn\n\n2\n\n\n−\n1\n\n\n{\\displaystyle \\epsilon =n_{2}-n_{1}=n_{2}-1}\n\n, we get:\nHence, when constructing the reduced density matrix, the trace of the matrix is multiplied by the factor:\nThe total truncation error, considering both sources, is upper bounded by:\nWhen using the Trotter expansion, we do not move from bond to bond, but between bonds of same parity; moreover, for the ST2, we make a sweep of the even ones and two for the odd. But nevertheless, the calculation presented above still holds. The error is evaluated by successively multiplying with the normalization constant, each time we build the reduced density matrix and select its relevant eigenvalues.\nOne thing that can save a lot of computational time without loss of accuracy is to use a different Schmidt dimension for each bond instead of a fixed one for all bonds, keeping only the necessary amount of relevant coefficients, as usual. For example, taking the first bond, in the case of qubits, the Schmidt dimension is just two. Hence, at the first bond, instead of futilely diagonalizing, let us say, 10 by 10 or 20 by 20 matrices, we can just restrict ourselves to ordinary 2 by 2 ones, thus making the algorithm generally faster. What we can do instead is set a threshold for the eigenvalues of the SD, keeping only those that are above the threshold.\nTEBD also offers the possibility of straightforward parallelization due to the factorization of the exponential time-evolution operator using the Suzuki-Trotter expansion. A parallel-TEBD has the same mathematics as its non-parallelized counterpart, the only difference is in the numerical implementation.", 
    "name": "Time Evolving Block Decimation"
}