{
    "about": "In computational complexity theory and combinatorics, the token reconfiguration problem is an optimization problem on a graph with both an initial and desired state for tokens.", 
    "name": "Token Reconfiguration", 
    "classification": "Approximation Algorithms", 
    "full_text": "In computational complexity theory and combinatorics, the token reconfiguration problem is an optimization problem on a graph with both an initial and desired state for tokens.\nGiven a graph \n\n\n\nG\n\n\n{\\displaystyle G}\n\n, an initial state of tokens is defined by a subset \n\n\n\nV\n⊂\nV\n(\nG\n)\n\n\n{\\displaystyle V\\subset V(G)}\n\n of the vertices of the graph; let \n\n\n\nn\n=\n\n|\n\nV\n\n|\n\n\n\n{\\displaystyle n=|V|}\n\n. Moving a token from vertex \n\n\n\n\nv\n\n1\n\n\n\n\n{\\displaystyle v_{1}}\n\n to vertex \n\n\n\n\nv\n\n2\n\n\n\n\n{\\displaystyle v_{2}}\n\n is valid if \n\n\n\n\nv\n\n1\n\n\n\n\n{\\displaystyle v_{1}}\n\n and \n\n\n\n\nv\n\n2\n\n\n\n\n{\\displaystyle v_{2}}\n\n are joined by a path in \n\n\n\nG\n\n\n{\\displaystyle G}\n\n that does not contain any other tokens; note that the distance traveled within the graph is inconsequential, and moving a token across multiple edges sequentially is considered a single move. A desired end state is defined as another subset \n\n\n\n\nV\n′\n\n⊂\nV\n(\nG\n)\n\n\n{\\displaystyle V'\\subset V(G)}\n\n. The goal is to minimize the number of valid moves to reach the end state from the initial state.[1]\n\n\nThe problem is motivated by so-called sliding puzzles, which are in fact a variant of this problem, often restricted to rectangular grid graphs with no holes. The most famous such puzzle, the 15 puzzle, is a variant of this problem on a 4 by 4 grid graph such that \n\n\n\nn\n=\n\n|\n\nV\n(\nG\n)\n\n|\n\n−\n1\n\n\n{\\displaystyle n=|V(G)|-1}\n\n. One key difference between sliding block puzzles and the token reconfiguration problem is that in the original token reconfiguration problem, the tokens are indistinguishable. As a result, if the graph is connected, the token reconfiguration problem is always solvable; this is not necessarily the case for sliding block puzzles.\nCalinescu, Dumitrescu, and Pach have shown several results regarding both the optimization and approximation of this problem on various types of graphs.[2]\nFirstly, reducing to the case of trees, there is always a solution in at most \n\n\n\nn\n\n\n{\\displaystyle n}\n\n moves, with at most one move per token. Furthermore, an optimal solution can be found in time linear in the size of the tree. Clearly, the first result extends to arbitrary graphs; the latter does not.\nA sketch of the optimal algorithm for trees is as follows. First, we obtain an algorithm that moves each node exactly once, which may not be optimal. Do this recursively: consider any leaf of the smallest tree in the graph containing both the initial and desired sets. If a leaf of this tree is in both, remove it and recurse down. If a leaf is in the initial set only, find a path from it to a vertex in the desired set that does not pass through any other vertices in the desired set. Remove this path (it'll be the last move), and recurse down. The other case, where the leaf is in the desired set only, is symmetric. To extend to an algorithm that achieves the optimum, consider any token in both the initial and desired sets. If removing it would split the graph into subtrees, all of which have the same number of elements from the initial and desired sets, then do so and recurse. If there is no such token, then each token must move exactly once, and so the solution that moves all tokens exactly once must be optimal.\nWhile the algorithm for finding the optimum on trees is linear time, finding the optimum for general graphs is NP-complete, a leap up in difficulty. It is in NP; the certificate is a sequence of moves, which is at most linear size, so it remains to show the problem is NP-hard as well. This is done via reduction from set cover.\nConsider an instance of set cover, where we wish to cover all elements \n\n\n\n\nv\n\n1\n\n\n,\n\nv\n\n2\n\n\n,\n…\n,\n\nv\n\nn\n\n\n\n\n{\\displaystyle v_{1},v_{2},\\ldots ,v_{n}}\n\n in a universe \n\n\n\nU\n\n\n{\\displaystyle U}\n\n using subsets \n\n\n\n\nS\n\n1\n\n\n,\n\nS\n\n2\n\n\n,\n…\n,\n\nS\n\nm\n\n\n\n\n{\\displaystyle S_{1},S_{2},\\ldots ,S_{m}}\n\n of \n\n\n\nU\n\n\n{\\displaystyle U}\n\n using the minimum number of subsets. Construct a graph as follows:\nMake a vertex for each of the elements in the universe and each of the subsets. Connect a subset vertex to an element vertex if the subset contains that element. Create a long path of size \n\n\n\nn\n\n\n{\\displaystyle n}\n\n, and attach one end to every subset vertex. The initial set is the added path plus every subset vertex, and the final set is every subset vertex plus every element vertex.\nTo see why this is a reduction, consider the selection of which subset vertex tokens to move. Clearly, we must open up paths to each of the element vertices, and we do so by moving some of the subset vertex tokens. After doing so, each token on the long path must move once. Thus, the optimum cost is equal to the number of selected subsets plus the number of elements (the latter of which is notably a constant). So we have a polynomial-time reduction from set cover, which is NP-complete, to token reconfiguration. Thus token reconfiguration is also NP-complete on general graphs.\nThe token reconfiguration problem is APX-complete, meaning that in some sense, it is as hard to approximate as any problem that has a constant-factor approximation algorithm. The reduction is the same one as above, from set cover. However, the set cover problem is restricted to subsets of size at most 3, which is an APX-hard problem.[3]\nUsing the exact same structure as above, we obtain an L-reduction, as the distance of any solution from optimum is equal between the set cover instance and the transformed token reconfiguration problem. The only change is the addition of the number of elements in the universe. Furthermore, the set cover optimum is at least 1/3 of the number of elements, due to the bounded subset size. Thus, the constants from the L-reduction are \n\n\n\nα\n=\n1\n\n/\n\n4\n,\nβ\n=\n1\n\n\n{\\displaystyle \\alpha =1/4,\\beta =1}\n\n.\nOne can, in fact, modify the reduction to work for labeled token reconfiguration as well. To do so, attach a new vertex to each of the subset vertices, which is neither an initial nor desired vertex. Label the vertices on the long path 1 through \n\n\n\nn\n\n\n{\\displaystyle n}\n\n, and do the same for the element vertices. Now, the solution consists of 'moving aside' each chosen subset vertex token, correctly placing the labeled vertices from the path, and returning the subset vertex tokens to the initial locations. This is an L-reduction with \n\n\n\nα\n=\n1\n\n/\n\n5\n,\nβ\n=\n2\n\n\n{\\displaystyle \\alpha =1/5,\\beta =2}\n\n.\nCalinescu, Dumitrescu, and Pach have also shown that there exists a 3-approximation for unlabeled token reconfiguration, so the problem is in APX as well and thus APX-complete. The proof is much more complicated and omitted here.", 
    "dbpedia_url": "http://dbpedia.org/resource/Token_reconfiguration", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Token_reconfiguration\n"
}