{
    "about": "Transfinite induction is an extension of mathematical induction to well-ordered sets, for example to sets of ordinal numbers or cardinal numbers.", 
    "name": "Transfinite Induction", 
    "classification": "Recursion", 
    "full_text": "Transfinite induction is an extension of mathematical induction to well-ordered sets, for example to sets of ordinal numbers or cardinal numbers.\nLet P(α) be a property defined for all ordinals α. Suppose that whenever P(β) is true for all β < α, then P(α) is also true. Then transfinite induction tells us that P is true for all ordinals.\nUsually the proof is broken down into three cases:\nAll three cases are identical except for the type of ordinal considered. They do not formally need to be considered separately, but in practice the proofs are typically so different as to require separate presentations. Zero is sometimes considered a limit ordinal and then may sometimes be treated in proofs in the same case as limit ordinals.\n\n\nTransfinite recursion is similar to transfinite induction; however, instead of proving that something holds for all ordinal numbers, we construct a sequence of objects, one for each ordinal.\nAs an example, a basis for a (possibly infinite-dimensional) vector space can be created by choosing a vector \n\n\n\n\nv\n\n0\n\n\n\n\n{\\displaystyle v_{0}}\n\n and for each ordinal α choosing a vector that is not in the span of the vectors \n\n\n\n{\n\nv\n\nβ\n\n\n\n|\n\nβ\n<\nα\n}\n\n\n{\\displaystyle \\{v_{\\beta }|\\beta <\\alpha \\}}\n\n. This process stops when no vector can be chosen.\nMore formally, we can state the Transfinite Recursion Theorem as follows:\nAs in the case of induction, we may treat different types of ordinals separately: another formulation of transfinite recursion is the following:\nNote that we require the domains of G2, G3 to be broad enough to make the above properties meaningful. The uniqueness of the sequence satisfying these properties can be proved using transfinite induction.\nMore generally, one can define objects by transfinite recursion on any well-founded relation R. (R need not even be a set; it can be a proper class, provided it is a set-like relation; that is, for any x, the collection of all y such that y R x must be a set.)\nProofs or constructions using induction and recursion often use the axiom of choice to produce a well-ordered relation that can be treated by transfinite induction. However, if the relation in question is already well-ordered, one can often use transfinite induction without invoking the axiom of choice.[2] For example, many results about Borel sets are proved by transfinite induction on the ordinal rank of the set; these ranks are already well-ordered, so the axiom of choice is not needed to well-order them.\nThe following construction of the Vitali set shows one way that the axiom of choice can be used in a proof by transfinite induction:\nThe above argument uses the axiom of choice in an essential way at the very beginning, in order to well-order the reals. After that step, the axiom of choice is not used again.\nOther uses of the axiom of choice are more subtle. For example, a construction by transfinite recursion frequently will not specify a unique value for Aα+1, given the sequence up to α, but will specify only a condition that Aα+1 must satisfy, and argue that there is at least one set satisfying this condition. If it is not possible to define a unique example of such a set at each stage, then it may be necessary to invoke (some form of) the axiom of choice to select one such at each step. For inductions and recursions of countable length, the weaker axiom of dependent choice is sufficient. Because there are models of Zermelo–Fraenkel set theory of interest to set theorists that satisfy the axiom of dependent choice but not the full axiom of choice, the knowledge that a particular proof only requires dependent choice can be useful.", 
    "dbpedia_url": "http://dbpedia.org/resource/Transfinite_induction", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Transfinite_induction\n"
}