{
    "about": "In engineering, a transfer function (also known as system function[1] or network function and, when plotted as a graph, transfer curve) is a mathematical representation for fit[2][3] or to describe inputs and outputs of black box models.", 
    "name": "Transfer Function", 
    "classification": "Signal Processing", 
    "full_text": "In engineering, a transfer function (also known as system function[1] or network function and, when plotted as a graph, transfer curve) is a mathematical representation for fit[2][3] or to describe inputs and outputs of black box models.\nTypically it is a representation in terms of spatial or temporal frequency, of the relation between the input and output of a linear time-invariant system (LTI) with zero initial conditions and zero-point equilibrium.[4] With optical imaging devices, for example, it is the Fourier transform of the point spread function (hence a function of spatial frequency) i.e., the intensity distribution caused by a point object in the field of view.[citation needed] A number of sources however use \"transfer function\" to mean some input-output characteristic in direct physical measures (e.g., output voltage as a function of input voltage of a two-port network) rather than its transform to the s-plane.[5][6][7]\n\n\nTransfer functions are commonly used in the analysis of systems such as single-input single-output filters, typically within the fields of signal processing, communication theory, and control theory. The term is often used exclusively to refer to linear time-invariant (LTI) systems, as covered in this article. Most real systems have non-linear input/output characteristics, but many systems, when operated within nominal parameters (not \"over-driven\") have behavior that is close enough to linear that LTI system theory is an acceptable representation of the input/output behavior.\nThe descriptions below are given in terms of a complex variable, \n\n\n\ns\n=\nσ\n+\nj\n⋅\nω\n\n\n{\\displaystyle s=\\sigma +j\\cdot \\omega }\n\n, which bears a brief explanation. In many applications, it is sufficient to define \n\n\n\nσ\n=\n0\n\n\n{\\displaystyle \\sigma =0}\n\n (and \n\n\n\ns\n=\nj\n⋅\nω\n\n\n{\\displaystyle s=j\\cdot \\omega }\n\n), which reduces the Laplace transforms with complex arguments to Fourier transforms with real argument ω. The applications where this is common are ones where there is interest only in the steady-state response of an LTI system, not the fleeting turn-on and turn-off behaviors or stability issues. That is usually the case for signal processing and communication theory.\nThus, for continuous-time input signal \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n and output \n\n\n\ny\n(\nt\n)\n\n\n{\\displaystyle y(t)}\n\n, the transfer function \n\n\n\nH\n(\ns\n)\n\n\n{\\displaystyle H(s)}\n\n is the linear mapping of the Laplace transform of the input, \n\n\n\nX\n(\ns\n)\n=\n\n\nL\n\n\n\n{\nx\n(\nt\n)\n}\n\n\n\n{\\displaystyle X(s)={\\mathcal {L}}\\left\\{x(t)\\right\\}}\n\n, to the Laplace transform of the output \n\n\n\nY\n(\ns\n)\n=\n\n\nL\n\n\n\n{\ny\n(\nt\n)\n}\n\n\n\n{\\displaystyle Y(s)={\\mathcal {L}}\\left\\{y(t)\\right\\}}\n\n:\nor\nIn discrete-time systems, the relation between an input signal \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n and output \n\n\n\ny\n(\nt\n)\n\n\n{\\displaystyle y(t)}\n\n is dealt with using the z-transform, and then the transfer function is similarly written as \n\n\n\nH\n(\nz\n)\n=\n\n\n\nY\n(\nz\n)\n\n\nX\n(\nz\n)\n\n\n\n\n\n{\\displaystyle H(z)={\\frac {Y(z)}{X(z)}}}\n\n and this is often referred to as the pulse-transfer function.[citation needed]\nConsider a linear differential equation with constant coefficients\nwhere u and r are suitably smooth functions of t, and L is the operator defined on the relevant function space, that transforms u into r. That kind of equation can be used to constrain the output function u in terms of the forcing function r. The transfer function can be used to define an operator \n\n\n\nF\n[\nr\n]\n=\nu\n\n\n{\\displaystyle F[r]=u}\n\n that serves as a right inverse of L, meaning that \n\n\n\nL\n[\nF\n[\nr\n]\n]\n=\nr\n\n\n{\\displaystyle L[F[r]]=r}\n\n.\nSolutions of the homogeneous, constant-coefficient differential equation \n\n\n\nL\n[\nu\n]\n=\n0\n\n\n{\\displaystyle L[u]=0}\n\n can be found by trying \n\n\n\nu\n=\n\ne\n\nλ\nt\n\n\n\n\n{\\displaystyle u=e^{\\lambda t}}\n\n. That substitution yields the characteristic polynomial\nThe inhomogeneous case can be easily solved if the input function r is also of the form \n\n\n\nr\n(\nt\n)\n=\n\ne\n\ns\nt\n\n\n\n\n{\\displaystyle r(t)=e^{st}}\n\n. In that case, by substituting \n\n\n\nu\n=\nH\n(\ns\n)\n\ne\n\ns\nt\n\n\n\n\n{\\displaystyle u=H(s)e^{st}}\n\n one finds that \n\n\n\nL\n[\nH\n(\ns\n)\n\ne\n\ns\nt\n\n\n]\n=\n\ne\n\ns\nt\n\n\n\n\n{\\displaystyle L[H(s)e^{st}]=e^{st}}\n\n if we define\nTaking that as the definition of the transfer function requires careful disambiguation[clarification needed] between complex vs. real values, which is traditionally influenced[clarification needed] by the interpretation of abs(H(s)) as the gain and -atan(H(s)) as the phase lag. Other definitions of the transfer function are used: for example \n\n\n\n1\n\n/\n\n\np\n\nL\n\n\n(\ni\nk\n)\n.\n\n\n{\\displaystyle 1/p_{L}(ik).}\n\n[8]\nA general sinusoidal input to a system may be written \n\n\n\nexp\n⁡\n(\nj\n\nω\n\ni\n\n\nt\n)\n\n\n{\\displaystyle \\exp(j\\omega _{i}t)}\n\n. The response of a system to a sinusoidal input beginning at time \n\n\n\nt\n=\n0\n\n\n{\\displaystyle t=0}\n\n will consist of the sum of the steady-state response and a transient response. The steady-state response is the output of the system in the limit of infinite time, and the transient response is the difference between the response and the steady state response (It corresponds to the homogeneous solution of the above differential equation.) The transfer function for an LTI system may be written as the product:\nwhere sPi are the N roots of the characteristic polynomial and will therefore be the poles of the transfer function. Consider the case of a transfer function with a single pole \n\n\n\nH\n(\ns\n)\n=\n\n\n1\n\ns\n−\n\ns\n\nP\n\n\n\n\n\n\n\n{\\displaystyle H(s)={\\frac {1}{s-s_{P}}}}\n\n where \n\n\n\n\ns\n\nP\n\n\n=\n\nσ\n\nP\n\n\n+\nj\n\nω\n\nP\n\n\n\n\n{\\displaystyle s_{P}=\\sigma _{P}+j\\omega _{P}}\n\n. The Laplace transform of a general sinusoid of unit amplitude will be \n\n\n\n\n\n1\n\ns\n−\nj\n\nω\n\ni\n\n\n\n\n\n\n\n{\\displaystyle {\\frac {1}{s-j\\omega _{i}}}}\n\n. The Laplace transform of the output will be \n\n\n\n\n\n\nH\n(\ns\n)\n\n\n(\ns\n−\nj\n\nω\n\ni\n\n\n)\n\n\n\n\n\n{\\displaystyle {\\frac {H(s)}{(s-j\\omega _{i})}}}\n\n and the temporal output will be the inverse Laplace transform of that function:\nThe second term in the numerator is the transient response, and in the limit of infinite time it will diverge to infinity if σP is positive. In order for a system to be stable, its transfer function must have no poles whose real parts are positive. If the transfer function is strictly stable, the real parts of all poles will be negative, and the transient behavior will tend to zero in the limit of infinite time. The steady-state output will be:\nThe frequency response (or \"gain\") G of the system is defined as the absolute value of the ratio of the input amplitude to the steady-state output amplitude:\nwhich is just the absolute value of the transfer function \n\n\n\nH\n(\ns\n)\n\n\n{\\displaystyle H(s)}\n\n evaluated at \n\n\n\nj\n\nω\n\ni\n\n\n\n\n{\\displaystyle j\\omega _{i}}\n\n. This result can be shown to be valid for any number of transfer function poles.\nLet \n\n\n\nx\n(\nt\n)\n \n\n\n{\\displaystyle x(t)\\ }\n\n be the input to a general linear time-invariant system, and \n\n\n\ny\n(\nt\n)\n \n\n\n{\\displaystyle y(t)\\ }\n\n be the output, and the bilateral Laplace transform of \n\n\n\nx\n(\nt\n)\n \n\n\n{\\displaystyle x(t)\\ }\n\n and \n\n\n\ny\n(\nt\n)\n \n\n\n{\\displaystyle y(t)\\ }\n\n be\nThen the output is related to the input by the transfer function \n\n\n\nH\n(\ns\n)\n\n\n{\\displaystyle H(s)}\n\n as\nand the transfer function itself is therefore\nIn particular, if a complex harmonic signal with a sinusoidal component with amplitude \n\n\n\n\n|\n\nX\n\n|\n\n \n\n\n{\\displaystyle |X|\\ }\n\n, angular frequency \n\n\n\nω\n \n\n\n{\\displaystyle \\omega \\ }\n\n and phase \n\n\n\narg\n⁡\n(\nX\n)\n \n\n\n{\\displaystyle \\arg(X)\\ }\n\n, where arg is the argument\nis input to a linear time-invariant system, then the corresponding component in the output is:\nNote that, in a linear time-invariant system, the input frequency \n\n\n\nω\n \n\n\n{\\displaystyle \\omega \\ }\n\n has not changed, only the amplitude and the phase angle of the sinusoid has been changed by the system. The frequency response \n\n\n\nH\n(\nj\nω\n)\n \n\n\n{\\displaystyle H(j\\omega )\\ }\n\n describes this change for every frequency \n\n\n\nω\n \n\n\n{\\displaystyle \\omega \\ }\n\n in terms of gain:\nand phase shift:\nThe phase delay (i.e., the frequency-dependent amount of delay introduced to the sinusoid by the transfer function) is:\nThe group delay (i.e., the frequency-dependent amount of delay introduced to the envelope of the sinusoid by the transfer function) is found by computing the derivative of the phase shift with respect to angular frequency \n\n\n\nω\n \n\n\n{\\displaystyle \\omega \\ }\n\n,\nThe transfer function can also be shown using the Fourier transform which is only a special case of the bilateral Laplace transform for the case where \n\n\n\ns\n=\nj\nω\n\n\n{\\displaystyle s=j\\omega }\n\n.\nWhile any LTI system can be described by some transfer function or another, there are certain \"families\" of special transfer functions that are commonly used. Typical infinite impulse response filters are designed to implement one of these special transfer functions.\nSome common transfer function families and their particular characteristics are:\nIn control engineering and control theory the transfer function is derived using the Laplace transform.\nThe transfer function was the primary tool used in classical control engineering. However, it has proven to be unwieldy for the analysis of multiple-input multiple-output (MIMO) systems, and has been largely supplanted by state space representations for such systems.[citation needed] In spite of this, a transfer matrix can be always obtained for any linear system, in order to analyze its dynamics and other properties: each element of a transfer matrix is a transfer function relating a particular input variable to an output variable.\nA useful representation bridging state space and transfer function methods was proposed by Howard H. Rosenbrock and is referred to as Rosenbrock system matrix.\nIn optics, modulation transfer function indicates the capability of optical contrast transmission.\nFor example, when observing a series of black-white-light fringes drawn with a specific spatial frequency, the image quality may decay. White fringes fade while black ones turn brighter.\nThe modulation transfer function in a specific spatial frequency is defined by:\nWhere modulation (M) is computed from the following image or light brightness:\nTransfer functions do not properly exist for many non-linear systems. For example, they do not exist for relaxation oscillators;[9] however, describing functions can sometimes be used to approximate such nonlinear time-invariant systems.", 
    "dbpedia_url": "http://dbpedia.org/resource/Transfer_function", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Transfer_function\n"
}