{
    "about": "The transmission-line matrix (TLM) method is a space and time discretising method for computation of electromagnetic fields. It is based on the analogy between the electromagnetic field and a mesh of transmission lines. The TLM method allows the computation of complex three-dimensional electromagnetic structures and has proven to be one of the most powerful time-domain methods along with the finite difference time domain (FDTD) method.", 
    "classification": "Computational Physics", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Transmission-line_matrix_method\n", 
    "full_text": "The transmission-line matrix (TLM) method is a space and time discretising method for computation of electromagnetic fields. It is based on the analogy between the electromagnetic field and a mesh of transmission lines. The TLM method allows the computation of complex three-dimensional electromagnetic structures and has proven to be one of the most powerful time-domain methods along with the finite difference time domain (FDTD) method.\n\n\nThe TLM method is based on Huygens' model of wave propagation and scattering and the analogy between field propagation and transmission lines. Therefore, it considers the computational domain as a mesh of transmission lines, interconnected at nodes. In the figure on the right is considered a simple example of a 2D TLM mesh with a voltage pulse of amplitude 1 V incident on the central node. This pulse will be partially reflected and transmitted according to the transmission-line theory. If we assume that each line has a characteristic impedance \n\n\n\nZ\n\n\n{\\displaystyle Z}\n\n, then the incident pulse sees effectively three transmission lines in parallel with a total impedance of \n\n\n\nZ\n\n/\n\n3\n\n\n{\\displaystyle Z/3}\n\n. The reflection coefficient and the transmission coefficient are given by\nThe energy injected into the node by the incident pulse and the total energy of the scattered pulses are correspondingly\nTherefore, the energy conservation law is fulfilled by the model.\nThe next scattering event excites the neighbouring nodes according to the principle described above. It can be seen that every node turns into a secondary source of spherical wave. These waves combine to form the overall waveform. This is in accordance with Huygens principle of light propagation.\nIn order to show the TLM schema we will use time and space discretisation. The time-step will be denoted with \n\n\n\nΔ\nt\n\n\n{\\displaystyle \\Delta t}\n\n and the space discretisation intervals with \n\n\n\nΔ\nx\n\n\n{\\displaystyle \\Delta x}\n\n, \n\n\n\nΔ\ny\n\n\n{\\displaystyle \\Delta y}\n\n and \n\n\n\nΔ\nz\n\n\n{\\displaystyle \\Delta z}\n\n. The absolute time and space will therefore be \n\n\n\nt\n=\nk\n\nΔ\nt\n\n\n{\\displaystyle t=k\\,\\Delta t}\n\n, \n\n\n\nx\n=\nl\n\nΔ\nx\n\n\n{\\displaystyle x=l\\,\\Delta x}\n\n, \n\n\n\ny\n=\nm\n\nΔ\ny\n\n\n{\\displaystyle y=m\\,\\Delta y}\n\n, \n\n\n\nz\n=\nn\n\nΔ\nz\n\n\n{\\displaystyle z=n\\,\\Delta z}\n\n, where \n\n\n\nk\n=\n0\n,\n1\n,\n2\n,\n…\n\n\n{\\displaystyle k=0,1,2,\\ldots }\n\n is the time instant and \n\n\n\nm\n,\nn\n,\nl\n\n\n{\\displaystyle m,n,l}\n\n are the cell coordinates. In case \n\n\n\nΔ\nx\n=\nΔ\ny\n=\nΔ\nz\n\n\n{\\displaystyle \\Delta x=\\Delta y=\\Delta z}\n\n the value \n\n\n\nΔ\nl\n\n\n{\\displaystyle \\Delta l}\n\n will be used, which is the lattice constant. In this case the following holds:\nwhere \n\n\n\n\nc\n\n0\n\n\n\n\n{\\displaystyle c_{0}}\n\n is the free space speed of light.\nIf we consider an electromagnetic field distribution in which the only non-zero components are \n\n\n\n\nE\n\nx\n\n\n\n\n{\\displaystyle E_{x}}\n\n, \n\n\n\n\nE\n\ny\n\n\n\n\n{\\displaystyle E_{y}}\n\n and \n\n\n\n\nH\n\nz\n\n\n\n\n{\\displaystyle H_{z}}\n\n (i.e. a TE-mode distribution), then Maxwell's equations in Cartesian coordinates reduce to\nWe can combine these equations to obtain\nThe figure on the right presents a structure referred to as a series node. It describes a block of space dimensions \n\n\n\nΔ\nx\n\n\n{\\displaystyle \\Delta x}\n\n, \n\n\n\nΔ\ny\n\n\n{\\displaystyle \\Delta y}\n\n and \n\n\n\nΔ\nz\n\n\n{\\displaystyle \\Delta z}\n\n that consists of four ports. \n\n\n\n\nL\n′\n\n\n\n{\\displaystyle L'}\n\n and \n\n\n\n\nC\n′\n\n\n\n{\\displaystyle C'}\n\n are the distributed inductance and capacitance of the transmission lines. It is possible to show that a series node is equivalent to a TE-wave, more precisely the mesh current I, the x-direction voltages (ports 1 and 3) and the y-direction voltages (ports 2 and 4) may be related to the field components \n\n\n\n\nH\n\nz\n\n\n\n\n{\\displaystyle H_{z}}\n\n, \n\n\n\n\nE\n\nx\n\n\n\n\n{\\displaystyle E_{x}}\n\n and \n\n\n\n\nE\n\ny\n\n\n\n\n{\\displaystyle E_{y}}\n\n. If the voltages on the ports are considered, \n\n\n\n\nL\n\nx\n\n\n=\n\nL\n\ny\n\n\n\n\n{\\displaystyle L_{x}=L_{y}}\n\n, and the polarity from the above figure holds, then the following is valid\nwhere \n\n\n\nΔ\nx\n=\nΔ\ny\n=\nΔ\nl\n\n\n{\\displaystyle \\Delta x=\\Delta y=\\Delta l}\n\n.\nand dividing both sides by \n\n\n\nΔ\nx\nΔ\ny\n\n\n{\\displaystyle \\Delta x\\Delta y}\n\n\nSince \n\n\n\nΔ\nx\n=\nΔ\ny\n=\nΔ\nz\n=\nΔ\nl\n\n\n{\\displaystyle \\Delta x=\\Delta y=\\Delta z=\\Delta l}\n\n and substituting \n\n\n\nI\n=\n\nH\n\nz\n\n\n\nΔ\nz\n\n\n{\\displaystyle I=H_{z}\\,\\Delta z}\n\n gives\nThis reduces to Maxwell's equations when \n\n\n\nΔ\nl\n→\n0\n\n\n{\\displaystyle \\Delta l\\rightarrow 0}\n\n.\nSimilarly, using the conditions across the capacitors on ports 1 and 4, it can be shown that the corresponding two other Maxwell equations are the following:\nHaving these results, it is possible to compute the scattering matrix of a shunt node. The incident voltage pulse on port 1 at time-step k is denoted as \n\n\n\n\n\n\nk\n\n\n\nV\n\n1\n\n\ni\n\n\n\n\n{\\displaystyle _{k}V_{1}^{i}}\n\n. Replacing the four line segments from the above figure with their Thevenin equivalent it is possible to show that the following equation for the reflected voltage pulse holds:\nIf all incident waves as well as all reflected waves are collected in one vector, then this equation may be written down for all ports in matrix form:\nwhere \n\n\n\n\n\n\nk\n\n\n\n\nV\n\n\ni\n\n\n\n\n{\\displaystyle _{k}\\mathbf {V} ^{i}}\n\n and \n\n\n\n\n\n\nk\n\n\n\n\nV\n\n\nr\n\n\n\n\n{\\displaystyle _{k}\\mathbf {V} ^{r}}\n\n are the incident and the reflected pulse amplitude vectors.\nFor a series node the scattering matrix S has the following form\nIn order to describe the connection between adjacent nodes by a mesh of series nodes, look at the figure on the right. As the incident pulse in timestep k+1 on a node is the scattered pulse from an adjacent node in timestep k, the following connection equations are derived:\nBy modifying the scattering matrix \n\n\n\n\n\nS\n\n\n\n\n{\\displaystyle {\\textbf {S}}}\n\n inhomogeneous and lossy materials can be modelled. By adjusting the connection equations it is possible to simulate different boundaries.\nApart from the series node, described above there is also the shunt TLM node, which represents a TM-mode field distribution. The only non-zero components of such wave are \n\n\n\n\nH\n\nx\n\n\n\n\n{\\displaystyle H_{x}}\n\n, \n\n\n\n\nH\n\ny\n\n\n\n\n{\\displaystyle H_{y}}\n\n, and \n\n\n\n\nE\n\nz\n\n\n\n\n{\\displaystyle E_{z}}\n\n. With similar considerations as for the series node the scattering matrix of the shunt node can be derived.\nMost problems in electromagnetics require a three-dimensional grid. As we now have structures that describe TE and TM-field distributions, intuitively it seems possible to define a combination of shunt and series nodes providing a full description of the electromagnetic field. Such attempts have been made, but because of the complexity of the resulting structures they proved to be not very useful. Using the analogy that was presented above leads to calculation of the different field components at physically separated points. This causes difficulties in providing simple and efficient boundary definitions. A solution to these problems was provided by Johns in 1987, when he proposed the structure known as the symmetrical condensed node (SCN), presented in the figure on the right. It consists of 12 ports because two field polarisations are to be assigned to each of the 6 sides of a mesh cell.\nThe topology of the SCN cannot be analysed using Thevenin equivalent circuits. More general energy and charge conservation principles are to be used.\nThe electric and the magnetic fields on the sides of the SCN node number (l,m,n) at time instant k may be summarised in 12-dimensional vectors\nThey can be linked with the incident and scattered amplitude vectors via\nwhere \n\n\n\n\nZ\n\nF\n\n\n=\n\n\n\nμ\nε\n\n\n\n\n\n{\\displaystyle Z_{F}={\\sqrt {\\frac {\\mu }{\\varepsilon }}}}\n\n is the field impedance, \n\n\n\n\n\n\nk\n\n\n\n\na\n\n\nl\n,\nm\n,\nn\n\n\n\n\n{\\displaystyle _{k}\\mathbf {a} _{l,m,n}}\n\n is the vector of the amplitudes of the incident waves to the node, and \n\n\n\n\n\n\nk\n\n\n\n\nb\n\n\nl\n,\nm\n,\nn\n\n\n\n\n{\\displaystyle _{k}\\mathbf {b} _{l,m,n}}\n\n is the vector of the scattered amplitudes. The relation between the incident and scattered waves is given by the matrix equation\nThe scattering matrix S can be calculated. For the symmetrical condensed node with ports defined as in the figure the following result is obtained\nwhere the following matrix was used\nThe connection between different SCNs is done in the same manner as for the 2D nodes.", 
    "name": "Transmission Line Matrix Method"
}