{
    "about": "The travelling salesman problem (TSP) asks the following question: \"Given a list of cities and the distances between each pair of cities, what is the shortest possible route that visits each city exactly once and returns to the origin city?\" It is an NP-hard problem in combinatorial optimization, important in operations research and theoretical computer science.", 
    "name": "Travelling Salesman Problem", 
    "classification": "Graph Algorithms", 
    "full_text": "The travelling salesman problem (TSP) asks the following question: \"Given a list of cities and the distances between each pair of cities, what is the shortest possible route that visits each city exactly once and returns to the origin city?\" It is an NP-hard problem in combinatorial optimization, important in operations research and theoretical computer science.\nTSP is a special case of the travelling purchaser problem and the vehicle routing problem.\nIn the theory of computational complexity, the decision version of the TSP (where, given a length L, the task is to decide whether the graph has any tour shorter than L) belongs to the class of NP-complete problems. Thus, it is possible that the worst-case running time for any algorithm for the TSP increases superpolynomially (but no more than exponentially) with the number of cities.\nThe problem was first formulated in 1930 and is one of the most intensively studied problems in optimization. It is used as a benchmark for many optimization methods. Even though the problem is computationally difficult, a large number of heuristics and exact algorithms are known, so that some instances with tens of thousands of cities can be solved completely and even problems with millions of cities can be approximated within a small fraction of 1%.[1]\nThe TSP has several applications even in its purest formulation, such as planning, logistics, and the manufacture of microchips. Slightly modified, it appears as a sub-problem in many areas, such as DNA sequencing. In these applications, the concept city represents, for example, customers, soldering points, or DNA fragments, and the concept distance represents travelling times or cost, or a similarity measure between DNA fragments. The TSP also appears in astronomy, as astronomers observing many sources will want to minimize the time spent moving the telescope between the sources. In many applications, additional constraints such as limited resources or time windows may be imposed.\n\n\nThe origins of the travelling salesman problem are unclear. A handbook for travelling salesmen from 1832 mentions the problem and includes example tours through Germany and Switzerland, but contains no mathematical treatment.[2]\nThe travelling salesman problem was mathematically formulated in the 1800s by the Irish mathematician W.R. Hamilton and by the British mathematician Thomas Kirkman. Hamilton’s Icosian Game was a recreational puzzle based on finding a Hamiltonian cycle.[3] The general form of the TSP appears to have been first studied by mathematicians during the 1930s in Vienna and at Harvard, notably by Karl Menger, who defines the problem, considers the obvious brute-force algorithm, and observes the non-optimality of the nearest neighbour heuristic:\nWe denote by messenger problem (since in practice this question should be solved by each postman, anyway also by many travelers) the task to find, for ﬁnitely many points whose pairwise distances are known, the shortest route connecting the points. Of course, this problem is solvable by finitely many trials. Rules which would push the number of trials below the number of permutations of the given points, are not known. The rule that one first should go from the starting point to the closest point, then to the point closest to this, etc., in general does not yield the shortest route. [4]\nIt was first considered mathematically in the 1930s by Merrill Flood who was looking to solve a school bus routing problem.[5] Hassler Whitney at Princeton University introduced the name travelling salesman problem soon after.[6]\nIn the 1950s and 1960s, the problem became increasingly popular in scientific circles in Europe and the USA after the RAND Corporation in Santa Monica, offered prizes for steps in solving the problem.[5] Notable contributions were made by George Dantzig, Delbert Ray Fulkerson and Selmer M. Johnson from the RAND Corporation, who expressed the problem as an integer linear program and developed the cutting plane method for its solution. They wrote what is considered the seminal paper on the subject in which with these new methods they solved an instance with 49 cities to optimality by constructing a tour and proving that no other tour could be shorter. Dantzig, Fulkerson and Johnson, however, speculated that given a near optimal solution we may be able to find optimality or prove optimality by adding a small amount of extra inequalities (cuts). They used this idea to solve their initial 49 city problem using a string model. They found they only needed 26 cuts to come to a solution for their 49 city problem. While this paper did not give an algorithmic approach to TSP problems, the ideas that lay within it were indispensable to later creating exact solution methods for the TSP, though it would take 15 years to find an algorithmic approach in creating these cuts.[5] As well as cutting plane methods, Dantzig, Fulkerson and Johnson used branch and bound algorithms perhaps for the first time.[5]\nIn the following decades, the problem was studied by many researchers from mathematics, computer science, chemistry, physics, and other sciences. In the 1960s however a new approach was created, instead of finding optimal solutions, people tried to instead find the worst solutions and in doing so, created lower bounds for the problem. These may then be used with branch and bound approaches. One method of doing this was to create the minimum spanning tree of the graph and then multiply the cost of this by 2.[5]\nChristofides made a big advance in this approach of giving an approach for which we know the worst-case scenario. His algorithm given in 1976, at worst is 1.5 times longer than the optimal solution. As the algorithm was so simple and quick, many hoped it would give way to a near optimal solution method. However, until 2011 when it was beaten by less than a billionth of a percent, this remained the method with the best worst-case scenario.[7]\nRichard M. Karp showed in 1972 that the Hamiltonian cycle problem was NP-complete, which implies the NP-hardness of TSP. This supplied a mathematical explanation for the apparent computational difficulty of finding optimal tours.\nGreat progress was made in the late 1970s and 1980, when Grötschel, Padberg, Rinaldi and others managed to exactly solve instances with up to 2392 cities, using cutting planes and branch-and-bound.\nIn the 1990s, Applegate, Bixby, Chvátal, and Cook developed the program Concorde that has been used in many recent record solutions. Gerhard Reinelt published the TSPLIB in 1991, a collection of benchmark instances of varying difficulty, which has been used by many research groups for comparing results. In 2006, Cook and others computed an optimal tour through an 85,900-city instance given by a microchip layout problem, currently the largest solved TSPLIB instance. For many other instances with millions of cities, solutions can be found that are guaranteed to be within 2-3% of an optimal tour.[8]\nThe problem is sometimes, especially in newer publications, referred to as Travelling Salesperson Problem.[citation needed]\nTSP can be modelled as an undirected weighted graph, such that cities are the graph's vertices, paths are the graph's edges, and a path's distance is the edge's weight. It is a minimization problem starting and finishing at a specified vertex after having visited each other vertex exactly once. Often, the model is a complete graph (i.e. each pair of vertices is connected by an edge). If no path exists between two cities, adding an arbitrarily long edge will complete the graph without affecting the optimal tour.\nIn the symmetric TSP, the distance between two cities is the same in each opposite direction, forming an undirected graph. This symmetry halves the number of possible solutions. In the asymmetric TSP, paths may not exist in both directions or the distances might be different, forming a directed graph. Traffic collisions, one-way streets, and airfares for cities with different departure and arrival fees are examples of how this symmetry could break down.\nTSP can be formulated as an integer linear program.[10][11][12] Label the cities with the numbers 1, …, n and define:\nFor i = 1, …, n, let \n\n\n\n\nu\n\ni\n\n\n\n\n{\\displaystyle u_{i}}\n\n be a dummy variable, and finally take \n\n\n\n\nc\n\ni\nj\n\n\n\n\n{\\displaystyle c_{ij}}\n\n to be the distance from city i to city j. Then TSP can be written as the following integer linear programming problem:\nThe first set of equalities requires that each city be arrived at from exactly one other city, and the second set of equalities requires that from each city there is a departure to exactly one other city. The last constraints enforce that there is only a single tour covering all cities, and not two or more disjointed tours that only collectively cover all cities. To prove this, it is shown below (1) that every feasible solution contains only one closed sequence of cities, and (2) that for every single tour covering all cities, there are values for the dummy variables \n\n\n\n\nu\n\ni\n\n\n\n\n{\\displaystyle u_{i}}\n\n that satisfy the constraints.\nTo prove that every feasible solution contains only one closed sequence of cities, it suffices to show that every subtour in a feasible solution passes through city 1 (noting that the equalities ensure there can only be one such tour). For if we sum all the inequalities corresponding to \n\n\n\n\nx\n\ni\nj\n\n\n=\n1\n\n\n{\\displaystyle x_{ij}=1}\n\n for any subtour of k steps not passing through city 1, we obtain:\nwhich is a contradiction.\nIt now must be shown that for every single tour covering all cities, there are values for the dummy variables \n\n\n\n\nu\n\ni\n\n\n\n\n{\\displaystyle u_{i}}\n\n that satisfy the constraints.\nWithout loss of generality, define the tour as originating (and ending) at city 1. Choose \n\n\n\n\nu\n\ni\n\n\n=\nt\n\n\n{\\displaystyle u_{i}=t}\n\n if city i is visited in step t (i, t = 1, 2, ..., n). Then\nsince \n\n\n\n\nu\n\ni\n\n\n\n\n{\\displaystyle u_{i}}\n\n can be no greater than n and \n\n\n\n\nu\n\nj\n\n\n\n\n{\\displaystyle u_{j}}\n\n can be no less than 1; hence the constraints are satisfied whenever \n\n\n\n\nx\n\ni\nj\n\n\n=\n0.\n\n\n{\\displaystyle x_{ij}=0.}\n\n For \n\n\n\n\nx\n\ni\nj\n\n\n=\n1\n\n\n{\\displaystyle x_{ij}=1}\n\n, we have:\nsatisfying the constraint.\nThe traditional lines of attack for the NP-hard problems are the following:\nThe most direct solution would be to try all permutations (ordered combinations) and see which one is cheapest (using brute force search). The running time for this approach lies within a polynomial factor of \n\n\n\nO\n(\nn\n!\n)\n\n\n{\\displaystyle O(n!)}\n\n, the factorial of the number of cities, so this solution becomes impractical even for only 20 cities.\nOne of the earliest applications of dynamic programming is the Held–Karp algorithm that solves the problem in time \n\n\n\nO\n(\n\nn\n\n2\n\n\n\n2\n\nn\n\n\n)\n\n\n{\\displaystyle O(n^{2}2^{n})}\n\n.[13]\nImproving these time bounds seems to be difficult. For example, it has not been determined whether an exact algorithm for TSP that runs in time \n\n\n\nO\n(\n\n1.9999\n\nn\n\n\n)\n\n\n{\\displaystyle O(1.9999^{n})}\n\n exists.[14]\nOther approaches include:\nAn exact solution for 15,112 German towns from TSPLIB was found in 2001 using the cutting-plane method proposed by George Dantzig, Ray Fulkerson, and Selmer M. Johnson in 1954, based on linear programming. The computations were performed on a network of 110 processors located at Rice University and Princeton University (see the Princeton external link)[citation needed]. The total computation time was equivalent to 22.6 years on a single 500 MHz Alpha processor. In May 2004, the travelling salesman problem of visiting all 24,978 towns in Sweden was solved: a tour of length approximately 72,500 kilometres was found and it was proven that no shorter tour exists.[16] In March 2005, the travelling salesman problem of visiting all 33,810 points in a circuit board was solved using Concorde TSP Solver: a tour of length 66,048,945 units was found and it was proven that no shorter tour exists. The computation took approximately 15.7 CPU-years (Cook et al. 2006). In April 2006 an instance with 85,900 points was solved using Concorde TSP Solver, taking over 136 CPU-years, see Applegate et al. (2006).\nVarious heuristics and approximation algorithms, which quickly yield good solutions have been devised. Modern methods can find solutions for extremely large problems (millions of cities) within a reasonable time which are with a high probability just 2–3% away from the optimal solution.[8]\nSeveral categories of heuristics are recognized.\nThe nearest neighbour (NN) algorithm (a greedy algorithm) lets the salesman choose the nearest unvisited city as his next move. This algorithm quickly yields an effectively short route. For N cities randomly distributed on a plane, the algorithm on average yields a path 25% longer than the shortest possible path.[17] However, there exist many specially arranged city distributions which make the NN algorithm give the worst route (Gutin, Yeo, and Zverovich, 2002). This is true for both asymmetric and symmetric TSPs (Gutin and Yeo, 2007). Rosenkrantz et al. [1977] showed that the NN algorithm has the approximation factor \n\n\n\nΘ\n(\nlog\n⁡\n\n|\n\nV\n\n|\n\n)\n\n\n{\\displaystyle \\Theta (\\log |V|)}\n\n for instances satisfying the triangle inequality. A variation of NN algorithm, called Nearest Fragment (NF) operator, which connects a group (fragment) of nearest unvisited cities, can find shorter route with successive iterations.[18] The NF operator can also be applied on an initial solution obtained by NN algorithm for further improvement in an elitist model, where only better solutions are accepted.\nThe bitonic tour of a set of points is the minimum-perimeter monotone polygon that has the points as its vertices; it can be computed efficiently by dynamic programming.\nAnother constructive heuristic, Match Twice and Stitch (MTS) (Kahng, Reda 2004 [19]), performs two sequential matchings, where the second matching is executed after deleting all the edges of the first matching, to yield a set of cycles. The cycles are then stitched to produce the final tour.\nThe Christofides algorithm follows a similar outline but combines the minimum spanning tree with a solution of another problem, minimum-weight perfect matching. This gives a TSP tour which is at most 1.5 times the optimal. The Christofides algorithm was one of the first approximation algorithms, and was in part responsible for drawing attention to approximation algorithms as a practical approach to intractable problems. As a matter of fact, the term \"algorithm\" was not commonly extended to approximation algorithms until later; the Christofides algorithm was initially referred to as the Christofides heuristic.\nThis algorithm looks at things differently by using a result from graph theory which helps improve on the LB of the TSP which originated from doubling the cost of the minimum spanning tree. Given an Eulerian graph we can find an Eulerian tour in O(n) time.[5] So if we had an Eulerian graph with cities from a TSP as vertices then we can easily see that we could use such a method for finding an Eulerian tour to find a TSP solution. By triangular inequality we know that the TSP tour can be no longer than the Eulerian tour and as such we have a LB for the TSP. Such a method is described below.\nTo improve our lower bound, we therefore need a better way of creating an Eulerian graph. But by triangular inequality, the best Eulerian graph must have the same cost as the best travelling salesman tour, hence finding optimal Eulerian graphs is at least as hard as TSP. One way of doing this that has been proposed is by the concept of minimum weight matching for the creation of which there exist algorithms of \n\n\n\nO\n(\n\nn\n\n3\n\n\n)\n\n\n{\\displaystyle O(n^{3})}\n\n.[5]\nTo make a graph into an Eulerian graph, one starts with the minimum spanning tree. Then all the vertices of odd order must be made even. So a matching for the odd degree vertices must be added which increases the order of every odd degree vertex by one.[5] This leaves us with a graph where every vertex is of even order which is thus Eulerian. Now we can adapt the above method to give Christofides' algorithm,\nFor Euclidean instances, 2-opt heuristics give on average solutions that are about 5% better than Christofides' algorithm. If we start with an initial solution made with a greedy algorithm, the average number of moves greatly decreases again and is O(n). For random starts however, the average number of moves is O(n log(n)). However whilst in order this is a small increase in size, the initial number of moves for small problems is 10 times as big for a random start compared to one made from a greedy heuristic. This is because such 2-opt heuristics exploit `bad' parts of a solution such as crossings. These types of heuristics are often used within Vehicle routing problem heuristics to reoptimize route solutions.[17]\nOptimized Markov chain algorithms which use local searching heuristic sub-algorithms can find a route extremely close to the optimal route for 700 to 800 cities.\nTSP is a touchstone for many general heuristics devised for combinatorial optimization such as genetic algorithms, simulated annealing, Tabu search, ant colony optimization, river formation dynamics (see swarm intelligence) and the cross entropy method.\nArtificial intelligence researcher Marco Dorigo described in 1993 a method of heuristically generating \"good solutions\" to the TSP using a simulation of an ant colony called ACS (Ant Colony System).[20] It models behaviour observed in real ants to find short paths between food sources and their nest, an emergent behaviour resulting from each ant's preference to follow trail pheromones deposited by other ants.\nACS sends out a large number of virtual ant agents to explore many possible routes on the map. Each ant probabilistically chooses the next city to visit based on a heuristic combining the distance to the city and the amount of virtual pheromone deposited on the edge to the city. The ants explore, depositing pheromone on each edge that they cross, until they have all completed a tour. At this point the ant which completed the shortest tour deposits virtual pheromone along its complete tour route (global trail updating). The amount of pheromone deposited is inversely proportional to the tour length: the shorter the tour, the more it deposits.\nIn the metric TSP, also known as delta-TSP or Δ-TSP, the intercity distances satisfy the triangle inequality.\nA very natural restriction of the TSP is to require that the distances between cities form a metric to satisfy the triangle inequality; that is the direct connection from A to B is never farther than the route via intermediate C:\nThe edge spans then build a metric on the set of vertices. When the cities are viewed as points in the plane, many natural distance functions are metrics, and so many natural instances of TSP satisfy this constraint.\nThe following are some examples of metric TSPs for various metrics.\nThe last two metrics appear for example in routing a machine that drills a given set of holes in a printed circuit board. The Manhattan metric corresponds to a machine that adjusts first one co-ordinate, and then the other, so the time to move to a new point is the sum of both movements. The maximum metric corresponds to a machine that adjusts both co-ordinates simultaneously, so the time to move to a new point is the slower of the two movements.\nIn its definition, the TSP does not allow cities to be visited twice, but many applications do not need this constraint. In such cases, a symmetric, non-metric instance can be reduced to a metric one. This replaces the original graph with a complete graph in which the inter-city distance \n\n\n\n\nd\n\nA\nB\n\n\n\n\n{\\displaystyle d_{AB}}\n\n is replaced by the shortest path between A and B in the original graph.\nWhen the input numbers can be arbitrary real numbers, Euclidean TSP is a particular case of metric TSP, since distances in a plane obey the triangle inequality. When the input numbers must be integers, comparing lengths of tours involves comparing sums of square-roots.\nLike the general TSP, Euclidean TSP is NP-hard in either case. With rational coordinates and discretized metric (distances rounded up to an integer), the problem is NP-complete.[21] With rational coordinates and the actual Euclidean metric, Euclidean TSP is known to be in the Counting Hierarchy,[22] a subclass of PSPACE. With arbitrary real coordinates, Euclidean TSP cannot be in such classes, since there are uncountably many possible inputs. However, Euclidean TSP is probably the easiest version for approximation.[23] For example, the minimum spanning tree of the graph associated with an instance of the Euclidean TSP is a Euclidean minimum spanning tree, and so can be computed in expected O (n log n) time for n points (considerably less than the number of edges). This enables the simple 2-approximation algorithm for TSP with triangle inequality above to operate more quickly.\nIn general, for any c > 0, where d is the number of dimensions in the Euclidean space, there is a polynomial-time algorithm that finds a tour of length at most (1 + 1/c) times the optimal for geometric instances of TSP in\ntime; this is called a polynomial-time approximation scheme (PTAS).[24] Sanjeev Arora and Joseph S. B. Mitchell were awarded the Gödel Prize in 2010 for their concurrent discovery of a PTAS for the Euclidean TSP.\nIn practice, simpler heuristics with weaker guarantees continue to be used.\nIn most cases, the distance between two nodes in the TSP network is the same in both directions. The case where the distance from A to B is not equal to the distance from B to A is called asymmetric TSP. A practical application of an asymmetric TSP is route optimization using street-level routing (which is made asymmetric by one-way streets, slip-roads, motorways, etc.).\nSolving an asymmetric TSP graph can be somewhat complex. The following is a 3×3 matrix containing all possible path weights between the nodes A, B and C. One option is to turn an asymmetric matrix of size N into a symmetric matrix of size 2N.[25]\nTo double the size, each of the nodes in the graph is duplicated, creating a second ghost node, linked to the original node with a \"ghost\" edge of very low (possibly negative) weight, here denoted −w. (Alternatively, the ghost edges have weight 0, and weight w is added to all other edges.) The original 3×3 matrix shown above is visible in the bottom left and the inverse of the original in the top-right. Both copies of the matrix have had their diagonals replaced by the low-cost hop paths, represented by −w. In the new graph, no edge directly links original nodes and no edge directly links ghost nodes.\nThe weight −w of the \"ghost\" edges linking the ghost nodes to the corresponding original nodes must be low enough to ensure that all ghost edges must belong to any optimal symmetric TSP solution on the new graph (w=0 is not always low enough). As a consequence, in the optimal symmetric tour, each original node appears next to its ghost node (e.g. a possible path is A -> A′ -> C -> C′ -> B -> B′ -> A) and by mergeing the original and ghost nodes again we get an (optimal) solution of the original asymmetric problem (in our example, A -> C -> B -> A).\nThere is an analogous problem in geometric measure theory which asks the following: under what conditions may a subset E of Euclidean space be contained in a rectifiable curve (that is, when is there a curve with finite length that visits every point in E)? This problem is known as the analyst's travelling salesman problem\nSuppose \n\n\n\n\nX\n\n1\n\n\n,\n…\n,\n\nX\n\nn\n\n\n\n\n{\\displaystyle X_{1},\\ldots ,X_{n}}\n\n are \n\n\n\nn\n\n\n{\\displaystyle n}\n\n independent random variables with uniform distribution in the square \n\n\n\n[\n0\n,\n1\n\n]\n\n2\n\n\n\n\n{\\displaystyle [0,1]^{2}}\n\n, and let \n\n\n\n\nL\n\nn\n\n\n∗\n\n\n\n\n{\\displaystyle L_{n}^{\\ast }}\n\n be the shortest path length (i.e. TSP solution) for this set of points, according to the usual Euclidean distance. It is known[26] that, almost surely,\nwhere \n\n\n\nβ\n\n\n{\\displaystyle \\beta }\n\n is a positive constant that is not known explicitly. Since \n\n\n\n\nL\n\nn\n\n\n∗\n\n\n≤\n2\n\n\nn\n\n\n+\n2\n\n\n{\\displaystyle L_{n}^{*}\\leq 2{\\sqrt {n}}+2}\n\n (see below), it follows from bounded convergence theorem that \n\n\n\nβ\n=\n\nlim\n\nn\n→\n∞\n\n\n\nE\n\n[\n\nL\n\nn\n\n\n∗\n\n\n]\n\n/\n\n\n\nn\n\n\n\n\n{\\displaystyle \\beta =\\lim _{n\\to \\infty }\\mathbb {E} [L_{n}^{*}]/{\\sqrt {n}}}\n\n, hence lower and upper bounds on \n\n\n\nβ\n\n\n{\\displaystyle \\beta }\n\n follow from bounds on \n\n\n\n\nE\n\n[\n\nL\n\nn\n\n\n∗\n\n\n]\n\n\n{\\displaystyle \\mathbb {E} [L_{n}^{*}]}\n\n.\nThe almost sure limit \n\n\n\n\n\n\nL\n\nn\n\n\n∗\n\n\n\nn\n\n\n\n→\nβ\n\n\n{\\displaystyle {\\frac {L_{n}^{*}}{\\sqrt {n}}}\\rightarrow \\beta }\n\n as \n\n\n\nn\n→\n∞\n\n\n{\\displaystyle n\\to \\infty }\n\n may not exist if the independent locations \n\n\n\n\nX\n\n1\n\n\n,\n…\n,\n\nX\n\nn\n\n\n\n\n{\\displaystyle X_{1},\\ldots ,X_{n}}\n\n are replaced with observations from a stationary ergodic process with uniform marginals. [27]\nwhere 0.522 comes from the points near square boundary which have fewer neighbours, and Christine L. Valenzuela and Antonia J. Jones [33] obtained the following other numerical lower bound:\nThe problem has been shown to be NP-hard (more precisely, it is complete for the complexity class FPNP; see function problem), and the decision problem version (\"given the costs and a number x, decide whether there is a round-trip route cheaper than x\") is NP-complete. The bottleneck travelling salesman problem is also NP-hard. The problem remains NP-hard even for the case when the cities are in the plane with Euclidean distances, as well as in a number of other restrictive cases. Removing the condition of visiting each city \"only once\" does not remove the NP-hardness, since it is easily seen that in the planar case there is an optimal tour that visits each city only once (otherwise, by the triangle inequality, a shortcut that skips a repeated visit would not increase the tour length).\nIn the general case, finding a shortest travelling salesman tour is NPO-complete.[34] If the distance measure is a metric and symmetric, the problem becomes APX-complete[35] and Christofides’s algorithm approximates it within 1.5.[36] The best known inapproximability bound is 123/122 .[37]\nIf the distances are restricted to 1 and 2 (but still are a metric) the approximation ratio becomes 8/7.[38] In the asymmetric, metric case, only logarithmic performance guarantees are known, the best current algorithm achieves performance ratio 0.814 log(n);[39] it is an open question if a constant factor approximation exists.\nThe corresponding maximization problem of finding the longest travelling salesman tour is approximable within 63/38.[40] If the distance function is symmetric, the longest tour can be approximated within 4/3 by a deterministic algorithm[41] and within \n\n\n\n\n\n\n1\n25\n\n\n\n(\n33\n+\nε\n)\n\n\n{\\displaystyle {\\tfrac {1}{25}}(33+\\varepsilon )}\n\n by a randomized algorithm.[42]\nThe TSP, in particular the Euclidean variant of the problem, has attracted the attention of researchers in cognitive psychology. It has been observed that humans are able to produce good quality solutions quickly.[43] These results suggest that computer performance on the TSP may be improved by understanding and emulating the methods used by humans for these problems, and have also led to new insights into the mechanisms of human thought.[44] The first issue of the Journal of Problem Solving was devoted to the topic of human performance on TSP,[45] and a 2011 review listed dozens of papers on the subject.[44]\nWhen presented with a spatial configuration of food sources, the amoeboid Physarum polycephalum adapts its morphology to create an efficient path between the food sources which can also be viewed as an approximate solution to TSP.[46] It's considered to present interesting possibilities and it has been studied in the area of natural computing.\nFor benchmarking of TSP algorithms, TSPLIB is a library of sample instances of the TSP and related problems is maintained, see the TSPLIB external reference. Many of them are lists of actual cities and layouts of actual printed circuits.", 
    "dbpedia_url": "http://dbpedia.org/resource/Travelling_salesman_problem", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Travelling_salesman_problem\n"
}