{
    "about": "The triple correlation of an ordinary function on the real line is the integral of the product of that function with two independently shifted copies of itself:", 
    "name": "Triple Correlation", 
    "classification": "Signal Processing", 
    "full_text": "The triple correlation of an ordinary function on the real line is the integral of the product of that function with two independently shifted copies of itself:\n\n\n\n\n\n∫\n\n−\n∞\n\n\n∞\n\n\n\nf\n\n∗\n\n\n(\nx\n)\nf\n(\nx\n+\n\ns\n\n1\n\n\n)\nf\n(\nx\n+\n\ns\n\n2\n\n\n)\nd\nx\n\n\n{\\displaystyle \\int _{-\\infty }^{\\infty }f^{*}(x)f(x+s_{1})f(x+s_{2})dx}\n\n\nThe Fourier transform of triple correlation is the bispectrum. The triple correlation extends the concept of autocorrelation, which correlates a function with a single shifted copy of itself and thereby enhances its latent periodicities.\n\n\nThe theory of the triple correlation was first investigated by statisticians examining the cumulant structure of non-gaussian random processes. It was also independently studied by physicists as a tool for spectroscopy of laser beams. Hideya Gamo in 1963 described an apparatus for measuring the triple correlation of a laser beam, and also showed how phase information can be recovered from the real part of the bispectrum—up to sign reversal and linear offset. However, Gamo's method implicitly requires the Fourier transform to never be zero at any frequency. This requirement was relaxed, and the class of functions which are known to be uniquely identified by their triple (and higher-order) correlations was considerably expanded, by the study of Yellott and Iverson (1992). Yellott & Iverson also pointed out the connection between triple correlations and the visual texture discrimination theory proposed by Bela Julesz.\nTriple correlation methods are frequently used in signal processing for treating signals that are corrupted by additive white Gaussian noise; in particular, triple correlation techniques are suitable when multiple observations of the signal are available and the signal may be translating in between the observations, e.g.,a sequence of images of an object translating on a noisy background. What makes the triple correlation particularly useful for such tasks are three properties: (1) it is invariant under translation of the underlying signal; (2) it is unbiased in additive Gaussian noise; and (3) it retains nearly all of the relevant phase information in the underlying signal. Properties (1)-(3) of the triple correlation extend in many cases to functions on an arbitrary locally compact group, in particular to the groups of rotations and rigid motions of euclidean space that arise in computer vision and signal processing.\nThe triple correlation may be defined for any locally compact group by using the group's left-invariant Haar measure. It is easily shown that the resulting object is invariant under left translation of the underlying function and unbiased in additive Gaussian noise. What is more interesting is the question of uniqueness : when two functions have the same triple correlation, how are the functions related? For many cases of practical interest, the triple correlation of a function on an abstract group uniquely identifies that function up to a single unknown group action. This uniqueness is a mathematical result that relies on the Pontryagin duality theorem, the Tannaka–Krein duality theorem, and related results of Iwahori-Sugiura, and Tatsuuma. Algorithms exist for recovering bandlimited functions from their triple correlation on euclidean space, as well as rotation groups in two and three dimensions. There is also an interesting link with Wiener's tauberian theorem: any function whose translates are dense in \n\n\n\n\nL\n\n1\n\n\n(\nG\n)\n\n\n{\\displaystyle L_{1}(G)}\n\n, where G is a locally compact abelian group, is also uniquely identified by its triple correlation.", 
    "dbpedia_url": "http://dbpedia.org/resource/Triple_correlation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Triple_correlation\n"
}