{
    "about": "In numerical analysis and scientific computing, truncation error is the error made by truncating an infinite sum and approximating it by a finite sum. For instance, if we approximate the sine function by the first two non-zero term of its Taylor series, as in \n\n\n\nsin\n⁡\n(\nx\n)\n≈\nx\n−\n\n\n\n1\n6\n\n\n\n\nx\n\n3\n\n\n\n\n{\\displaystyle \\sin(x)\\approx x-{\\tfrac {1}{6}}x^{3}}\n\n for small \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, the resulting error is a truncation error. It is present even with infinite-precision arithmetic, because it is caused by truncation of the infinite Taylor series to form the algorithm.", 
    "name": "Truncation Error", 
    "classification": "Numerical Analysis", 
    "full_text": "In numerical analysis and scientific computing, truncation error is the error made by truncating an infinite sum and approximating it by a finite sum. For instance, if we approximate the sine function by the first two non-zero term of its Taylor series, as in \n\n\n\nsin\n⁡\n(\nx\n)\n≈\nx\n−\n\n\n\n1\n6\n\n\n\n\nx\n\n3\n\n\n\n\n{\\displaystyle \\sin(x)\\approx x-{\\tfrac {1}{6}}x^{3}}\n\n for small \n\n\n\nx\n\n\n{\\displaystyle x}\n\n, the resulting error is a truncation error. It is present even with infinite-precision arithmetic, because it is caused by truncation of the infinite Taylor series to form the algorithm.\nOften, truncation error also includes discretization error, which is the error that arises from taking a finite number of steps in a computation to approximate an infinite process. For example, in numerical methods for ordinary differential equations, the continuously varying function that is the solution of the differential equation is approximated by a process that progresses step by step, and the error that this entails is a discretization or truncation error. See Truncation error (numerical integration) for more on this.\nOccasionally, round-off error (the consequence of using finite precision floating point numbers on computers) is also called truncation error, especially if the number is rounded by truncation.", 
    "dbpedia_url": "http://dbpedia.org/resource/Truncation_error", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Truncation_error\n"
}