{
    "about": "UCLUST[1] is an algorithm designed to cluster nucleotide or amino-acid sequences into clusters based on sequence similarity. The algorithm was published in 2010 and implemented in a program also named UCLUST. The algorithm is described by the author as following two simple clustering criteria, in regard to the requested similarity threshold T. The first criterion states that any given cluster's centroid sequence will have a similarity smaller than T to any other clusters' centroid sequence. The second criterion states that each member sequence in a given cluster will have similarity to the cluster's centroid sequence that is equal or greater than T.", 
    "name": "Uclust", 
    "classification": "Bioinformatics Algorithms", 
    "full_text": "UCLUST[1] is an algorithm designed to cluster nucleotide or amino-acid sequences into clusters based on sequence similarity. The algorithm was published in 2010 and implemented in a program also named UCLUST. The algorithm is described by the author as following two simple clustering criteria, in regard to the requested similarity threshold T. The first criterion states that any given cluster's centroid sequence will have a similarity smaller than T to any other clusters' centroid sequence. The second criterion states that each member sequence in a given cluster will have similarity to the cluster's centroid sequence that is equal or greater than T.\nUCLUST algorithm is a greedy one. As a result, the order of the sequences in the input file will affect the resulting clusters and their quality. For this reason, it is advised that the sequences will be sorted before entering clustering stage. The program UCLUST is equipped with some options to sort the input sequences prior to clustering them.\nUCLUST program is widely utilized among the bioinformatic research community, where it used for multiple applications including OTU assignment (e.g. 16s), creating non-redundant gene catalogs, taxonomic assignment and phylogenetic analysis.", 
    "dbpedia_url": "http://dbpedia.org/resource/UCLUST", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/UCLUST\n"
}