{
    "about": "In computational complexity theory, the Unique Games Conjecture is a conjecture made by Subhash Khot in 2002.[1][2][3] The conjecture postulates that the problem of determining the approximate value of a certain type of game, known as a unique game, has NP-hard algorithmic complexity. It has broad applications in the theory of hardness of approximation. If it is true, then for many important problems it is not only impossible to get an exact solution in polynomial time (as postulated by the P versus NP problem), but also impossible to get a good polynomial-time approximation. The problems for which such an inapproximability result would hold include constraint satisfaction problems, which crop up in a wide variety of disciplines.", 
    "name": "Unique Games Conjecture", 
    "classification": "Approximation Algorithms", 
    "full_text": "In computational complexity theory, the Unique Games Conjecture is a conjecture made by Subhash Khot in 2002.[1][2][3] The conjecture postulates that the problem of determining the approximate value of a certain type of game, known as a unique game, has NP-hard algorithmic complexity. It has broad applications in the theory of hardness of approximation. If it is true, then for many important problems it is not only impossible to get an exact solution in polynomial time (as postulated by the P versus NP problem), but also impossible to get a good polynomial-time approximation. The problems for which such an inapproximability result would hold include constraint satisfaction problems, which crop up in a wide variety of disciplines.\nThe conjecture is unusual in that the academic world seems about evenly divided on whether it is true or not.[1]\n\n\nThe unique games conjecture can be stated in a number of equivalent ways.\nThe following formulation of the unique games conjecture is often used in hardness of approximation. The conjecture postulates the NP-hardness of the following promise problem known as label cover with unique constraints. For each edge, the colors on the two vertices are restricted to some particular ordered pairs. In particular, unique constraints means that for each edge none of the ordered pairs have the same color for the same node.\nThis means that an instance of label cover with unique constraints over an alphabet of size k can be represented as a directed graph together with a collection of permutations πe: [k] → [k], one for each edge e of the graph. An assignment to a label cover instance gives to each vertex of G a value in the set [k] = {1, 2, ... k}, often called “colours.”\nAn instance of unique label cover. The 4 vertices may be assigned the colors red, blue, and green while satisfying the constraints at each edge.\nA solution to the unique label cover instance.\nSuch instances are strongly constrained in the sense that the colour of a vertex uniquely defines the colours of its neighbours, and hence for its entire connected component. Thus, if the input instance admits a valid assignment, then such an assignment can be found efficiently by iterating over all colours of a single node. In particular, the problem of deciding if a given instance admits a satisfying assignment can be solved in polynomial time.\nAn instance of unique label cover that does not allow a satisfying assignment.\nAn assignment that satisfies all edges except the thick edge. Thus, this instance has value 3/4.\nThe value of a unique label cover instance is the fraction of constraints that can be satisfied by any assignment. For satisfiable instances, this value is 1 and is easy to find. On the other hand, it seems to be very difficult to determine the value of an unsatisfiable game, even approximately. The unique games conjecture formalises this difficulty.\nMore formally, the (c, s)-gap label-cover problem with unique constraints is the following promise problem (Lyes, Lno):\nwhere G is an instance of the label cover problem with unique constraints.\nThe unique games conjecture states that for every sufficiently small pair of constants ε, δ > 0, there exists a constant k such that the (1 - δ, ε)-gap label-cover problem with unique constraints over alphabet of size k is NP-hard.\nInstead of graphs, the label cover problem can be formulated in terms of linear equations. For example, suppose that we have a system of linear equations over the integers modulo 7:\nThis is an instance of the label cover problem with unique constraints. For example, the first equation corresponds to the permutation π(1, 2) where π(1, 2)(x1) = 2x2 modulo 7.\nA unique game is a special case of a two-prover one-round (2P1R) game. A two-prover one-round game has two players (also known as provers) and a referee. The referee sends each player a question drawn from a known probability distribution, and the players each have to send an answer. The answers come from a set of fixed size. The game is specified by a predicate that depends on the questions sent to the players and the answers provided by them.\nThe players may decide on a strategy beforehand, although they cannot communicate with each other during the game. The players win if the predicate is satisfied by their questions and their answers.\nA two-prover one-round game is called a unique game if for every pair of questions and every answer to the first question, there is exactly one answer to the second question that results in a win for the players, and vice versa. The value of a game is the maximum winning probability for the players over all strategies.\nThe unique games conjecture states that for every sufficiently small pair of constants ε, δ > 0, there exists a constant k such that the following promise problem (Lyes, Lno) is NP-hard:\nwhere G is a unique game whose answers come from a set of size k.\nAlternatively, the unique games conjecture postulates the existence of a certain type of probabilistically checkable proof for problems in NP.\nA unique game can be viewed as a special kind of nonadaptive probabilistically checkable proof with query complexity 2, where for each pair of possible queries of the verifier and each possible answer to the first query, there is exactly one possible answer to the second query that makes the verifier accept, and vice versa.\nThe unique games conjecture states that for every sufficiently small pair of constants ε, δ > 0 there is a constant K such that every problem in NP has a probabilistically checkable proof over an alphabet of size K with completeness 1 - δ, soundness ε and randomness complexity O(log(n)) which is a unique game.\nThe unique games conjecture was introduced by Subhash Khot in 2002 in order to make progress on certain questions in the theory of hardness of approximation.\nThe truth of the unique games conjecture would imply the optimality of many known approximation algorithms (assuming P ≠ NP). For example, the approximation ratio achieved by the algorithm of Goemans and Williamson for approximating the maximum cut in a graph is optimal to within any additive constant assuming the unique games conjecture and P ≠ NP.\nA list of results that the unique games conjecture is known to imply is shown in the adjacent table together with the corresponding best results for the weaker assumption P ≠ NP. A constant of c + ε or c − ε means that the result holds for every constant (with respect to the problem size) strictly greater than or less than c, respectively.\nCurrently there is no consensus regarding the truth of the unique games conjecture. Certain stronger forms of the conjecture have been disproved.\nA different form of the conjecture postulates that distinguishing the case when the value of a unique game is at least 1 − δ from the case when the value is at most ε is impossible for polynomial-time algorithms (but perhaps not NP-hard). This form of the conjecture would still be useful for applications in hardness of approximation. On the other hand, distinguishing instances with value at least 3/8 − δ from instances with value at most 1/2 is known to be NP-hard.[12]\nThe constant δ > 0 in the above formulations of the conjecture is necessary unless P = NP. If the uniqueness requirement is removed the corresponding statement is known to be true by the parallel repetition theorem, even when δ = 0.\nKarpinski and Schudy[13] constructed linear time approximation schemes for dense instances of unique games problem.\nIn 2010, Arora, Barak and Steurer found a subexponential time approximation algorithm for the unique games problem.[14]", 
    "dbpedia_url": "http://dbpedia.org/resource/Unique_games_conjecture", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Unique_games_conjecture\n"
}