{
    "about": "Vector field reconstruction[1] is a method of creating a vector field from experimental or computer generated data, usually with the goal of finding a differential equation model of the system.", 
    "name": "Vector Field Reconstruction", 
    "classification": "Numerical Analysis", 
    "full_text": "Vector field reconstruction[1] is a method of creating a vector field from experimental or computer generated data, usually with the goal of finding a differential equation model of the system.\nA differential equation model is one that describes the value of dependent variables as they evolve in time or space by giving equations involving those variables and their derivatives with respect to some independent variables, usually time and/or space. An ordinary differential equation is one in which the system's dependent variables are functions of only one independent variable. Many physical, chemical, biological and electrical systems are well described by ordinary differential equations. Frequently we assume a system is governed by differential equations, but we do not have exact knowledge of the influence of various factors on the state of the system. For instance, we may have an electrical circuit that in theory is described by a system of ordinary differential equations, but due to the tolerance of resistors, variations of the supply voltage or interference from outside influences we do not know the exact parameters of the system. For some systems, especially those that support chaos, a small change in parameter values can cause a large change in the behavior of the system, so an accurate model is extremely important. Therefore, it may be necessary to construct more exact differential equations by building them up based on the actual system performance rather than a theoretical model. Ideally, one would measure all the dynamical variables involved over an extended period of time, using many different initial conditions, then build or fine tune a differential equation model based on these measurements.\nIn some cases we may not even know enough about the processes involved in a system to even formulate a model. In other cases, we may have access to only one dynamical variable for our measurements, i.e., we have a scalar time series. If we only have a scalar time series, we need to use the method of time delay embedding or derivative coordinates to get a large enough set of dynamical variables to describe the system.\nIn a nutshell, once we have a set of measurements of the system state over some period of time, we find the derivatives of these measurements, which gives us a local vector field, then determine a global vector field consistent with this local field. This is usually done by a least squares fit to the derivative data.\nIn the best possible case, one has data streams of measurements of all the system variables, equally spaced in time, say\nfor\nbeginning at several different initial conditions. Then the task of finding a vector field, and thus a differential equation model consists of fitting functions, for instance, a cubic spline, to the data to obtain a set of continuous time functions\ncomputing time derivatives dx1/dt, dx2/dt,...,dxk/dt of the functions, then making a least squares fit using some sort of orthogonal basis functions (orthogonal polynomials, radial basis functions, etc.) to each component of the tangent vectors to find a global vector field. A differential equation then can be read off the global vector field.\nThere are various methods of creating the basis functions for the least squares fit. The most common method is the Gram–Schmidt process. Which creates a set of orthogonal basis vectors, which can then easily be normalized. This method begins by first selecting any standard basis β={v1, v2,...,vn}. Next, set the first vector v1=u1. Then, we set u2=v2-proju1v2. This process is repeated to for k vectors, with the final vector being uk= vk-∑(j=1)(k-1)projukvk. This then creates a set of orthogonal standard basis vectors.\nThe reason for using a standard orthogonal basis rather than a standard basis arises from the creation of the least squares fitting done next. Creating a least-squares fit begins by assuming some function, in the case of the reconstruction an nth degree polynomial, and fitting the curve to the data using constants. The accuracy of the fit can be increased by increasing the degree of the polynomial being used to fit the data. If a set of non-orthogonal standard basis functions was used, it becomes necessary to recalculate the constant coefficients of the function describing the fit. However, by using the orthogonal set of basis functions, it is not necessary to recalculate the constant coefficients.\nVector field reconstruction has several applications, and many different approaches. Some mathematicians have not only used radial basis functions and polynomials to reconstruct a vector field, but they have used Lyapunov exponents and singular value decomposition.[2] Gouesbet and Letellier used a multivariate polynomial approximation and least squares to reconstruct their vector field. This method was applied to the Rössler system, and the Lorenz system, as well as thermal lens oscillations.\nThe Rossler system, Lorenz system and Thermal lens oscillation follows the differential equations in standard system as\nwhere F(X,Y,Z) is known as the standard function.[3]\nIn some situation the model is not very efficient and difficulties can arise if the model has a large number of coefficients and demonstrates a divergent solution. For example, nonautonomous differential equations give the previously described results.[4] In this case the modification of the standard approach in application gives a better way of further development of global vector reconstruction.\nUsually the system being modeled in this way is a chaotic dynamical system, because chaotic systems explore a large part of the phase space and the estimate of the global dynamics based on the local dynamics will be better than with a system exploring only a small part of the space.\nFrequently, one has only a single scalar time series measurement from a system known to have more than one degree of freedom. The time series may not even be from a system variable, but may be instead of a function of all the variables, such as temperature in a stirred tank reactor using several chemical species. In this case, one must use the technique of delay coordinate embedding,[5] where a state vector consisting of the data at time t and several delayed versions of the data is constructed.\nA comprehensive review of the topic is available from [6]", 
    "dbpedia_url": "http://dbpedia.org/resource/Vector_field_reconstruction", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Vector_field_reconstruction\n"
}