{
    "about": "The VEGAS algorithm, due to G. P. Lepage,[1] is a method for reducing error in Monte Carlo simulations by using a known or approximate probability distribution function to concentrate the search in those areas of the integrand that make the greatest contribution to the final integral.", 
    "name": "Vegas Algorithm", 
    "classification": "Statistical Algorithms", 
    "full_text": "The VEGAS algorithm, due to G. P. Lepage,[1] is a method for reducing error in Monte Carlo simulations by using a known or approximate probability distribution function to concentrate the search in those areas of the integrand that make the greatest contribution to the final integral.\nThe VEGAS algorithm is based on importance sampling. It samples points from the probability distribution described by the function \n\n\n\n\n|\n\nf\n\n|\n\n\n\n{\\displaystyle |f|}\n\n, so that the points are concentrated in the regions that make the largest contribution to the integral.\n\n\nIn general, if the Monte Carlo integral of \n\n\n\nf\n\n\n{\\displaystyle f}\n\n is sampled with points distributed according to a probability distribution described by the function \n\n\n\ng\n\n\n{\\displaystyle g}\n\n, we obtain an estimate \n\n\n\n\n\nE\n\n\ng\n\n\n(\nf\n;\nN\n)\n\n\n{\\displaystyle \\mathrm {E} _{g}(f;N)}\n\n,\nThe variance of the new estimate is then\nwhere \n\n\n\n\nV\na\nr\n\n(\nf\n;\nN\n)\n\n\n{\\displaystyle \\mathrm {Var} (f;N)}\n\n is the variance of the original estimate, \n\n\n\n\nV\na\nr\n\n(\nf\n;\nN\n)\n=\n\nE\n\n(\n\nf\n\n2\n\n\n;\nN\n)\n−\n(\n\nE\n\n(\nf\n;\nN\n)\n\n)\n\n2\n\n\n\n\n{\\displaystyle \\mathrm {Var} (f;N)=\\mathrm {E} (f^{2};N)-(\\mathrm {E} (f;N))^{2}}\n\n.\nIf the probability distribution is chosen as \n\n\n\ng\n=\n\n|\n\nf\n\n|\n\n\n/\n\nI\n(\n\n|\n\nf\n\n|\n\n)\n\n\n{\\displaystyle g=|f|/I(|f|)}\n\n then it can be shown that the variance \n\n\n\n\n\nV\na\nr\n\n\ng\n\n\n(\nf\n;\nN\n)\n\n\n{\\displaystyle \\mathrm {Var} _{g}(f;N)}\n\n vanishes, and the error in the estimate will be zero. In practice it is not possible to sample from the exact distribution g for an arbitrary function, so importance sampling algorithms aim to produce efficient approximations to the desired distribution.\nThe VEGAS algorithm approximates the exact distribution by making a number of passes over the integration region while histogramming the function f. Each histogram is used to define a sampling distribution for the next pass. Asymptotically this procedure converges to the desired distribution. In order to avoid the number of histogram bins growing like \n\n\n\n\nK\n\nd\n\n\n\n\n{\\displaystyle K^{d}}\n\n with dimension d the probability distribution is approximated by a separable function: \n\n\n\ng\n(\n\nx\n\n1\n\n\n,\n\nx\n\n2\n\n\n,\n…\n)\n=\n\ng\n\n1\n\n\n(\n\nx\n\n1\n\n\n)\n\ng\n\n2\n\n\n(\n\nx\n\n2\n\n\n)\n⋯\n\n\n{\\displaystyle g(x_{1},x_{2},\\ldots )=g_{1}(x_{1})g_{2}(x_{2})\\cdots }\n\n so that the number of bins required is only Kd. This is equivalent to locating the peaks of the function from the projections of the integrand onto the coordinate axes. The efficiency of VEGAS depends on the validity of this assumption. It is most efficient when the peaks of the integrand are well-localized. If an integrand can be rewritten in a form which is approximately separable this will increase the efficiency of integration with VEGAS.", 
    "dbpedia_url": "http://dbpedia.org/resource/VEGAS_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/VEGAS_algorithm\n"
}