{
    "about": "Vehicular Reactive Routing protocol (VRR)[1] is a reactive routing protocol with geographical features which is specifically designed for Wireless Access for the Vehicular Environment (WAVE) standard in Vehicular ad hoc Networks (VANETs). The protocol takes advantages of the multichannel scheme defined in WAVE and uses the Control Channel (CCH) for signalling, and relies on one of the multiple Service Channels (SCHs) for payload data dissemination.", 
    "name": "Vehicular Reactive Routing Protocol", 
    "classification": "Routing Algorithms", 
    "full_text": "Vehicular Reactive Routing protocol (VRR)[1] is a reactive routing protocol with geographical features which is specifically designed for Wireless Access for the Vehicular Environment (WAVE) standard in Vehicular ad hoc Networks (VANETs). The protocol takes advantages of the multichannel scheme defined in WAVE and uses the Control Channel (CCH) for signalling, and relies on one of the multiple Service Channels (SCHs) for payload data dissemination.\n\n\nThe Vehicular Reactive Routing (VRR) protocol is integrated with the WAVE stack and is embedded at the Logic Link Control layer. VRR is a multi-channel protocol which exercises efficient route discovery, route maintenance and data deliver processes with the use of the Control Channel (CCH) and a Service Channel (SCH). Standard WSA messages are transmitted over CCH and IPv6 packets are transmitted over SCH. To obtain a current neighbour location the WSA frame is modified to carry position information (incurs an additional 4 Bytes). Route request and route reply demands are transmitted inside WSA frames (additional 40 Bytes) over the Control Channel and data acknowledgment and all application data (IPv6 packets) are sent over the Service Channel. Due to these modifications, a route is firstly established over the CCH and afterwards data are transmitted over the SCH.\nThe VRR protocol uses 3 signalling message types. Messages, route request (RREQ) and route reply (RREP) are broadcast on the CCH and acknowledgment (ACK) packets are transmitted on the SCH. Data packets are IPv6 packets and are transmitted after route discovery or route maintenance on one of SCHs. RREQ and RREP are situated inside the WRA field of WSA frame and on each hop the WSA frame is discarded and a new WSA frame created. Both messages are transmitted in the lowest Traffic Class (background).\nThis algorithm is based on combination of three approaches\nPrinciple of VRR Broadcasting simply like that: A transmitter sends a broadcast data.\nAn advantage of VRR Broadcasting approach is that all receiving nodes have some opportunity to rebroadcast information (not only MPR nodes), but only a few nodes have the best opportunity (i.e. the shortest backoff time) for rebroadcasting. Another advantage is that in the case of the multipoint relay node not always receiving the broadcast due to collisions (in a dense busy network) then other nodes who overhear can transmit the information instead.\nThe RREQ frames are broadcast by the VRR Broadcasting algorithm. If a node doesn't have a route to destination then the node rebroadcasts depend on the algorithm. If a node has a route to destination, it creates broadcast frame RREP and set up backoff time depend on mobility behaviour (distance from a transmitter, speed and vector of motion). If a RREP is transmitted by a transmitter, all neighbour's nodes received also the RREP and they discards own RREQ or RREP effort except node which is on a way to a source node. Principle of VRR Route Discovery handshake (without MPRs) (animation)", 
    "dbpedia_url": "http://dbpedia.org/resource/Vehicular_Reactive_Routing_protocol", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Vehicular_Reactive_Routing_protocol\n"
}