{
    "about": "The Verhoeff algorithm[1] is a checksum formula for error detection developed by the Dutch mathematician Jacobus Verhoeff and was first published in 1969.[2][3] It was the first decimal check digit algorithm which detects all single-digit errors, and all transposition errors involving two adjacent digits,[4] which was at the time thought impossible with such a code.", 
    "name": "Verhoeff Algorithm", 
    "classification": "Checksum Algorithms", 
    "full_text": "The Verhoeff algorithm[1] is a checksum formula for error detection developed by the Dutch mathematician Jacobus Verhoeff and was first published in 1969.[2][3] It was the first decimal check digit algorithm which detects all single-digit errors, and all transposition errors involving two adjacent digits,[4] which was at the time thought impossible with such a code.\n\n\nVerhoeff had the goal of finding a decimal code—one where the check digit is a single decimal digit—which detected all single-digit errors and all transpositions of adjacent digits. At the time, supposed proofs of the nonexistence[5] of these codes made base-11 codes popular, for example in the ISBN check digit.\nHis goals were also practical, and he based the evaluation of different codes on live data from the Dutch postal system, using a weighted points system for different kinds of error. The analysis broke the errors down into a number of categories: first, by how many digits are in error; for those with two digits in error, there are transpositions (ab → ba), twins (aa → 'bb'), jump transpositions (abc → cba), phonetic (1a → a0), and jump twins (aba → cbc). Additionally there are omitted and added digits. Although the frequencies of some of these kinds of errors might be small, some codes might be immune to them in addition to the primary goals of detecting all singles and transpositions.\nThe phonetic errors in particular showed linguistic effects, because in Dutch, numbers are typically read in pairs; and also while 50 sounds similar to 15 in Dutch, 80 doesn't sound like 18.\nTaking six-digit numbers as an example, Verhoeff reported the following classification of the errors:.\nVerhoeff devised his algorithm using the properties of the dihedral group of order 10 (a non-commutative system of operations on ten elements, which corresponds to the rotation and reflection of a regular pentagon), combined with a permutation. He claimed that it was the first practical use of the dihedral group, and confirmed the principle that in the end, all beautiful mathematics will find a use,[6] even though in practice the algorithm will be implemented using simple lookup tables without needing to understand how to generate those tables from the underlying group and permutation theory.\nThis is more properly considered a family of algorithms, as there are other permutations possible, and discussed in Verhoeff's treatment. He notes that this particular permutation, \n\n\n\n\n\n(\n\n\n\n0\n\n\n1\n\n\n2\n\n\n3\n\n\n4\n\n\n5\n\n\n6\n\n\n7\n\n\n8\n\n\n9\n\n\n\n\n1\n\n\n5\n\n\n7\n\n\n6\n\n\n2\n\n\n8\n\n\n3\n\n\n0\n\n\n9\n\n\n4\n\n\n\n)\n\n\n=\n\n\n(\n\n\n\n1\n\n\n5\n\n\n8\n\n\n9\n\n\n4\n\n\n2\n\n\n7\n\n\n0\n\n\n\n)\n\n\n\n\n(\n\n\n\n3\n\n\n6\n\n\n\n)\n\n\n\n\n{\\displaystyle {\\begin{pmatrix}0&1&2&3&4&5&6&7&8&9\\\\1&5&7&6&2&8&3&0&9&4\\end{pmatrix}}={\\begin{pmatrix}1&5&8&9&4&2&7&0\\end{pmatrix}}{\\begin{pmatrix}3&6\\end{pmatrix}}}\n\n, is special as it has the property of detecting 95.3% of the phonetic errors.[7]\nThe strengths of the algorithm are that it detects all transliteration and transposition errors, and additionally most twin, twin jump, jump transposition and phonetic errors.\nThe main weakness of the Verhoeff algorithm is its complexity, and the calculations required cannot readily be performed by hand. A similar code is the Damm algorithm, which has similar qualities.\nThe Verhoeff algorithm can be implemented using three tables: a multiplication table d, an inverse table inv, and a permutation table p.\nThe first table, d, is based on multiplication in the dihedral group D5.[9] and is simply the Cayley table of the group. Note that this group is not commutative, that is, for some values of j and k, d(j,k) ≠ d(k, j).\nThe inverse table inv represents the multiplicative inverse of a digit, that is, the value that satisfies d(j, inv(j)) = 0.\nThe permutation table p applies a permutation to each digit based on its position in the number. This is actually a single permutation (1 5 8 9 4 2 7 0)(3 6) applied iteratively; i.e. p(i+j,n) = p(i, p(j,n)). (See [clarification needed]\nThe Verhoeff checksum calculation is performed as follows:\nThe original number is valid if and only if c = 0.\nTo generate a check digit, append a 0, perform the calculation: the correct check digit is inv(c).\nGenerate a check digit for 236:\nc is 2, so the check digit is inv(2), which is 3.\nValidate the check digit 2363:\nc is zero, so the check is correct.", 
    "dbpedia_url": "http://dbpedia.org/resource/Verhoeff_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Verhoeff_algorithm\n"
}