{
    "about": "The Vienna Ab-initio Simulation Package, better known as VASP, is a package for performing ab initio quantum mechanical molecular dynamics (MD) using either Vanderbilt pseudopotentials, or the projector augmented wave method, and a plane wave basis set.[1] The basic methodology is density functional theory (DFT), but the code also allows use of post-DFT corrections such as hybrid functionals mixing DFT and Hartree–Fock exchange, many-body perturbation theory (the GW method) and dynamical electronic correlations within the random phase approximation.", 
    "name": "Vienna Ab Initio Simulation Package", 
    "classification": "Computational Physics", 
    "full_text": "The Vienna Ab-initio Simulation Package, better known as VASP, is a package for performing ab initio quantum mechanical molecular dynamics (MD) using either Vanderbilt pseudopotentials, or the projector augmented wave method, and a plane wave basis set.[1] The basic methodology is density functional theory (DFT), but the code also allows use of post-DFT corrections such as hybrid functionals mixing DFT and Hartree–Fock exchange, many-body perturbation theory (the GW method) and dynamical electronic correlations within the random phase approximation.\nOriginally, VASP was based on code written by Mike Payne (then at MIT), which was also the basis of CASTEP.[2] It was then brought to the University of Vienna, Austria in July 1989 by Jürgen Hafner. The main program was written by Jürgen Furthmüller, who joined the group at the Institut für Materialphysik in January 1993, and Georg Kresse. VASP is currently being developed by Georg Kresse; recent additions include the extension of methods frequently used in molecular quantum chemistry (such as MP2 and CCSD(T)) to periodic system. VASP is currently used by more than 1400 research groups in academia and industry worldwide on the basis of software licence agreements with the University of Vienna.", 
    "dbpedia_url": "http://dbpedia.org/resource/Vienna_Ab_initio_Simulation_Package", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Vienna_Ab_initio_Simulation_Package\n"
}