{
    "about": "The Viterbi algorithm is a dynamic programming algorithm for finding the most likely sequence of hidden states – called the Viterbi path – that results in a sequence of observed events, especially in the context of Markov information sources and hidden Markov models.", 
    "name": "Viterbi Algorithm", 
    "classification": "Error Detection And Correction", 
    "full_text": "The Viterbi algorithm is a dynamic programming algorithm for finding the most likely sequence of hidden states – called the Viterbi path – that results in a sequence of observed events, especially in the context of Markov information sources and hidden Markov models.\nThe algorithm has found universal application in decoding the convolutional codes used in both CDMA and GSM digital cellular, dial-up modems, satellite, deep-space communications, and 802.11 wireless LANs. It is now also commonly used in speech recognition, speech synthesis, diarization,[1] keyword spotting, computational linguistics, and bioinformatics. For example, in speech-to-text (speech recognition), the acoustic signal is treated as the observed sequence of events, and a string of text is considered to be the \"hidden cause\" of the acoustic signal. The Viterbi algorithm finds the most likely string of text given the acoustic signal.\n\n\nThe Viterbi algorithm is named after Andrew Viterbi, who proposed it in 1967 as a decoding algorithm for convolutional codes over noisy digital communication links.[2] It has, however, a history of multiple invention, with at least seven independent discoveries, including those by Viterbi, Needleman and Wunsch, and Wagner and Fischer.[3]\n\"Viterbi path\" and \"Viterbi algorithm\" have become standard terms for the application of dynamic programming algorithms to maximization problems involving probabilities.[3] For example, in statistical parsing a dynamic programming algorithm can be used to discover the single most likely context-free derivation (parse) of a string, which is commonly called the \"Viterbi parse\".[4][5][6]\nA generalization of the Viterbi algorithm, termed the max-sum algorithm (or max-product algorithm) can be used to find the most likely assignment of all or some subset of latent variables in a large number of graphical models, e.g. Bayesian networks, Markov random fields and conditional random fields. The latent variables need in general to be connected in a way somewhat similar to an HMM, with a limited number of connections between variables and some type of linear structure among the variables. The general algorithm involves message passing and is substantially similar to the belief propagation algorithm (which is the generalization of the forward-backward algorithm).\nWith the algorithm called iterative Viterbi decoding one can find the subsequence of an observation that matches best (on average) to a given hidden Markov model. This algorithm is proposed by Qi Wang et al.[7] to deal with turbo code. Iterative Viterbi decoding works by iteratively invoking a modified Viterbi algorithm, reestimating the score for a filler until convergence.\nAn alternative algorithm, the Lazy Viterbi algorithm, has been proposed recently.[8] For many codes of practical interest, under reasonable noise conditions, the lazy decoder (using Lazy Viterbi algorithm) is much faster than the original Viterbi decoder (using Viterbi algorithm). This algorithm works by not expanding any nodes until it really needs to, and usually manages to get away with doing a lot less work (in software) than the ordinary Viterbi algorithm for the same result - however, it is not so easy to parallelize in hardware.\nThis algorithm generates a path \n\n\n\nX\n=\n{\n\nx\n\n1\n\n\n,\n\nx\n\n2\n\n\n,\n…\n,\n\nx\n\nT\n\n\n}\n\n\n{\\displaystyle X=\\{x_{1},x_{2},\\ldots ,x_{T}\\}}\n\n, which is a sequence of states \n\n\n\n\nx\n\nn\n\n\n∈\nS\n=\n{\n\ns\n\n1\n\n\n,\n\ns\n\n2\n\n\n,\n…\n,\n\ns\n\nK\n\n\n}\n\n\n{\\displaystyle x_{n}\\in S=\\{s_{1},s_{2},\\dots ,s_{K}\\}}\n\n that generate the observations \n\n\n\nY\n=\n{\n\ny\n\n1\n\n\n,\n\ny\n\n2\n\n\n,\n…\n,\n\ny\n\nT\n\n\n}\n\n\n{\\displaystyle Y=\\{y_{1},y_{2},\\ldots ,y_{T}\\}}\n\n.\nTwo 2-dimensional tables of size \n\n\n\nK\n⋅\nT\n\n\n{\\displaystyle K\\cdot T}\n\n are constructed:\nThe table entries \n\n\n\n\nT\n\n1\n\n\n[\ni\n,\nj\n]\n,\n\nT\n\n2\n\n\n[\ni\n,\nj\n]\n\n\n{\\displaystyle T_{1}[i,j],T_{2}[i,j]}\n\n are filled by increasing order of \n\n\n\nK\n⋅\nj\n+\ni\n\n\n{\\displaystyle K\\cdot j+i}\n\n.\nNote that \n\n\n\n\nB\n\ni\n\ny\n\nj\n\n\n\n\n\n\n{\\displaystyle B_{iy_{j}}}\n\n does not need to appear in the latter expression, as it's constant with i and j and does not affect the argmax.\nSuppose we are given a hidden Markov model (HMM) with state space \n\n\n\nS\n\n\n{\\displaystyle S}\n\n, initial probabilities \n\n\n\n\nπ\n\ni\n\n\n\n\n{\\displaystyle \\pi _{i}}\n\n of being in state \n\n\n\ni\n\n\n{\\displaystyle i}\n\n and transition probabilities \n\n\n\n\na\n\ni\n,\nj\n\n\n\n\n{\\displaystyle a_{i,j}}\n\n of transitioning from state \n\n\n\ni\n\n\n{\\displaystyle i}\n\n to state \n\n\n\nj\n\n\n{\\displaystyle j}\n\n. Say we observe outputs \n\n\n\n\ny\n\n1\n\n\n,\n…\n,\n\ny\n\nT\n\n\n\n\n{\\displaystyle y_{1},\\dots ,y_{T}}\n\n. The most likely state sequence \n\n\n\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nT\n\n\n\n\n{\\displaystyle x_{1},\\dots ,x_{T}}\n\n that produces the observations is given by the recurrence relations:[9]\nHere \n\n\n\n\nV\n\nt\n,\nk\n\n\n\n\n{\\displaystyle V_{t,k}}\n\n is the probability of the most probable state sequence \n\n\n\n\nP\n\n\n\n(\n\n\n\nx\n\n1\n\n\n,\n…\n,\n\nx\n\nT\n\n\n,\n\ny\n\n1\n\n\n,\n…\n,\n\ny\n\nT\n\n\n\n\n)\n\n\n\n\n{\\displaystyle \\mathrm {P} {\\big (}x_{1},\\dots ,x_{T},y_{1},\\dots ,y_{T}{\\big )}}\n\n responsible for the first \n\n\n\nt\n\n\n{\\displaystyle t}\n\n observations that have \n\n\n\nk\n\n\n{\\displaystyle k}\n\n as its final state. The Viterbi path can be retrieved by saving back pointers that remember which state \n\n\n\nx\n\n\n{\\displaystyle x}\n\n was used in the second equation. Let \n\n\n\n\nP\nt\nr\n\n(\nk\n,\nt\n)\n\n\n{\\displaystyle \\mathrm {Ptr} (k,t)}\n\n be the function that returns the value of \n\n\n\nx\n\n\n{\\displaystyle x}\n\n used to compute \n\n\n\n\nV\n\nt\n,\nk\n\n\n\n\n{\\displaystyle V_{t,k}}\n\n if \n\n\n\nt\n>\n1\n\n\n{\\displaystyle t>1}\n\n, or \n\n\n\nk\n\n\n{\\displaystyle k}\n\n if \n\n\n\nt\n=\n1\n\n\n{\\displaystyle t=1}\n\n. Then:\nHere we're using the standard definition of arg max.\nThe complexity of this algorithm is \n\n\n\nO\n(\nT\n×\n\n\n|\n\nS\n\n|\n\n\n2\n\n\n)\n\n\n{\\displaystyle O(T\\times \\left|{S}\\right|^{2})}\n\n.\nConsider a village where all villagers are either healthy or have a fever and only the village doctor can determine whether each has a fever. The doctor diagnoses fever by asking patients how they feel. The villagers may only answer that they feel normal, dizzy, or cold.\nThe doctor believes that the health condition of his patients operate as a discrete Markov chain. There are two states, \"Healthy\" and \"Fever\", but the doctor cannot observe them directly; they are hidden from him. On each day, there is a certain chance that the patient will tell the doctor he/she is \"normal\", \"cold\", or \"dizzy\", depending on her health condition.\nThe observations (normal, cold, dizzy) along with a hidden state (healthy, fever) form a hidden Markov model (HMM), and can be represented as follows in the Python programming language:\nIn this piece of code, start_probability represents the doctor's belief about which state the HMM is in when the patient first visits (all he knows is that the patient tends to be healthy). The particular probability distribution used here is not the equilibrium one, which is (given the transition probabilities) approximately {'Healthy': 0.57, 'Fever': 0.43}. The transition_probability represents the change of the health condition in the underlying Markov chain. In this example, there is only a 30% chance that tomorrow the patient will have a fever if he is healthy today. The emission_probability represents how likely the patient is to feel on each day. If he is healthy, there is a 50% chance that he feels normal; if he has a fever, there is a 60% chance that he feels dizzy.\nThe patient visits three days in a row and the doctor discovers that on the first day she feels normal, on the second day she feels cold, on the third day she feels dizzy. The doctor has a question: what is the most likely sequence of health conditions of the patient that would explain these observations? This is answered by the Viterbi algorithm.\nThe function viterbi takes the following arguments: obs is the sequence of observations, e.g. ['normal', 'cold', 'dizzy']; states is the set of hidden states; start_p is the start probability; trans_p are the transition probabilities; and emit_p are the emission probabilities. For simplicity of code, we assume that the observation sequence obs is non-empty and that trans_p[i][j] and emit_p[i][j] is defined for all states i,j.\nIn the running example, the forward/Viterbi algorithm is used as follows:\nThe output of the script is\nThis reveals that the observations ['normal', 'cold', 'dizzy'] were most likely generated by states ['Healthy', 'Healthy', 'Fever']. In other words, given the observed activities, the patient was most likely to have been healthy both on the first day when she felt normal as well as on the second day when she felt cold, and then she contracted a fever the third day.\nThe operation of Viterbi's algorithm can be visualized by means of a trellis diagram. The Viterbi path is essentially the shortest path through this trellis. The trellis for the clinic example is shown below; the corresponding Viterbi path is in bold:", 
    "dbpedia_url": "http://dbpedia.org/resource/Viterbi_algorithm", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Viterbi_algorithm\n"
}