{
    "about": "In numerical analysis, von Neumann stability analysis (also known as Fourier stability analysis) is a procedure used to check the stability of finite difference schemes as applied to linear partial differential equations.[1] The analysis is based on the Fourier decomposition of numerical error and was developed at Los Alamos National Laboratory after having been briefly described in a 1947 article by British researchers Crank and Nicolson.[2] This method is an example of explicit time integration where the function that defines governing equation is evaluated at the current time. Later, the method was given a more rigorous treatment in an article[3] co-authored by John von Neumann.", 
    "name": "Von Neumann Stability Analysis", 
    "classification": "Numerical Analysis", 
    "full_text": "In numerical analysis, von Neumann stability analysis (also known as Fourier stability analysis) is a procedure used to check the stability of finite difference schemes as applied to linear partial differential equations.[1] The analysis is based on the Fourier decomposition of numerical error and was developed at Los Alamos National Laboratory after having been briefly described in a 1947 article by British researchers Crank and Nicolson.[2] This method is an example of explicit time integration where the function that defines governing equation is evaluated at the current time. Later, the method was given a more rigorous treatment in an article[3] co-authored by John von Neumann.\nThe stability of numerical schemes is closely associated with numerical error. A finite difference scheme is stable if the errors made at one time step of the calculation do not cause the errors to be magnified as the computations are continued. A neutrally stable scheme is one in which errors remain constant as the computations are carried forward. If the errors decay and eventually damp out, the numerical scheme is said to be stable. If, on the contrary, the errors grow with time the numerical scheme is said to be unstable. The stability of numerical schemes can be investigated by performing von Neumann stability analysis. For time-dependent problems, stability guarantees that the numerical method produces a bounded solution whenever the solution of the exact differential equation is bounded. Stability, in general, can be difficult to investigate, especially when the equation under consideration is nonlinear.\nIn certain cases, von Neumann stability is necessary and sufficient for stability in the sense of Lax–Richtmyer (as used in the Lax equivalence theorem): The PDE and the finite difference scheme models are linear; the PDE is constant-coefficient with periodic boundary conditions and has only two independent variables; and the scheme uses no more than two time levels.[4] Von Neumann stability is necessary in a much wider variety of cases. It is often used in place of a more detailed stability analysis to provide a good guess at the restrictions (if any) on the step sizes used in the scheme because of its relative simplicity.\nThe von Neumann method is based on the decomposition of the errors into Fourier series. To illustrate the procedure, consider the one-dimensional heat equation\ndefined on the spatial interval \n\n\n\nL\n\n\n{\\displaystyle L}\n\n, which can be discretized[5] as\nwhere\nand the solution \n\n\n\n\nu\n\nj\n\n\nn\n\n\n\n\n{\\displaystyle u_{j}^{n}}\n\n of the discrete equation approximates the analytical solution \n\n\n\nu\n(\nx\n,\nt\n)\n\n\n{\\displaystyle u(x,t)}\n\n of the PDE on the grid.\nDefine the round-off error \n\n\n\n\nϵ\n\nj\n\n\nn\n\n\n\n\n{\\displaystyle \\epsilon _{j}^{n}}\n\n as\nwhere \n\n\n\n\nu\n\nj\n\n\nn\n\n\n\n\n{\\displaystyle u_{j}^{n}}\n\n is the solution of the discretized equation (1) that would be computed in the absence of round-off error, and \n\n\n\n\nN\n\nj\n\n\nn\n\n\n\n\n{\\displaystyle N_{j}^{n}}\n\n is the numerical solution obtained in finite precision arithmetic. Since the exact solution \n\n\n\n\nu\n\nj\n\n\nn\n\n\n\n\n{\\displaystyle u_{j}^{n}}\n\n must satisfy the discretized equation exactly, the error \n\n\n\n\nϵ\n\nj\n\n\nn\n\n\n\n\n{\\displaystyle \\epsilon _{j}^{n}}\n\n must also satisfy the discretized equation.[6] Here we assumed that \n\n\n\n\nN\n\nj\n\n\nn\n\n\n\n\n{\\displaystyle N_{j}^{n}}\n\n satisfies the equation, too (this is only true in machine precision). Thus\nis a recurrence relation for the error. Equations (1) and (2) show that both the error and the numerical solution have the same growth or decay behavior with respect to time. For linear differential equations with periodic boundary condition, the spatial variation of error may be expanded in a finite Fourier series, in the interval \n\n\n\nL\n\n\n{\\displaystyle L}\n\n, as\nwhere the wavenumber \n\n\n\n\nk\n\nm\n\n\n=\n\n\n\nπ\nm\n\nL\n\n\n\n\n{\\displaystyle k_{m}={\\frac {\\pi m}{L}}}\n\n with \n\n\n\nm\n=\n1\n,\n2\n,\n…\n,\nM\n\n\n{\\displaystyle m=1,2,\\ldots ,M}\n\n and \n\n\n\nM\n=\nL\n\n/\n\nΔ\nx\n\n\n{\\displaystyle M=L/\\Delta x}\n\n. The time dependence of the error is included by assuming that the amplitude of error \n\n\n\n\nA\n\nm\n\n\n\n\n{\\displaystyle A_{m}}\n\n is a function of time. Since the error tends to grow or decay exponentially with time, it is reasonable to assume that the amplitude varies exponentially with time; hence\nwhere \n\n\n\na\n\n\n{\\displaystyle a}\n\n is a constant.\nSince the difference equation for error is linear (the behavior of each term of the series is the same as series itself), it is enough to consider the growth of error of a typical term:\nThe stability characteristics can be studied using just this form for the error with no loss in generality. To find out how error varies in steps of time, substitute equation (5) into equation (2), after noting that\nto yield (after simplification)\nUsing the identities\nequation (6) may be written as\nDefine the amplification factor\nThe necessary and sufficient condition for the error to remain bounded is that \n\n\n\n|\nG\n|\n≤\n1.\n\n\n{\\displaystyle \\vert G\\vert \\leq 1.}\n\n However,\nThus, from equations (7) and (8), the condition for stability is given by\nNote that the term \n\n\n\n\n\n\n4\nα\nΔ\nt\n\n\nΔ\n\nx\n\n2\n\n\n\n\n\n\nsin\n\n2\n\n\n⁡\n(\n\nk\n\nm\n\n\nΔ\nx\n\n/\n\n2\n)\n\n\n{\\displaystyle {\\frac {4\\alpha \\Delta t}{\\Delta x^{2}}}\\sin ^{2}(k_{m}\\Delta x/2)}\n\n is always positive. Thus, to satisfy Equation (9):\nFor the above condition to hold at all \n\n\n\n\nsin\n\n2\n\n\n⁡\n(\n\nk\n\nm\n\n\nΔ\nx\n\n/\n\n2\n)\n\n\n{\\displaystyle \\sin ^{2}(k_{m}\\Delta x/2)}\n\n, we have\nEquation (11) gives the stability requirement for the FTCS scheme as applied to one-dimensional heat equation. It says that for a given \n\n\n\nΔ\nx\n\n\n{\\displaystyle \\Delta x}\n\n, the allowed value of \n\n\n\nΔ\nt\n\n\n{\\displaystyle \\Delta t}\n\n must be small enough to satisfy equation (10).", 
    "dbpedia_url": "http://dbpedia.org/resource/Von_Neumann_stability_analysis", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Von_Neumann_stability_analysis\n"
}