{
    "about": "In mathematics, a wavelet series is a representation of a square-integrable (real- or complex-valued) function by a certain orthonormal series generated by a wavelet. Nowadays, wavelet transformation is one of the most popular time-frequency-transformations. This article provides a formal, mathematical definition of an orthonormal wavelet and of the integral wavelet transform.", 
    "name": "Wavelet Transform", 
    "classification": "Signal Processing", 
    "full_text": "In mathematics, a wavelet series is a representation of a square-integrable (real- or complex-valued) function by a certain orthonormal series generated by a wavelet. Nowadays, wavelet transformation is one of the most popular time-frequency-transformations. This article provides a formal, mathematical definition of an orthonormal wavelet and of the integral wavelet transform.\n\n\nA function \n\n\n\n\nψ\n\n∈\n\n\nL\n\n2\n\n\n(\n\nR\n\n)\n\n\n\n{\\displaystyle \\scriptstyle \\psi \\,\\in \\,L^{2}(\\mathbb {R} )}\n\n is called an orthonormal wavelet if it can be used to define a Hilbert basis, that is a complete orthonormal system, for the Hilbert space \n\n\n\n\n\nL\n\n2\n\n\n\n(\n\nR\n\n)\n\n\n\n\n{\\displaystyle \\scriptstyle L^{2}\\left(\\mathbb {R} \\right)}\n\n of square integrable functions.\nThe Hilbert basis is constructed as the family of functions \n\n\n\n\n{\n\nψ\n\nj\nk\n\n\n:\n\nj\n,\n\nk\n\n∈\n\n\nZ\n\n}\n\n\n\n{\\displaystyle \\scriptstyle \\{\\psi _{jk}:\\,j,\\,k\\,\\in \\,\\mathbb {Z} \\}}\n\n by means of dyadic translations and dilations of \n\n\n\n\nψ\n\n\n\n\n{\\displaystyle \\scriptstyle \\psi \\,}\n\n,\nfor integers \n\n\n\n\nj\n,\n\nk\n\n∈\n\n\nZ\n\n\n\n\n{\\displaystyle \\scriptstyle j,\\,k\\,\\in \\,\\mathbb {Z} }\n\n.\nIf under the standard inner product on \n\n\n\n\n\nL\n\n2\n\n\n\n(\n\nR\n\n)\n\n\n\n\n{\\displaystyle \\scriptstyle L^{2}\\left(\\mathbb {R} \\right)}\n\n,\nthis family is orthonormal, it is an orthonormal system:\nwhere \n\n\n\n\n\nδ\n\nj\nl\n\n\n\n\n\n\n{\\displaystyle \\scriptstyle \\delta _{jl}\\,}\n\n is the Kronecker delta.\nCompleteness is satisfied if every function \n\n\n\n\nh\n\n∈\n\n\nL\n\n2\n\n\n\n(\n\nR\n\n)\n\n\n\n\n{\\displaystyle \\scriptstyle h\\,\\in \\,L^{2}\\left(\\mathbb {R} \\right)}\n\n may be expanded in the basis as\nwith convergence of the series understood to be convergence in norm. Such a representation of a function f is known as a wavelet series. This implies that an orthonormal wavelet is self-dual.\nThe integral wavelet transform is the integral transform defined as\nThe wavelet coefficients \n\n\n\n\n\nc\n\nj\nk\n\n\n\n\n\n{\\displaystyle \\scriptstyle c_{jk}}\n\n are then given by\nHere, \n\n\n\n\na\n\n=\n\n\n2\n\n−\nj\n\n\n\n\n\n{\\displaystyle \\scriptstyle a\\;=\\;2^{-j}}\n\n is called the binary dilation or dyadic dilation, and \n\n\n\n\nb\n\n=\n\nk\n\n2\n\n−\nj\n\n\n\n\n\n{\\displaystyle \\scriptstyle b\\;=\\;k2^{-j}}\n\n is the binary or dyadic position.\nThe fundamental idea of wavelet transforms is that the transformation should allow only changes in time extension, but not shape. This is effected by choosing suitable basis functions that allow for this.[how?] Changes in the time extension are expected to conform to the corresponding analysis frequency of the basis function. Based on the uncertainty principle of signal processing,\nwhere t represents time and ω angular frequency (ω = 2πf, where f is temporal frequency).\nThe higher the required resolution in time, the lower the resolution in frequency has to be. The larger the extension of the analysis windows is chosen, the larger is the value of \n\n\n\n\nΔ\nt\n\n\n\n{\\displaystyle \\scriptstyle \\Delta t}\n\n[how?].\nWhen Δt is large,\nWhen Δt is small\nIn other words, the basis function Ψ can be regarded as an impulse response of a system with which the function x(t) has been filtered. The transformed signal provides information about the time and the frequency. Therefore, wavelet-transformation contains information similar to the short-time-Fourier-transformation, but with additional special properties of the wavelets, which show up at the resolution in time at higher analysis frequencies of the basis function. The difference in time resolution at ascending frequencies for the Fourier transform and the wavelet transform is shown below.\nThis shows that wavelet transformation is good in time resolution of high frequencies, while for slowly varying functions, the frequency resolution is remarkable.\nAnother example: The analysis of three superposed sinusoidal signals \n\n\n\n\ny\n(\nt\n)\n\n=\n\nsin\n⁡\n(\n2\nπ\n\nf\n\n0\n\n\nt\n)\n\n+\n\nsin\n⁡\n(\n4\nπ\n\nf\n\n0\n\n\nt\n)\n\n+\n\nsin\n⁡\n(\n8\nπ\n\nf\n\n0\n\n\nt\n)\n\n\n\n{\\displaystyle \\scriptstyle y(t)\\;=\\;\\sin(2\\pi f_{0}t)\\;+\\;\\sin(4\\pi f_{0}t)\\;+\\;\\sin(8\\pi f_{0}t)}\n\n with STFT and wavelet-transformation.\nWavelet compression is a form of data compression well suited for image compression (sometimes also video compression and audio compression). Notable implementations are JPEG 2000, DjVu and ECW for still images, CineForm, and the BBC's Dirac. The goal is to store image data in as little space as possible in a file. Wavelet compression can be either lossless or lossy.[1]\nUsing a wavelet transform, the wavelet compression methods are adequate for representing transients, such as percussion sounds in audio, or high-frequency components in two-dimensional images, for example an image of stars on a night sky. This means that the transient elements of a data signal can be represented by a smaller amount of information than would be the case if some other transform, such as the more widespread discrete cosine transform, had been used.\nDiscrete wavelet transform has been successfully applied for the compression of electrocardiograph (ECG) signals[2] In this work, the high correlation between the corresponding wavelet coefficients of signals of successive cardiac cycles is utilized employing linear prediction.\nWavelet compression is not good for all kinds of data: transient signal characteristics mean good wavelet compression, while smooth, periodic signals are better compressed by other methods, particularly traditional harmonic compression (frequency domain, as by Fourier transforms and related).\nSee Diary Of An x264 Developer: The problems with wavelets (2010) for discussion of practical issues of current methods using wavelets for video compression.\nFirst a wavelet transform is applied. This produces as many coefficients as there are pixels in the image (i.e., there is no compression yet since it is only a transform). These coefficients can then be compressed more easily because the information is statistically concentrated in just a few coefficients. This principle is called transform coding. After that, the coefficients are quantized and the quantized values are entropy encoded and/or run length encoded.\nA few 1D and 2D applications of wavelet compression use a technique called \"wavelet footprints\".[3][4]\nWavelets have some slight benefits over Fourier transforms in reducing computations when examining specific frequencies. However, they are rarely more sensitive, and indeed, the common Morlet wavelet is mathematically identical to a short-time Fourier transform using a Gaussian window function.[5] The exception is when searching for signals of a known, non-sinusoidal shape (e.g., heartbeats); in that case, using matched wavelets can outperform standard STFT/Morlet analyses.[6]\nThe wavelet transform can provide us with the frequency of the signals and the time associated to those frequencies, making it very convenient for its application in numerous fields. For instance, signal processing of accelerations for gait analysis,[7] for fault detection,[8] for design of low power pacemakers and also in ultra-wideband (UWB) wireless communications.[9]\nApplied the following discretization of frequency and time:\nLeading to wavelets of the form, the discrete formula for the basis wavelet:\nSuch discrete wavelets can be used for the transformation:\nAs apparent from wavelet-transformation representation (shown below)\nwhere c is scaling factor, τ represents time shift factor\nand as already mentioned in this context, the wavelet-transformation corresponds to a convolution of a function y(t) and a wavelet-function. A convolution can be implemented as a multiplication in the frequency domain. With this the following approach of implementation results into:", 
    "dbpedia_url": "http://dbpedia.org/resource/Wavelet_transform", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Wavelet_transform\n"
}