{
    "about": "A wavelet is a wave-like oscillation with an amplitude that begins at zero, increases, and then decreases back to zero. It can typically be visualized as a \"brief oscillation\" like one recorded by a seismograph or heart monitor. Generally, wavelets are purposefully crafted to have specific properties that make them useful for signal processing. Wavelets can be combined, using a \"reverse, shift, multiply and integrate\" technique called convolution, with portions of a known signal to extract information from the unknown signal.", 
    "name": "Wavelet", 
    "classification": "Signal Processing", 
    "full_text": "A wavelet is a wave-like oscillation with an amplitude that begins at zero, increases, and then decreases back to zero. It can typically be visualized as a \"brief oscillation\" like one recorded by a seismograph or heart monitor. Generally, wavelets are purposefully crafted to have specific properties that make them useful for signal processing. Wavelets can be combined, using a \"reverse, shift, multiply and integrate\" technique called convolution, with portions of a known signal to extract information from the unknown signal.\nFor example, a wavelet could be created to have a frequency of Middle C and a short duration of roughly a 32nd note. If this wavelet was to be convolved with a signal created from the recording of a song, then the resulting signal would be useful for determining when the Middle C note was being played in the song. Mathematically, the wavelet will correlate with the signal if the unknown signal contains information of similar frequency. This concept of correlation is at the core of many practical applications of wavelet theory.\nAs a mathematical tool, wavelets can be used to extract information from many different kinds of data, including – but certainly not limited to – audio signals and images. Sets of wavelets are generally needed to analyze data fully. A set of \"complementary\" wavelets will decompose data without gaps or overlap so that the decomposition process is mathematically reversible. Thus, sets of complementary wavelets are useful in wavelet based compression/decompression algorithms where it is desirable to recover the original information with minimal loss.\nIn formal terms, this representation is a wavelet series representation of a square-integrable function with respect to either a complete, orthonormal set of basis functions, or an overcomplete set or frame of a vector space, for the Hilbert space of square integrable functions. This is accomplished through coherent states.\n\n\nThe word wavelet has been used for decades in digital signal processing and exploration geophysics.[1] The equivalent French word ondelette meaning \"small wave\" was used by Morlet and Grossmann in the early 1980s.\nWavelet theory is applicable to several subjects. All wavelet transforms may be considered forms of time-frequency representation for continuous-time (analog) signals and so are related to harmonic analysis. Almost all practically useful discrete wavelet transforms use discrete-time filterbanks. These filter banks are called the wavelet and scaling coefficients in wavelets nomenclature. These filterbanks may contain either finite impulse response (FIR) or infinite impulse response (IIR) filters. The wavelets forming a continuous wavelet transform (CWT) are subject to the uncertainty principle of Fourier analysis respective sampling theory: Given a signal with some event in it, one cannot assign simultaneously an exact time and frequency response scale to that event. The product of the uncertainties of time and frequency response scale has a lower bound. Thus, in the scaleogram of a continuous wavelet transform of this signal, such an event marks an entire region in the time-scale plane, instead of just one point. Also, discrete wavelet bases may be considered in the context of other forms of the uncertainty principle.\nWavelet transforms are broadly divided into three classes: continuous, discrete and multiresolution-based.\nIn continuous wavelet transforms, a given signal of finite energy is projected on a continuous family of frequency bands (or similar subspaces of the Lp function space L2(R) ). For instance the signal may be represented on every frequency band of the form [f, 2f] for all positive frequencies f > 0. Then, the original signal can be reconstructed by a suitable integration over all the resulting frequency components.\nThe frequency bands or subspaces (sub-bands) are scaled versions of a subspace at scale 1. This subspace in turn is in most situations generated by the shifts of one generating function ψ in L2(R), the mother wavelet. For the example of the scale one frequency band [1, 2] this function is\nwith the (normalized) sinc function. That, Meyer's, and two other examples of mother wavelets are:\nThe subspace of scale a or frequency band [1/a, 2/a] is generated by the functions (sometimes called child wavelets)\nwhere a is positive and defines the scale and b is any real number and defines the shift. The pair (a, b) defines a point in the right halfplane R+ × R.\nThe projection of a function x onto the subspace of scale a then has the form\nwith wavelet coefficients\nFor the analysis of the signal x, one can assemble the wavelet coefficients into a scaleogram of the signal.\nSee a list of some Continuous wavelets.\nIt is computationally impossible to analyze a signal using all wavelet coefficients, so one may wonder if it is sufficient to pick a discrete subset of the upper halfplane to be able to reconstruct a signal from the corresponding wavelet coefficients. One such system is the affine system for some real parameters a > 1, b > 0. The corresponding discrete subset of the halfplane consists of all the points (am, namb) with m, n in Z. The corresponding child wavelets are now given as\nA sufficient condition for the reconstruction of any signal x of finite energy by the formula\nis that the functions \n\n\n\n{\n\nψ\n\nm\n,\nn\n\n\n:\nm\n,\nn\n∈\n\nZ\n\n}\n\n\n{\\displaystyle \\{\\psi _{m,n}:m,n\\in \\mathbb {Z} \\}}\n\n form an orthonormal basis of L2(R).\nIn any discretised wavelet transform, there are only a finite number of wavelet coefficients for each bounded rectangular region in the upper halfplane. Still, each coefficient requires the evaluation of an integral. In special situations this numerical complexity can be avoided if the scaled and shifted wavelets form a multiresolution analysis. This means that there has to exist an auxiliary function, the father wavelet φ in L2(R), and that a is an integer. A typical choice is a = 2 and b = 1. The most famous pair of father and mother wavelets is the Daubechies 4-tap wavelet. Note that not every orthonormal discrete wavelet basis can be associated to a multiresolution analysis; for example, the Journe wavelet admits no multiresolution analysis.[2]\nFrom the mother and father wavelets one constructs the subspaces\nThe father wavelet \n\n\n\n\nV\n\ni\n\n\n\n\n{\\displaystyle V_{i}}\n\n keeps the time domain properties, while the mother wavelets \n\n\n\n\nW\n\ni\n\n\n\n\n{\\displaystyle W_{i}}\n\n keeps the frequency domain properties.\nFrom these it is required that the sequence\nforms a multiresolution analysis of L2 and that the subspaces \n\n\n\n…\n,\n\nW\n\n1\n\n\n,\n\nW\n\n0\n\n\n,\n\nW\n\n−\n1\n\n\n,\n…\n…\n\n\n{\\displaystyle \\dots ,W_{1},W_{0},W_{-1},\\dots \\dots }\n\n are the orthogonal \"differences\" of the above sequence, that is, Wm is the orthogonal complement of Vm inside the subspace Vm−1,\nIn analogy to the sampling theorem one may conclude that the space Vm with sampling distance 2m more or less covers the frequency baseband from 0 to 2−m-1. As orthogonal complement, Wm roughly covers the band [2−m−1, 2−m].\nFrom those inclusions and orthogonality relations, especially \n\n\n\n\nV\n\n0\n\n\n⊕\n\nW\n\n0\n\n\n=\n\nV\n\n−\n1\n\n\n\n\n{\\displaystyle V_{0}\\oplus W_{0}=V_{-1}}\n\n, follows the existence of sequences \n\n\n\nh\n=\n{\n\nh\n\nn\n\n\n\n}\n\nn\n∈\n\nZ\n\n\n\n\n\n{\\displaystyle h=\\{h_{n}\\}_{n\\in \\mathbb {Z} }}\n\n and \n\n\n\ng\n=\n{\n\ng\n\nn\n\n\n\n}\n\nn\n∈\n\nZ\n\n\n\n\n\n{\\displaystyle g=\\{g_{n}\\}_{n\\in \\mathbb {Z} }}\n\n that satisfy the identities\nThe second identity of the first pair is a refinement equation for the father wavelet φ. Both pairs of identities form the basis for the algorithm of the fast wavelet transform.\nFrom the multiresolution analysis derives the orthogonal decomposition of the space L2 as\nFor any signal or function \n\n\n\nS\n∈\n\nL\n\n2\n\n\n\n\n{\\displaystyle S\\in L^{2}}\n\n this gives a representation in basis functions of the corresponding subspaces as\nwhere the coefficients are\nFor practical applications, and for efficiency reasons, one prefers continuously differentiable functions with compact support as mother (prototype) wavelet (functions). However, to satisfy analytical requirements (in the continuous WT) and in general for theoretical reasons, one chooses the wavelet functions from a subspace of the space \n\n\n\n\nL\n\n1\n\n\n(\n\nR\n\n)\n∩\n\nL\n\n2\n\n\n(\n\nR\n\n)\n.\n\n\n{\\displaystyle L^{1}(\\mathbb {R} )\\cap L^{2}(\\mathbb {R} ).}\n\n This is the space of measurable functions that are absolutely and square integrable:\nBeing in this space ensures that one can formulate the conditions of zero mean and square norm one:\nFor ψ to be a wavelet for the continuous wavelet transform (see there for exact statement), the mother wavelet must satisfy an admissibility criterion (loosely speaking, a kind of half-differentiability) in order to get a stably invertible transform.\nFor the discrete wavelet transform, one needs at least the condition that the wavelet series is a representation of the identity in the space L2(R). Most constructions of discrete WT make use of the multiresolution analysis, which defines the wavelet by a scaling function. This scaling function itself is a solution to a functional equation.\nIn most situations it is useful to restrict ψ to be a continuous function with a higher number M of vanishing moments, i.e. for all integer m < M\nThe mother wavelet is scaled (or dilated) by a factor of a and translated (or shifted) by a factor of b to give (under Morlet's original formulation):\nFor the continuous WT, the pair (a,b) varies over the full half-plane R+ × R; for the discrete WT this pair varies over a discrete subset of it, which is also called affine group.\nThese functions are often incorrectly referred to as the basis functions of the (continuous) transform. In fact, as in the continuous Fourier transform, there is no basis in the continuous wavelet transform. Time-frequency interpretation uses a subtly different formulation (after Delprat).\nRestriction：\n(1) \n\n\n\n\n\n1\n\na\n\n\n\n\n∫\n\n−\n∞\n\n\n∞\n\n\n\nφ\n\na\n1\n,\nb\n1\n\n\n(\nt\n)\nφ\n\n(\n\n\n\nt\n−\nb\n\na\n\n\n)\n\n\nd\nt\n\n\n{\\displaystyle {\\frac {1}{\\sqrt {a}}}\\int _{-\\infty }^{\\infty }\\varphi _{a1,b1}(t)\\varphi \\left({\\frac {t-b}{a}}\\right)\\,dt}\n\n when a1 = a and b1 = b,\n(2) \n\n\n\nΨ\n(\nt\n)\n\n\n{\\displaystyle \\Psi (t)}\n\n has a finite time interval\nThe wavelet transform is often compared with the Fourier transform, in which signals are represented as a sum of sinusoids. In fact, the Fourier transform can be viewed as a special case of the continuous wavelet transform with the choice of the mother wavelet \n\n\n\nψ\n(\nt\n)\n=\n\ne\n\n−\n2\nπ\ni\nt\n\n\n\n\n{\\displaystyle \\psi (t)=e^{-2\\pi it}}\n\n. The main difference in general is that wavelets are localized in both time and frequency whereas the standard Fourier transform is only localized in frequency. The Short-time Fourier transform (STFT) is similar to the wavelet transform, in that it is also time and frequency localized, but there are issues with the frequency/time resolution trade-off.\nIn particular, assuming a rectangular window region, one may think of the STFT as a transform with a slightly different kernel\nwhere \n\n\n\ng\n(\nt\n−\nu\n)\n\n\n{\\displaystyle g(t-u)}\n\n can often be written as \n\n\n\n\n\n\nr\ne\nc\nt\n\n\n(\n\n\n\nt\n−\nu\n\n\nΔ\n\nt\n\n\n\n\n)\n\n\n\n\n\n{\\displaystyle {\\rm {{rect}\\left({\\frac {t-u}{\\Delta _{t}}}\\right)}}}\n\n, where \n\n\n\n\nΔ\n\nt\n\n\n\n\n{\\displaystyle \\Delta _{t}}\n\n and u respectively denote the length and temporal offset of the windowing function. Using Parseval’s theorem, one may define the wavelet’s energy as\nFrom this, the square of the temporal support of the window offset by time u is given by\nand the square of the spectral support of the window acting on a frequency \n\n\n\nξ\n\n\n{\\displaystyle \\xi }\n\n\nAs stated by the Heisenberg uncertainty principle, the product of the temporal and spectral supports \n\n\n\n\nσ\n\nt\n\n\n2\n\n\n\nσ\n\nω\n\n\n2\n\n\n≥\n1\n\n/\n\n4\n\n\n{\\displaystyle \\sigma _{t}^{2}\\sigma _{\\omega }^{2}\\geq 1/4}\n\n for any given time-frequency atom, or resolution cell. The STFT windows restrict the resolution cells to spectral and temporal supports determined by \n\n\n\n\nΔ\n\nt\n\n\n\n\n{\\displaystyle \\Delta _{t}}\n\n.\nMultiplication with a rectangular window in the time domain corresponds to convolution with a \n\n\n\n\n\ns\ni\nn\nc\n(\n\nΔ\n\nt\n\n\nω\n)\n\n\n\n\n{\\displaystyle {\\rm {sinc(\\Delta _{t}\\omega )}}}\n\n function in the frequency domain, resulting in spurious ringing artifacts for short/localized temporal windows. With the continuous-time Fourier Transform, \n\n\n\n\nΔ\n\nt\n\n\n→\n∞\n\n\n{\\displaystyle \\Delta _{t}\\rightarrow \\infty }\n\n and this convolution is with a delta function in Fourier space, resulting in the true Fourier transform of the signal \n\n\n\nx\n(\nt\n)\n\n\n{\\displaystyle x(t)}\n\n. The window function may be some other apodizing filter, such as a Gaussian. The choice of windowing function will affect the approximation error relative to the true Fourier transform.\nA given resolution cell’s time-bandwidth product may not be exceeded with the STFT. All STFT basis elements maintain a uniform spectral and temporal support for all temporal shifts or offsets, thereby attaining an equal resolution in time for lower and higher frequencies. The resolution is purely determined by the sampling width.\nIn contrast, the wavelet transform’s multiresolutional properties enables large temporal supports for lower frequencies while maintaining short temporal widths for higher frequencies by the scaling properties of the wavelet transform. This property extends conventional time-frequency analysis into time-scale analysis.[3]\nThe discrete wavelet transform is less computationally complex, taking O(N) time as compared to O(N log N) for the fast Fourier transform. This computational advantage is not inherent to the transform, but reflects the choice of a logarithmic division of frequency, in contrast to the equally spaced frequency divisions of the FFT (Fast Fourier Transform) which uses the same basis functions as DFT (Discrete Fourier Transform).[4] It is also important to note that this complexity only applies when the filter size has no relation to the signal size. A wavelet without compact support such as the Shannon wavelet would require O(N2). (For instance, a logarithmic Fourier Transform also exists with O(N) complexity, but the original signal must be sampled logarithmically in time, which is only useful for certain types of signals.[5])\nThere are a number of ways of defining a wavelet (or a wavelet family).\nAn orthogonal wavelet is entirely defined by the scaling filter – a low-pass finite impulse response (FIR) filter of length 2N and sum 1. In biorthogonal wavelets, separate decomposition and reconstruction filters are defined.\nFor analysis with orthogonal wavelets the high pass filter is calculated as the quadrature mirror filter of the low pass, and reconstruction filters are the time reverse of the decomposition filters.\nDaubechies and Symlet wavelets can be defined by the scaling filter.\nWavelets are defined by the wavelet function ψ(t) (i.e. the mother wavelet) and scaling function φ(t) (also called father wavelet) in the time domain.\nThe wavelet function is in effect a band-pass filter and scaling it for each level halves its bandwidth. This creates the problem that in order to cover the entire spectrum, an infinite number of levels would be required. The scaling function filters the lowest level of the transform and ensures all the spectrum is covered. See [1] for a detailed explanation.\nFor a wavelet with compact support, φ(t) can be considered finite in length and is equivalent to the scaling filter g.\nMeyer wavelets can be defined by scaling functions\nThe wavelet only has a time domain representation as the wavelet function ψ(t).\nFor instance, Mexican hat wavelets can be defined by a wavelet function. See a list of a few Continuous wavelets.\nThe development of wavelets can be linked to several separate trains of thought, starting with Haar's work in the early 20th century. Later work by Dennis Gabor yielded Gabor atoms (1946), which are constructed similarly to wavelets, and applied to similar purposes. Notable contributions to wavelet theory can be attributed to Zweig’s discovery of the continuous wavelet transform in 1975 (originally called the cochlear transform and discovered while studying the reaction of the ear to sound),[6] Pierre Goupillaud, Grossmann and Morlet's formulation of what is now known as the CWT (1982), Jan-Olov Strömberg's early work on discrete wavelets (1983), Daubechies' orthogonal wavelets with compact support (1988), Mallat's multiresolution framework (1989), Akansu's Binomial QMF (1990), Nathalie Delprat's time-frequency interpretation of the CWT (1991), Newland's harmonic wavelet transform (1993) and many others since.\nA wavelet is a mathematical function used to divide a given function or continuous-time signal into different scale components. Usually one can assign a frequency range to each scale component. Each scale component can then be studied with a resolution that matches its scale. A wavelet transform is the representation of a function by wavelets. The wavelets are scaled and translated copies (known as \"daughter wavelets\") of a finite-length or fast-decaying oscillating waveform (known as the \"mother wavelet\"). Wavelet transforms have advantages over traditional Fourier transforms for representing functions that have discontinuities and sharp peaks, and for accurately deconstructing and reconstructing finite, non-periodic and/or non-stationary signals.\nWavelet transforms are classified into discrete wavelet transforms (DWTs) and continuous wavelet transforms (CWTs). Note that both DWT and CWT are continuous-time (analog) transforms. They can be used to represent continuous-time (analog) signals. CWTs operate over every possible scale and translation whereas DWTs use a specific subset of scale and translation values or representation grid.\nThere are a large number of wavelet transforms each suitable for different applications. For a full list see list of wavelet-related transforms but the common ones are listed below:\nThere are a number of generalized transforms of which the wavelet transform is a special case. For example, Joseph Segman introduced scale into the Heisenberg group, giving rise to a continuous transform space that is a function of time, scale, and frequency. The CWT is a two-dimensional slice through the resulting 3d time-scale-frequency volume.\nAnother example of a generalized transform is the chirplet transform in which the CWT is also a two dimensional slice through the chirplet transform.\nAn important application area for generalized transforms involves systems in which high frequency resolution is crucial. For example, darkfield electron optical transforms intermediate between direct and reciprocal space have been widely used in the harmonic analysis of atom clustering, i.e. in the study of crystals and crystal defects.[7] Now that transmission electron microscopes are capable of providing digital images with picometer-scale information on atomic periodicity in nanostructure of all sorts, the range of pattern recognition[8] and strain[9]/metrology[10] applications for intermediate transforms with high frequency resolution (like brushlets[11] and ridgelets[12]) is growing rapidly.\nFractional wavelet transform (FRWT) is a generalization of the classical wavelet transform in the fractional Fourier transform domains. This transform is capable of providing the time- and fractional-domain information simultaneously and representing signals in the time-fractional-frequency plane.[13]\nGenerally, an approximation to DWT is used for data compression if a signal is already sampled, and the CWT for signal analysis.[14] Thus, DWT approximation is commonly used in engineering and computer science, and the CWT in scientific research.\nLike some other transforms, wavelet transforms can be used to transform data, then encode the transformed data, resulting in effective compression. For example, JPEG 2000 is an image compression standard that uses biorthogonal wavelets. This means that although the frame is overcomplete, it is a tight frame (see types of frames of a vector space), and the same frame functions (except for conjugation in the case of complex wavelets) are used for both analysis and synthesis, i.e., in both the forward and inverse transform. For details see wavelet compression.\nA related use is for smoothing/denoising data based on wavelet coefficient thresholding, also called wavelet shrinkage. By adaptively thresholding the wavelet coefficients that correspond to undesired frequency components smoothing and/or denoising operations can be performed.\nWavelet transforms are also starting to be used for communication applications. Wavelet OFDM is the basic modulation scheme used in HD-PLC (a power line communications technology developed by Panasonic), and in one of the optional modes included in the IEEE 1901 standard. Wavelet OFDM can achieve deeper notches than traditional FFT OFDM, and wavelet OFDM does not require a guard interval (which usually represents significant overhead in FFT OFDM systems).[15]\nOften, signals can be represented well as a sum of sinusoids. However, consider a non-continuous signal with an abrupt discontinuity; this signal can still be represented as a sum of sinusoids, but requires an infinite number, which is an observation known as Gibbs phenomenon. This, then, requires an infinite number of Fourier coefficients, which is not practical for many applications, such as compression. Wavelets are more useful for describing these signals with discontinuities because of their time-localized behavior (both Fourier and wavelet transforms are frequency-localized, but wavelets have an additional time-localization property). Because of this, many types of signals in practice may be non-sparse in the Fourier domain, but very sparse in the wavelet domain. This is particularly useful in signal reconstruction, especially in the recently popular field of compressed sensing. (Note that the short-time Fourier transform (STFT) is also localized in time and frequency, but there are often problems with the frequency-time resolution trade-off. Wavelets are better signal representations because of multiresolution analysis.)\nThis motivates why wavelet transforms are now being adopted for a vast number of applications, often replacing the conventional Fourier transform. Many areas of physics have seen this paradigm shift, including molecular dynamics, ab initio calculations, astrophysics, density-matrix localisation, seismology, optics, turbulence and quantum mechanics. This change has also occurred in image processing, EEG, EMG,[16] ECG analyses, brain rhythms, DNA analysis, protein analysis, climatology, human sexual response analysis,[17] general signal processing, speech recognition, acoustics, vibration signals,[18] computer graphics, multifractal analysis, and sparse coding. In computer vision and image processing, the notion of scale space representation and Gaussian derivative operators is regarded as a canonical multi-scale representation.\nSuppose we measure a noisy signal \n\n\n\nx\n=\ns\n+\nv\n\n\n{\\displaystyle x=s+v}\n\n. Assume s has a sparse representation in a certain wavelet bases, and \n\n\n\nv\n \n∼\n \n\n\nN\n\n\n(\n0\n,\n\n\nσ\n\n2\n\n\nI\n)\n\n\n{\\displaystyle v\\ \\sim \\ {\\mathcal {N}}(0,\\,\\sigma ^{2}I)}\n\n\nSo \n\n\n\ny\n=\n\nW\n\nT\n\n\nx\n=\n\nW\n\nT\n\n\ns\n+\n\nW\n\nT\n\n\nv\n=\np\n+\nz\n\n\n{\\displaystyle y=W^{T}x=W^{T}s+W^{T}v=p+z}\n\n.\nMost elements in p are 0 or close to 0, and \n\n\n\nz\n \n∼\n \n \n\n\nN\n\n\n(\n0\n,\n\n\nσ\n\n2\n\n\nI\n)\n\n\n{\\displaystyle z\\ \\sim \\ \\ {\\mathcal {N}}(0,\\,\\sigma ^{2}I)}\n\n\nSince W is orthogonal, the estimation problem amounts to recovery of a signal in iid Gaussian noise. As p is sparse, one method is to apply a Gaussian mixture model for p.\nAssume a prior \n\n\n\np\n \n∼\n \na\n\n\nN\n\n\n(\n0\n,\n\n\nσ\n\n1\n\n\n2\n\n\n)\n+\n(\n1\n−\na\n)\n\n\nN\n\n\n(\n0\n,\n\n\nσ\n\n2\n\n\n2\n\n\n)\n\n\n{\\displaystyle p\\ \\sim \\ a{\\mathcal {N}}(0,\\,\\sigma _{1}^{2})+(1-a){\\mathcal {N}}(0,\\,\\sigma _{2}^{2})}\n\n, \n\n\n\n\nσ\n\n1\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{1}^{2}}\n\n is the variance of \"significant\" coefficients, and \n\n\n\n\nσ\n\n2\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{2}^{2}}\n\n is the variance of \"insignificant\" coefficients.\nThen \n\n\n\n\n\n\np\n~\n\n\n\n=\nE\n(\np\n\n/\n\ny\n)\n=\nτ\n(\ny\n)\ny\n\n\n{\\displaystyle {\\tilde {p}}=E(p/y)=\\tau (y)y}\n\n, \n\n\n\nτ\n(\ny\n)\n\n\n{\\displaystyle \\tau (y)}\n\n is called the shrinkage factor, which depends on the prior variances \n\n\n\n\nσ\n\n1\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{1}^{2}}\n\n and \n\n\n\n\nσ\n\n2\n\n\n2\n\n\n\n\n{\\displaystyle \\sigma _{2}^{2}}\n\n. The effect of the shrinkage factor is that small coefficients are set early to 0, and large coefficients are unaltered.\nSmall coefficients are mostly noises, and large coefficients contain actual signal.\nAt last, apply the inverse wavelet transform to obtain \n\n\n\n\n\n\ns\n~\n\n\n\n=\nW\n\n\n\np\n~\n\n\n\n\n\n{\\displaystyle {\\tilde {s}}=W{\\tilde {p}}}\n\n", 
    "dbpedia_url": "http://dbpedia.org/resource/Wavelet", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Wavelet\n"
}