{
    "about": "The Whittaker–Shannon interpolation formula or sinc interpolation is a method to construct a continuous-time bandlimited function from a sequence of real numbers. The formula dates back to the works of E. Borel in 1898, and E. T. Whittaker in 1915, and was cited from works of J. M. Whittaker in 1935, and in the formulation of the Nyquist–Shannon sampling theorem by Claude Shannon in 1949. It is also commonly called Shannon's interpolation formula and Whittaker's interpolation formula. E. T. Whittaker, who published it in 1915, called it the Cardinal series.", 
    "name": "Whittaker–Shannon Interpolation Formula", 
    "classification": "Digital Signal Processing", 
    "full_text": "The Whittaker–Shannon interpolation formula or sinc interpolation is a method to construct a continuous-time bandlimited function from a sequence of real numbers. The formula dates back to the works of E. Borel in 1898, and E. T. Whittaker in 1915, and was cited from works of J. M. Whittaker in 1935, and in the formulation of the Nyquist–Shannon sampling theorem by Claude Shannon in 1949. It is also commonly called Shannon's interpolation formula and Whittaker's interpolation formula. E. T. Whittaker, who published it in 1915, called it the Cardinal series.\n\n\nGiven a sequence of real numbers, x[n], the continuous function\n(where \"sinc\" denotes the normalized sinc function) has a Fourier transform, X(f), whose non-zero values are confined to the region |f| ≤ 1/(2T).  When parameter T has units of seconds, the bandlimit, 1/(2T), has units of cycles/sec (hertz). When the x[n] sequence represents time samples, at interval T, of a continuous function, the quantity fs = 1/T is known as the sample rate, and fs/2 is the corresponding Nyquist frequency. When the sampled function has a bandlimit, B, less than the Nyquist frequency, x(t) is a perfect reconstruction of the original function. (See Sampling theorem.) Otherwise, the frequency components above the Nyquist frequency \"fold\" into the sub-Nyquist region of X(f), resulting in distortion. (See Aliasing.)\nThe interpolation formula is derived in the Nyquist–Shannon sampling theorem article, which points out that it can also be expressed as the convolution of an infinite impulse train with a sinc function:\nThis is equivalent to filtering the impulse train with an ideal (brick-wall) low-pass filter.\nThe interpolation formula always converges absolutely and locally uniformly as long as\nBy the Hölder inequality this is satisfied if the sequence \n\n\n\n\n(\nx\n[\nn\n]\n\n)\n\nn\n∈\n\nZ\n\n\n\n\n\n\n{\\displaystyle \\scriptstyle (x[n])_{n\\in \\mathbb {Z} }}\n\n belongs to any of the \n\n\n\n\n\nℓ\n\np\n\n\n(\n\nZ\n\n,\n\nC\n\n)\n\n\n\n{\\displaystyle \\scriptstyle \\ell ^{p}(\\mathbb {Z} ,\\mathbb {C} )}\n\n spaces with 1 ≤ p < ∞, that is\nThis condition is sufficient, but not necessary. For example, the sum will generally converge if the sample sequence comes from sampling almost any stationary process, in which case the sample sequence is not square summable, and is not in any \n\n\n\n\n\nℓ\n\np\n\n\n(\n\nZ\n\n,\n\nC\n\n)\n\n\n\n{\\displaystyle \\scriptstyle \\ell ^{p}(\\mathbb {Z} ,\\mathbb {C} )}\n\n space.\nIf x[n] is an infinite sequence of samples of a sample function of a wide-sense stationary process, then it is not a member of any \n\n\n\n\n\nℓ\n\np\n\n\n\n\n\n{\\displaystyle \\scriptstyle \\ell ^{p}}\n\n or Lp space, with probability 1; that is, the infinite sum of samples raised to a power p does not have a finite expected value. Nevertheless, the interpolation formula converges with probability 1. Convergence can readily be shown by computing the variances of truncated terms of the summation, and showing that the variance can be made arbitrarily small by choosing a sufficient number of terms. If the process mean is nonzero, then pairs of terms need to be considered to also show that the expected value of the truncated terms converges to zero.\nSince a random process does not have a Fourier transform, the condition under which the sum converges to the original function must also be different. A stationary random process does have an autocorrelation function and hence a spectral density according to the Wiener–Khinchin theorem. A suitable condition for convergence to a sample function from the process is that the spectral density of the process be zero at all frequencies equal to and above half the sample rate.", 
    "dbpedia_url": "http://dbpedia.org/resource/Whittaker–Shannon_interpolation_formula", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Whittaker–Shannon_interpolation_formula\n"
}