{
    "about": "The Whittle likelihood is an approximation to the likelihood function of a stationary Gaussian time series. It is named after the mathematician and statistician Peter Whittle, who introduced it in his PhD thesis in 1951.[1] It is commonly utilized in time series analysis and signal processing for parameter estimation and signal detection.", 
    "name": "Whittle Likelihood", 
    "classification": "Signal Processing", 
    "full_text": "The Whittle likelihood is an approximation to the likelihood function of a stationary Gaussian time series. It is named after the mathematician and statistician Peter Whittle, who introduced it in his PhD thesis in 1951.[1] It is commonly utilized in time series analysis and signal processing for parameter estimation and signal detection.\n\n\nIn a stationary Gaussian time series model, the likelihood function is (as usual in Gaussian models) determined by the associated mean and covariance parameters. With a large number (\n\n\n\nN\n\n\n{\\displaystyle N}\n\n) of observations, the (\n\n\n\nN\n×\nN\n\n\n{\\displaystyle N\\times N}\n\n) covariance matrix may become very large, making computations very costly in practice. However, due to stationarity, the covariance matrix has a rather simple structure, and by using an approximation, computations may be simplified considerably (from \n\n\n\nO\n(\n\nN\n\n2\n\n\n)\n\n\n{\\displaystyle O(N^{2})}\n\n to \n\n\n\nO\n(\nN\nlog\n⁡\n(\nN\n)\n)\n\n\n{\\displaystyle O(N\\log(N))}\n\n).[2] The idea effectively boils down to assuming a heteroscedastic zero-mean Gaussian model in Fourier domain; the model formulation is based on the time series' discrete Fourier transform and its power spectral density.[3] [4] [5]\nLet \n\n\n\n\nX\n\n1\n\n\n,\n…\n,\n\nX\n\nN\n\n\n\n\n{\\displaystyle X_{1},\\ldots ,X_{N}}\n\n be a stationary Gaussian time series with (one-sided) power spectral density \n\n\n\n\nS\n\n1\n\n\n(\nf\n)\n\n\n{\\displaystyle S_{1}(f)}\n\n, where \n\n\n\nN\n\n\n{\\displaystyle N}\n\n is even and samples are taken at constant sampling intervals \n\n\n\n\nΔ\n\nt\n\n\n\n\n{\\displaystyle \\Delta _{t}}\n\n. Let \n\n\n\n\n\n\n\nX\n~\n\n\n\n\n1\n\n\n,\n…\n,\n\n\n\n\nX\n~\n\n\n\n\nN\n\n/\n\n2\n+\n1\n\n\n\n\n{\\displaystyle {\\tilde {X}}_{1},\\ldots ,{\\tilde {X}}_{N/2+1}}\n\n be the (complex-valued) discrete Fourier transform (DFT) of the time series. Then for the Whittle likelihood one effectively assumes independent zero-mean Gaussian distributions for all \n\n\n\n\n\n\n\nX\n~\n\n\n\n\nj\n\n\n\n\n{\\displaystyle {\\tilde {X}}_{j}}\n\n with variances for the real and imaginary parts given by\nwhere \n\n\n\n\nf\n\nj\n\n\n=\n\n\nj\n\nN\n\nΔ\n\nt\n\n\n\n\n\n\n\n{\\displaystyle f_{j}={\\frac {j}{N\\Delta _{t}}}}\n\n is the \n\n\n\nj\n\n\n{\\displaystyle j}\n\nth Fourier frequency. This approximate model immediately leads to the (logarithmic) likelihood function\nwhere \n\n\n\n\n|\n\n⋅\n\n|\n\n\n\n{\\displaystyle |\\cdot |}\n\n denotes the absolute value with \n\n\n\n\n|\n\n\n\n\n\nx\n~\n\n\n\n\nj\n\n\n\n\n|\n\n\n2\n\n\n=\n\n\n(\n\n\n\nR\ne\n\n(\n\n\n\n\nx\n~\n\n\n\n\nj\n\n\n)\n\n\n\n)\n\n\n\n2\n\n\n+\n\n\n(\n\n\n\nI\nm\n\n(\n\n\n\n\nx\n~\n\n\n\n\nj\n\n\n)\n\n\n\n)\n\n\n\n2\n\n\n\n\n{\\displaystyle |{\\tilde {x}}_{j}|^{2}={\\bigl (}\\mathrm {Re} ({\\tilde {x}}_{j}){\\bigr )}^{2}+{\\bigl (}\\mathrm {Im} ({\\tilde {x}}_{j}){\\bigr )}^{2}}\n\n.[3] [4] [6]\nIn case the noise spectrum is assumed a-priori known, and noise properties are not to be inferred from the data, the likelihood function may be simplified further by ignoring constant terms, leading to the sum-of-squares expression\nThis expression also is the basis for the common matched filter.\nThe Whittle likelihood in general is only an approximation, it is only exact if the spectrum is constant, i.e., in the trivial case of white noise. The efficiency of the Whittle approximation always depends on the particular circumstances.[7] [8]\nNote that due to linearity of the Fourier transform, Gaussianity in Fourier domain implies Gaussianity in time domain and vice versa. What makes the Whittle likelihood only approximately accurate is related to the sampling theorem — the effect of Fourier-transforming only a finite number of data points, which also manifests itself as spectral leakage in related problems (and which may be ameliorated using the same methods, namely, windowing). In the present case, the implicit periodicity assumption implies correlation between the first and last samples (\n\n\n\n\nx\n\n1\n\n\n\n\n{\\displaystyle x_{1}}\n\n and \n\n\n\n\nx\n\nN\n\n\n\n\n{\\displaystyle x_{N}}\n\n), which are effectively treated as \"neighbouring\" samples (like \n\n\n\n\nx\n\n1\n\n\n\n\n{\\displaystyle x_{1}}\n\n and \n\n\n\n\nx\n\n2\n\n\n\n\n{\\displaystyle x_{2}}\n\n).\nWhittle's likelihood is commonly used to estimate signal parameters for signals that are buried in non-white noise. The noise spectrum then may be assumed known,[9] or it may be inferred along with the signal parameters.[4] [6]\nSignal detection is commonly performed utilizing the matched filter, which is based on the Whittle likelihood for the case of a known noise power spectral density.[10] [11] The matched filter effectively does a maximum-likelihood fit of the signal to the noisy data and uses the resulting likelihood ratio as the detection statistic.[12]\nThe matched filter may be generalized to an analogous procedure based on a Student-t distribution by also considering uncertainty (e.g. estimation uncertainty) in the noise spectrum. On the technical side, this entails repeated or iterative matched-filtering.[12]\nThe Whittle likelihood is also applicable for estimation of the noise spectrum, either alone or in conjunction with signal parameters. [13] [14]", 
    "dbpedia_url": "http://dbpedia.org/resource/Whittle_likelihood", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Whittle_likelihood\n"
}