{
    "about": "In applied mathematics, the Wiener–Khinchin theorem, also known as the Wiener–Khintchine theorem and sometimes as the Wiener–Khinchin–Einstein theorem or the Khinchin–Kolmogorov theorem, states that the autocorrelation function of a wide-sense-stationary random process has a spectral decomposition given by the power spectrum of that process.[1][2][3][4][5][6][7]", 
    "name": "Wiener–Khinchin Theorem", 
    "classification": "Signal Processing", 
    "full_text": "In applied mathematics, the Wiener–Khinchin theorem, also known as the Wiener–Khintchine theorem and sometimes as the Wiener–Khinchin–Einstein theorem or the Khinchin–Kolmogorov theorem, states that the autocorrelation function of a wide-sense-stationary random process has a spectral decomposition given by the power spectrum of that process.[1][2][3][4][5][6][7]\n\n\nNorbert Wiener proved this theorem for the case of a deterministic function in 1930;[8] Aleksandr Khinchin later formulated an analogous result for stationary stochastic processes and published that probabilistic analogue in 1934.[9][10] Albert Einstein explained, without proofs, the idea in a brief two-page memo in 1914.[11]\nFor continuous time, the Wiener–Khinchin theorem says that if \n\n\n\nx\n\n\n{\\displaystyle x}\n\n is a wide-sense stationary process such that its autocorrelation function (sometimes called autocovariance) defined in terms of statistical expected value E, \n\n\n\n\nr\n\nx\nx\n\n\n(\nτ\n)\n=\nE\n⁡\n\n\n[\n\n\n\nx\n(\nt\n)\n\nx\n\n∗\n\n\n(\nt\n−\nτ\n)\n\n\n\n]\n\n\n \n\n\n{\\displaystyle r_{xx}(\\tau )=\\operatorname {E} {\\big [}\\,x(t)x^{*}(t-\\tau )\\,{\\big ]}\\ }\n\n exists and is finite at every lag \n\n\n\nτ\n\n\n{\\displaystyle \\tau }\n\n, then there exists a monotone function \n\n\n\nF\n(\nf\n)\n\n\n{\\displaystyle F(f)}\n\n in the frequency domain \n\n\n\n−\n∞\n<\nf\n<\n∞\n\n\n{\\displaystyle -\\infty <f<\\infty }\n\n such that\nwhere the integral is a Riemann–Stieltjes integral.[1][12] This is a kind of spectral decomposition of the auto-correlation function. F is called the power spectral distribution function, and is a statistical distribution function. It is sometimes called the integrated spectrum.\n(The asterisk denotes complex conjugate, and of course it can be omitted if the random process is real-valued.)\nNote that the Fourier transform of \n\n\n\nx\n(\nt\n)\n\n\n\n{\\displaystyle x(t)\\,}\n\n does not exist in general, because stationary random functions are not generally either square integrable or absolutely integrable. Nor is \n\n\n\n\nr\n\nx\nx\n\n\n\n\n{\\displaystyle r_{xx}}\n\n assumed to be absolutely integrable, so it need not have a Fourier transform, either.\nBut if \n\n\n\nF\n(\nf\n)\n\n\n{\\displaystyle F(f)}\n\n is absolutely continuous, for example if the process is purely indeterministic, then \n\n\n\nF\n\n\n{\\displaystyle F}\n\n is differentiable almost everywhere. In this case, one can define \n\n\n\nS\n(\nf\n)\n\n\n{\\displaystyle S(f)}\n\n, the power spectral density of \n\n\n\nx\n(\nt\n)\n\n\n\n{\\displaystyle x(t)\\,}\n\n, by taking the averaged derivative of \n\n\n\nF\n\n\n{\\displaystyle F}\n\n. Because the left and right derivatives of \n\n\n\nF\n\n\n{\\displaystyle F}\n\n exist everywhere, we can put \n\n\n\nS\n(\nf\n)\n=\n\n\n1\n2\n\n\n(\n\nlim\n\nϵ\n↓\n0\n\n\n\n\n1\nϵ\n\n\n(\nF\n(\nf\n+\nϵ\n)\n−\nF\n(\nf\n)\n)\n+\n\nlim\n\nϵ\n↑\n0\n\n\n\n\n1\nϵ\n\n\n(\nF\n(\nf\n+\nϵ\n)\n−\nF\n(\nf\n)\n)\n)\n\n\n{\\displaystyle S(f)={\\frac {1}{2}}(\\lim _{\\epsilon \\downarrow 0}{\\frac {1}{\\epsilon }}(F(f+\\epsilon )-F(f))+\\lim _{\\epsilon \\uparrow 0}{\\frac {1}{\\epsilon }}(F(f+\\epsilon )-F(f)))}\n\n everywhere,[13] (obtaining that F is the integral of its averaged derivative[14]), and the theorem simplifies to\nIf now one assumes that r and S satisfy the necessary conditions for Fourier inversion to be valid, the Wiener–Khinchin theorem takes the simple form of saying that r and S are a Fourier transform pair, and\nFor the discrete-time case, the power spectral density of the function with discrete values \n\n\n\nx\n[\nn\n]\n\n\n\n{\\displaystyle x[n]\\,}\n\n is\nwhere\nis the discrete autocorrelation function of \n\n\n\nx\n[\nn\n]\n\n\n\n{\\displaystyle x[n]\\,}\n\n, provided this is absolutely integrable. Being a sampled and discrete-time sequence, the spectral density is periodic in the frequency domain. This is due to the problem of aliasing: the contribution of any frequency higher than the Nyquist frequency seems to be equal to that of its alias between 0 and 1. For this reason, the domain of the function \n\n\n\nS\n\n\n{\\displaystyle S}\n\n is usually restricted to lie between 0 and 1.\nThe theorem is useful for analyzing linear time-invariant systems, LTI systems, when the inputs and outputs are not square integrable, so their Fourier transforms do not exist. A corollary is that the Fourier transform of the autocorrelation function of the output of an LTI system is equal to the product of the Fourier transform of the autocorrelation function of the input of the system times the squared magnitude of the Fourier transform of the system impulse response.[15] This works even when the Fourier transforms of the input and output signals do not exist because these signals are not square integrable, so the system inputs and outputs cannot be directly related by the Fourier transform of the impulse response.\nSince the Fourier transform of the autocorrelation function of a signal is the power spectrum of the signal, this corollary is equivalent to saying that the power spectrum of the output is equal to the power spectrum of the input times the energy transfer function.\nThis corollary is used in the parametric method for power spectrum estimation.\nIn many textbooks and in much of the technical literature it is tacitly assumed that Fourier inversion of the autocorrelation function and the power spectral density is valid, and the Wiener–Khinchin theorem is stated, very simply, as if it said that the Fourier transform of the autocorrelation function was equal to the power spectral density, ignoring all questions of convergence.[16] (Einstein is an example.) But the theorem (as stated here), was applied by Norbert Wiener and Aleksandr Khinchin to the sample functions (signals) of wide-sense-stationary random processes, signals whose Fourier transforms do not exist. The whole point of Wiener's contribution was to make sense of the spectral decomposition of the autocorrelation function of a sample function of a wide-sense-stationary random process even when the integrals for the Fourier transform and Fourier inversion do not make sense.\nFurther complicating the issue is that the discrete Fourier transform always exists for digital, finite length sequences, meaning that the theorem can be blindly applied to calculate auto-correlations of numerical sequences. As mentioned earlier, the relation of this discrete sampled data to a mathematical model is often misleading and related errors can show up as a divergence when the sequence length is modified.\nSome authors refer to \n\n\n\nR\n\n\n{\\displaystyle R}\n\n as the autocovariance function. They then proceed to normalise it, by dividing by \n\n\n\nR\n(\n0\n)\n\n\n{\\displaystyle R(0)}\n\n, to obtain what they refer to as the autocorrelation function.", 
    "dbpedia_url": "http://dbpedia.org/resource/Wiener–Khinchin_theorem", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Wiener–Khinchin_theorem\n"
}