{
    "about": "In mathematics, Wiener deconvolution is an application of the Wiener filter to the noise problems inherent in deconvolution. It works in the frequency domain, attempting to minimize the impact of deconvolved noise at frequencies which have a poor signal-to-noise ratio.", 
    "name": "Wiener Deconvolution", 
    "classification": "Signal Processing", 
    "full_text": "In mathematics, Wiener deconvolution is an application of the Wiener filter to the noise problems inherent in deconvolution. It works in the frequency domain, attempting to minimize the impact of deconvolved noise at frequencies which have a poor signal-to-noise ratio.\nThe Wiener deconvolution method has widespread use in image deconvolution applications, as the frequency spectrum of most visual images is fairly well behaved and may be estimated easily.\nWiener deconvolution is named after Norbert Wiener.\n\n\nGiven a system:\nwhere \n\n\n\n∗\n\n\n{\\displaystyle *}\n\n denotes convolution and:\nOur goal is to find some \n\n\n\n \ng\n(\nt\n)\n\n\n{\\displaystyle \\ g(t)}\n\n so that we can estimate \n\n\n\n \nx\n(\nt\n)\n\n\n{\\displaystyle \\ x(t)}\n\n as follows:\nwhere \n\n\n\n \n\n\n\nx\n^\n\n\n\n(\nt\n)\n\n\n{\\displaystyle \\ {\\hat {x}}(t)}\n\n is an estimate of \n\n\n\n \nx\n(\nt\n)\n\n\n{\\displaystyle \\ x(t)}\n\n that minimizes the mean square error.\nThe Wiener deconvolution filter provides such a \n\n\n\n \ng\n(\nt\n)\n\n\n{\\displaystyle \\ g(t)}\n\n. The filter is most easily described in the frequency domain:\nwhere:\nThe filtering operation may either be carried out in the time-domain, as above, or in the frequency domain:\n(where \n\n\n\n \n\n\n\nX\n^\n\n\n\n(\nf\n)\n\n\n{\\displaystyle \\ {\\hat {X}}(f)}\n\n and \n\n\n\n \nY\n(\nf\n)\n\n\n{\\displaystyle \\ Y(f)}\n\n are the Fourier transforms of \n\n\n\n\n\n\nx\n^\n\n\n\n(\nt\n)\n\n\n{\\displaystyle {\\hat {x}}(t)}\n\n and \n\n\n\ny\n(\nt\n)\n\n\n{\\displaystyle y(t)}\n\n, respectively) and then performing an inverse Fourier transform on \n\n\n\n \n\n\n\nX\n^\n\n\n\n(\nf\n)\n\n\n{\\displaystyle \\ {\\hat {X}}(f)}\n\n to obtain \n\n\n\n \n\n\n\nx\n^\n\n\n\n(\nt\n)\n\n\n{\\displaystyle \\ {\\hat {x}}(t)}\n\n.\nNote that in the case of images, the arguments \n\n\n\n \nt\n\n\n{\\displaystyle \\ t}\n\n and \n\n\n\n \nf\n\n\n{\\displaystyle \\ f}\n\n above become two-dimensional; however the result is the same.\nThe operation of the Wiener filter becomes apparent when the filter equation above is rewritten:\nHere, \n\n\n\n \n1\n\n/\n\nH\n(\nf\n)\n\n\n{\\displaystyle \\ 1/H(f)}\n\n is the inverse of the original system, and \n\n\n\n \n\nS\nN\nR\n\n(\nf\n)\n=\nS\n(\nf\n)\n\n/\n\nN\n(\nf\n)\n\n\n{\\displaystyle \\ \\mathrm {SNR} (f)=S(f)/N(f)}\n\n is the signal-to-noise ratio. When there is zero noise (i.e. infinite signal-to-noise), the term inside the square brackets equals 1, which means that the Wiener filter is simply the inverse of the system, as we might expect. However, as the noise at certain frequencies increases, the signal-to-noise ratio drops, so the term inside the square brackets also drops. This means that the Wiener filter attenuates frequencies dependent on their signal-to-noise ratio.\nThe Wiener filter equation above requires us to know the spectral content of a typical image, and also that of the noise. Often, we do not have access to these exact quantities, but we may be in a situation where good estimates can be made. For instance, in the case of photographic images, the signal (the original image) typically has strong low frequencies and weak high frequencies, and in many cases the noise content will be relatively flat with frequency.\nAs mentioned above, we want to produce an estimate of the original signal that minimizes the mean square error, which may be expressed:\nwhere \n\n\n\n \n\nE\n\n\n\n{\\displaystyle \\ \\mathbb {E} }\n\n denotes expectation.\nIf we substitute in the expression for \n\n\n\n \n\n\n\nX\n^\n\n\n\n(\nf\n)\n\n\n{\\displaystyle \\ {\\hat {X}}(f)}\n\n, the above can be rearranged to\nIf we expand the quadratic, we get the following:\nHowever, we are assuming that the noise is independent of the signal, therefore:\nAlso, we are defining the power spectral densities as follows:\nTherefore, we have:\nTo find the minimum error value, we calculate the Wirtinger derivative with respect to \n\n\n\n \nG\n(\nf\n)\n\n\n{\\displaystyle \\ G(f)}\n\n and set it equal to zero.\nThis final equality can be rearranged to give the Wiener filter.", 
    "dbpedia_url": "http://dbpedia.org/resource/Wiener_deconvolution", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Wiener_deconvolution\n"
}