{
    "about": "Wenjun Wu's method is an algorithm for solving multivariate polynomial equations introduced in the late 1970s by the Chinese mathematician Wen-Tsun Wu. This method is based on the mathematical concept of characteristic set introduced in the late 1940s by J.F. Ritt. It is fully independent of the Gröbner basis method, introduced by Bruno Buchberger (1965), even if Gröbner bases may be used to compute characteristic sets.[1][2]", 
    "name": "Wu'S Method Of Characteristic Set", 
    "classification": "Computer Algebra", 
    "full_text": "Wenjun Wu's method is an algorithm for solving multivariate polynomial equations introduced in the late 1970s by the Chinese mathematician Wen-Tsun Wu. This method is based on the mathematical concept of characteristic set introduced in the late 1940s by J.F. Ritt. It is fully independent of the Gröbner basis method, introduced by Bruno Buchberger (1965), even if Gröbner bases may be used to compute characteristic sets.[1][2]\nWu's method is powerful for mechanical theorem proving in elementary geometry, and provides a complete decision process for certain classes of problem. It has been used in research in his laboratory (KLMM, Key Laboratory of Mathematics Mechanization in Chinese Academy of Science) and around the world. The main trends of research on Wu's method concern systems of polynomial equations of positive dimension and differential algebra where Ritt's results have been made effective.[3][4] Wu's method has been applied in various scientific fields, like biology, computer vision, robot kinematics and especially automatic proofs in geometry[5]\n\n\nWu's method uses polynomial division to solve problems of the form:\nwhere f is a polynomial equation and I is a conjunction of polynomial equations. The algorithm is complete for such problems over the complex domain.\nThe core idea of the algorithm is that you can divide one polynomial by another to give a remainder. Repeated division results in either the remainder vanishing (in which case the I implies f statement is true), or an irreducible remainder is left behind (in which case the statement is false).\nMore specifically, for an ideal I in the ring k[x1, ..., xn] over a field k, a (Ritt) characteristic set C of I is composed of a set of polynomials in I, which is in triangular shape: polynomials in C have distinct main variables (see the formal definition below). Given a characteristic set C of I, one can decide if a polynomial f is zero modulo I. That is, the membership test is checkable for I, provided a characteristic set of I.\nA Ritt characteristic set is a finite set of polynomials in triangular form of an ideal. This triangular set satisfies certain minimal condition with respect to the Ritt ordering, and it preserves many interesting geometrical properties of the ideal. However it may not be its system of generators.\nLet R be the multivariate polynomial ring k[x1, ..., xn] over a field k. The variables are ordered linearly according to their subscript: x1 < ... < xn. For a non-constant polynomial p in R, the greatest variable effectively presenting in p, called main variable or class, plays a particular role: p can be naturally regarded as a univariate polynomial in its main variable xk with coefficients in k[x1, ..., xk−1]. The degree of p as a univariate polynomial in its main variable is also called its main degree.\nA set T of non-constant polynomials is called a triangular set if all polynomials in T have distinct main variables. This generalizes triangular systems of linear equations in a natural way.\nFor two non-constant polynomials p and q, we say p is smaller than q with respect to Ritt ordering and written as p <r q, if one of the following assertions holds:\nIn this way, (k[x1, ..., xn],<r) forms a well partial order. However, the Ritt ordering is not a total order: there exist polynomials p and q such that neither p <r q nor p >r q. In this case, we say that p and q are not comparable. Note that the Ritt ordering is comparing the rank of p and q. The rank, denoted by rank(p), of a non-constant polynomial p is defined to be a power of its main variable: mvar(p)mdeg(p) and ranks are compared by comparing first the variables and then, in case of equality of the variables, the degrees.\nA crucial generalization on Ritt ordering is to compare triangular sets. Let T = { t1, ..., tu} and S = { s1, ..., sv} be two triangular sets such that polynomials in T and S are sorted increasingly according to their main variables. We say T is smaller than U w.r.t. Ritt ordering if one of the following assertions holds\nAlso, there exists incomparable triangular sets w.r.t Ritt ordering.\nLet I be a non-zero ideal of k[x1, ..., xn]. A subset T of I is a Ritt characteristic set of I if one of the following conditions holds:\nA polynomial ideal may possess (infinitely) many characteristic sets, since Ritt ordering is a partial order.\nThe Ritt–Wu process, first devised by Ritt, subsequently modified by Wu, computes not a Ritt characteristic but an extended one, called Wu characteristic set or ascending chain.\nA non-empty subset T of the ideal <F> generated by F is a Wu characteristic set of F if one of the following condition holds\nNote that Wu characteristic set is defined to the set F of polynomials, rather to the ideal <F> generated by F. Also it can be shown that a Ritt characteristic set T of <F> is a Wu characteristic set of F. Wu characteristic sets can be computed by Wu's algorithm CHRST-REM, which only requires pseudo-remainder computations and no factorizations are needed.\nWu's characteristic set method has exponential complexity; improvements in computing efficiency by weak chains, regular chains, saturated chain were introduced[6]\nAn application is an algorithm for solving systems of algebraic equations by means of characteristic sets. More precisely, given a finite subset F of polynomials, there is an algorithm to compute characteristic sets T1, ..., Te such that:\nwhere W(Ti) is the difference of V(Ti) and V(hi), here hi is the product of initials of the polynomials in Ti.", 
    "dbpedia_url": "http://dbpedia.org/resource/Wu's_method_of_characteristic_set", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Wu's_method_of_characteristic_set\n"
}