{
    "about": "XDAIS or eXpressDsp Algorithm Interoperability Standard is a standard for algorithm development by Texas Instruments for the TMS320 DSP family. The standard was first introduced in 1999 and was created to facilitate integration of DSP algorithms into systems without re-engineering cost. The XDAIS standard address the issues of algorithm resource allocation and consumption on a DSP. Algorithms that comply with the standard are tested and awarded an \"eXpressDSP-compliant\" mark upon successful completion of the test", 
    "name": "Xdais Algorithms", 
    "classification": "Digital Signal Processing", 
    "full_text": "XDAIS or eXpressDsp Algorithm Interoperability Standard is a standard for algorithm development by Texas Instruments for the TMS320 DSP family. The standard was first introduced in 1999 and was created to facilitate integration of DSP algorithms into systems without re-engineering cost. The XDAIS standard address the issues of algorithm resource allocation and consumption on a DSP. Algorithms that comply with the standard are tested and awarded an \"eXpressDSP-compliant\" mark upon successful completion of the test\nThe standard consists of a set of general rules and guidelines that should be applied to all algorithms. For instance, all XDAIS compliant algorithms must implement an Algorithm Interface, called IALG. For those algorithms utilizing DMA, the IDMA interface must be implemented. Further, specific rules are provided for each family of TI DSP.\nProblems are often caused in algorithm by hard-coding access to system resources that are used by other algorithms. DAIS prohibits the use of this type of hard-coding. Instead, DAIS requires a standard API for the application to call a particular algorithm class. This API is defined in the xDM standard, also referred to as the VISA APIs (video, imaging, speech and audio).\nA XDAIS developer's kit provides the standard itself, example code, and a demonstration.\nBenefits of XDAIS over non-standardised approaches include:\n", 
    "dbpedia_url": "http://dbpedia.org/resource/XDAIS_algorithms", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/XDAIS_algorithms\n"
}