{
    "about": "In filtering theory the Zakai equation is a linear stochastic partial differential equation for the un-normalized density of a hidden state. In contrast, the Kushner equation gives a non-linear stochastic partial differential equation for the normalized density of the hidden state. In principle either approach allows one to estimate a quantity function (the state of a Dynamical system) from noisy measurements, even when the system is non-linear (thus generalizing the earlier results of Wiener and Kalman for linear systems and solving a central problem in estimation theory). The application of this approach to a specific engineering situation may be problematic however, as these equations are quite complex. The Zakai equation is a bilinear stochastic partial differential equation. It was named after Moshe Zakai.", 
    "name": "Zakai Equation", 
    "classification": "Signal Processing", 
    "full_text": "In filtering theory the Zakai equation is a linear stochastic partial differential equation for the un-normalized density of a hidden state. In contrast, the Kushner equation gives a non-linear stochastic partial differential equation for the normalized density of the hidden state. In principle either approach allows one to estimate a quantity function (the state of a Dynamical system) from noisy measurements, even when the system is non-linear (thus generalizing the earlier results of Wiener and Kalman for linear systems and solving a central problem in estimation theory). The application of this approach to a specific engineering situation may be problematic however, as these equations are quite complex. The Zakai equation is a bilinear stochastic partial differential equation. It was named after Moshe Zakai.\nAssume the state of the system evolves according to\nand a noisy measurement of the system state is available:\nwhere \n\n\n\nw\n,\nv\n\n\n{\\displaystyle w,v}\n\n are independent Wiener processes. Then the unnormalized conditional probability density \n\n\n\np\n(\nx\n,\nt\n)\n\n\n{\\displaystyle p(x,t)}\n\n of the state at time t is given by the Zakai equation:\nwhere the operator \n\n\n\nL\n=\n−\n∑\n\n\n\n∂\n(\n\nf\n\ni\n\n\np\n)\n\n\n∂\n\nx\n\ni\n\n\n\n\n\n+\n\n\n1\n2\n\n\n∑\n\n\n\n\n∂\n\n2\n\n\np\n\n\n∂\n\nx\n\ni\n\n\n∂\n\nx\n\nj\n\n\n\n\n\n\n\n{\\displaystyle L=-\\sum {\\frac {\\partial (f_{i}p)}{\\partial x_{i}}}+{\\frac {1}{2}}\\sum {\\frac {\\partial ^{2}p}{\\partial x_{i}\\partial x_{j}}}}\n\n\nAs previously mentioned p is an unnormalized density, i.e. it does not necessarily integrate to 1. After solving for p integration and normalization can be done if desired (an extra step not required in the Kushner approach).\nNote that if the last two terms on the right hand side are omitted (by choosing h identically zero), the result is a nonstochastic PDE : the familiar Kolmogorov Forward Equation, which describes the evolution of the state when no measurement information is available.", 
    "dbpedia_url": "http://dbpedia.org/resource/Zakai_equation", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Zakai_equation\n"
}