{
    "about": "Zero-forcing (or null-steering) precoding is a method of spatial signal processing by which the multiple antenna transmitter can null multiuser interference signals in wireless communications. Regularized zero-forcing precoding is enhanced processing to consider the impact on a background noise and unknown user interference,[1] where the background noise and the unknown user interference can be emphasized in the result of (known) interference signal nulling.", 
    "classification": "Signal Processing", 
    "wikipedia_url": "http://en.wikipedia.org/wiki/Zero-forcing_precoding\n", 
    "full_text": "Zero-forcing (or null-steering) precoding is a method of spatial signal processing by which the multiple antenna transmitter can null multiuser interference signals in wireless communications. Regularized zero-forcing precoding is enhanced processing to consider the impact on a background noise and unknown user interference,[1] where the background noise and the unknown user interference can be emphasized in the result of (known) interference signal nulling.\nIn particular, null-steering is a method of beamforming for narrowband signals where we want to have a simple way of compensating delays of receiving signals from a specific source at different elements of the antenna array. In general to make better use of the antenna arrays, we sum and average the signals coming to different elements, but this is only possible when delays are equal. Otherwise, we first need to compensate the delays and then sum them up. To reach this goal, we may only add the weighted version of the signals with appropriate weight values. We do this in such a way that the frequency domain output of this weighted sum produces a zero result. This method is called null steering. The generated weights are of course related to each other and this relation is a function of delay and central working frequency of the source.\n\n\nIf the transmitter knows the downlink channel state information (CSI) perfectly, ZF-precoding can achieve almost the system capacity when the number of users is large. On the other hand, with limited channel state information at the transmitter (CSIT) the performance of ZF-precoding decreases depending on the accuracy of CSIT. ZF-precoding requires the significant feedback overhead with respect to signal-to-noise-ratio (SNR) so as to achieve the full multiplexing gain.[2] Inaccurate CSIT results in the significant throughput loss because of residual multiuser interferences. Multiuser interferences remain since they can not be nulled with beams generated by imperfect CSIT.\nIn a multiple antenna downlink system which comprises a \n\n\n\n\nN\n\nt\n\n\n\n\n{\\displaystyle N_{t}}\n\n transmit antenna access point (AP) and \n\n\n\nK\n\n\n{\\displaystyle K}\n\n single receive antenna users, the received signal of user \n\n\n\nk\n\n\n{\\displaystyle k}\n\n is described as\nwhere \n\n\n\n\nx\n\n=\n\n∑\n\ni\n=\n1\n\n\nK\n\n\n\ns\n\ni\n\n\n\nP\n\ni\n\n\n\n\nw\n\n\ni\n\n\n\n\n{\\displaystyle \\mathbf {x} =\\sum _{i=1}^{K}s_{i}P_{i}\\mathbf {w} _{i}}\n\n is the \n\n\n\n\nN\n\nt\n\n\n×\n1\n\n\n{\\displaystyle N_{t}\\times 1}\n\n vector of transmitted symbols, \n\n\n\n\nn\n\nk\n\n\n\n\n{\\displaystyle n_{k}}\n\n is the noise signal, \n\n\n\n\n\nh\n\n\nk\n\n\n\n\n{\\displaystyle \\mathbf {h} _{k}}\n\n is the \n\n\n\n\nN\n\nt\n\n\n×\n1\n\n\n{\\displaystyle N_{t}\\times 1}\n\n channel vector and \n\n\n\n\n\nw\n\n\ni\n\n\n\n\n{\\displaystyle \\mathbf {w} _{i}}\n\n is the \n\n\n\n\nN\n\nt\n\n\n×\n1\n\n\n{\\displaystyle N_{t}\\times 1}\n\n linear precoding vector. From the fact that each beam generated by ZF-precoding is orthogonal to all the other user channel vectors, one can rewrite the received signal as\nFor comparison purpose, we describe the received signal model for multiple antenna uplink systems. In the uplink system with a \n\n\n\n\nN\n\nr\n\n\n\n\n{\\displaystyle N_{r}}\n\n receiver antenna AP and \n\n\n\nK\n\n\n{\\displaystyle K}\n\n K single transmit antenna user, the received signal at the AP is described as\nwhere \n\n\n\n\ns\n\ni\n\n\n\n\n{\\displaystyle s_{i}}\n\n is the transmitted signal of user \n\n\n\ni\n\n\n{\\displaystyle i}\n\n, \n\n\n\n\nn\n\n\n\n{\\displaystyle \\mathbf {n} }\n\n is the \n\n\n\n\nN\n\nr\n\n\n×\n1\n\n\n{\\displaystyle N_{r}\\times 1}\n\n noise vector, \n\n\n\n\n\nh\n\n\nk\n\n\n\n\n{\\displaystyle \\mathbf {h} _{k}}\n\n is the \n\n\n\n\nN\n\nr\n\n\n×\n1\n\n\n{\\displaystyle N_{r}\\times 1}\n\n channel vector.\nQuantify the amount of the feedback resource required to maintain at least a given throughput performance gap between zero-forcing with perfect feedback and with limited feedback, i.e.,\nJindal showed that the required feedback bits of a spatially uncorrelated channel should be scaled according to SNR of the downlink channel, which is given by:[2]\nwhere M is the number of transmit antennas and \n\n\n\n\nρ\n\nb\n,\nm\n\n\n\n\n{\\displaystyle \\rho _{b,m}}\n\n is the SNR of the downlink channel.\nTo feed back B bits though the uplink channel, the throughput performance of the uplink channel should be larger than or equal to 'B'\nwhere \n\n\n\nb\n=\n\nΩ\n\nF\nB\n\n\n\nT\n\nF\nB\n\n\n\n\n{\\displaystyle b=\\Omega _{FB}T_{FB}}\n\n is the feedback resource consisted by multiplying the feedback frequency resource and the frequency temporal resource subsequently and \n\n\n\n\nρ\n\nF\nB\n\n\n\n\n{\\displaystyle \\rho _{FB}}\n\n is SNR of the feedback channel. Then, the required feedback resource to satisfy \n\n\n\nΔ\nR\n≤\n\nlog\n\n2\n\n\n⁡\ng\n\n\n{\\displaystyle \\Delta R\\leq \\log _{2}g}\n\n is\nNote that differently from the feedback bits case, the required feedback resource is a function of both downlink and uplink channel conditions. It is reasonable to include the uplink channel status in the calculation of the feedback resource since the uplink channel status determines the capacity, i.e., bits/second per unit frequency band (Hz), of the feedback link. Consider a case when SNR of the downlink and uplink are proportion such that \n\n\n\n\nρ\n\nb\n,\nm\n\n\n\n/\n\n\nρ\n\nF\nB\n\n\n)\n=\n\nC\n\nu\np\n,\nd\nn\n\n\n\n\n{\\displaystyle \\rho _{b,m}/\\rho _{FB})=C_{up,dn}}\n\n is constant and both SNRs are sufficiently high. Then, the feedback resource will be only proportional to the number of transmit antennas\nIt follows from the above equation that the feedback resource (\n\n\n\n\nb\n\nF\nB\n\n\n\n\n{\\displaystyle b_{FB}}\n\n) is not necessary to scale according to SNR of the downlink channel, which is almost contradict to the case of the feedback bits. One, hence, sees that the whole systematic analysis can reverse the facts resulted from each reductioned situation.", 
    "name": "Zero Forcing Precoding"
}